Teigha.DatabaseServices.ObjectSnapModes.ModeNear
Значение: 10.
Привязка к ближайшей точке объекта, например дуги, окружности, эллипса, эллиптической дуги, отрезка, точки как объекта, полилинии, луча, сплайна или прямой.