HostMgd.GraphicsSystem.Manager.ViewToBeDestroyed
Событие ViewToBeDestroyed выпускается непосредственно перед уничтожением вида.
Событие ViewToBeDestroyed выпускается непосредственно перед уничтожением вида.
Returns: Возвращает делегат типа Teigha.GraphicsSystem.ViewToBeDestroyedEventHandler.