Teigha.DatabaseServices.ObjectIdGraph
Этот класс реализует общие объекты графа.
Этот класс реализует общие объекты графа.
Граф состоит из набора узлов, двунаправленно связанных направленными ребрами.
Ребро, связанное с узлом, представляется как ссылка на узел на другом конце ребра.
Ссылки делятся на входящие и исходящие. Каждой входящей ссылке соответствует исходящая ссылка, и наоборот.
Каждый объект GraphNode может иметь любое количество связанных с ним ссылок, что позволяет реализовать граф произвольной структуры.