HostMgd.EditorInput.ConstraintUtilities
Класс ConstraintUtilities позволяет управлять режимом отображения значков наложенных ограничений у объектов активного документа. Не реализован.
Класс ConstraintUtilities представляет метод для отображения, либо подавления видимости значков наложенных ограничений у объектов активного документа.
В текущей версии не реализован.

HostMgd.EditorInput.ConstraintUtilities.ShowConstraintBar(array,System.Boolean)
Метод управляет отображением ограничений для указанного набора объектов чертежа с наложенными ограничениями.
Не реализован.
Метод позволяет скрыть или отобразить наложенные ограничения для указанных в массиве subentityPaths объектов чертежа.  Отображением управляет входной флаг bToShow.
В текущей версии не реализован.
subentityPaths: Массив полных путей подобъектов с наложенными ограничениями. Тип Teigha.DatabaseServices.FullSubentityPath[]. Если этот массив пуст, действие «показать/скрыть» будет применено ко всем объектам с наложенными ограничениями в активном документе.
bToShow: Флаг видимости ограничений. Тип bool. Если задано true, ограничения отображаются, в противном случае отображение ограничений подавлено.
Returns: Возвращает true, если метод завершился успешно.
В противном случае возвращает false.