Teigha.DatabaseServices.Viewport
Класс Viewport представляет в базе данных объекты видового экрана пространства листа PaperSpace.
Класс Viewport представляет в базе данных объекты видового экрана пространства листа PaperSpace.

Teigha.DatabaseServices.Viewport.#ctor
Конструктор по умолчанию класса Viewport.
Конструктор по умолчанию класса Viewport.

Teigha.DatabaseServices.Viewport.FreezeLayersInViewport(System.Collections.IEnumerator)
Метод позволяет заморозить указанные слои в данном видовом экране.
Метод позволяет заморозить указанные слои в данном видовом экране.
layerIds: Список идентификаторов слоёв, которые должны быть заморожены.

Teigha.DatabaseServices.Viewport.GetPreviousBackground(GraphicsInterface.DrawableType)
Метод позволяет получить ранее заданный фон вида. Не реализован.
Метод позволяет получить ранее заданный фон вида.
В текущей версии не реализован.
type: Тип объекта предыдущего фона. Перечисление GraphicsInterface.DrawableType.
Returns: Возвращает идентификатор объекта предыдущего фона.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.GetUcs(Point3d%,Vector3d%,Vector3d%)
Метод позволяет получить начало, ось X и ось Y пользовательской системы координат (UCS) данного видового экрана.
Метод позволяет получить начало, ось X и ось Y пользовательской системы координат (UCS) данного видового экрана.
origin: Принимает точку начала ПСК (UCS).      Тип Point3d.
x: Принимает направление оси X ПСК (UCS). Тип Vector3d.
y: Принимает направление оси Y ПСК (UCS). Тип Vector3d.

Teigha.DatabaseServices.Viewport.IsLayerFrozenInViewport(DatabaseServices.ObjectId)
Метод позволяет определить, заморожен ли указанный слой в данном видовом экране.
Метод позволяет определить, заморожен ли указанный слой в данном видовом экране.
layerId: Идентификатор проверяемого слоя. Тип DatabaseServices.ObjectId.
Returns: Возвращает true, если слой заморожен в данном видовом экране.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.SetPreviousBackground(DatabaseServices.ObjectId,GraphicsInterface.DrawableType)
Метод позволяет задать предыдущий фон в данном видовом экране. Не реализован.
Метод позволяет задать предыдущий фон в данном видовом экране.
В текущей версии не реализован.
value: Идентификатор объекта фона. Тип DatabaseServices.ObjectId.
type: Тип предыдущего объекта фона. Перечисление GraphicsInterface.DrawableType.

Teigha.DatabaseServices.Viewport.SetShadePlot(Teigha.DatabaseServices.ShadePlotType,DatabaseServices.ObjectId)
Метод позволяет задать тип отображения теней при выводе на печать данного видового экрана.
Метод позволяет задать тип отображения теней при выводе на печать данного видового экрана.
Используемый для этого объект отображения теней представляет собой визуальный стиль или набор настроек рендеринга, который определяет, как будет отображаться текущий видовой экран при выводе на печать.
Если для типа отображения теней установлено значение AsDisplayed или Rendered, параметр shadePlotId игнорируется, а для идентификатора объекта отображения теней автоматически устанавливается значение Null.
Если для режима отображения теней установлено значение VisualStyle или RenderPreset, идентификатор объекта отображения теней shadePlotId должен указывать на допустимый объект VisualStyle или RenderSettings.
type: Тип отображения теней. Перечисление ShadePlotType.
shadePlotId: Идентификатор объекта VisualStyle или RenderSettings, которые будут использоваться для управления отображением теней. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.SetSun(Teigha.DatabaseServices.DBObject)
Метод позволяет задать солнечное освещение (бесконечно удаленный источник света) для данного видового экрана.
Метод позволяет задать солнечное освещение (бесконечно удаленный источник света) для данного видового экрана.
sun: Объект Солнца. Тип DBObject.
Returns: Возвращает идентификатор установленного источника солнечного освещения в базе данных.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.SetUcs(DatabaseServices.ObjectId)
Метод позволяет задать пользовательскую систему координат, связанную с этим видовым экраном.
Метод позволяет задать пользовательскую систему координат (ПСК, UCS), связанную с этим видовым экраном.
userCoordinateSystemId: Идентификатор объекта UCS.

Teigha.DatabaseServices.Viewport.SetUcs(Teigha.DatabaseServices.OrthographicView)
Метод позволяет задать в видовом экране пользовательскую систему координат, используя указанный тип ортогонального вида.
Метод позволяет задать в видовом экране пользовательскую систему координат (ПСК, UCS), используя указанный тип ортогонального вида.
view: Тип ортогонального вида. Перечисление OrthographicView.

Teigha.DatabaseServices.Viewport.SetUcs(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет задать в видовом экране пользовательскую систему координат непосредственно, используя координаты точки начала и направления осей X и Y.
Метод позволяет задать в видовом экране пользовательскую систему координат непосредственно, используя координаты точки начала и направления осей X и Y.  Все координаты и направления задаются в мировой системе координат (WCS).
origin: Положение начала новой пользовательской системы координат. Тип Point3d.
x: Направляющий вектор оси X. Тип Vector3d.
y: Направляющий вектор оси Y. Тип Vector3d.

Teigha.DatabaseServices.Viewport.SetViewDirection(Teigha.DatabaseServices.OrthographicView)
Метод позволяет задать в данном видовом экране предопределенную ориентацию вида из набора ортогональных видов.
Не реализован.
Метод позволяет задать в данном видовом экране предопределенную ориентацию вида из набора ортогональных видов.
В текущей версии не реализован.
view: Тип ортогонального вида. Перечисление OrthographicView.

Teigha.DatabaseServices.Viewport.ThawLayersInViewport(System.Collections.IEnumerator)
Метод позволяет разморозить в данном видовом экране указанный список слоёв.
Метод позволяет разморозить в данном видовом экране указанный список слоёв.
Notes
Данный метод не затрагивает другие видовые экраны.
layerIds: Коллекция идентификаторов слоёв, которые следует разморозить.

Teigha.DatabaseServices.Viewport.AmbientLightColor
Свойство AmbientLightColor представляет цвет рассеянного света в данном видовом экране.
Свойство AmbientLightColor представляет цвет рассеянного света в данном видовом экране.
Returns: Возвращает цвет рассеянного света.
Тип Teigha.Colors.Color.

Teigha.DatabaseServices.Viewport.AnnotationScale
Свойство AnnotationScale представляет объект масштаба аннотаций в данном видовом экране.
Свойство AnnotationScale представляет объект масштаба аннотаций в данном видовом экране.
Returns: Возвращает объект масштаба аннотаций.
Тип DatabaseServices.AnnotationScale.

Teigha.DatabaseServices.Viewport.BackClipDistance
Свойство BackClipDistance представляет расстояние до задней плоскости отсечения для данного видового экрана.
Свойство BackClipDistance представляет расстояние до задней плоскости отсечения для данного видового экрана.
В случае использования этой плоскости всякая геометрия позади задней плоскости отсечения не отображается.
Returns: Возвращает расстояние до задней плоскости отсечения.
Тип double.

Teigha.DatabaseServices.Viewport.BackClipOn
Свойство BackClipOn позволяет определить,  включен ли в данном видовом экране режим заднего отсечения.
Свойство BackClipOn позволяет определить,  включен ли в данном видовом экране режим заднего отсечения.
Returns: Возвращает true, если режим заднего отсечения включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.Background
Свойство Background представляет идентификатор объекта фона в данном видовом экране.
Свойство Background представляет идентификатор объекта фона в данном видовом экране.
Returns: Возвращает идентификатор объекта фона вида.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.Brightness
Свойство Brightness представляет значение яркости, которое влияет на относительную интенсивность освещения в данном видовом экране.
Свойство Brightness представляет значение яркости, которое влияет на относительную интенсивность освещения в данном видовом экране.
Returns: Возвращает значение яркости.
Тип double.

Teigha.DatabaseServices.Viewport.centerPoint
Свойство CenterPoint представляет центральную точку данного видового экрана в координатах МСК (WCS).
Свойство CenterPoint представляет центральную точку данного видового экрана в мировой системе координат (WCS).
Returns: Возвращает центральную точку видового экрана.
Тип Point3d.

Teigha.DatabaseServices.Viewport.CircleSides
Свойство CircleSides представляет процент масштабирования окружностей в данном видовом экране в диапазоне [1..20000].
Это значение используется при тесселяции кривых. Чем оно выше, тем больше линейных сегментов используется при тесселяции кривой.
Свойство CircleSides представляет процент масштабирования окружностей в данном видовом экране.
Эта величина влияет на количество сегментов при тесселяции кривых для отображения на экране и находится в диапазоне [1..20000].
Чем значение выше, тем больше линейных сегментов используется при тесселяции кривой.
Returns: Возвращает процент масштабирования окружностей в диапазоне [1..20000].
Тип int.

Teigha.DatabaseServices.Viewport.Contrast
Свойство Contrast представляет значение контрастности, влияющее на интенсивность рассеянного освещения от других источников света в данном видовом экране.
Свойство Contrast представляет значение контрастности, влияющее на интенсивность рассеянного освещения от других источников света в данном видовом экране.
Returns: Возвращает значение контраста.
Тип double.

Teigha.DatabaseServices.Viewport.CustomScale
Свойство CustomScale представляет пользовательский масштаб в данном видовом экране.
Свойство, которое представляет пользовательский масштаб этого видового экрана.
Returns: Возвращает величину пользовательского масштаба.
Тип double.

Teigha.DatabaseServices.Viewport.DefaultLightingOn
Свойство DefaultLightingOn позволяет определить, включено ли в данном видовом экране освещение по умолчанию.
Свойство DefaultLightingOn позволяет определить, включено ли в данном видовом экране освещение по умолчанию.
Returns: Возвращает true, если освещение по умолчанию включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.DefaultLightingType
Свойство DefaultLightingType представляет тип освещения по умолчанию в данном видовом экране.
Свойство DefaultLightingType представляет тип освещения по умолчанию в данном видовом экране.
Returns: Возвращает тип освещения по умолчанию в данном видовом экране.
Перечисление DatabaseServices.DefaultLightingType.

Teigha.DatabaseServices.Viewport.EffectivePlotStyleSheet
Свойство EffectivePlotStyleSheet представляет имя таблицы стилей печати, связанной с данным видовым экраном.
Свойство EffectivePlotStyleSheet представляет имя таблицы стилей печати, связанной с данным видовым экраном.
Returns: Возвращает имя таблицы стилей печати.
Тип String.

Teigha.DatabaseServices.Viewport.Elevation
Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана.
Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана.
Возвышение - это расстояние от начала мировой системы координат (МСК, WCS) до плоскости ПСК этого объекта.
Returns: Возвращает возвышение плоскости ПСК.
Тип double.

Teigha.DatabaseServices.Viewport.FastZoomOn
Свойство FastZoomOn позволяет определить, включен ли в данном видовом экране режим быстрого масштабирования.
Свойство FastZoomOn позволяет определить, включен ли в данном видовом экране режим быстрого масштабирования.
Returns: Возвращает true, если режим быстрого масштабирования включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.FrontClipAtEyeOn
Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через камеру.
Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через камеру.
Returns: Возвращает true, если передняя плоскость отсечения проходит через камеру.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.FrontClipDistance
Свойство FrontClipDistance представляет расстояние до передней плоскости отсечения в данном видовом экране.
Свойство FrontClipDistance представляет расстояние до передней плоскости отсечения в данном видовом экране.
Returns: Возвращает расстояние до передней плоскости отсечения.
Тип double.

Teigha.DatabaseServices.Viewport.FrontClipOn
Свойство FrontClipOn позволяет определить, включен ли в данном видовом экране режим переднего отсечения.
Свойство FrontClipOn позволяет определить, включен ли в данном видовом экране режим переднего отсечения.
Returns: Возвращает true, если режим переднего отсечения включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.GridAdaptive
Свойство GridAdaptive позволяет определить, является ли сетка в данном видовом экране адаптивной.
Свойство GridAdaptive определяет, является ли сетка в данном видовом экране адаптивной. Адаптивная сетка позволяет избежать слишком плотной или слишком разреженной сетки при изменении масштаба отображения в видовом экране независимо от текущего значения системной переменной GRIDUNIT.
Returns: Возвращает true, если сетка в данном видовом экране является адаптивной.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.GridBoundToLimits
Свойство GridBoundToLimits определяет, отображается ли сетка в этом видовом экране только в границах лимитов МСК (WCS) и ПСК (UCS).
Свойство GridBoundToLimits определяет, отображается ли сетка в этом видовом экране только в границах лимитов МСК (WCS) и ПСК (UCS).
Returns: Возвращает true, если сетка отображается только в границах МСК (WCS) и ПСК (UCS).
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.GridFollow
Свойство GridFollow определяет, реагирует ли сетка на динамические изменения ПСК (UCS) в этом видовом экране.
Свойство GridFollow определяет, реагирует ли сетка в данном видовом экране на динамические изменения пользовательской системы координат (ПСК, UCS).
Returns: Возвращает true, если сетка динамически перестраивается в соответствии с изменениями ориентации пользовательской системы координат.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.GridIncrement
Свойство GridIncrement представляет шаг сетки вдоль осей X и Y ПСК в данном видовом экране.
Свойство GridIncrement представляет текущие значения шага сетки вдоль осей X и Y пользовательской системы координат (в единицах чертежа) в данном видовом экране.
Returns: Возвращает объект типа Vector2d, компоненты которого представляют шаг сетки вдоль соответствующей оси системы координат.

Teigha.DatabaseServices.Viewport.GridMajor
Свойство GridMajor представляет количество вспомогательных линий сетки между каждой парой соседних основных линий сетки.
Свойство GridMajor представляет количество вспомогательных линий сетки между каждой парой соседних основных линий сетки.
Returns: Возвращает количество вспомогательных линий сетки между основными.
Тип short.

Teigha.DatabaseServices.Viewport.GridOn
Свойство GridOn позволяет определить, включен ли режим отображения сетки в данном видовом экране.
Свойство GridOn позволяет определить, включен ли режим отображения сетки в данном видовом экране.
Returns: Возвращает true, если режим отображения сетки включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.GridSubdivisionRestricted
Свойство GridSubdivisionRestricted позволяет определить, запрещено ли дробление сетки мельче шага вспомогательных линий сетки в данном видовом экране.
Свойство GridSubdivisionRestricted позволяет определить, запрещено ли дробление сетки мельче шага вспомогательных линий сетки в данном видовом экране.
Returns: Возвращает true, если дробление сетки мельче шага вспомогательных линий не допускается.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.Height
Свойство Height представляет высоту этого видового экрана в единицах чертежа.
Свойство Height представляет высоту этого видового экрана в единицах чертежа.
Returns: Возвращает высоту видового экрана в единицах чертежа.
Тип double.

Teigha.DatabaseServices.Viewport.HiddenLinesRemoved
Свойство HiddenLinesRemoved позволяет определить, будут ли удалены скрытые линии в данном видовом экране при выводе на печать.
Свойство HiddenLinesRemoved позволяет определить, будут ли удалены скрытые линии в данном видовом экране при выводе на печать.
Returns: Возвращает true, если скрытые линии будут удалены.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.LensLength
Свойство LensLength представляет фокусное расстояние в режиме вида в перспективе (в мм) в данном видовом экране.
Свойство LensLength представляет фокусное расстояние в режиме вида в перспективе (в мм) в данном видовом экране.
Returns: Возвращает фокусное расстояние (в мм).
Тип double.

Teigha.DatabaseServices.Viewport.LinkedToSheetView
Свойство LinkedToSheetView позволяет определить, связан ли данный видовой экран с видом в пространстве листа.
Свойство LinkedToSheetView позволяет определить, связан ли данный видовой экран с видом в пространстве листа.
Returns: Возвращает true, если данный видовой экран связан с видом в пространстве листа.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.Locked
Свойство Locked позволяет определить, заблокирован ли масштабный коэффициент в данном видовом экране.
Свойство Locked позволяет определить, заблокирован ли масштабный коэффициент в данном видовом экране.
Returns: Возвращает true, если масштабный коэффициент заблокирован.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.NonRectClipEntityId
Свойство NonRectClipEntityId представляет идентификатор объекта чертежа, который послужил инструментом обрезки в данном видовом экране.
Свойство NonRectClipEntityId представляет идентификатор объекта чертежа, который послужил инструментом обрезки в данном видовом экране.
Returns: Возвращает идентификатор объекта чертежа.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.NonRectClipOn
Свойство NonRectClipOn позволяет определить, включен ли в данном видовом экране режим обрезки непрямоугольным объектом.
Свойство NonRectClipOn позволяет определить, включен ли в данном видовом экране режим обрезки непрямоугольным объектом.
Returns: Возвращает true, если режим обрезки непрямоугольным объектом включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.Number
Свойство Number представляет идентификационный номер данного видового экрана.
Свойство Number представляет идентификационный номер данного видового экрана.
Notes
Этот номер сообщает системная переменная CVPORT, когда данный видовой экран является текущим.
В случае неактивного видового экрана возвращается -1.
Это значение не сохраняется вместе с чертежом и меняется при каждом открытии чертежа.
Returns: Возвращает идентификационный номер данного видового экрана.
Тип int.

Teigha.DatabaseServices.Viewport.On
Свойство On позволяет определить состояние данного видового экрана (включен или выключен).
Свойство On позволяет определить состояние данного видового экрана (включен или выключен).
Returns: Возвращает true, если видового экрана включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.PerspectiveOn
Свойство PerspectiveOn позволяет определить, включено ли перспективное проецирование в данном видовом экране.
Свойство PerspectiveOn позволяет определить, включено ли перспективное проецирование в данном видовом экране.
Returns: Возвращает true, если перспективное проецирование включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.PlotAsRaster
Свойство PlotAsRaster позволяет определить, выводится ли данный видовой экран на печать в растровом режиме с использованием своих текущих настроек тонирования.
Свойство PlotAsRaster позволяет определить, выводится ли данный видовой экран на печать в растровом режиме с использованием своих текущих настроек тонирования.
Это свойство будет иметь значение true, если отключены все перечисленные ниже параметры:
* Режим рендеринга — Wireframe или Optimized2D;
* Тип визуального стиля — Wireframe2D или Wireframe3D;
* Визуальный стиль использует модель освещения FaceStyle.LightingModel = LightingModel.Invisible для граней и модель EdgeStyle.EdgeModel = EdgeModel.Isolines для рёбер.
Returns: Возвращает true, если видовой экран выводится на печать в растровом режиме с использованием своих настроек тонирования.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.PlotStyleSheet
Свойство PlotStyleSheet представляет имя таблицы стилей печати, применяемых к объектам в данном видовом экране.
Свойство PlotStyleSheet представляет имя таблицы стилей печати, применяемых к объектам в данном видовом экране.
Returns: Возвращает имя таблицы стилей печати.
Тип String.

Teigha.DatabaseServices.Viewport.PlotWireframe
Свойство PlotWireframe позволяет определить, отображается ли векторная графика в данном видовом экране с использованием текущих настроек отображения теней при выводе на печать.
Свойство PlotWireframe позволяет определить, отображается ли векторная графика в данном видовом экране с использованием текущих настроек отображения теней при выводе на печать.
Это свойство будет иметь значение true, если включены все следующие настройки:
* Режим рендеринга — Wireframe или Optimized2D.
* Тип визуального стиля — Wireframe2D или Wireframe3D.
* Визуальный стиль использует для граней модель освещения FaceStyle.LightingModel = LightingModel.Invisible, а для рёбер - модель EdgeStyle.EdgeModel = EdgeModel.Isolines.
Returns: Возвращает true, если используются текущие настройки тонирования.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.RenderMode
Свойство RenderMode представляет текущий режим рендеринга в данном видовом экране.
Свойство RenderMode представляет текущий режим рендеринга в данном видовом экране.
Returns: Возвращает текущий режим рендеринга.
Тип DatabaseServices.RenderMode.

Teigha.DatabaseServices.Viewport.ShadePlot
Свойство ShadePlot представляет текущий режим отображения теней в данном видовом экране.
Свойство ShadePlot представляет текущий режим отображения теней в данном видовом экране.
Returns: Возвращает текущий режим отображения теней.
Тип ShadePlotType.

Teigha.DatabaseServices.Viewport.ShadePlotId
Свойство ShadePlotId представляет объект тени (визуальный стиль или предопределенные настройки рендеринга), который определяет, как будет выводиться на печать текущий видовой экран.
Свойство ShadePlotId представляет объект тени, связанный с данным видовым экраном. Объект тени — это визуальный стиль или предопределенные настройки рендеринга, которые определяют, как будет выводиться на печать текущий видовой экран.
Returns: Возвращает идентификатор объекта тени.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.SnapAngle
Свойство SnapAngle представляет угол поворота шаговой привязки в данном видовом экране относительно текущей ПСК (UCS).
Свойство SnapAngle представляет угол поворота шаговой привязки в данном видовом экране относительно текущей пользовательской системы координат (ПСК, UCS).
Угол поворота определяется в плоскости XY ПСК относительно оси X ПСК. Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть вдоль оси Z ПСК в сторону начала системы координат.
Notes
См. также описание системной переменной SNAPANG и команды SNAP.
Returns: Возвращает угол поворота шаговой привязки (в радианах).
Тип double.

Teigha.DatabaseServices.Viewport.SnapBasePoint
Свойство SnapBasePoint представляет базовую точку шаговой привязки в данном видовом экране относительно текущей ПСК (UCS).
Свойство SnapBasePoint представляет базовую (начальную) точку шаговой привязки в данном видовом экране относительно текущей пользовательской системы координат (ПСК, UCS).
Returns: Возвращает базовую точку шаговой привязки.
Тип Point2d.

Teigha.DatabaseServices.Viewport.SnapIncrement
Свойство SnapIncrement представляет интервал шаговой привязки в данном видовом экране.
Свойство SnapIncrement представляет интервал шаговой привязки в данном видовом экране.
Returns: Возвращает интервал шаговой привязки.
Тип Vector2d.

Teigha.DatabaseServices.Viewport.SnapIsometric
Свойство SnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
Свойство SnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
Returns: Возвращает true, если текущим типом шаговой привязки является изометрическая привязка.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.SnapIsoPair
Свойство SnapIsoPair представляет плоскость изометрии для данного видового экрана.
Свойство SnapIsoPair представляет плоскость изометрии для данного видового экрана.
Допустимые значения:
Значение    Описание
--------    ------------
0           Левая изоплоскость.
1           Верхняя изоплоскость.
2           Правая изоплоскость.
Returns: Возвращает код плоскости изометрии.
Тип int.

Teigha.DatabaseServices.Viewport.SnapOn
Свойство SnapOn позволяет определить, включен ли режим шаговой привязки в данном видовом экране.
Свойство SnapOn позволяет определить, включен ли режим шаговой привязки в данном видовом экране.
Returns: Возвращает true, если режим шаговой привязки включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.StandardScale
Свойство StandardScale представляет масштаб в данном видовом экране, используя стандартные значения масштабов из перечисления Teigha.DatabaseServices.StandardScaleType.
Свойство StandardScale представляет масштаб в данном видовом экране, используя стандартные значения масштабов из перечисления Teigha.DatabaseServices.StandardScaleType. Если текущий масштаб не соответствует ни одному из стандартных, свойство StandardScale возвращает значение StandardScaleType.CustomScale.
Returns: Возвращает текущий масштаб в видовом экране как значение из перечисления Teigha.DatabaseServices.StandardScaleType.

Teigha.DatabaseServices.Viewport.SunId
Свойство SunId представляет идентификатор связанного с этим видовым экраном объекта солнца (бесконечно удаленного источника освещения).
Свойство SunId представляет идентификатор связанного с этим видовым экраном объекта солнца (бесконечно удаленного источника освещения).
Returns: Возвращает идентификатор объекта солнца (бесконечно удаленного источника освещения).
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.Thumbnail
Свойство Thumbnail представляет изображение предварительного просмотра этого видового экрана.
Свойство Thumbnail представляет изображение предварительного просмотра этого видового экрана.
Returns: Возвращает изображение предварительного просмотра видового экрана.
Тип System.Drawing.Bitmap.

Teigha.DatabaseServices.Viewport.Transparent
Свойство Transparent позволяет определить, выставлен ли флаг прозрачности для данного видового экрана.
Свойство Transparent позволяет определить, выставлен ли флаг прозрачности для данного видового экрана.
Returns: Возвращает true, если видовой экран прозрачный.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.TwistAngle
Свойство TwistAngle представляет угол поворота данного видового экрана в системе координат дисплея (DCS).
Свойство TwistAngle представляет угол поворота данного видового экрана в системе координат дисплея (DCS).
Это вращение происходит в плоскости дисплея, т.е. вокруг направления от камеры к цели, которое всегда перпендикулярно плоскости дисплея.
Углы отсчитываются против часовой стрелки от положительного направления оси X DCS, которая горизонтальна и направлена вправо.
Returns: Возвращает угол поворота видового экрана (в радианах) в плоскости дисплея.
Тип double.

Teigha.DatabaseServices.Viewport.UcsFollowModeOn
Свойство UcsFollowModeOn позволяет определить, включен ли для данного видового экрана переход к отображению в плане при переключении с одной пользовательской системы координат (ПСК, UCS) на другую.
Свойство UcsFollowModeOn позволяет определить, включен ли для данного видового экрана переход к отображению в плане при переключении с одной пользовательской системы координат (ПСК, UCS) на другую.
Когда этот режим включен, при каждом изменении ПСК в видовом экране происходит переключение на обновленный вид в плане.
Returns: Возвращает true, если переход к отображению в плане при каждой смене ПСК включен.
В противном случае возвращает false, и тогда смена ПСК не влияет на текущий вид.

Teigha.DatabaseServices.Viewport.UcsIconAtOrigin
Свойство UcsIconAtOrigin позволяет определить, располагается ли в данном видовом экране значок ПСК (UCS) в начале пользовательской системы координат.
Свойство UcsIconAtOrigin позволяет определить, располагается ли в данном видовом экране значок ПСК (UCS) в начале пользовательской системы координат.
Returns: Возвращает true, если значок ПСК располагается в начале пользовательской системы координат.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.UcsIconVisible
Свойство UcsIconVisible позволяет определить, включено ли отображение значка ПСК (UCS) в данном видовом экране.
Свойство UcsIconVisible позволяет определить, включено ли отображение значка ПСК (UCS) в данном видовом экране.
Returns: Возвращает true, если значок ПСК (UCS) отображается в видовом экране.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.UcsName
Свойство UcsName представляет идентификатор объекта пользовательской системы координат, связанной с данным видовым экраном.
Свойство UcsName представляет идентификатор объекта пользовательской системы координат (ПСК, UCS), связанной с данным видовым экраном.
Returns: Возвращает идентификатор объекта пользовательской системы координат.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.UcsOrthographic
Свойство UcsOrthographic представляет ортогональный вид в пользовательской системе координат.
Свойство UcsOrthographic представляет ортогональный вид в пользовательской системе координат.
Returns: Возвращает ортогональный вид из перечисления OrthographicView.

Teigha.DatabaseServices.Viewport.UcsPerViewport
Свойство UcsPerViewport позволяет определить, следует ли сохранять связь ПСК с данным видовым экраном.
Свойство UcsPerViewport позволяет определить, сохраняется ли связь ПСК с данным видовым экраном.
Если да, то при каждой активации видового экрана активируется и связанная с ним ПСК и наоборот.
Returns: Возвращает true, если связь ПСК с данным видовым экраном сохраняется.
В противном случае возвращает false.

Teigha.DatabaseServices.Viewport.ViewCenter
Свойство ViewCenter представляет точку центра вида в данном видовом экране в системе координат дисплея.
Свойство ViewCenter представляет точку центра вида в данном видовом экране в системе координат дисплея (DCS).
Returns: Возвращает точку центра вида в данном видовом экране.
Тип Point2d.

Teigha.DatabaseServices.Viewport.ViewDirection
Свойство ViewDirection представляет направление вида в данном видовом экране (в мировой системе координат).
Свойство ViewDirection представляет направление вида в данном видовом экране (в мировой системе координат, WCS ).
Returns: Возвращает направление вида (в мировой системе координат, WCS ).
Тип Vector3d.

Teigha.DatabaseServices.Viewport.ViewHeight
Свойство ViewHeight представляет высоту вида данного видового экрана в системе координат дисплея (DCS).
Свойство ViewHeight представляет высоту вида данного видового экрана в системе координат дисплея (DCS).
Returns: Возвращает высоту вида данного видового экрана в DCS.
Тип double.

Teigha.DatabaseServices.Viewport.ViewOrthographic
Свойство ViewOrthographic представляет текущий ортогональный вид в данном видовом экране.
Свойство ViewOrthographic представляет текущий ортогональный вид в данном видовом экране.
Returns: Возвращает текущий ортогональный вид. Перечисление OrthographicView.

Teigha.DatabaseServices.Viewport.viewTarget
Свойство ViewTarget представляет целевую точку данного видового экрана в мировой системе координат.
Свойство ViewTarget представляет целевую точку данного видового экрана в мировой системе координат (МСК, WCS).
Returns: Возвращает целевую точку видового экрана в WCS.
Тип Point3d.

Teigha.DatabaseServices.Viewport.VisualStyleId
Свойство VisualStyleId представляет идентификатор объекта визуального стиля, который используется в данном видовом экране.
Свойство VisualStyleId представляет идентификатор объекта визуального стиля, который используется в данном видовом экране.
Returns: Возвращает идентификатор объекта визуального стиля.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Viewport.Width
Свойство Width представляет ширину данного видового экрана.
Свойство Width представляет ширину данного видового экрана.
Returns: Возвращает ширину видового экрана.
Тип double.