Teigha.LayerManager.LayerFilter
Класс LayerFilter представляет в базе данных объекты фильтров слоев.
Класс LayerFilter представляет в базе данных объекты фильтров слоев.

Teigha.LayerManager.LayerFilter.#ctor
Конструктор по умолчанию класса LayerFilter.
Конструктор по умолчанию класса LayerFilter.

Teigha.LayerManager.LayerFilter.CompareTo(Teigha.LayerManager.LayerFilter)
Метод проверяет эквивалентность двух объектов LayerFilter.
Метод проверяет эквивалентность двух объектов LayerFilter.
otherFilter: Входной объект, который сравнивается с данным.  Тип LayerFilter.
Returns: Возвращает true, если два объекта эквивалентны.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.Filter(Teigha.DatabaseServices.LayerTableRecord)
Метод позволяет проверить, что указанная запись LayerTableRecord будет видимой в случае применения данного фильтра.
Метод позволяет проверить, что указанная запись LayerTableRecord будет видимой в случае применения данного фильтра.
layer: Входной слой.  Тип LayerTableRecord.
Returns: Возвращает true, если слой layer будет видимым.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.AllowDelete
Свойство AllowDelete позволяет проверить, возможно ли удаление данного фильтра.
Свойство AllowDelete позволяет проверить, возможно ли удаление данного фильтра.
Returns: Возвращает true, если фильтр можно удалить.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.AllowNested
Свойство AllowNested позволяет проверить, допускает ли данный фильтр вложенные фильтры.
Свойство AllowNested позволяет проверить, допускает ли данный фильтр вложенные фильтры.
Returns: Возвращает true, если вложенные фильтры допустимы.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.AllowRename
Свойство AllowRename позволяет проверить, разрешено ли переименование данного фильтра.
Свойство AllowRename позволяет проверить, разрешено ли переименование данного фильтра.
Returns: Возвращает true, если переименование фильтра разрешено.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.DynamicallyGenerated
Свойство DynamicallyGenerated позволяет проверить, генерируется ли данный фильтр динамически своим родителем.
Свойство DynamicallyGenerated при реализации в производном классе позволяет проверить, генерируется ли данный фильтр динамически своим родителем.  Динамически генерируемый фильтр не должен быть постоянным сам по себе.
Returns: Возвращает true, если фильтр является динамически генерируемым.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.FilterExpression
Свойство FilterExpression представляет выражение фильтра в форме Бэкуса — Наура.
Свойство FilterExpression представляет выражение фильтра в форме Бэкуса — Наура следующего вида:
/*
Форма БНФ для валидного логического выражения, которое требуется вычислить.
.=  or  |
.= and  |
.=
.= == | !=
.=A-Z0-9*?~@.,-
.=#A-Z0-9
*/
Свойство может вернуть значение null, если фильтр не допускает такое представление.
Returns: Возвращает выражение фильтра в виде БНФ.
Тип String.

Teigha.LayerManager.LayerFilter.IsIdFilter
Свойство IsIdFilter позволяет проверить, фильтрует ли данный фильтр слои только по идентификатору объекта слоя.
Свойство IsIdFilter позволяет проверить, фильтрует ли данный фильтр слои только по идентификатору объекта слоя.
Эти фильтры также известны как группы слоев.
Returns: Возвращает true, если фильтр фильтрует слои только по идентификаторам объекта слоя.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.IsProxy
Свойство IsProxy позволяет проверить, является ли данный фильтр прокси-фильтром.
Свойство IsProxy позволяет проверить, является ли данный фильтр прокси-фильтром.
Фильтр превращается в прокси-фильтр, когда ObjectDBX не находит код, поддерживающий этот фильтр (ObjectARX или приложение ObjectDBX).
Прокси-фильтры не показываются пользователю nanoCAD, но их постоянные данные передаются в обе стороны.
Returns: Возвращает true, если данный фильтр является прокси-фильтром.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilter.Name
Свойство Name представляет имя фильтра.
Свойство Name представляет имя фильтра.
Обычно это имя вводит пользователь при создании фильтра. Однако для некоторых фильтров, таких как Xref или All, имена представляют собой локализованные константы.
Returns: Возвращает имя фильтра.  Тип String.

Teigha.LayerManager.LayerFilter.NestedFilters
Свойство NestedFilters представляет массив вложенных фильтров данного фильтра.
Свойство NestedFilters представляет массив вложенных фильтров данного фильтра.
Возвращаемый массив является константным; клиенты не должны удалять или добавлять фильтры в этот массив.
Returns: Возвращает массив вложенных фильтров.
Тип LayerFilterCollection.

Teigha.LayerManager.LayerFilter.Parent
Свойство Parent представляет родительский фильтр данного фильтра.
Свойство Parent представляет родительский фильтр данного фильтра.
Родителя имеют все фильтры, кроме фильтра верхнего уровня ("All").
В случае фильтра верхнего уровня это свойство возвращает null.
Returns: Возвращает родительский фильтр данного фильтра.
Тип LayerFilter.