HostMgd.PlottingServices.PlotCancelStatus.CanceledByCancelAllButton
Значение: 2.
Пользователь средствами пользовательского интерфейса отменил продолжение выполнения задания на печать.
Как следствие, отменяется вывод на печать всех листов, ожидающих обработки в текущем процессе печати.