Teigha.DatabaseServices.TextHorizontalMode.TextAlign
Значение: 3.
Текст вписывается в заданную ширину аналогично функции "по ширине" в текстовых редакторах (justify).
Заполнение текстом заданной полосы (по ширине) осуществляется регулированием исключительно интервалов между словами.
Межбуквенные интервалы, сами буквы и высота текста остаются неизменными.