HostMgd.EditorInput.PromptSelectionOptions
Класс предоставляет параметры для настройки
интерактивной операции выбора объектов в nanoCAD.
Класс используется при вызове метода GetSelection()
для настройки поведения команды выбора объектов.
Он позволяет задать:
* текст приглашения,
* режим выбора,
* разрешение на пустой ввод,
* ключевые слова,
* дополнительные параметры контекста .
Этот класс играет ключевую роль при реализации команд,
требующих точного контроля над выборкой — например,
при фильтрации по типу объекта, слою или пользовательским условиям.
Он обеспечивает гибкость при взаимодействии с пользователем,
позволяя добавлять подсказки, управлять режимами выделения
и реализовывать диалоговый ввод.
Класс используется совместно с событиями PromptingForSelection и PromptedForSelection,
что позволяет как настраивать параметры перед выбором, так и обрабатывать
результат после его завершения.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.#ctor
Конструктор инициализирует новый экземпляр класса с параметрами выбора объектов по умолчанию.
Конструктор создаёт новый объект класса PromptSelectionOptions,
используемый для настройки операции выбора объектов в nanoCAD.
Он инициализирует все свойства значениями по умолчанию.
После создания экземпляра разработчик может настроить параметры ввода
в соответствии с требованиями команды — например, задать сообщение,
добавить ключевые слова.
Этот конструктор используется при программной инициализации выборки,
когда нет необходимости в предварительно заданном сообщении или сложной конфигурации.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.SetKeywords(String,String)
Метод устанавливает отображаемые и глобальные ключевые слова
для приглашения выбора вложенного объекта с проверкой соответствия и формата.
Этот метод устанавливает отображаемые ключевые слова и
глобальные ключевые слова в globalKeywords. Набор
отображаемых ключевых слов должен быть заключен в скобки "["
в начале набора и "]" в конце. Сами ключевые слова набора
должны быть отделены между собой символом "/".
Каждое отображаемое в строке messageAndKeywords ключевое
слово должно также быть представленным строке на той же
позиции в строке globalKeywords. Ключевые слова в строке
globalKeywords дожны отделяться друг от друга одним пробелом.
Если список ключевых слов в скобках "[" и "]" ошибочный или
пустой, то возникает событие System.ArgumentException. Если
количество глобальных ключевых слов не совпадает с
количеством отображаемых ключевых слов, возникает событие
System.ArgumentException.
keywords: Ключевые слова (отображаемые). Тип string
globalKeywords: Ключевые слова (глобальные имена). Тип string

HostMgd.EditorInput.PromptSelectionOptions.AllowDuplicates
Свойство определяет, разрешено ли добавление дублирующихся объектов
в результирующий набор выбора.
Свойство используется в классе PromptSelectionOptions и указывает,
может ли итоговый набор выбранных объектов (SelectionSet) содержать один
и тот же объект более одного раза. Если свойство установлено в true,
пользователь может указать один и тот же объект несколько раз — например,
при многократном щелчке в режиме выбора с возможностью добавления.
Если false — каждый объект может быть выбран только один раз.
Returns: Возвращает значение типа bool:
* true — дублирующиеся объекты разрешены в наборе выбора.
* false — каждый объект может быть выбран только один раз.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.AllowSubSelections
Свойство определяет, разрешён ли выбор подмножества объектов
(например, вершин, рёбер или граней) внутри составных объектов,
таких как полилинии, блоки или 3D-тела.
Свойство указывает, может ли пользователь выбирать не только целые объекты,
но и их внутренние компоненты — подмножества. Если свойство установлено в true,
при выборе объекта пользователь может указать конкретную вершину, сегмент полилинии,
ребро блока или другую логическую часть. Если false — выбор ограничен только целыми объектами.
Свойство применяется в связке с методом GetSelection().
Returns: Возвращает значение типа bool:
* true — выбор подмножеств объектов разрешён.
* false — выбор ограничен целыми объектами.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.ForceSubSelections
Свойство определяет, будет ли выбор ограничен только
подмножествами объектов — например, сегментами полилинии
или элементами блока.
Свойство указывает, обязательно ли пользователь должен выбрать
именно подмножество объекта (например, вершину, ребро, сегмент),
а не весь объект целиком. Если свойство установлено в true,
система будет игнорировать выбор целого объекта и требовать указания
его внутреннего компонента. Если false — выбор целого объекта разрешён.
Это свойство применяется в связке с AllowSubSelections = true
и используется в специализированных командах, где требуется
строгое взаимодействие с элементами сложных объектов — например,
при редактировании сегментов полилинии, работе с гранями 3D-тел
или анализе структуры блоков.
Returns: Возвращает значение типа bool:
* true —  выбор подмножества объекта обязателен;
выбор целого объекта не разрешён.
* false — выбор подмножества не обязателен;
пользователь может выбрать как подмножество,
так и весь объект.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.Keywords
Свойство предоставляет доступ к коллекции ключевых слов,
доступных для выбора при операции ввода.
Свойство предоставляет доступ к объекту типа KeywordCollection,
содержащему список ключевых слов, которые могут быть введены
пользователем в ходе интерактивной команды выбора объекта.
Эти слова отображаются в командной строке в формате [Ключ1/Ключ2/Ключ3]
и позволяют пользователю выбрать действие из предложенных вариантов:
например, "Да/Нет", "Включить/Отключить", "Все/Фильтр".
Returns: Возвращает объект типа KeywordCollection — изменяемую коллекцию строк, представляющих ключевые слова.
* Если коллекция пуста — пользователь не имеет вариантов выбора (кроме глобальных команд).
* Каждое ключевое слово должно быть корректной строкой без пробелов.
* Первое добавленное ключевое слово может быть установлено как значение по умолчанию через свойство Default.

HostMgd.EditorInput.PromptSelectionOptions.MessageForAdding
Свойство возвращает или устанавливает сообщение,
отображаемое при добавлении объектов в выборку.
Свойство предназначено для задания текста приглашения,
который отображается пользователю во время добавления объектов
в текущий набор выбора — например, при многократном выборе
с возможностью добавления (режим "Выберите больше объектов...").
Оно позволяет улучшить пользовательский интерфейс,
делая его более понятным: вместо стандартного сообщения
система может показать контекстное, например:
"Выберите объекты для копирования (добавьте ещё):"
или "Добавьте элементы к выборке:".
Returns: Возвращает строку (string), которая отображается в командной строке при добавлении объектов к существующей выборке.
* Если значение null или пустое — используется Message или сообщение по умолчанию.
* Если задано — отображается только при добавлении объектов (не при первом выборе).

HostMgd.EditorInput.PromptSelectionOptions.MessageForRemoval
Свойство возвращает или устанавливает сообщение,
отображаемое при удалении объектов из текущего набора выбора.
Свойство предназначено для задания текста приглашения,
который выводится в командной строке, когда пользователь
находится в режиме удаления объектов из выборки — например,
при использовании опции Remove в интерактивной команде выбора.
Это позволяет улучшить пользовательский интерфейс,
предоставляя понятную инструкцию: например,
"Выберите объекты для удаления из выборки:"
или "Щелкните, чтобы исключить объекты".
Returns: Возвращает строку (string), отображаемую в командной строке
при режиме удаления объектов из выборки.
Если значение null или пустое — используется Message
или сообщение по умолчанию.
Если задано — активируется только при включении режима Remove
(например, при вводе ключевого слова "Удалить").
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.PrepareOptionalDetails
Свойство устанавливает или возвращает режим N (No details),
определяя, следует ли пропускать подготовку дополнительных данных о выбранных объектах.
Свойство влияет на поведение внутренней функции выбора объектов.
Оно управляет тем, будет ли система заранее загружать и обрабатывать дополнительные детали
о выбранных объектах — такие как геометрия, свойства, связи и другие метаданные.
Если свойство установлено в false, включается режим N (No details) —
система оптимизирует операцию выбора, пропуская подготовку вспомогательной информации.
Это может повысить производительность при работе с большими наборами объектов,
особенно если детальная информация не требуется.
Если true — система выполняет полную подготовку данных, что может быть необходимо для команд,
требующих анализа или отображения свойств объектов сразу после выбора.
Returns: Возвращает значение типа bool:
* true — дополнительные детали о выбранных объектах будут подготовлены (режим по умолчанию).
* false — подготовка деталей пропускается (режим N), выбор выполняется быстрее,
но без предварительной загрузки метаданных.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.RejectObjectsFromNonCurrentSpace
Свойство определяет, будут ли отклоняться объекты,
находящиеся вне текущего пространства (модель или лист),
при операции выбора.
Свойство указывает, разрешено ли выбирать объекты, находящиеся в пространстве,
отличном от текущего активного. Если свойство установлено в true,
система отклоняет выбор объектов из других пространств — например,
при работе в пространстве листа (Layout) нельзя выбрать объекты из модели,
и наоборот. Если false — выбор объектов из других пространств разрешён.
Это свойство особенно полезно при реализации команд, которые должны работать
только в контексте текущего пространства чертежа, предотвращая случайное
включение объектов из модели в листовых командах и наоборот.
Returns: Возвращает значение типа bool:
* true — выбор объектов из других пространств (модель/лист) запрещён.
* false — выбор объектов из любого пространства разрешён.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.RejectObjectsOnLockedLayers
Свойство определяет, разрешён ли выбор объектов,
расположенных на заблокированных слоях.
Свойство позволяет контролировать, могут ли пользователи выбирать объекты,
находящиеся на слоях с состоянием "заблокирован".
Если свойство установлено в true — выбор объектов на заблокированных слоях запрещён .
Если false — выбор разрешён, даже если объекты находятся на заблокированном слое.
Это свойство особенно полезно при реализации команд редактирования,
где важно предотвратить случайное изменение защищённых элементов чертежа.
Оно работает независимо от возможности редактирования — объекты на заблокированных слоях
всё равно нельзя изменять, но их выбор может быть разрешён или запрещён в зависимости от настройки.
Returns: Возвращает значение типа bool:
* true — объекты на заблокированных слоях не могут быть выбраны.
* false — объекты на заблокированных слоях могут быть выбраны.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.RejectPaperspaceViewport
Свойство определяет, будет ли отклоняться выбор видовых экранов
в пространстве листа (Paper Space).
Свойство указывает, могут ли пользователи выбирать видовые экраны (viewport'ы)
в пространстве листа.
Если свойство установлено в true — выбор видовых экранов запрещён.
Если false — выбор видовых экранов разрешён .
Это свойство особенно полезно при реализации команд,
которые должны работать только с обычными графическими объектами на листе,
исключая вмешательство в структуру видовых экранов — например,
при оформлении, аннотировании или печати.
Оно не влияет на объекты внутри видовых экранов (в модели),
а только на сам объект видового экрана в пространстве листа.
Свойство применяется при вызове GetSelection().
Returns: Возвращает значение типа bool:
* true — выбор видовых экранов в пространстве листа запрещён.
* false — выбор видовых экранов разрешён.
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.SelectEverythingInAperture
Свойство влияет на поведение внутренней функции выбора объектов HostSSGet.
Оно включает или отключает режим :E, при котором все объекты,
пересекаемые прямоугольной апертурой (курсором выбора), автоматически
добавляются в набор выбора , независимо от того, используется ли режим окна,
рамки или одиночного выбора.
Если свойство установлено в true, при щелчке мышью выбираются все объекты ,
попадающие под апертуру, даже если они частично её пересекают.
Если false — применяется стандартное поведение, зависящее от режима выбора
(например, только объекты, полностью внутри окна, или точное попадание).
Этот режим особенно полезен при реализации команд, где требуется
максимальная чувствительность выбора — например, при быстром редактировании
или массовом выделении.
Returns: Возвращает значение типа bool:
* true — включён режим :E: все объекты в пределах апертуры выбираются.
* false — режим отключён, выбор зависит от текущего режима (Window, Crossing и т.д.).
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.SingleOnly
Свойство устанавливает режим :S для функции HostSSGet,
ограничивая выбор только одним объектом.
Свойство активирует режим :S внутренней функции выбора HostSSGet.
При установке в true пользователь может выбрать только один объект ,
даже если используется режим окна, рамки или множественного выбора.
После выбора первого объекта операция завершается автоматически —
без возможности добавления других объектов.
Этот режим аналогичен использованию ключевого слова Один (Single)
в командах чертежа. Он полезен при реализации команд,
где требуется строго один объект — например, указание базовой точки,
целевого объекта для копирования или элемента для анализа.
Returns: Возвращает значение типа bool:
* true — включён режим :S: выбор ограничен одним объектом.
* false — выбор может включать несколько объектов (в зависимости от режима).
Example
C#

HostMgd.EditorInput.PromptSelectionOptions.SinglePickInSpace
Свойство включает режим :A для HostSSGet, позволяя выполнять
выбор объектов только по одиночному щелчку без открытия рамки
или окна выбора.
Свойство активирует режим :A (Aperture Only) функции HostSSGet.
При установке в true выбор объектов происходит только по одному щелчку мыши
— система использует текущую апертуру (выборную рамку) для определения объектов
под курсором, не позволяя пользователю рисовать окно или рамку.
Это обеспечивает быстрый и точный выбор одного или нескольких объектов в точке щелчка.
Если SinglePickInSpace = false, пользователь может использовать стандартные режимы выбора
— такие как окно, рамка, пересечение и т.д.
Режим особенно полезен при реализации команд, требующих точечного выбора
— например, редактирование свойств, измерение, выделение или редактирование
отдельного элемента в плотной группе объектов.
Returns: Возвращает значение типа bool:
* true — включён режим :A: выбор возможен только по одиночному щелчку (без рисования окна).
* false — разрешены стандартные режимы выбора (окно, рамка и др.).
Example
C#