Teigha.DatabaseServices.CustomScale
Этот класс предназначен для хранения значений числителя и знаменателя, используемых для формирования пользовательского масштаба печати.
Этот класс предназначен для хранения значений числителя и знаменателя, используемых для формирования пользовательского масштаба печати.

Teigha.DatabaseServices.CustomScale.#ctor(System.Double,System.Double)
Конструктор класса CustomScale.
Конструктор класса CustomScale.  Создает новый пользовательский масштаб с указанными числителем и знаменателем.
numerator: Числитель.   Тип double.
denominator: Знаменатель. Тип double.

Teigha.DatabaseServices.CustomScale.Equals(Object)
Метод предназначен для проверки объектов CustomScale на совпадение.
Метод предназначен для проверки входного объекта obj на совпадение с данным объектом.
obj: Объект, который проверяется на совпадение с данным объектом CustomScale. Тип Object.
Returns: Возвращает true, если переданный объект obj не является нулевым и имеет те же самые значения числителя и знаменателя масштаба.
В противном случае возвращает false.
Notes

Teigha.DatabaseServices.CustomScale.IsEqualTo(Teigha.DatabaseServices.CustomScale)
Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale.
Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale.
a: Пользовательский масштаб, с которым данный объект проверяется на равенство. Тип CustomScale.
Returns: Возвращает true, если входной объект a не является нулевым и имеет те же самые значения числителя и знаменателя масштаба.
В противном случае возвращает false.

Teigha.DatabaseServices.CustomScale.IsEqualTo(Teigha.DatabaseServices.CustomScale,Teigha.Geometry.Tolerance)
Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale в пределах указанного допуска.
Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale в пределах указанного допуска.
a: Пользовательский масштаб, с которым данный объект проверяется на равенство. Тип CustomScale.
tolerance: Заданный допуск для сравнения на равенство. Тип Tolerance.
Returns: Возвращает true, если входной объект a не является нулевым и имеет совпадающие в пределах допуска значения числителя и знаменателя масштаба.
В противном случае возвращает false.

Teigha.DatabaseServices.CustomScale.ToString(IFormatProvider)
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек.
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек, определяемых указанным провайдером.
provider: Провайдер формата региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.
Строка содержит значения числителя и знаменателя пользовательского масштаба.

Teigha.DatabaseServices.CustomScale.!=(Teigha.DatabaseServices.CustomScale,Teigha.DatabaseServices.CustomScale)
Оператор неравенства для класса CustomScale.
Оператор неравенства для класса CustomScale. Позволяет проверить, равны ли указанные объекты.
a: Левый операнд.  Тип CustomScale.
b: Правый операнд. Тип CustomScale.
Returns: Возвращает true, если не выполняется хотя бы одно из перечисленных ниже условий:
* Числители объектов a и b равны;
* Знаменатели объектов a и b равны.

Teigha.DatabaseServices.CustomScale.==(Teigha.DatabaseServices.CustomScale,Teigha.DatabaseServices.CustomScale)
Оператор равенства для класса CustomScale.
Оператор равенства для класса CustomScale. Позволяет проверить, равны ли указанные объекты.
a: Левый операнд.  Тип CustomScale.
b: Правый операнд. Тип CustomScale.
Returns: Возвращает true, если одновременно выполняются оба перечисленных ниже условия:
* Числители объектов a и b равны;
* Знаменатели объектов a и b равны.

Teigha.DatabaseServices.CustomScale.Denominator
Свойство представляет знаменатель этого пользовательского масштаба.
Свойство представляет знаменатель этого пользовательского масштаба.
Returns: Возвращает знаменатель пользовательского масштаба. Тип double.

Teigha.DatabaseServices.CustomScale.Numerator
Свойство представляет числитель этого пользовательского масштаба.
Свойство представляет числитель этого пользовательского масштаба.
Returns: Возвращает числитель пользовательского масштаба.  Тип double.