Teigha.Geometry.Curve2d.GetReverseParameterCurve
Метод изменяет направление параметра для данной кривой на противоположное.
Метод предназначен для изменения направления параметра для данной кривой на противоположное.
Множество точек данной кривой сохраняется без изменений.
Returns: Возвращает кривую с инвертированным параметрическим интервалом.
Тип Curve2d.