Teigha.DatabaseServices.PropertiesOverrule.SetCustomFilter
Этот метод включает использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.
Этот метод включает использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.