Teigha.DatabaseServices.Group
Этот класс представляет объекты группы в экземпляре базы данных.
Класс Group представляет собой коллекцию объектов, на которые можно ссылаться, используя одно, общее для всех имя группы.
В отличие от элементов блока, объектами внутри группы можно манипулировать индивидуально.
Один и тот же объект может принадлежать более чем одной группе. Однако в любой такой группе он может присутствовать только в одном экземпляре.
Индексы членов группы отсчитываются от нуля. Таким образом, первый элемент в группе имеет индекс 0.

Teigha.DatabaseServices.Group.#ctor
Конструктор по умолчанию класса Group.
Конструктор по умолчанию класса Group.

Teigha.DatabaseServices.Group.#ctor(String,System.Boolean)
Конструктор класса Group. Создает экземпляр класса с указанным именем группы и предписанным режимом выделения (групповое / индивидуальное).
Конструктор класса Group. Создает экземпляр класса с указанным именем группы и предписанным режимом выделения (групповое / индивидуальное).

Teigha.DatabaseServices.Group.Append(DatabaseServices.ObjectId)
Метод предназначен для добавления в данную группу указанного объекта чертежа.
Метод предназначен для добавления в данную группу указанного объекта чертежа.
Один и тот же объект может принадлежать более чем одной группе.
Однако в любой такой группе он может присутствовать только в одном экземпляре.
id: Идентификатор добавляемого в группу объекта чертежа. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Group.Append(Teigha.DatabaseServices.ObjectIdCollection)
Метод предназначен для добавления в данную группу нескольких объектов списком.
Метод предназначен для добавления в данную группу нескольких объектов списком.
Один и тот же объект может принадлежать более чем одной группе.
Однако в любой такой группе он может присутствовать только в одном экземпляре.
ids: Коллекция идентификаторов объектов чертежа, которые добавляются в данную группу. Тип ObjectIdCollection.

Teigha.DatabaseServices.Group.GetIndex(DatabaseServices.ObjectId)
Метод позволяет получить индекс указанного объекта в данной группе.
Метод позволяет получить индекс указанного объекта в данной группе.
id: Идентификатор объекта чертежа. Тип DatabaseServices.ObjectId.
Returns: Возвращает индекс указанного объекта в данной группе. Тип int. Метод выбрасывает исключение eInvalidInput, если объект с указанным id в данной группе отсутствует.

Teigha.DatabaseServices.Group.Has(Teigha.DatabaseServices.Entity)
Метод позволяет проверить, имеется ли в данной группе указанный объект.
Метод позволяет проверить, входит ли в данную группу указанный объект.
entity: Искомый объект чертежа. Тип Entity.
Returns: Возвращает true, если указанный объект entity входит в данную группу.
В противном случае возвращает false.

Teigha.DatabaseServices.Group.InsertAt(System.Int32,DatabaseServices.ObjectId)
Метод позволяет вставить указанный объект чертежа в данную группу по указанному индексу.
Метод позволяет вставить указанный объект чертежа в данную группу по указанному индексу.
index: Индекс, по которому следует вставить в группу новый объект чертежа. Тип int.
id: Идентификатор вставляемого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Group.InsertAt(System.Int32,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет вставить указанную коллекцию объектов в данный объект Group по указанному индексу.
Метод позволяет вставить в данную группу объекты, чьи идентификаторы ObjectId представлены в коллекции ids, непосредственно после члена группы с индексом index.
Нумерация членов группы начинается с нуля.
index: Индекс в группе, по которому вставляются объекты из коллекции.   Тип int.
ids: Коллекция идентификаторов вставляемых в группу объектов чертежа. Тип ObjectIdCollection.

Teigha.DatabaseServices.Group.Prepend(DatabaseServices.ObjectId)
Метод предназначен для добавления указанного объекта в начало списка членов данной группы.
Метод предназначен для добавления указанного объекта в начало списка членов данной группы.
id: Идентификатор вставляемого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Group.Prepend(Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет вставить указанные в коллекции объекты в начало списка членов данной группы.
Метод позволяет вставить указанные в коллекции ids объекты в начало списка членов данной группы.
ids: Идентификаторы вставляемых объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.Group.Remove(DatabaseServices.ObjectId)
Метод позволяет удалить указанный объект из данной группы.
Метод позволяет удалить указанный объект из данной группы.
id: Идентификатор удаляемого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Group.Remove(Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет удалить указанные объекты из данной группы.
Метод позволяет удалить указанные в коллекции ids объекты из данной группы.
ids: Идентификаторы удаляемых объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.Group.RemoveAt(System.Int32)
Метод предназначен для удаления из группы объекта с указанным индексом.
Метод предназначен для удаления из группы объекта с указанным индексом.
index: Индекс удаляемого объекта группы. Тип int.

Teigha.DatabaseServices.Group.RemoveAt(System.Int32,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет удалить из данной группы указанные объекты, причем они должны иметь индексы равные или больше некоторого заданного индекса.
Метод позволяет удалить из данной группы указанные объекты, причем они должны иметь индексы равные или больше некоторого заданного индекса.
index: Индекс, начиная с которого будут удаляться объекты из коллекции ids. Тип int.
ids: Коллекция удаляемых объектов. Тип ObjectIdCollection. Все объекты должны находиться в этой группе и иметь индекс, равный или превышающий указанное значение index.

Teigha.DatabaseServices.Group.Replace(DatabaseServices.ObjectId,DatabaseServices.ObjectId)
Метод предназначен для замены в составе данной группы одного объекта другим.
Метод предназначен для замены одного объекта в составе данной группы другим объектом, который в этой группе не состоит.
oldId: Удаляемый из группы объект. Тип DatabaseServices.ObjectId.
newId: Объект, добавляемый в группу взамен объекта oldId. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Group.SetColor(Teigha.Colors.Color)
Метод позволяет назначить новый цвет всем объектам данной группы.
Метод позволяет назначить новый цвет всем объектам данной группы.
color: Новое значение цвета для объектов группы. Тип Color.

Teigha.DatabaseServices.Group.SetColorIndex(System.Int32)
Метод позволяет назначить всем объектам данной группы новый цвет, указанный индексом.
Метод позволяет назначить всем объектам данной группы новый цвет, указанный индексом color.
color: Индекс нового цвета объектов группы. Тип int.

Teigha.DatabaseServices.Group.SetHighlight(System.Boolean)
Метод позволяет подсветить или отменить подсветку объектов данной группы.
Метод позволяет подсветить или отменить подсветку (Highlight) объектов данной группы.
Новое состояние определяется переданным в метод логическим аргументом value.
value: Флаг подсветки объектов группы. Тип bool. Если он принимает значение true, будут подсвечены все объекты в группе. В противном случае подсветка отменяется.

Teigha.DatabaseServices.Group.SetLayer(DatabaseServices.ObjectId)
Метод позволяет для всех объектов данной группы задать слой с указанным идентификатором.
Метод позволяет задать слой для всех объектов данной группы.
После выполнения метода все объекты будут связаны со слоем с идентификатором value.
value: Идентификатор объекта LayerTableRecord. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Group.SetLayer(String)
Метод позволяет для всех объектов данной группы задать слой с указанным именем.
Метод позволяет для всех объектов данной группы задать слой с указанным именем.
value: Имя слоя, назначаемого объектам группы. Тип String.

Teigha.DatabaseServices.Group.SetLinetype(DatabaseServices.ObjectId)
Метод позволяет задать иной тип линий для всех объектов в этой группе.
Метод позволяет назначить всем объектам этой группы тип линий LinetypeTableRecord с указанным идентификатором ObjectId.
value: Идентификатор типа линий LinetypeTableRecord.   Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Group.SetLinetype(String)
Метод позволяет задать всем объектам этой группы тип линий с указанным именем.
Метод позволяет задать всем объектам этой группы тип линий, указанный по имени.
Тип линий должен быть загружен до вызова метода.
value: Имя типа линий.  Тип String.

Teigha.DatabaseServices.Group.SetLinetypeScale(System.Double)
Метод позволяет задать масштаб типа линий для всех объектов в данной группе.
Метод позволяет задать масштаб типа линий для всех объектов в данной группе.
value: Масштаб типа линий. Тип double.

Teigha.DatabaseServices.Group.SetVisibility(System.Boolean)
Метод позволяет установить статус видимости для всех объектов в данной группе.
Метод позволяет установить статус видимости для всех объектов в данной группе.
value: Флаг, определяющий видимость объектов группы. Тип bool. Если флаг принимает значение true, объекты становятся видимыми. В противном случае вся группа оказывается невидимой.

Teigha.DatabaseServices.Group.Transfer(System.Int32,System.Int32,System.Int32)
Этот метод предоставляет возможность изменять порядок следования элементов внутри группы целыми диапазонами индексов.
Этот метод предоставляет возможность изменять порядок следования элементов внутри группы целыми диапазонами индексов.
fromIndex: Индекс первого перемещаемого объекта. Тип int.
toIndex: Новый индекс первого перемещаемого объекта. Тип int.
numItems: Количество перемещаемых объектов группы. Тип int.

Teigha.DatabaseServices.Group.Description
Свойство обеспечивает доступ к описанию данного объекта Group.
Свойство обеспечивает доступ к описанию данного объекта Group.
Returns: Возвращает описание группы. Тип String.

Teigha.DatabaseServices.Group.IsAnonymous
Свойство позволяет определить, является ли данная группа анонимной.
Свойство позволяет определить, является ли данная группа анонимной.
Returns: Возвращает true, если данная группа является анонимной. В противном случае возвращает false.

Teigha.DatabaseServices.Group.IsNotAccessible
Свойство позволяет определить, является ли эта группа недоступной.
Свойство позволяет определить, является ли эта группа недоступной.
В текущей версии только группы во внешних ссылках помечаются как недоступные.
Returns: Возвращает true, если группа помечена как недоступная.
В противном случае возвращает false.

Teigha.DatabaseServices.Group.Name
Свойство обеспечивает доступ к имени данного объекта Group.
Свойство обеспечивает доступ к имени данного объекта Group.
Returns: Возвращает имя данной группы. Тип String.

Teigha.DatabaseServices.Group.NumEntities
Свойство возвращает текущее количество объектов в этой группе.
Свойство возвращает текущее количество объектов в этой группе.
Returns: Возвращает количество объектов в группе. Тип int.

Teigha.DatabaseServices.Group.Selectable
Свойство позволяет определить, возможно ли выделение всей группы целиком.
Свойство позволяет определить, возможно ли выделить данную группу, чтобы обрабатывать ее как единое целое.
Returns: Возвращает true, если группа допускает выделение.
В противном случае возвращает false.