HostMgd.GraphicsSystem.Manager.ViewWasCreated
Событие ViewWasCreated выпускается сразу после создания нового вида.
Событие ViewWasCreated выпускается сразу после создания нового вида.
Returns: Возвращает делегат типа Teigha.GraphicsSystem.ViewWasCreatedEventHandler.