HostMgd.Windows.ToolPalette
Пространство имен HostMgd.Windows.ToolPalette включает классы, перечисления и делегаты, предназначенные для создания в пользовательском интерфейсе разнообразных панелей инструментов.
Пространство имен HostMgd.Windows.ToolPalette включает классы, перечисления и делегаты, предназначенные для создания в пользовательском интерфейсе разнообразных панелей инструментов.