Teigha.GraphicsInterface.TextStyle
Класс TextStyle предоставляет интерфейс для настройки атрибутов отображения текста.
Класс TextStyle предоставляет интерфейс для настройки атрибутов отображения текста.

Teigha.GraphicsInterface.TextStyle.#ctor
Конструктор по умолчанию класса TextStyle.
Конструктор по умолчанию класса TextStyle.

Teigha.GraphicsInterface.TextStyle.#ctor(String,String,System.Double,System.Double,System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,String)
Конструктор класса TextStyle.
Создает экземпляр класса с указанными параметрами.
Конструктор класса TextStyle.
Создает экземпляр класса с указанными параметрами.
fontName: Имя файла шрифта. Тип String.
bigFontName: Имя файла BigFont. Тип String.
textSize: Фиксированный размер текста. Тип double.
x: Коэффициент масштабирования текста по оси X (по ширине). Тип double.
obliqueAngle: Угол наклона текста в диапазоне [-1.48335 .. +1.48335] рад или [-85° .. +85°]. Выражается в радианах. Тип double.
trackingPercent: Значение трекинга в процентах. Изменяет межсимвольный интервал. Тип double.
isBackward: Флаг ориентации текста в обратном направлении. Тип bool.
isUpsideDown: Флаг расположения текста в перевернутой ориентации. Тип bool.
isVertical: Флаг вертикальной ориентации текста. Тип bool.
isOverLined: Флаг зачеркнутого текста. Тип bool.
isUnderlined: Флаг подчеркнутого текста. Тип bool.
styleName: Имя используемого текстового стиля. Тип String.

Teigha.GraphicsInterface.TextStyle.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип TextStyle.

Teigha.GraphicsInterface.TextStyle.ExtentsBox(String,System.Boolean,System.Boolean,Teigha.GraphicsInterface.WorldDraw)
Метод вычисляет границы переданной текстовой строки при использовании текущего текстового стиля.
Не реализован.
Метод вычисляет границы переданной текстовой строки при использовании текущего текстового стиля.
В данной версии метод не реализован.
text: Входная текстовая строка, границы которой требуется вычислить. Тип String.
includeSpaces: Флаг, определяющий, требуется ли в расчете границ учитывать возможные лидирующие и концевые пробелы. Тип bool.
raw: Флаг, определяющий, что управляющие последовательности, такие как %%P, не будут преобразовываться в специальные символы. Тип bool.
worldDraw: Интерфейс WorldDraw. В случае значения NULL используется конвейер регенерации по умолчанию. Тип WorldDraw.
Returns: Возвращает границы текста. Тип Extents2d.

Teigha.GraphicsInterface.TextStyle.FromTextStyleTableRecord(Teigha.DatabaseServices.ObjectId)
Метод копирует свойства текстового стиля из записи TextStyleTableRecord с указанным ObjectId.
Метод копирует свойства текстового стиля из записи TextStyleTableRecord с переданным идентификатором styleId.
styleId: Входной идентификатор объекта текстового стиля.

Teigha.GraphicsInterface.TextStyle.FromTextStyleTableRecord(String)
Метод копирует свойства текстового стиля из записи TextStyleTableRecord с указанным именем.
Метод копирует свойства текстового стиля из записи TextStyleTableRecord с указанным именем styleName.
styleName: Входное имя текстового стиля.

Teigha.GraphicsInterface.TextStyle.SetTrackKerning(System.Double)
Метод устанавливает значение трекинга (в процентах) для текущего стиля текста.
Метод устанавливает значение трекинга (в процентах) для текущего стиля текста.
Notes
Процент трекинга — это множитель для настройки межсимвольного интервала, который определён в файле шрифта.
trackPercent: Значение трекинга (в процентах).

Teigha.GraphicsInterface.TextStyle.Backward
Свойство Backward позволяет определить, отображается ли текст в обратном направлении с помощью данного текстового стиля.
Свойство Backward позволяет определить, отображается ли текст в обратном направлении с помощью данного текстового стиля.
Returns: Возвращает true, если текст отображается в обратном направлении.
В противном случае возвращает false.

Teigha.GraphicsInterface.TextStyle.BigFontFileName
Свойство BigFontFileName представляет имя файла BigFont для данного текстового стиля.
Свойство BigFontFileName представляет имя файла BigFont для данного текстового стиля.
Returns: Возвращает имя файла BigFont.
Тип String.

Teigha.GraphicsInterface.TextStyle.FileName
Свойство FileName представляет полный путь к файлу шрифта для данного текстового стиля.
Свойство FileName представляет полный путь к файлу шрифта для данного текстового стиля.
Returns: Возвращает полный путь к файлу шрифта.
Тип String.

Teigha.GraphicsInterface.TextStyle.Font
Свойство Font представляет дескриптор шрифта для данного текстового стиля.
Свойство Font представляет дескриптор шрифта для данного текстового стиля.
Notes
Дескриптор шрифта обеспечивает доступ к определению шрифта - его гарнитуре, атрибутам полужирного и курсивного начертания, набору символов и ряду других характеристик.
Returns: Возвращает дескриптор шрифта.
Тип FontDescriptor.

Teigha.GraphicsInterface.TextStyle.LoadStyleRec
Свойство LoadStyleRec загружает шрифт (не стиль) после того, как свойствами TextStyle.FileName или TextStyle.BigFontFileName заданы файлы шрифта.
Свойство LoadStyleRec загружает шрифт (не стиль) после того, как свойствами TextStyle.FileName или TextStyle.BigFontFileName заданы файлы шрифта.
Notes
Свойство следует вызывать после загрузки шрифта TrueType (TTF).
Его также необходимо вызвать после изменения любых свойств TextStyle, таких как процент трекинга, чтобы загрузить новые значения в графическую систему.
Returns: Возвращает значение типа unsigned char.

Teigha.GraphicsInterface.TextStyle.ObliquingAngle
Свойство ObliquingAngle предоставляет доступ к углу наклона текста.
Свойство ObliquingAngle предоставляет доступ к углу наклона текста.
Notes
Угол наклона выражается в радианах и определен на интервале [-1.48335 .. +1.48335] рад ([-85° .. +85°]).
К отрицательным углам будет добавлено значение 2PI.
Если угол наклона не задан, возвращается 0.
Returns: Возвращает угол наклона текста (в радианах).
Тип double.

Teigha.GraphicsInterface.TextStyle.Overlined
Свойство Overlined позволяет определить, является ли текст зачеркнутым.
Свойство Overlined позволяет определить, является ли текст зачеркнутым.
Returns: Возвращает true, если текст является зачеркнутым.
В противном случае возвращает false.

Teigha.GraphicsInterface.TextStyle.PreLoaded
Свойство PreLoaded позволяет определить, имеет ли данный текстовый стиль предварительно загруженный шрифт.
Свойство PreLoaded позволяет определить, имеет ли данный текстовый стиль предварительно загруженный шрифт.
Returns: Возвращает true, если шрифт загружается предварительно.
В противном случае возвращает false.

Teigha.GraphicsInterface.TextStyle.StyleName
Свойство StyleName представляет имя данного текстового стиля.
Свойство StyleName представляет имя данного текстового стиля.
Notes
Если стиль не задан, возвращается NULL.
На имена стилей распространяются все ограничения, принятые для любых имен в таблицах символов.
Returns: Возвращает имя текстового стиля.
Тип String.

Teigha.GraphicsInterface.TextStyle.TextSize
Свойство TextSize представляет текущую высоту текста для данного текстового стиля.
Свойство TextSize представляет текущую высоту текста для данного текстового стиля.
Returns: Возвращает текущую высоту текста.
Тип double.

Teigha.GraphicsInterface.TextStyle.TrackingPercent
Свойство TrackingPercent представляет текущее значение трекинга для данного текстового стиля.
Свойство TrackingPercent представляет текущее значение трекинга для данного текстового стиля.
Returns: Возвращает значение трекинга (в процентах).
Тип double.

Teigha.GraphicsInterface.TextStyle.Underlined
Свойство Underlined позволяет определить, должен ли текст отображаться подчеркнутым согласно данному текстовому стилю.
Свойство Underlined позволяет определить, должен ли текст отображаться подчеркнутым согласно данному текстовому стилю.
Returns: Возвращает true, если текст должен быть подчеркнутым.
В противном случае возвращает false.

Teigha.GraphicsInterface.TextStyle.UpsideDown
Свойство UpsideDown позволяет определить, отображается ли текст перевернутым согласно данному стилю.
Свойство UpsideDown позволяет определить, отображается ли текст перевернутым согласно данному стилю.
Returns: Возвращает true, если текст отображается перевернутым.
В противном случае возвращает false.

Teigha.GraphicsInterface.TextStyle.Vertical
Свойство Vertical позволяет определить, отображается ли текст вертикально в рамках данного текстового стиля.
Свойство Vertical позволяет определить, отображается ли текст вертикально в рамках данного текстового стиля.
Returns: Возвращает true, если текст ориентирован вертикально.
В противном случае возвращает false.

Teigha.GraphicsInterface.TextStyle.XScale
Свойство XScale представляет коэффициент масштабирования текста по оси X (по ширине).
Свойство XScale представляет коэффициент масштабирования текста по оси X (по ширине).
Returns: Возвращает коэффициент масштабирования текста по оси X (по ширине).
Тип double.