Teigha.DatabaseServices.Table.GetBreakSpacing
Метод предназначен для получения расстояния между фрагментами разбитой на части таблицы.
Метод предназначен для получения расстояния между фрагментами разбитой на части таблицы.
Returns: Возвращает расстояние между фрагментами таблицы, тип double.