Teigha.DatabaseServices.Shape
Класс Shape представляет объекты Shape в базе данных nanoCAD.
Класс Shape представляет объекты Shape в базе данных nanoCAD.

Teigha.DatabaseServices.Shape.#ctor
Конструктор по умолчанию класса Shape.
Конструктор по умолчанию класса Shape.

Teigha.DatabaseServices.Shape.#ctor(Teigha.Geometry.Point3d,System.Double,System.Double,System.Double)
Конструктор класса Shape. Создает экземпляр класса с указанными параметрами.
Конструктор класса Shape. Создает экземпляр класса с указанными параметрами.
position: Координатная точка привязки данного объекта Shape. Тип Point3d.
size: Высота объекта Shape. Тип double.
rotation: Угол поворота объекта Shape (в радианах). Тип double.
widthFactor: Относительный коэффициент ширины объекта Shape. Тип double.

Teigha.DatabaseServices.Shape.Name
Свойство Name представляет имя данного объекта.
Свойство Name представляет имя данного объекта.
Returns: Возвращает имя объекта. Тип String.

Teigha.DatabaseServices.Shape.Normal
Свойство Normal представляет нормаль плоскости, в которой располагается данный объект.
Свойство Normal представляет нормаль плоскости, в которой располагается данный объект.
Returns: Возвращает вектор нормали плоскости в мировой системе координат (WCS). Тип Vector3d.

Teigha.DatabaseServices.Shape.Oblique
Свойство Oblique представляет угол наклона данного объекта в интервале [-85 .. +85] градусов.
Свойство Oblique представляет угол наклона данного объекта.
Диапазон значений свойства представлен интервалом [-1,48335 .. 1,48335] радиан или [-85 .. +85] градусов.
Returns: Возвращает угол наклона объекта в радианах. Тип double.

Teigha.DatabaseServices.Shape.Position
Свойство Position представляет координатную точку привязки данного объекта.
Свойство Position представляет координатную точку привязки данного объекта.
Returns: Возвращает точку привязки объекта. Тип Point3d.

Teigha.DatabaseServices.Shape.Rotation
Свойство Rotation представляет угол поворота данного объекта в своей плоскости.
Свойство Rotation представляет угол поворота данного объекта в своей плоскости (в радианах).
Returns: Возвращает угол поворота объекта в радианах. Тип double.

Teigha.DatabaseServices.Shape.ShapeIndex
Свойство ShapeIndex представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта.
Свойство ShapeIndex представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта. Фактически, объект Shape представляет собой отдельный символ специального шрифта SHX.
Эквивалентно свойству StyleId.
Returns: Возвращает идентификатор объекта записи в таблице символов шрифта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Shape.ShapeNumber
Свойство ShapeNumber представляет номер данного объекта в файле SHX.
Свойство ShapeNumber представляет номер данного объекта в файле SHX.
Объект Shape, по сути, является одним из символов шрифта SHX.
Данное свойство возвращает код этого символа.
Returns: Возвращает код данного символа в файле SHX.  Тип short.

Teigha.DatabaseServices.Shape.Size
Свойство Size представляет высоту данного объекта.
Свойство Size представляет высоту данного объекта.
Returns: Возвращает высоту данного объекта. Тип double.

Teigha.DatabaseServices.Shape.StyleId
Свойство StyleId представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта.
Свойство StyleId представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта. Фактически, объект Shape представляет собой отдельный символ специального шрифта SHX.
Returns: Возвращает идентификатор объекта записи в таблице символов шрифта.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Shape.Thickness
Свойство Thickness представляет толщину данного объекта как глубину выдавливания по нормали к плоскости объекта.
Свойство Thickness представляет толщину данного объекта как глубину выдавливания по нормали к плоскости объекта.
Returns: Возвращает толщину данного объекта. Тип double.

Teigha.DatabaseServices.Shape.WidthFactor
Свойство WidthFactor представляет коэффициент ширины данного объекта, т.е. относительный масштабный коэффициент по ширине X.
Свойство WidthFactor представляет коэффициент ширины данного объекта, т.е. относительный масштабный коэффициент по ширине X.
Returns: Возвращает коэффициент ширины. Тип double.