Teigha.DatabaseServices.FieldCodeWithChildren
Этот класс хранит код поля и его внедренные или вложенные (дочерние) поля.
Этот класс хранит код поля и его внедренные или вложенные (дочерние) поля.

Teigha.DatabaseServices.FieldCodeWithChildren.Add(System.Int32,Teigha.DatabaseServices.Field)
Метод добавляет в массив дочерних полей новое дочернее поле по указанному индексу.
Метод добавляет новое дочернее поле field в массив дочерних полей по указанному индексу i.
i: Индекс, под которым в массив добавляется новое поле. Тип int.
field: Добавляемое дочернее поле.  Тип Field.

Teigha.DatabaseServices.FieldCodeWithChildren.Children
Свойство Children обеспечивает доступ к массиву вложенных (дочерних) полей данного объекта.
Свойство Children обеспечивает доступ к массиву вложенных (дочерних) полей данного объекта.
Returns: Возвращает массив дочерних полей. Тип Field[].

Teigha.DatabaseServices.FieldCodeWithChildren.FieldCode
Свойство FieldCode обеспечивает доступ к коду поля данного объекта.
Свойство FieldCode обеспечивает доступ к коду поля данного объекта.
Returns: Возвращает код поля. Тип String.