HostMgd.EditorInput.PromptDistanceOptions.GetDefaultValueString
Метод возвращает строковое представление значения расстояния по умолчанию,
заданного в параметрах команды.
Метод является вспомогательным и предназначен для преобразования числового значения
свойства DefaultValue в строку, отформатированную согласно текущим настройкам единиц
чертежа и локализации. Это удобно при формировании подсказок, сообщений или динамического
обновления интерфейса, где требуется отобразить значение по умолчанию в читаемом виде.
Метод автоматически учитывает формат отображения чисел (например, разделитель точка/запятая),
количество знаков после запятой и единицы измерения, используемые в текущем чертеже nanoCAD.
Returns: Возвращает значение типа string, представляющее собой отформатированное
значение расстояния по умолчанию.
Например:
* "100.00" — если DefaultValue = 100.0.
"0" — если значение по умолчанию не задано.
Может возвращать пустую строку, если DefaultValue не определено.
Example
C#