Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs
Класс XrefVetoableSubCommandEventArgs представляет данные для команды XrefVetoableSubCommand базы данных.
Класс XrefVetoableSubCommandEventArgs представляет данные для команды XrefVetoableSubCommand базы данных.

Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs.abortOp
Свойство abortOp позволяет определить, была ли прервана операция.
Свойство abortOp позволяет определить, была ли прервана операция.
Returns: Возвращает true, если операция прервана.
В противном случае возвращает false.