HostMgd.EditorInput.ObjectSnapMasks
Данное перечисление определяет битовые флаги для настройки режимов объектной привязки.
Данное перечисление определяет поддерживаемые битовые флаги (маски) для настройки режимов объектной привязки.