Teigha.Geometry.Matrix2dBuilder
Класс Matrix2dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix2d, который является неизменяемым типом.
Класс Matrix2dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix2d, который является неизменяемым типом.

Teigha.Geometry.Matrix2dBuilder.#ctor
Конструктор по умолчанию класса Matrix2dBuilder.
Конструктор по умолчанию класса Matrix2dBuilder.

Teigha.Geometry.Matrix2dBuilder.#ctor(Teigha.Geometry.Matrix2d)
Конструктор класса Matrix2dBuilder.
Создает новый экземпляр класса на основе указанной матрицы.
Конструктор класса Matrix2dBuilder.
Создает новый экземпляр класса на основе указанной матрицы.
value: Входная матрица, на основе которой создается новый экземпляр класса. Тип Matrix2d.

Teigha.Geometry.Matrix2dBuilder.ElementAt
Свойство ElementAt представляет элемент матрицы с указанными индексами строки и столбца.
Свойство ElementAt представляет элемент матрицы с указанными индексами строки и столбца.
i: Индекс строки. Тип int.
j: Индекс столбца. Тип int.
Returns: Возвращает элемент матрицы с указанными индексами строки и столбца.
Тип double.