HostMgd.EditorInput.Editor.PromptedForDouble
Событие возникает после завершения интерактивного ввода вещественного числа пользователем в редакторе nanoCAD.
Событие не реализовано.
Событие вызывается, когда пользователь завершает ввод значения типа double,
например, через метод GetDouble(). Оно предоставляет доступ к результату операции
— числовому значению, статусу (OK, Cancel, Error) и строковому представлению введённой величины.
Это событие используется для обработки числового ввода,
не привязанного к конкретным геометрическим параметрам (например, угол или расстояние),
и позволяет разработчикам реагировать на ввод произвольных чисел
при выполнении пользовательских команд.
Событие реализуется через делегат PromptDoubleResultEventHandler,
передающий объект PromptDoubleResultEventArgs,
одержащий значение ввода и дополнительные данные о контексте.
Example
C#