Teigha.DatabaseServices.Graph
Класс Graph реализует базовый объект ориентированного графа и предоставляет базовый механизм для выявления циклов.
Класс Graph реализует базовый объект ориентированного графа.
Граф представлен множеством узлов (вершин), связанных между собой ориентированными ребрами.
Узлы графа реализуются классом GraphNode.
Ребро, исходящее из узла, представляется указателем или ссылкой на узел на противоположном конце ребра.
Ссылки делятся на входящие и исходящие. Каждой входящей ссылке соответствует исходящая ссылка, и наоборот.
Каждый узел может иметь любое количество связанных с ним ссылок (ребер), что позволяет реализовать граф произвольной структуры.
Класс Graph предоставляет метод Graph.FindCycles() в качестве базового механизма выявления циклов.

Teigha.DatabaseServices.Graph.#ctor(Teigha.DatabaseServices.GraphNode)
Конструктор класса Graph. Создает новый объект Graph с указанным корневым узлом.
Конструктор класса Graph. Создает новый объект Graph с указанным корневым узлом root.
root: Корневой узел графа. Тип GraphNode.

Teigha.DatabaseServices.Graph.AddEdge(Teigha.DatabaseServices.GraphNode,Teigha.DatabaseServices.GraphNode)
Метод предназначен для добавления к данному объекту Graph нового ориентированного ребра с указанными начальным и конечным узлами.
Метод предназначен для добавления к данному объекту Graph нового ориентированного ребра с указанными начальным и конечным узлами.
В узле from создается исходящая ссылка на узел toPointer, а в узле toPointer - входящая ссылка на узел from.
Оба узла на концах создаваемого ребра обязаны принадлежать одному и тому же объекту Graph.
В противном случае метод завершается ошибкой eInvalidOwnerObject.
from: Начальный узел ребра. Тип GraphNode.
toPointer: Конечный узел ребра.  Тип GraphNode.

Teigha.DatabaseServices.Graph.AddNode(Teigha.DatabaseServices.GraphNode)
Метод предназначен для добавления в данный граф нового узла GraphNode.
Метод предназначен для добавления нового узла nodeToAdd в данный объект Graph.
Работа метода завершается ошибкой eInvalidOwnerObject, если узел nodeToAdd уже имеет владельца (т.е. уже является узлом другого графа).
nodeToAdd: Добавляемый узел. Тип GraphNode.

Teigha.DatabaseServices.Graph.BreakCycleEdge(Teigha.DatabaseServices.GraphNode,Teigha.DatabaseServices.GraphNode)
Метод предназначен для разрыва цикла на конкретном ребре графа с последующим обновлением информации о циклах в данном графе.
Метод предназначен для удаления из графа конкретного ребра, заданного узлами на его концах.
В завершение вызывается метод FindCycles() для обновления информации о циклах в связи с внесенными изменениями.
from: Узел в начале удаляемого ребра. Тип GraphNode.
toPointer: Узел на конце удаляемого ребра. Тип GraphNode.

Teigha.DatabaseServices.Graph.ClearAll(unsigned char)
Метод предназначен для очистки битовых флагов во всех узлах графа.
Метод предназначен для очистки битовых флагов во всех узлах графа.
Аргумент flags должен представлять собой комбинацию следующих битовых флагов:
Имя бита        Значение	Описание
_____________	_________	____________________________________________________
kNone            0x00     	Значение не задано.
kVisited         0x01     	Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
kOutsideRefed	0x02     	Используется в процессе отключения внешних ссылок Xref.
kSelected        0x04     	Выделение пользователем. Устанавливается в методе GetOutgoing().
kInList          0x08     	Присутствует в списке. Устанавливается в методе GetOutgoing().
kListAll         0x0E     	Используется для очистки флагов Selected, InList, OutsideRefed.
kFirstLevel      0x10     	Узел первого уровня, связан с корневым узлом графа. Только для чтения.
kUnresTree       0x20     	Дерево не разрешимо.
kAll             0x2F     	Используется для очистки всех флагов, кроме FirstLevel.
flags: Входные битовые флаги, которые следует очистить во всех узлах графа.  Тип unsigned char.

Teigha.DatabaseServices.Graph.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта Graph на базе указанного объекта.
Метод предназначен для создания объекта Graph на базе указанного объекта.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект типа Graph.

Teigha.DatabaseServices.Graph.DelNode(Teigha.DatabaseServices.GraphNode)
Метод предназначен для полного удаления конкретного узла из данного графа.
Метод удаляет указанный узел nodeToDelete из данного графа.
При этом удаляются также все существующие в других узлах ссылки на узел nodeToDelete.
nodeToDelete: Удаляемый узел. Тип GraphNode.

Teigha.DatabaseServices.Graph.FindCycles(Teigha.DatabaseServices.GraphNode)
Метод предназначен для выявления всех узлов данного графа, участвующих в циклах.
Метод предназначен для выявления всех узлов данного графа, участвующих в циклах.
Чтобы получать корректную информацию о циклах, метод FindCycles() следует вызывать непосредственно перед выполнением соответствующих запросов (т.е. какие-либо промежуточные изменения графа должны быть исключены).
start: Узел графа, с которого начинается поиск циклов. Тип GraphNode. Обычно передается null.
Returns: Возвращает true, только если данный объект представляет собой циклический граф.
В противном случае возвращает false.

Teigha.DatabaseServices.Graph.Node(System.Int32)
Метод предназначен для получения узла данного графа по его индексу.
Метод предназначен для получения узла данного графа по его индексу.
index: Входной индекс узла. Тип int.
Returns: Возвращает узел с указанным индексом.  Тип GraphNode.
В случае недействительного индекса возвращает null.

Teigha.DatabaseServices.Graph.SetNodeGrowthRate(System.Int32)
Метод позволяет задать количество узлов, под которые графу одномоментно выделяется память.
Метод позволяет задать количество узлов, под которые графу одномоментно выделяется память.
Приращение по умолчанию составляет 8 узлов. В случае большого графа это значение имеет смысл увеличить.
Использование более высоких значений повышает производительность ценой выделения дополнительной памяти.
rate: Количество узлов, под которые графу выделяется память. Тип int.

Teigha.DatabaseServices.Graph.IsEmpty
Свойство позволяет проверить, является ли граф пустым.
Свойство позволяет проверить, граф является ли граф пустым.
Returns: Возвращает true тогда и только тогда, когда граф является пустым.
В противном случае возвращает false.

Teigha.DatabaseServices.Graph.NumNodes
Свойство возвращает текущее количество узлов в графе.
Свойство возвращает текущее количество узлов в графе.
Returns: Возвращает количество узлов в графе. Тип int.

Teigha.DatabaseServices.Graph.RootNode
Свойство обеспечивает доступ к корневому (первому) узлу графа.
Свойство обеспечивает доступ к корневому (первому) узлу графа.
В случае пустого графа возвращает null.
Returns: Возвращает корневой узел графа.  Тип GraphNode.