Teigha.Runtime.StreamBuf
Класс StreamBuf реализует платформенно-зависимый потоковый буфер для операций ввода-вывода на платформе nanoCAD.
Класс StreamBuf реализует платформенно-зависимый потоковый буфер для операций ввода-вывода на платформе nanoCAD.

Teigha.Runtime.StreamBuf.#ctor
Конструктор по умолчанию класса StreamBuf.
Конструктор по умолчанию класса StreamBuf.

Teigha.Runtime.StreamBuf.CopyTo(Teigha.Runtime.StreamBuf)
Метод копирует байты из данного объекта StreamBuf в указанный объект StreamBuf.
Метод предназначен для копирования байтов из данного объекта StreamBuf в указанный потоковый буфер pDestination.
pDestination: Целевой потоковый буфер. Тип StreamBuf.

Teigha.Runtime.StreamBuf.CopyTo(Teigha.Runtime.StreamBuf,UInt64)
Метод копирует байты в указанный буфер StreamBuf из данного объекта StreamBuf, начиная с указанной позиции.
Метод предназначен для копирования байтов в указанный буфер pDestination из данного объекта StreamBuf, начиная с указанной позиции.
pDestination: Целевой потоковый буфер. Тип StreamBuf.
sourceStart: Позиция в данном буфере, начиная с которой выполняется копирование байтов в целевой буфер. Тип UInt64.

Teigha.Runtime.StreamBuf.CopyTo(Teigha.Runtime.StreamBuf,UInt64,UInt64)
Метод копирует заданный диапазон байтов из данного объекта StreamBuf в указанный буфер StreamBuf.
Метод предназначен для копирования заданного диапазона байтов из данного объекта StreamBuf в  потоковый буфер pDestination.
pDestination: Целевой потоковый буфер. Тип StreamBuf.
sourceStart: Начальная позиция копируемого диапазона байтов в данном буфере. Тип UInt64.
sourceEnd: Конечная  позиция копируемого диапазона байтов в данном буфере. Тип UInt64.

Teigha.Runtime.StreamBuf.Read(UInt32)
Метод считывает указанное количество байтов, начиная с текущей позиции файлового указателя.
Метод считывает указанное количество байтов, начиная с текущей позиции файлового указателя.
numBytes: Количество считываемых байтов. Тип UInt32.
Returns: Возвращает массив прочитанных байтов. Тип char[].

Teigha.Runtime.StreamBuf.Seek(Int64,Teigha.Runtime.FilerSeekType)
Метод выполняет заданное смещение текущей позиции файлового указателя в данном потоковом буфере относительно указанной позиции.
Метод реализует заданное смещение текущей позиции файлового указателя в данном потоковом буфере относительно указанной позиции.
Точкой отсчета может служить начало, либо конец файла, а также текущая позиция файлового указателя.
offset: Заданное смещение файлового указателя. Тип Int64.
seekType: Точка отсчета смещения. Значение из перечисления FilerSeekType.
Returns: Возвращает новое положение файлового указателя. Тип UInt64.

Teigha.Runtime.StreamBuf.Write(unsigned char)
Метод записывает заданное значение (байт) в текущую позицию файлового указателя в данном потоковом буфере, после чего смещает указатель на следующую позицию.
Метод записывает заданное значение (байт) в текущую позицию файлового указателя в данном потоковом буфере, после чего смещает указатель на следующую позицию.
value: Записываемое значение.  Тип unsigned char.

Teigha.Runtime.StreamBuf.Write(array,UInt32)
Метод записывает в данный потоковый буфер переданный массив байтов, начиная с текущей позиции файлового указателя, с соответствующим положительным смещением указателя.
Метод записывает в данный потоковый буфер переданный массив байтов, начиная с текущей позиции файлового указателя, с соответствующим положительным смещением указателя.
buffer: Входной массив. Тип unsigned char[].
numBytes: Количество байтов, записываемых в данный потоковый буфер. Тип UInt32.

Teigha.Runtime.StreamBuf.FileName
Свойство FileName возвращает имя файла, связанного с данным потоковым буфером StreamBuf.
Свойство FileName возвращает имя файла, связанного с данным потоковым буфером StreamBuf.
Returns: Возвращает имя файла. Тип String.

Teigha.Runtime.StreamBuf.IsEof
Свойство IsEof позволяет проверить, находится ли в конце файла текущая позиция файлового указателя для данного буфера.
Свойство IsEof позволяет проверить, находится ли в конце файла текущая позиция файлового указателя для данного буфера.
Returns: Возвращает true, если текущая позиция файлового указателя соответствует концу файла.
В противном случае возвращает false.

Teigha.Runtime.StreamBuf.Length
Свойство Length возвращает выраженную в байтах длину файла, связанного с этим потоковым буфером.
Свойство Length возвращает выраженную в байтах длину файла, связанного с этим потоковым буфером.
Returns: Возвращает длину файла. Тип UInt64.

Teigha.Runtime.StreamBuf.ShareMode
Свойство ShareMode возвращает текущий режим общего доступа для данного потокового буфера.
Свойство ShareMode возвращает текущий режим общего доступа для данного потокового буфера.
Returns: Возвращает режим общего доступа. Тип UInt32.
Константы определены в перечислении FileShareMode.

Teigha.Runtime.StreamBuf.Tell
Свойство Tell возвращает текущую позицию файлового указателя в данном потоковом буфере.
Свойство Tell возвращает текущую позицию файлового указателя в данном потоковом буфере.
Returns: Возвращает позицию файлового указателя. Тип UInt64.