Teigha.DatabaseServices.StandardScaleType
Данное перечисление определяет типы стандартных масштабов для объекта настроек печати.
Данное перечисление определяет типы стандартных масштабов печати для объекта настроек печати.
Они используются вместе с другой информацией (например, размеры области печати), для вычисления PlotSettings.CustomPrintScale, когда свойство PlotSettings.UseStandardScale имеет значение true.