HostMgd.EditorInput.PromptPointOptionsEventArgs
Класс предоставляет данные для события PromptingForPoint
и позволяет настраивать параметры ввода точки перед
началом интерактивной операции.
Класс наследуется от EventArgs и используется в .NET API nanoCAD
для передачи параметров ввода точки при начале интерактивной команды —
например, при вызове метода GetPoint() или GetCorner().
Он предоставляет доступ к объекту PromptPointOptions, через который можно изменить:
* текст приглашения ,
* базовую точку ,
* режимы привязки ,
* дополнительные флаги , такие как UseBasePoint, AllowNone и другие.
Этот класс применяется совместно с событиями, такими как PromptingForPoint и PromptingForCorner,
и позволяет динамически настраивать параметры ввода точки в зависимости от контекста.
Example
C#

HostMgd.EditorInput.PromptPointOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при интерактивном вводе точки.
Свойство предназначено для получения объекта PromptPointOptions,
который содержит параметры приглашения и настройки ввода точки
при интерактивной команде — например, при вызове метода GetCorner() или GetPoint().
Оно позволяет программно изменять такие параметры, как:
* сообщение приглашения (Message),
* базовая точка (BasePoint),
* режимы привязки (UseBasePoint, UseDashedLine),
* разрешение на пропуск ввода (AllowNone) и другие.
Это свойство особенно полезно при обработке событий PromptingForPoint и PromptingForCorner,
где требуется динамически изменять поведение команды ввода точки в зависимости от контекста
или состояния чертежа.
Returns: Возвращает объект типа PromptPointOptions, содержащий настройки команды ввода точки.
Если параметры не были инициализированы, может вернуть null.
Example
C#