Teigha.DatabaseServices.XrefNotificationStatus.ResolvedUpdateAvailable
Значение: 4.
Статус означает, что внешняя ссылка была разрешена, но с момента разрешения файл был обновлен, и его необходимо перезагрузить заново.