Teigha.Geometry.Scale3d
Структура Scale3d представляет преобразование масштаба в трехмерном пространстве.
Структура Scale3d представляет преобразование масштаба в трехмерном пространстве (векторы 3D-масштабирования).
Scale3d можно рассматривать как трехэлементный массив вещественных чисел двойной точности.
Каждый из его элементов представляет масштабный коэффициент вдоль своей оси координат:
* 0 — масштабный коэффициент для оси X.
* 1 — масштабный коэффициент для оси Y.
* 2 — масштабный коэффициент для оси Z.
Notes
Вектор масштабирования не должен иметь нулевых компонентов.

Teigha.Geometry.Scale3d.#ctor(System.Double)
Конструктор структуры Scale3d.  Создает экземпляр структуры, который представляет равномерное преобразование масштаба
вдоль осей X, Y и Z с указанным коэффициентом.
Конструктор структуры Scale3d.  Создает экземпляр структуры, который представляет равномерное преобразование масштаба
вдоль осей X, Y и Z с указанным коэффициентом factor.
factor: Масштабный множитель, одинаковый для всех трех осей. Тип double.

Teigha.Geometry.Scale3d.#ctor(System.Double,System.Double,System.Double)
Конструктор структуры Scale3d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X, Y и Z.
Конструктор структуры Scale3d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X, Y и Z.
x: Масштабный коэффициент для оси X. Тип double.
y: Масштабный коэффициент для оси Y. Тип double.
z: Масштабный коэффициент для оси Z. Тип double.

Teigha.Geometry.Scale3d.#ctor(array)
Конструктор структуры Scale3d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
Конструктор структуры Scale3d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
Notes
Используются только первые три элемента массива xyz.
Эти элементы массива не должны быть нулевыми.
Каждый из элементов массива xyz представляет свой масштабный коэффициент:
* 0 — масштабный коэффициент для оси X,
* 1 — масштабный коэффициент для оси Y,
* 2 — масштабный коэффициент для оси Z.
xyz: Входной массив масштабных коэффициентов. Тип double[].

Teigha.Geometry.Scale3d.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true в случае равенства сравниваемых объектов.
В противном случае возвращает false.

Teigha.Geometry.Scale3d.ExtractScale(Teigha.Geometry.Matrix3d)
Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования.
Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования mat.
mat: Входная матрица геометрического преобразования. Тип Matrix3d.
Returns: Возвращает вектор масштабирования, представленный преобразованием mat.
Тип Scale3d.

Teigha.Geometry.Scale3d.IsEqualTo(Teigha.Geometry.Scale3d)
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием точности по умолчанию.
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе.
Используется вызов метода Scale3d.IsEqualTo(Scale3d a, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
Два экземпляра структуры Scale3d считаются равными, если в пределах предписанной точности одновременно выполняются следующие условия:
* Равны масштабные коэффициенты по оси X;
* Равны масштабные коэффициенты по оси Y;
* Равны масштабные коэффициенты по оси Z.
scaleVector: Входной вектор масштабирования, который сравнивается с данным объектом. Тип Scale3d.
Returns: Возвращает true, если в пределах используемой точности данный объект можно считать равным вектору масштабирования scaleVector.
В противном случае возвращает false.

Teigha.Geometry.Scale3d.IsEqualTo(Teigha.Geometry.Scale3d,Teigha.Geometry.Tolerance)
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
Два экземпляра структуры Scale3d считаются равными, если в пределах предписанной точности одновременно выполняются следующие условия:
* Равны масштабные коэффициенты по оси X;
* Равны масштабные коэффициенты по оси Y;
* Равны масштабные коэффициенты по оси Z.
scaleVector: Входной вектор масштабирования, который сравнивается с данным объектом. Тип Scale3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой точности данный объект можно считать равным вектору масштабирования scaleVector.
В противном случае возвращает false.

Teigha.Geometry.Scale3d.IsProportional(Teigha.Geometry.Tolerance)
Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X, Y и Z.
При проверке используется указанная в аргументе точность.
Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X, Y и Z.
При проверке используется указанная в аргументе точность.
tolerance: Заданная точность для сравнения. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance компоненты данного вектора масштабирования можно считать равными по модулю.
В противном случае возвращает false.

Teigha.Geometry.Scale3d.MultiplyBy(System.Double)
Метод реализует умножение данного вектора масштабирования на заданный скалярный множитель.
Метод реализует умножение данного вектора масштабирования на переданный в аргументе скалярный множитель s.
s: Входное значение множителя. Тип double.
Returns: Возвращает результат умножения данного объекта на множитель s.
Тип Scale3d.

Teigha.Geometry.Scale3d.PostMultiplyBy(Teigha.Geometry.Scale3d)
Метод реализует векторное произведение данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
Notes
Умножение векторов масштабирования является коммутативным.
rightSide: Входной вектор масштабирования, используемый в качестве множителя. Тип Scale3d.
Returns: Возвращает результат векторного умножения.
Тип Scale3d.

Teigha.Geometry.Scale3d.PreMultiplyBy(Teigha.Geometry.Scale3d)
Метод реализует векторное произведение указанного вектора масштабирования на данный объект (leftSide) * (данный вектор).
Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования  (leftSide) * (данный вектор).
Notes
Умножение векторов масштабирования является коммутативным.
leftSide: Входной вектор масштабирования, используемый в качестве множителя. Тип Scale3d.
Returns: Возвращает результат векторного умножения.
Тип Scale3d.

Teigha.Geometry.Scale3d.RemoveScale(Teigha.Geometry.Matrix3d)
Метод вычисляет вектор масштабирования, соответствующий длинам вектор-столбцов матрицы преобразования, и затем приводит масштабные коэффициенты этой матрицы к единице.
Метод вычисляет вектор масштабирования, соответствующий длинам вектор-столбцов матрицы преобразования, и затем приводит масштабные коэффициенты этой матрицы к единице.
mat: Входная матрица преобразования. Тип Matrix3d.
Returns: Возвращает вектор масштабирования в матрице mat в ее исходном состоянии.
Тип Scale3d.

Teigha.Geometry.Scale3d.ToString(IFormatProvider)
Метод предоставляет эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
Метод предоставляет эквивалентное строковое представление данного объекта.
Возвращаемая строка содержит компоненты вектора масштабирования, отформатированные с учетом указанных языковых и региональных настроек.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
Тип String.

Teigha.Geometry.Scale3d.!=(Teigha.Geometry.Scale3d,Teigha.Geometry.Scale3d)
Оператор неравенства структуры Scale3d.
Оператор неравенства структуры Scale3d.
Два экземпляра структуры Scale3d считаются неравными, если в пределах используемой точности нарушается хотя бы одно из следующих условий:
* масштабные коэффициенты по оси X равны;
* масштабные коэффициенты по оси Y равны;
* масштабные коэффициенты по оси Z равны.
a: Левый операнд.  Тип Scale3d.
b: Правый операнд. Тип Scale3d.
Returns: Возвращает true в случае неравенства левого и правого операндов.
В противном случае возвращает false.

Teigha.Geometry.Scale3d.*(System.Double,Teigha.Geometry.Scale3d)
Оператор умножения структуры Scale3d.
Реализует умножение скалярного множителя на вектор масштабирования.
Оператор умножения структуры Scale3d.
Возвращает результат умножения скалярного множителя factor на вектор масштабирования a.
factor: Левый операнд.  Представляет скалярный множитель. Тип double.
a: Правый операнд. Представляет вектор масштабирования. Тип Scale3d.
Returns: Возвращает результат умножения скалярного множителя factor на вектор масштабирования a.
Тип Scale3d.

Teigha.Geometry.Scale3d.*(Teigha.Geometry.Scale3d,System.Double)
Оператор умножения структуры Scale3d.
Реализует умножение вектора масштабирования на скалярный множитель.
Оператор умножения структуры Scale3d.
Реализует умножение вектора масштабирования a на скалярный множитель factor.
a: Левый операнд.  Представляет вектор масштабирования. Тип Scale3d.
factor: Правый операнд. Представляет скалярный множитель.    Тип double.
Returns: Возвращает результат умножения вектора масштабирования a на скалярный множитель factor.
Тип Scale3d.

Teigha.Geometry.Scale3d.*(Teigha.Geometry.Scale3d,Teigha.Geometry.Scale3d)
Оператор умножения структуры Scale3d.
Реализует векторное умножение двух векторов масштабирования.
Оператор умножения структуры Scale3d.
Реализует умножение (a * b) двух векторов масштабирования a и b.
a: Левый операнд.  Тип Scale3d.
b: Правый операнд. Тип Scale3d.
Returns: Возвращает результат умножения (a * b) двух операндов a и b.
Тип Scale3d.

Teigha.Geometry.Scale3d.==(Teigha.Geometry.Scale3d,Teigha.Geometry.Scale3d)
Оператор равенства структуры Scale3d.
Оператор равенства структуры Scale3d.
Два экземпляра структуры Scale3d считаются равными, если в пределах используемой точности одновременно выполняются следующие условия:
* масштабные коэффициенты по оси X равны;
* масштабные коэффициенты по оси Y равны;
* масштабные коэффициенты по оси Z равны.
a: Левый операнд.  Тип Scale3d.
b: Правый операнд. Тип Scale3d.
Returns: Возвращает true в случае равенства левого и правого операндов.
В противном случае возвращает false.

Teigha.Geometry.Scale3d.Coordinate
Свойство Coordinate представляет масштабный коэффициент с указанным индексом.
Свойство Coordinate представляет масштабный коэффициент с указанным индексом.
index: Входной индекс масштабного коэффициента. Тип int.
Returns: Возвращает значение масштабного коэффициента.
Тип double.

Teigha.Geometry.Scale3d.X
Свойство представляет масштабный коэффициент по оси X.
Свойство представляет масштабный коэффициент по оси X.
Returns: Возвращает значение масштабного коэффициента по оси X.
Тип double.

Teigha.Geometry.Scale3d.Y
Свойство представляет масштабный коэффициент по оси Y.
Свойство представляет масштабный коэффициент по оси Y.
Returns: Возвращает значение масштабного коэффициента по оси Y.
Тип double.

Teigha.Geometry.Scale3d.Z
Свойство представляет масштабный коэффициент по оси Z.
Свойство представляет масштабный коэффициент по оси Z.
Returns: Возвращает значение масштабного коэффициента по оси Z.
Тип double.