Teigha.LayerManager.DialogResult
Данное перечисление определяет предопределенные значения результатов для использования в диалоговых окнах.
Данное перечисление определяет предопределенные значения результатов для использования в диалоговых окнах.