Teigha.Geometry.CurveCurveIntersector3d.ChangeCurveOrder
Метод изменяет на обратный порядок кривых в данном объекте, делая первую кривую второй и наоборот.
Метод изменяет на обратный порядок кривых в данном объекте, делая первую кривую второй и наоборот.