Teigha.DatabaseServices.ResultBuffer.AsArray
Этот метод возвращает массив типизированных значений, представляющих узлы в цепочке буфера результатов.
Этот метод возвращает массив типизированных значений, представляющих узлы в цепочке буфера результатов.
Returns: Возвращает массив тпизированных значений TypedValue[].