Teigha.DatabaseServices.TableStyle
Класс TableStyle представляет в базе данных табличные стили.
Класс TableStyle представляет в базе данных табличные стили.

Teigha.DatabaseServices.TableStyle.#ctor
Конструктор по умолчанию класса TableStyle.
Конструктор по умолчанию класса TableStyle.

Teigha.DatabaseServices.TableStyle.Alignment(Teigha.DatabaseServices.RowType)
Метод позволяет определить тип выравнивания содержимого в ячейках строк указанного типа.
Метод позволяет определить тип выравнивания содержимого в ячейках строк указанного типа.
rowType: Тип строки. Перечисление RowType.
Returns: Возвращает тип выравнивания содержимого в ячейках. Перечисление CellAlignment.

Teigha.DatabaseServices.TableStyle.BackgroundColor(Teigha.DatabaseServices.RowType)
Метод позволяет определить цвет фона в строке указанного типа.
Метод позволяет определить цвет фона в строке указанного типа.
rowType: Тип строки. Перечисление Тип RowType.
Returns: Возвращает цвет фона в строке. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.TableStyle.CellClass(String)
Метод позволяет определить класс ячейки по имени стиля ячейки.
Метод позволяет определить класс ячейки по имени стиля ячейки.
styleName: Имя стиля ячейки. Тип String.
Returns: Возвращает класс ячейки. Значение из перечисления DatabaseServices.CellClass.

Teigha.DatabaseServices.TableStyle.Color(Teigha.DatabaseServices.RowType)
Метод позволяет получить цвет текста в строке указанного типа.
Метод позволяет получить цвет текста в строке указанного типа.
rowType: Тип строки. Перечисление RowType.
Returns: Возвращает цвет текста в строке. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.TableStyle.DataType(Teigha.DatabaseServices.RowType)
Метод позволяет получить тип данных в строке указанного типа.
Метод позволяет получить тип данных в строке указанного типа.
rowType: Тип строки. Перечисление RowType.
Returns: Возвращает тип данных в строке согласно типу строки.
Тип DatabaseServices.DataType.

Teigha.DatabaseServices.TableStyle.Format(Teigha.DatabaseServices.RowType)
Метод предназначен для получения формата, назначенного для строк указанного типа.
Метод предназначен для получения формата, назначенного для строк  указанного типа.
rowType: Тип строки. Перечисление RowType.
Returns: Возвращает пустую строку. Тип String.

Teigha.DatabaseServices.TableStyle.GridColor(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет получить цвет указанного типа линий сетки в строке заданного типа.
Метод позволяет получить цвет линий сетки указанного типа в строках заданного типа.
gridLineType: Тип линий сетки. Перечисление GridLineType.
rowType: Тип строки.      Перечисление RowType.
Returns: Возвращает цвет линий сетки. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.TableStyle.GridLineWeight(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет получить вес (толщину) линий, используемый в заданном сочетании типа линий сетки и типа строк таблицы.
Метод позволяет получить вес (толщину) линий, используемый в заданном сочетании типа линий сетки и типа строк таблицы.
gridLineType: Тип линий сетки. Перечисление GridLineType.
rowType: Тип строки.      Перечисление RowType.
Returns: Возвращает вес (толщину) линий. Перечисление LineWeight.

Teigha.DatabaseServices.TableStyle.GridVisibility(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет выяснить, отображается ли указанный тип линий сетки в строках заданного типа.
Метод позволяет выяснить, отображается ли указанный тип линий сетки в строках заданного типа.
gridLineType: Тип линий сетки. Перечисление GridLineType.
rowType: Тип строки.      Перечисление RowType.
Returns: Возвращает true, если линии сетки отображаются.
В противном случае возвращает false.

Teigha.DatabaseServices.TableStyle.IsBackgroundColorNone(Teigha.DatabaseServices.RowType)
Метод позволяет проверить, отображается ли цвет фона в строках указанного типа.
Метод позволяет проверить, отображается ли цвет фона в строках указанного типа.
rowType: Тип строки. Перечисление RowType.
Returns: Возвращает true, если цвет фона не отображается.
В противном случае возвращает false.

Teigha.DatabaseServices.TableStyle.Margin(Teigha.DatabaseServices.CellMargins,String)
Метод позволяет получить величину поля указанного типа в заданном стиле ячейки.
Метод позволяет получить величину поля указанного типа в заданном стиле ячейки.
cellMargin: Тип поля ячейки. Перечисление CellMargins.
styleName: Имя стиля ячейки таблицы. Тип String.
Returns: Возвращает величину поля. Тип double.

Teigha.DatabaseServices.TableStyle.PostTableStyleToDatabase(DatabaseServices.Database,String)
Метод добавляет табличный стиль в указанную базу данных.
Метод добавляет табличный стиль в указанную базу данных.
databasePointer: База данных, в которую добавляется табличный стиль. Тип DatabaseServices.Database.
styleName: Имя добавляемого табличного стиля. Тип String.
Returns: Возвращает идентификатор добавленного табличного стиля.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.TableStyle.SetAlignment(Teigha.DatabaseServices.CellAlignment,System.Int32)
Метод позволяет задать выравнивание в ячейках строк указанных типов.
Метод позволяет задать выравнивание в ячейках строк указанных типов.
alignment: Выравнивание в ячейках строки. Перечисление CellAlignment.
rowTypes: Один или комбинация типов строк таблицы, для которых задается выравнивание. Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetBackgroundColor(Colors.Color,System.Int32)
Метод позволяет задать цвет фона в ячейках строк указанного типа.
Метод позволяет задать цвет фона в ячейках строк указанного типа.
color: Цвет фона. Тип Teigha.Colors.Color.
rowTypes: Один или комбинация нескольких типов строк таблицы, для которых задается выравнивание. Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetBackgroundColorNone(System.Boolean,System.Int32)
Метод позволяет задать режим отображения цвета фона в строках указанного типа.
Метод позволяет отключить или включить режим отображения цвета фона в строках указанного типа.
value: Флаг отключения отображения фонового цвета. Тип bool. Если принимает значение true, цвет фона подавляется и наоборот.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetCellClass(DatabaseServices.CellClass,String)
Метод позволяет задать класс ячейкам с указанным стилем ячейки.
Метод позволяет задать класс ячейкам с указанным стилем ячейки.
cellClass: Класс ячейки. Тип DatabaseServices.CellClass.
styleName: Имя стиля ячейки. Тип String.

Teigha.DatabaseServices.TableStyle.SetColor(Colors.Color,System.Int32)
Метод позволяет задать цвет текста в строках указанного типа.
Метод позволяет задать цвет текста в строках указанного типа.
color: Цвет текста. Тип Teigha.Colors.Color.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetDataType(DatabaseServices.DataType,DatabaseServices.UnitType,Teigha.DatabaseServices.RowType)
Метод позволяет задать тип данных и тип единиц измерения в строках заданного типа.
Метод позволяет задать тип данных и тип единиц измерения в строках заданного типа.
nDataType: Входной тип данных. Тип DatabaseServices.DataType.
nUnitType: Входной тип единиц изверения. Тип DatabaseServices.UnitType.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetFormat(String,Teigha.DatabaseServices.RowType)
Метод позволяет задать формат в ячейках строк заданного типа. В текущей версии не реализован.
Метод позволяет задать формат в ячейках строк заданного типа.
В текущей версии не реализован.
pFormat: Задаваемый формат ячеек. Тип String.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetGridColor(Colors.Color,System.Int32,System.Int32)
Метод позволяет задать цвет сетки для указанного сочетания типов линий сетки и типов строк таблицы.
Метод позволяет задать цвет сетки для указанного сочетания типов линий сетки и типов строк таблицы.
Различные типы линий и типы строк можно комбинировать с помощью логического оператора OR.
color: Новый цвет сетки. Тип Teigha.Colors.Color.
gridLineTypes: Тип линий сетки (или логическая комбинация нескольких типов). Тип int. См. перечисление GridLineType.
rowTypes: Тип строк таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetGridLineWeight(Teigha.DatabaseServices.LineWeight,System.Int32,System.Int32)
Метод позволяет задать вес (толщину) линий для указанных типов линий сетки и типов строк.
Метод позволяет задать вес (толщину) линий для указанных типов линий сетки и типов строк.
Различные типы линий и типы строк можно комбинировать с помощью логического оператора OR.
lineWeight: Новый вес (толщина) линий. Перечисление LineWeight.
gridLineTypes: Тип линий сетки   (или логическая комбинация нескольких типов). Тип int. См. перечисление GridLineType.
rowTypes: Тип строк таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
Метод позволяет задать видимость сетки для указанных типов линий сетки и типов строк.
Метод позволяет задать видимость сетки для указанных типов линий сетки и типов строк.
Различные типы линий и типы строк можно комбинировать с помощью логического оператора OR.
visible: Флаг видимости. Тип bool.
gridLineTypes: Тип линий сетки (или логическая комбинация нескольких типов). Тип int. См. перечисление GridLineType.
rowTypes: Тип строк таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetMargin(Teigha.DatabaseServices.CellMargins,System.Double,String)
Метод позволяет задать величину поля ячейки таблицы для указанного типа поля в заданном стиле ячейки.
Метод позволяет задать величину поля ячейки таблицы для указанного типа поля в заданном стиле ячейки.
cellMargin: Тип поля. Перечисление CellMargins.
margin: Величина поля. Тип double.
styleName: Имя стиля ячейки. Тип String.

Teigha.DatabaseServices.TableStyle.SetTextHeight(System.Double,System.Int32)
Метод позволяет задать высоту текста для строк указанного типа.
Метод позволяет задать высоту текста для строк указанного типа.
Допускаются комбинации различных типов строк с использованием логического оператора OR.
height: Высота текста. Тип double.
rowTypes: Тип строки таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetTextStyle(DatabaseServices.ObjectId,System.Int32)
Метод позволяет задать текстовый стиль для строк указанного типа.
Метод позволяет задать текстовый стиль для строк указанного типа.
Допускаются комбинации различных типов строк с использованием логического оператора OR.
id: Идентификатор объекта текстового стиля. Тип DatabaseServices.ObjectId.
rowTypes: Тип строки таблицы (или логическая комбинация нескольких типов). Тип int. См. перечисление RowType.

Teigha.DatabaseServices.TableStyle.SetTextStyle(DatabaseServices.ObjectId,String)
Метод позволяет задать текстовый стиль для указанного стиля ячейки.
Метод позволяет задать текстовый стиль для указанного стиля ячейки.
id: Идентификатор объекта текстового стиля. Тип DatabaseServices.ObjectId.
styleName: Имя стиля ячейки таблицы. Тип String.

Teigha.DatabaseServices.TableStyle.TextHeight(Teigha.DatabaseServices.RowType)
Метод позволяет получить высоту текста, назначенную для строк указанного типа.
Метод позволяет получить высоту текста, назначенную для строк указанного типа.
rowType: Тип строки таблицы. Перечисление RowType.
Returns: Возвращает высоту текста. Тип double.

Teigha.DatabaseServices.TableStyle.TextHeight(String)
Метод позволяет получить высоту текста в указанном стиле ячейки.
Метод позволяет получить высоту текста в указанном стиле ячейки.
cellStyle: Имя стиля ячейки. Тип String.
Returns: Возвращает высоту текста в ячейке. Тип double.

Teigha.DatabaseServices.TableStyle.TextStyle(Teigha.DatabaseServices.RowType)
Метод позволяет получить стиль текста в строках указанного типа.
Метод позволяет получить стиль текста в строках указанного типа.
rowType: Тип строки таблицы. Перечисление RowType.
Returns: Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.TableStyle.TextStyle(String)
Метод позволяет получить текстовый стиль, предусмотренный в указанном стиле ячейки.
Метод позволяет получить текстовый стиль, предусмотренный в указанном стиле ячейки.
styleName: Имя стиля ячейки таблицы. Тип String.
Returns: Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.TableStyle.UnitType(Teigha.DatabaseServices.RowType)
Метод позволяет получить тип единиц измерения, назначенный для строк указанного типа.
Метод позволяет получить тип единиц измерения, назначенный для строк указанного типа.
rowType: Тип строки таблицы. Перечисление RowType.
Returns: Возвращает тип единиц измерения. Перечисление DatabaseServices.UnitType.

Teigha.DatabaseServices.TableStyle.BitFlags
Свойство BitFlags представляет битовые флаги направления заполнения таблицы, предусмотренные данным стилем таблицы.
Свойство BitFlags представляет битовые флаги направления заполнения таблицы, предусмотренные данным стилем таблицы.
См. свойство FlowDirection.
Returns: Возвращает битовые флаги направления заполнения таблицы.
Тип int.

Teigha.DatabaseServices.TableStyle.CellStyles
Свойство CellStyles представляет массив стилей ячеек, связанных с данным табличным стилем.
Свойство CellStyles представляет массив стилей ячеек, связанных с данным табличным стилем.
Returns: Возвращает массив стилей ячеек. Тип ArrayList.

Teigha.DatabaseServices.TableStyle.Description
Свойство Description представляет описание данного табличного стиля.
Свойство Description представляет описание данного табличного стиля.
Returns: Возвращает описание стиля. Тип String.

Teigha.DatabaseServices.TableStyle.FlowDirection
Свойство FlowDirection представляет направление, в котором таблица заполняется содержимым.
Свойство FlowDirection представляет направление, в котором таблица заполняется содержимым.
Returns: Возвращает направление заполнения таблицы. Перечисление DatabaseServices.FlowDirection.

Teigha.DatabaseServices.TableStyle.HorizontalCellMargin
Свойство HorizontalCellMargin представляет величину горизонтального поля ячейки.
Свойство HorizontalCellMargin представляет величину горизонтального поля ячейки.
Returns: Возвращает размер горизонтального поля ячейки. Тип double.

Teigha.DatabaseServices.TableStyle.IsHeaderSuppressed
Свойство IsHeaderSuppressed представляет состояние флага подавления строки заголовков столбцов.
Свойство IsHeaderSuppressed представляет состояние флага подавления строки заголовков столбцов.
Returns: Возвращает true, если строка заголовков столбцов подавлена.
В противном случае возвращает false.

Teigha.DatabaseServices.TableStyle.IsTitleSuppressed
Свойство IsTitleSuppressed представляет состояние флага подавления наименования таблицы.
Свойство IsTitleSuppressed представляет состояние флага подавления наименования таблицы.
Returns: Возвращает true, если строка наименования таблицы подавлена.
В противном случае возвращает false.

Teigha.DatabaseServices.TableStyle.Name
Свойство Name представляет имя данного стиля таблицы.
Свойство Name представляет имя данного стиля таблицы.
Returns: Возвращает имя стиля таблицы.
Тип String.

Teigha.DatabaseServices.TableStyle.Template
Свойство Template представляет шаблон данного табличного стиля.
Свойство Template представляет шаблон данного табличного стиля.
Может принимать значение NULL.
Returns: Возвращает идентификатор шаблона табличного стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.TableStyle.VerticalCellMargin
Свойство VerticalCellMargin представляет величину вертикального поля ячейки.
Свойство VerticalCellMargin представляет величину вертикальных полей ячеек, предусмотренную данным табличным стилем.
Returns: Возвращает величину вертикального поля ячейки.
Тип double.