Teigha.BoundaryRepresentation.BrepComplexCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции комплексов.
Метод позволяет получить перечислитель данной коллекции комплексов.
Returns: Возвращает перечислитель коллекции комплексов.
Тип BrepComplexEnumerator.