Teigha.DatabaseServices.ObjectId.GetHashCode
Возвращает хэш-код для данного объекта.
Возвращает хэш-код для данного объекта.  Подробнее см. в документации Microsoft .NET API.
Returns: Возвращает целочисленный хэш-код, тип int.