Teigha.DatabaseServices.MlineStyle
Этот класс представляет в базе данных объекты стиля мультилинии.
Этот класс представляет в базе данных объекты стиля мультилинии.

Teigha.DatabaseServices.MlineStyle.#ctor
Конструктор по умолчанию класса MlineStyle.
Конструктор по умолчанию класса MlineStyle.

Teigha.DatabaseServices.MlineStyle.Set(Teigha.DatabaseServices.MlineStyle,System.Boolean)
Метод делает данный объект копией указанного объекта MlineStyle.
Метод делает данный объект копией указанного объекта MlineStyle.
source: Объект-источник.  Тип MlineStyle.
checkIfReferenced: Флаг, указывающий, следует ли проверять наличие ссылок на этот стиль. Тип bool.  В текущей версии не используется.

Teigha.DatabaseServices.MlineStyle.Description
Свойство представляет описание данного объекта.
Свойство представляет описание данного объекта.
Returns: Возвращает описание данного объекта. Тип String.

Teigha.DatabaseServices.MlineStyle.Elements
Свойство представляет элементы данного объекта MlineStyle с данными о цвете, смещении и типах линий, используемых стилем мультилинии.
Свойство представляет элементы данного объекта MlineStyle, которые содержат данные о цвете, смещении и идентификаторах типов линий, используемых этим стилем.
Returns: Возвращает коллекцию элементов мультилинии. Тип MlineStyleElementCollection.

Teigha.DatabaseServices.MlineStyle.EndAngle
Свойство представляет угол скоса торцевого ограничителя на завершающем торце мультилинии.
Свойство представляет угол скоса торцевого ограничителя на завершающем торце мультилинии.
Измеряется в радианах. Значение по умолчанию равно pi/2 рад.
Returns: Возвращает угол скоса торцевого ограничителя (в радианах). Тип double.

Teigha.DatabaseServices.MlineStyle.EndInnerArcs
Свойство управляет отображением внутренних дуг на завершающем торце мультилинии.
Свойство управляет отображением внутренних дуг на завершающем торце мультилинии.
Returns: Возвращает true, если отображение внутренних дуг на завершающем торце мультилинии включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MlineStyle.EndRoundCap
Свойство управляет отображением круглого торцевого ограничителя на завершающем торце мультилинии.
Свойство управляет отображением круглого торцевого ограничителя на завершающем торце мультилинии.
Это внешняя дуга между крайними элементами мультилинии.
Returns: Возвращает true, если отображение круглого торцевого ограничителя включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MlineStyle.EndSquareCap
Свойство управляет отображением квадратного торцевого ограничителя на завершающем торце мультилинии.
Свойство управляет отображением квадратного торцевого ограничителя на завершающем торце мультилинии.
Returns: Возвращает true, если отображение квадратного торцевого ограничителя включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MlineStyle.FillColor
Свойство представляет цвет фоновой заливки мультилинии.
Свойство представляет цвет фоновой заливки мультилинии.
Returns: Возвращает цвет фоновой заливки мультилинии.  Тип Color.

Teigha.DatabaseServices.MlineStyle.Filled
Свойство управляет режимом фоновой заливки мультилинии.
Свойство управляет режимом фоновой заливки мультилинии.
Returns: Возвращает true, если фоновая заливка включена.
В противном случае возвращает false.

Teigha.DatabaseServices.MlineStyle.Name
Свойство представляет наименование данного стиля.
Свойство представляет наименование данного стиля.
Returns: Возвращает наименование данного стиля. Тип String.

Teigha.DatabaseServices.MlineStyle.ShowMiters
Свойство управляет отображением линий стыков (miterlines) в вершинах мультилиний.
Свойство управляет отображением линий стыков (miterlines) в вершинах мультилиний.
Returns: Возвращает true, если отображение линий стыков включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MlineStyle.StartAngle
Свойство представляет угол скоса торцевого ограничителя на начальном торце мультилинии.
Свойство представляет угол скоса торцевого ограничителя на начальном торце мультилинии.
Измеряется в радианах. Значение по умолчанию равно pi/2 рад.
Returns: Возвращает угол скоса торцевого ограничителя (в радианах). Тип double.

Teigha.DatabaseServices.MlineStyle.StartInnerArcs
Свойство управляет отображением внутренних дуг на начальном торце мультилинии.
Свойство управляет отображением внутренних дуг на начальном торце мультилинии.
Returns: Возвращает true, если отображение внутренних дуг на начальном торце мультилинии включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MlineStyle.StartRoundCap
Свойство управляет отображением круглого торцевого ограничителя на начальном торце мультилинии.
Свойство управляет отображением круглого торцевого ограничителя на начальном торце мультилинии.
Это внешняя дуга между крайними элементами мультилинии.
Returns: Возвращает true, если отображение круглого торцевого ограничителя включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MlineStyle.StartSquareCap
Свойство управляет отображением квадратного торцевого ограничителя на начальном торце мультилинии.
Свойство управляет отображением квадратного торцевого ограничителя на начальном торце мультилинии.
Returns: Возвращает true, если отображение квадратного торцевого ограничителя включено.
В противном случае возвращает false.