Teigha.GraphicsInterface.DisplaySettings
Перечисление DisplaySettings определяет доступные к использованию настройки отображения.
Перечисление DisplaySettings определяет доступные к использованию настройки отображения.
Эти настройки можно комбинировать, используя логические операторы.