Teigha.GraphicsInterface.FaceData
Класс FaceData служит контейнером для организации опциональных данных, используемых для множества граней графического примитива сети или оболочки.
Класс FaceData служит контейнером для организации опциональных данных, используемых для множества граней графического примитива сети или оболочки.  Объекты этого класса передаются в качестве аргумента методам Mesh() и Shell() класса Teigha.GraphicsInterface.Geometry.

Teigha.GraphicsInterface.FaceData.SetColors(array)
Метод задаёт массив индексированных цветов для граней, используемых данным объектом FaceData.
Метод позволяет задать массив индексированных цветов для граней, используемых данным объектом FaceData.
Размерность массива colors должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Первый элемент массива задает индекс цвета для первой грани, второй элемент - для второй грани и т.д.
Каждый элемент массива управляет цветом "своей" грани независимо от цвета других граней.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Для определения цвета граней допускается использовать либо индексированные цвета посредством метода SetColors(), либо "истинные" цвета EntityColor с помощью метода SetTrueColors(), но не оба способа одновременно.
Предупреждение:
Преждевременное освобождение или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
colors: Массив индексированных цветов для граней.

Teigha.GraphicsInterface.FaceData.SetLayers(array)
Метод задаёт массив слоёв, используемых для граней данным объектом FaceData.
Метод задаёт используемые данным объектом FaceData слои как массив идентификаторов объектов LayerTableRecord.
Размерность массива layers должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Каждый элемент массива индивидуально определяет слой, на котором располагается соответствующая грань сети или оболочки.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Предупреждение:
Преждевременное освобождение памяти или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
layers: Массив идентификаторов объектов LayerTableRecord.  Тип ObjectId[].

Teigha.GraphicsInterface.FaceData.SetMappers(array)
Метод позволяет задать массив мапперов, назначенных граням данного объекта FaceData.
Метод задает массив мапперов для граней, используемых данным объектом FaceData.
Размерность массива mappers должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Первый элемент массива используется как маппер для первой грани сети или оболочки, второй элемент — для второй грани и т.д.
Для граней, у которых "свой" маппер не был переопределён, соответствующий элемент массива должен определять тождественное преобразование.
mappers: Входной массив мапперов.

Teigha.GraphicsInterface.FaceData.SetMaterials(array)
Метод задаёт массив материалов для граней сети или оболочки, с которой связан данный объект FaceData.
Метод задаёт массив материалов для граней, используемых объектом FaceData.
Размерность массива materials должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Каждый элемент массива управляет материалом "своей" грани.
Первый элемент массива определяет материал для первой грани, второй элемент — материал второй грани и т.д.
Для тех граней, у которых не назначено переопределение материала, соответствующие элементы массива materials должны содержать значение ObjectId.Null.
materials: Массив идентификаторов материалов для граней. Тип ObjectId[].

Teigha.GraphicsInterface.FaceData.SetNormalVectors(array)
Метод задаёт массив нормалей для граней сети или оболочки, с которой связан данный объект FaceData.
Метод задаёт массив нормалей для граней сети или оболочки, с которой связан данный объект FaceData.
Размерность массива normal должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Каждый элемент массива управляет ориентацией нормали "своей" грани.
Первый элемент массива определяет нормаль первой грани, второй элемент — нормаль второй грани и т.д.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Предупреждение:
Преждевременное освобождение или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
normal: Массив нормалей граней. Тип Vector3d[].

Teigha.GraphicsInterface.FaceData.SetSelectionMarkers(array)
Метод задает массив маркеров выделения графической системы для граней, используемых данным объектом FaceData.
Метод задает массив selectionMarker маркеров выделения графической системы (gsmarkers) для граней, используемых данным объектом FaceData.
Размерность массива должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Первый элемент массива определяет маркер выделения, используемый для первой грани, второй элемент — для второй грани и т.д.
selectionMarker: Массив маркеров выделения графической системы. Тип IntPtr[].

Teigha.GraphicsInterface.FaceData.SetTransparency(array)
Метод задаёт массив объектов прозрачности для граней сети или оболочки, используемых данным объектом FaceData.
Метод задаёт массив объектов прозрачности для граней сети или оболочки, используемых данным объектом FaceData.
Размерность массива должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Первый элемент массива определяет прозрачность для первой грани, второй элемент — прозрачность для второй грани и т.д.
transparency: Массив объектов прозрачности граней сети или оболочки.

Teigha.GraphicsInterface.FaceData.SetTrueColors(array)
Метод задаёт массив значений цвета для граней, используемых данным объектом FaceData.
Метод задаёт массив значений цвета для граней, используемых данным объектом FaceData.
Размерность массива должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Первый элемент массива определяет цвет для первой грани, второй элемент — для второй грани и т.д.
Каждый элемент массива управляет цветом "своей" грани индивидуально, независимо от цвета других граней.
Notes
За выделение и высвобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Для определения цвета граней допускается использовать либо индексированные цвета посредством метода SetColors(), либо "истинные" цвета EntityColor с помощью метода SetTrueColors(), но не оба способа одновременно.
Предупреждение:
Преждевременное освобождение памяти или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
colors: Массив цветов граней. Тип EntityColor[].

Teigha.GraphicsInterface.FaceData.SetVisibility(array)
Метод задаёт массив флагов видимости граней, используемых этим объектом FaceData.
Метод определяет массив флагов видимости граней, по одному для каждой грани в сети или оболочке, с которыми используется данный объект FaceData.  Значение 1 означает видимое состояние, значение 0 - невидимое.
Размерность массива должна точно соответствовать количеству граней, а порядок элементов в массиве должен строго соответствовать порядку граней в сети или оболочке, для которых массив предназначен.
Первый элемент массива определяет видимость первой грани, второй элемент — видимость второй грани и т.д.
Каждый элемент массива управляет видимостью "своей" грани, независимо от состояния других граней.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Предупреждение:
Преждевременное освобождение выделенной памяти или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
visibility: Массив флагов видимости граней.