Teigha.DatabaseServices.PdfReference
Класс PdfReference реализует функционал для работы со ссылками на контент в формате PDF.
Класс PdfReference реализует функционал для работы со ссылками на контент в формате PDF.

Teigha.DatabaseServices.PdfReference.#ctor
Конструктор по умолчанию класса PdfReference.
Конструктор по умолчанию класса PdfReference.