Teigha.GraphicsInterface.Filter
Перечисление Filter определяет методы фильтрации, используемые для формирования цвета пикселя на основе цветов в выборке.
Перечисление Filter определяет методы фильтрации, используемые для формирования цвета пикселя на основе цветов в выборке.