Teigha.DatabaseServices.DatabaseSummaryInfo.ToString
Метод предназначен для формирования эквивалентного строкового представления данного объекта.
Метод предназначен для формирования эквивалентного строкового представления данного объекта.
Returns: Возвращает эквивалентное представление данного объекта в виде строки. Тип String.