Teigha.DatabaseServices.ViewTableRecord
Класс предназначен для хранения определения именованного
вида.
Класс предназначен для хранения определения именованного
вида. Определение именованного вида представляет из себя
набор настроек вида. Именованный вид всегда относится к
какому-либо листу.
Управление настройками именованного вида возможно как через
API, так и через пользовательский интерфейс с помощью команды
ВИД -gt; Свойства вида. Все настройки именованных видов,
которые есть в пользовательском интерфейсе, также доступны и
через API в виде свойств класса ViewTableRecord.
Для создания нового именованного вида необходимо обязательно
указать его название. Все остальные свойства имеют значения
по умолчанию.
Example
В качестве примера приведена команда ADDNAMEDVIEW, которая
создает именованный вид в чертеже для пространства модели и
делает его активным.
C#

Teigha.DatabaseServices.ViewTableRecord.#ctor
Конструктор класса
Конструктор класса.

Teigha.DatabaseServices.ViewTableRecord.#ctor(IntPtr,System.Boolean)
Конструктор класса
Конструктор класса.

Teigha.DatabaseServices.ViewTableRecord.ViewAssociatedToViewport
В свойстве хранится признак принадлежности именованного вида
к видовому экрану пространства листа.
В свойстве хранится информация о принадлежности именованного
вида к видовому экрану пространства листа.
Returns: Возвращает тип данных bool:
* true – именованный вид связан с видовым экраном;
* false – именованный вид не связан с видовым экраном.

Teigha.DatabaseServices.ViewTableRecord.Thumbnail
Свойство предназначено для просмотра или изменения иконки
именованного вида.
Свойство предназначено для просмотра или изменения иконки
именованного вида и хранит в себе упакованную структуру
BITMAPINFO миниатюры с данными миниатюры, следующими за ней
непосредственно в памяти. Для свойтсва можно установить
значение null, если для этого вида не требуется иконка.
Свойство возвращает ошибку, если данные миниатюры не удалось
сохранить.
Returns: Возвращает тип данных System.Drawing.Bitmap.

Teigha.DatabaseServices.ViewTableRecord.LiveSection
Свойство предназначено для управления отображением
псевдоразреза, применяемого в именованном виде.
Свойство предназначено для управления отображением
псевдоразреза, применяемого в именованном виде. Доступно
только для именованных видов пространства модели.
Псевдоразрез – секущая плоскость. Трехмерные тела, через
которую проходит эта плоскость, получат разрез, который можно
только просматривать.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.ViewTableRecord.Layout
В свойстве хранится ObjectId листа, к которому относится
именованный вид.
В свойстве хранится ObjectId листа, к которому относится
именованный вид. Зная ObjectId листа, можно получить
подробную информацию о нем из базы данных документа. Также,
через свойство можно изменить лист, к которому относится
именованный вид, заменив ObjectId текущего листа на ObjectId
нового листа.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.ViewTableRecord.LayerState
В свойстве хранится название снимка слоёв именованного вида.
Снимок слоёв именованного вида – это набор настроек слоёв, установленных для именованного вида.
Снимок слоёв можно сделать только в именованном виде, который уже сохранен в базе данных чертежа.
Во время создания именованного вида снимок слоёв не делается.
Для создания снимка слоёв нужно выбрать именованный вид и сохранить в нём снимок cлоёв.
В именованном виде может храниться только один снимок слоёв. Если нужно внести изменения
в снимок слоёв именованного вида, то нужно удалить старый снимок и добавить в именованный вид новый.
При восстановлении именованного вида, в котором есть снимок слоёв, настройки слоёв документа
изменяются в соответствии со снимком слоёв именованного вида.
Returns: Возвращает тип данных string.

Teigha.DatabaseServices.ViewTableRecord.IsUcsAssociatedToView
В свойстве хранится информация о том, связан ли именованный
вид с пользовательской системой координат.
При создании именованного вида возможно привязать этот вид к
пользовательской системе координат. Пользовательская система
координат создается пользователем и именованный вид привязывается к ней,
если он создается в этой системе координат. С помощью свойства
можно определить, есть ли у именованного вида привязка к
сохраненной пользовательской системе координат.
Когда именованный вид не привязан к пользовательской системе координат,
значит он привязан к мировой системе координат.
Returns: Возвращает тип данных bool:
* true - именованный вид связан с пользовательской системой координат;
* false - именованный вид не привязан к пользовательской системе координат.

Teigha.DatabaseServices.ViewTableRecord.IsPaperspaceView
Свойство предназначено для просмотра/изменения принадлежности
именованного вида к различным пространствам чертежа:
пространству модели или пространству листа.
Свойство предназначено для просмотра/изменения принадлежности
именованного вида к различным пространствам чертежа: пространству
модели или пространству листа. При указании пространства листа,
нужно в свойстве Layout указать ObjectId листа, к которому относится именованный вид.
При создании именованного вида через API, по умолчанию значение свойства равно false.
Returns: Возвращает тип данных bool:
* true - именованный вид привязан к пространству листа;
* false - именованный вид привязан к пространству модели.

Teigha.DatabaseServices.ViewTableRecord.CategoryName
В свойстве хранится название категории именованного вида.
Свойство предназначено для просмотра/изменения категории
именованного вида. По умолчанию, в свойстве хранится
пустая строка. Название категории именованного вида –
дополнительный инструмент для фильтрации именованных видов.
Returns: Возвращает тип данных string.

Teigha.DatabaseServices.ViewTableRecord.AnnotationScale
В свойстве хранится аннотативный масштаб именованного вида.
Свойство предназначено для просмотра/изменения аннотативного
масштаба именованного вида.
Returns: Возвращает тип данных .