HostMgd.PlottingServices.PlotEngine
Основной класс производства печати
Приложение использует интерфейс этого класса для печати одного или нескольких документов на устройстве печати или в файл.
Экземпляры этого класса создаются статическими методами класса PlotFactory.
В любой момент времени может существовать только один объект класса PlotEngine.
Приложение должно создать один экземпляр этого класса, произвести печать с его помощью и удалить его при помощи метода Destroy()

HostMgd.PlottingServices.PlotEngine.BeginGenerateGraphics(System.Object)
Метод начала собственно печати. После него необходимо вызвать метод EndGenerateGraphics

HostMgd.PlottingServices.PlotEngine.BeginPlot(HostMgd.PlottingServices.PlotProgress,System.Object)
Метод начало печати.
Параметрами этого метода является потомок класса PlotProgress. Обычно это PlotProgressDialog.

HostMgd.PlottingServices.PlotEngine.EndPlot(System.Object)
Метод завершения печати.