Teigha.DatabaseServices.Database
Класс Database представляет файл чертежа nanoCAD.
Каждый объект типа Database содержит различные переменные заголовка,
таблицы символов, записи таблицы, геометрические объекты и
объекты, которые составляют чертеж.
Класс Database содержит функции, позволяющие получить доступ
к таблице символов, осуществлять чтение и запись файлов формата .dwg,
задавать и получать значения по умолчанию, выполнять
различные операции уровня базы данных, такие как Wblock и
DeepCloneObjects, получать или устанавливать переменные
заголовка.

Teigha.DatabaseServices.Database.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.Database.#ctor(System.Boolean,System.Boolean)
Конструктор с дополнительными параметрами.
buildDefaultDrawing: Параметр указывает, должен или нет быть
noDocument: Параметр указывает, должна или нет

Teigha.DatabaseServices.Database.AbortDeepClone(Teigha.DatabaseServices.IdMapping)
Инициирует отмену глубокого копирования.
Инициирует в классе Editor событие, в котором операция
deepClone, определенная по значению idMap, будет отменена.
Объект IdMapping должен однозначно определять операцию
deepClone.
idMap: IdMapping

Teigha.DatabaseServices.Database.AddDBObject(Teigha.DatabaseServices.DBObject)
\ \
Добавляет объект, на который указывает параметр метода, в
базу данных. Возвращается Id нового объекта.
appendIt: Объект, который должен быть добавлен в базу данных

Teigha.DatabaseServices.Database.ApplyPartialOpenFilters(Filters.SpatialFilter,Filters.LayerFilter)
Эта функция может быть вызвана в базе данных с тем, чтобы
отфильтровать геометрические объекты пространства модели,
чтобы только часть чертежа располагалась в памяти.
spatialFilter: Определяет том пространства модели, который
layerFilter: Определяет слои, используемые для фильтрации

Teigha.DatabaseServices.Database.AttachXref(String,String)
Присоединяет файл внешней ссылки, определяемый параметром
fileName в базу данных, после чего создает новую запись в
BlockTableRecord для внешней ссылки. Имя новой записи таблицы
блоков задается в параметре blockName. Возвращается Id
объекта.
fileName: Путь файла внешней ссылки
blockName: Имя блока, используемое для файла внешней ссылки

Teigha.DatabaseServices.Database.BindXrefs(Teigha.DatabaseServices.ObjectIdCollection,System.Boolean)
Эта функция связывает внешние ссылки, чьи Id таблицы
BlockTableRecord указаны в первом параметре метода. Если
insertBind установлен в true, то имена записей в
таблице символов будут преобразованы из имен внешних ссылок в
имена обычных вставленных блоков.
Все Id в параметре xrefIds должны быть из базы данных и
должны быть действительными.
xrefIds: Коллекция ObjectIds для BlockTableRecord файлов
insertBind: Признак, указывающий, нужно ли конвертировать

Teigha.DatabaseServices.Database.ClassDxfName(Teigha.Runtime.RXClass)
Функция, возвращающая DXF имя для класса.
getMyDxfName: Объект, для которого должно быть получено имя

Teigha.DatabaseServices.Database.CloseInput(System.Boolean)
Если файл чертежа ассоциирован с базой данных, то вызов этой
функции приводит к немедленному чтению всей необходимой
информации из файла в базу данных. Если параметр closeFile
установлен в true, то файл чертежа после завершения чтения
будет закрыт.
closeFile: Признак закрытия файла после чтения

Teigha.DatabaseServices.Database.CountHardReferences(Teigha.DatabaseServices.ObjectIdCollection,array)
Эта функция просматривает базу данных в поиске объектов с
жесткими ссылками на любые из объектов, Id которых есть в
массиве ids. Каждый раз, когда такая ссылка найдена, элемент
count, соответствующий порядковому номеру Id в массиве ids,
увеличивается на 1. Например, если найдена ссылка на объект
ids[2], то значение count[2] массива будет увеличено на 1.
На том, кто вызывает метод, лежит ответственность за то,
чтобы элементы массива count были обнулены до вызова (или
имели требуемые начальные значения). Функция просто
увеличивает любые значения, которые были. Также на том, кто
вызывает метод, лежит ответственность за то, чтобы ids и
count имели одинаковые размеры.
ids: Коллекция Id объектов для поиска количества жестких
count: Массив того же размера, что и ids, в котором ведется

Teigha.DatabaseServices.Database.DeepCloneObjects(Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.IdMapping,System.Boolean)
Клонирует все объекты, Id которых указаны в параметре
identifiers и добавляет их в контейнер объектов с
определенным владельцем (заданным параметром id). Параметр
mapping заполняется IdMapping объектов, которые содержат
objectId пар исходного и клонированного объектов. Этот массив
может быть использован для последующей обработки объектов,
участвующих в операции deepClone.
Когда новым объектам назначаются владельцы, объекты слоев
инициируют, что владельцем является словарь слоя базы данных
и слой присваивает имя в словаре, которое соответствует
имени, хранимому внутри слоя (по умолчанию объектам, которыми
владеет словарь, даются анонимные имена, такие как "*A1").
identifiers: Коллекция объектов, которые должны быть
id: Id объекта, который будет владельцем
mapping: Возвращаемая коллекция объектов,
deferTranslation: Признак, задающий, должно ли

Teigha.DatabaseServices.Database.DetachXref(Teigha.DatabaseServices.ObjectId)
Функция отсоединяет внешнюю ссылку в базе данных, чей
BlockTableRecord определен с помощью xrefId.
xrefId: Id внешней ссылки, которая отсоединяется

Teigha.DatabaseServices.Database.DisableUndoRecording(System.Boolean)
Эта функция отключает или включает запись в буфер Undo для
операций, выполняемых с базой данных. Если disable==true, то
запись в буфер Undo производиться не будет.
Эта функция не удаляет никакую уже находящуюся в буфере
информацию. Она только включает или выключает запись в буфер
Undo.
disable: Параметр, указывающий, надо ли включить или

Teigha.DatabaseServices.Database.DxfIn(String,String)
Функция читает файл DXF, связанный с объектом базы данных.
fileName: Полный путь к файлу DXF, который должен быть
logFilename: Имя файла для записи всех ошибок и

Teigha.DatabaseServices.Database.DxfOut(String,System.Int32,Teigha.DatabaseServices.DwgVersion)
Функция создает DXF файл.
Note
Точность также может быть установлена равной -1 для изменения
выходного формата с формата ASCII DXF файла по умолчанию на
двоичный DXF формат.
fileName: Имя или URL нового создаваемого DXF файла
precision: Количество разрядов точности от 0 до 16

Teigha.DatabaseServices.Database.DxfOut(String,System.Int32,System.Boolean)
Функция создает DXF файл.
Note
Точность также может быть установлена равной -1 для изменения
выходного формата с формата ASCII DXF файла по умолчанию на
двоичный DXF формат.
fileName: Имя или URL нового создаваемого DXF
precision: Количество разрядов точности от 0 до 16
saveThumbnailImage: Признак, нужно ли сохранять уменьшенное

Teigha.DatabaseServices.Database.GetDimensionStyleChildData(Teigha.Runtime.RXClass)
Эта функция возвращает запись DimStyleTableRecord, на которую ссылается
размерный стиль.
classDescriptor: Объект для проверки

Teigha.DatabaseServices.Database.GetDimensionStyleChildId(Teigha.Runtime.RXClass,Teigha.DatabaseServices.ObjectId)
Получив Id родительского размерного стиля и дескриптор
размера класса, эта функция возвращает Id размерного стиля
потомка, если он доступен, для данного типа размера.
Возвращает полученный Id родительского размерного стиля, если
Id размерного стиля потомка, относящийся к данному классу
размера, не доступен.
classDescriptor: Дескриптор класса размеров
parentStyle: Id родительского размерного стиля

Teigha.DatabaseServices.Database.GetDimensionStyleParentId(Teigha.DatabaseServices.ObjectId)
Получив Id размерного стиля потомка, функция возвращает Id
размерного стиля родителя. Если родитель не доступен,
возвращается Id размерного стиля потомка.
childStyle: Id размерного стиля потомка

Teigha.DatabaseServices.Database.GetHostDwgXrefGraph(System.Boolean)
Возвращает вершину, ассоциированную с узлом чертежа.
includeGhosts: Признак разрешения повторных вершин (если он

Teigha.DatabaseServices.Database.GetNearestLineWeight(System.Int32)
Метод getNearestLineWeight() по значению ширины линии
возвращает ближайшее к этому значению значение из
перечисления LineWeight. Например, для значения 4 будет
возвращено значение LineWeight005.
weight: Ширина в сотых долях миллиметра

Teigha.DatabaseServices.Database.GetObjectId(System.Boolean,Teigha.DatabaseServices.Handle,System.Int32)
Возвращает Id объекта, дескриптор которого содержится в
objHandle. Если параметр createIfNotFound установлен в true,
и дескриптор не найден в базе данных, будет создан объект
заглушки (stub) ObjectID, используя указанный дескриптор.
Параметр createIfNotFound должен быть установлен в false.
createIfNotFound: Признак того, нужно ли создавать объект
objHandle: Дескриптор объекта, который должен быть
identifier: Предназначен для использования в будущем

Teigha.DatabaseServices.Database.GetViewports(System.Boolean)
Функция нумерует видовые экраны чертежа.
bGetPaperspaceVports: Признак, указывающий, нужно ли

Teigha.DatabaseServices.Database.Insert(Teigha.Geometry.Matrix3d,Teigha.DatabaseServices.Database,System.Boolean)
Вставка пространства модели базы данных, указанной параметром
dataBase, в пространство модели данной базы данных, при
помощи вызова функцию insert(). В процессе вставки, всем
вставляемым объектам в методы transformBy() передаётся
матрица преобразования xform.
Аргумент preserveSourceDatabase определяет, должна ли
исходная база данных быть сохранена независимой от базы
данных получателя или нет. Значение этого параметра по
умолчанию — true. В этом случае объекты из базы данных
источника копируются в базу данных получателя и база данных
источника не меняется. Если параметр preserveSourceDatabase
равен false, то объекты из базы данных источника не
переписываются в базу данных-получатель. В этом случае метод
исполняется быстрее, но это делает базу данных источника
зависимой от базы данных назначения. При таком вызове
необходимо быть уверенным, что исходная база данных будет
удалена сразу же после или, как минимум, перед удалением базы
данных назначения.
transform: Матрица преобразования, применимая
dataBase: База данных источника
preserveSourceDatabase: Признак, определяющий, будет ли база

Teigha.DatabaseServices.Database.Insert(String,Teigha.DatabaseServices.Database,System.Boolean)
Эта функция имитирует команду INSERT nanoCAD. Сначала при
выполнении метода создается новая запись в таблице блоков.
Этой записи присваивается имя, указанное в blockName. Затем,
все геометрические объекты пространства модели, указанные в
dataBase, копируются в новую запись таблицы блоков.
Аргумент preserveSourceDatabase определяет, должна ли
исходная база данных быть сохранена независимой от базы
данных назначения или нет. Значение этого параметра по
умолчанию — true. В этом случае объекты из базы данных
источника копируются в базу данных назначения и база данных
источника не меняется. Если параметр preserveSourceDatabase
равен false, то объекты из базы данных источника не
переписываются в базу данных назначения. В этом случае метод
исполняется быстрее, но это делает базу данных источника
зависимой от базы данных назначения. При таком вызове
необходимо быть уверенным, что база данных источника будет
удалена сразу же после или, как минимум, перед удалением базы
данных назначения.
Возвращает Id объекта для новой записи таблицы блоков,
созданной этой функцией.
blockName: Имя, используемое для новой записи
dataBase: База данных источника
preserveSourceDatabase: Признак, определяющий, будет ли база

Teigha.DatabaseServices.Database.Insert(String,String,Teigha.DatabaseServices.Database,System.Boolean)
Метод создает новую запись таблицы блоков в базе данных, в
которой он исполняется. Этому новому блоку дается имя,
указанное в destinationBlockName. Затем каждый геометрический
объект в таблице записей блоков с именем sourceBlockName,
который находится в базе данных dataBase, копируется в новую
запись таблицы блоков.
Аргумент preserveSourceDatabase определяет, должна ли база
данных источника быть сохранена независимой от базы данных
назначения или нет. Значение этого параметра по умолчанию —
true. В этом случае объекты из базы данных источника
копируются в базу данных назначения и база данных источника
не меняется. Если параметр preserveSourceDatabase равен
false, то объекты из базы данных источника не переписываются
в базу данных назначения. В этом случае метод исполняется
быстрее, но это делает базу данных источника зависимой от
базы данных назначения. При таком вызове необходимо быть
уверенным, что база данных источника будет удалена сразу же
после или, как минимум, перед удалением базы данных
назначения.
Возвращает Id объекта новой записи таблицы блоков, созданной
этой функцией.
sourceBlockName: Имя блока (записи в таблице блоков)
destinationBlockName: Имя, используемое для новой записи
dataBase: База данных источника
preserveSourceDatabase: Признак, определяющий, будет ли база

Teigha.DatabaseServices.Database.IsObjectNonPersistent(Teigha.DatabaseServices.ObjectId)
Возвращает true, если объект обозначен как не постоянный.
id: Id опрашиваемого объекта

Teigha.DatabaseServices.Database.IsValidLineWeight(System.Int32)
Возвращает true, если weight содержит значение,
соответствующее одной из предопределенных ширин линий, иначе
возвращает false.
weight: Значение ширины в сотых долях миллиметра

Teigha.DatabaseServices.Database.LoadLineTypeFile(String,String)
Эта функция загружает тип линии, определенный lineTypeName из
файла, определенного параметром filename и сохраняет его в
базе данных, из которой данный метод был вызван.
Параметр lineTypeName может содержать маску на символы имени
(например, символ *). В этом случае будут загружены все типы
линий, удовлетворяющих заданному имени.
Если параметр filename не является URL и не содержит полный
путь, то путь к файлу ищется в путях поиска nanoCAD.
lineTypeName: Строка имени типа линии (может содержать маску
filename: Путь/имя файла или URL, откуда должен быть

Teigha.DatabaseServices.Database.LoadMlineStyleFile(String,String)
Эта функция загружает стиль мультилинии, определенный в
mlineStyleName из файла, указанного в параметре fileName.
Если параметр filename не является URL и не содержит полный
путь, то путь к файлу ищется в путях поиска nanoCAD.
mlineStyleName не может содержать маску на символы имени.
mlineStyleName: Строка имени типа линии (не может содержать
fileName: Путь/имя файла или URL, откуда должен быть

Teigha.DatabaseServices.Database.MarkObjectNonPersistent(Teigha.DatabaseServices.ObjectId,System.Boolean)
Помечает объект как постоянный или не постоянный. Объекты в
чертеже по умолчанию являются постоянными (если у них есть
владелец). Этот метод позволяет делать их не постоянными.
id: Id изменяемого объекта
value: true, чтобы сделать объект не постоянным и false,

Teigha.DatabaseServices.Database.OverlayXref(String,String)
Производит наложение файла внешней ссылки, определенного
параметром fileName в базу данных, затем создает новую запись
таблицы блоков. Имя этой записи указано в параметре
blockName. Метод возвращает Id этой записи.
fileName: Имя файла внешней ссылки
blockName: Имя таблицы блоков для наложенного файла внешней

Teigha.DatabaseServices.Database.Purge(Teigha.DatabaseServices.ObjectIdCollection)
Эта функция просматривает базу данных и ищет жесткие ссылки
на объекты, Id которых есть в массиве ids. Если такие объекты
обнаружены, то метод удаляет Id соответствующих объектов из
массива ids. Таким образом, при завершении работы метода
массив ids будет содержать только Id геометрических объектов,
на которые нет жестких ссылок и которые, следовательно, могут
быть удалены.
Если база данных частично открыта, то Id геометрических
объектов, которые не были созданы в текущей сессии редактора,
все равно удаляются из коллекции ids.
Note
Метод не изменяет базу данных.
ids: Входная коллекция Id объектов

Teigha.DatabaseServices.Database.Purge(Teigha.DatabaseServices.ObjectIdGraph)
Эта версия метода purge() работает в один проход. Метод ищет
связи между объектами, что не требует вызова метода несколько раз.
Другими словами, если есть объекты Layer и Linetype и
единственная ссылка на Linetype производится из Layer, то на
возвращаемом графе помечается, что очищены должны быть оба
объекта — и Layer, и Linetype. (Более старая
ObjectIdCollection, создаваемая предыдущей версией purge()
сначала помечала, что только Layer может быть очищен. Затем,
при втором вызове после удаления Layer, метод указывал, что
Linetype может быть очищен).
idGraph: Граф объектов базы данных. Возвращаемый граф

Teigha.DatabaseServices.Database.ReadDwgFile(IntPtr,System.Boolean,String)
Читает файл чертежа, указанный в drawingFile, в базу данных,
исполняющую данный метод.
drawingFile: Указатель на файл формата .dwg для чтения
allowCPConversion: Переменная, определяющая режим разрешения
password: Строка, содержащая пароль файла

Teigha.DatabaseServices.Database.ReadDwgFile(String,Teigha.DatabaseServices.FileOpenMode,System.Boolean,String)
Читает файл чертежа, определенный fileName в базу данных.
fileName должен включать расширение
файла (не обязательно .dwg), даже если открываемый файл имеет
расширение .dwg. fileName может быть URL.
fileName: Имя или URL читаемого файла
mode: Режим открытия
allowCPConversion: Переменная, определяющая режим разрешения
password: Строка, содержащая пароль файла

Teigha.DatabaseServices.Database.ReadDwgFile(String,System.IO.FileShare,System.Boolean,String)
Читает файл чертежа, определенный fileName в базу данных.
fileName должен включать расширение
файла (не обязательно .dwg), даже если открываемый файл имеет
расширение .dwg. fileName может быть URL.
fileName: Имя или URL читаемого файла
fileSharing: Режим разделения файла
allowCPConversion: Переменная, определяющая режим разрешения
password: Строка, содержащая пароль файла

Teigha.DatabaseServices.Database.ReclaimMemoryFromErasedObjects(Teigha.DatabaseServices.ObjectIdCollection)
Метод удаляет объекты, Id которых входят в коллекцию
ids.
Объекты, id которых находятся в массиве ids, должны быть уже
удалены, и они должны находиться в этой базе данных. Объекты,
владельцами которых являются объекты из коллекции ids, будут
удалены, если они еще не удалены, и их память также
освобождается.
Все удаленные объекты могут быть восстановлены по Undo и
снова удалены по Redo.
ids: Коллекция объектов Id, чья память должна быть

Teigha.DatabaseServices.Database.ReloadXrefs(Teigha.DatabaseServices.ObjectIdCollection)
Этот метод перезагружает файлы внешних ссылок, Id записей
таблицы блоков которых есть в xrefIds. Id объектов из xrefIds
должны быть из данной базы данных.
xrefIds: Входная коллекция Id объектов для таблиц блоков

Teigha.DatabaseServices.Database.ResolveXrefs(System.Boolean,System.Boolean)
Метод разрешает существующие внешние ссылки в работающей базе
данных.
Если doNewOnly установлен в true, только неразрешеннные
внешние ссылки будут обрабатываться. Существующие внешние
ссылки LayerTableRecord, LinetypeTableRecord и
BlockTableRecords будут игнорироваться. В этом случае
параметр useThreadEngine игнорируется.
useThreadEngine: Параметр, определяющий, будет ли
doNewOnly: Параметр, определяющий, нужно ли

Teigha.DatabaseServices.Database.SaveAs(String,DatabaseServices.SecurityParameters)
Запускает процесс сохранения в базе данных и записывает
информацию чертежа в файл, определенный параметром fileName.
fileName: Имя файла или URL, куда записываются данные базы
security: Структура типа SecurityParameters

Teigha.DatabaseServices.Database.SaveAs(String,Teigha.DatabaseServices.DwgVersion)
Запускает процесс сохранения в базе данных и записывает
информацию чертежа в файл, указанный в fileName. Аргумент
fileName берется так, как он есть. Если расширения файла нет,
.dwg не подставляется.
fileName: Имя файла или URL, куда записывается информация
version\: Версия формата .dwg, в которой сохраняется файл

Teigha.DatabaseServices.Database.SaveAs(String,System.Boolean,Teigha.DatabaseServices.DwgVersion,DatabaseServices.SecurityParameters)
Запускает процесс сохранения в базе данных и записывает
информацию чертежа в файл, указанный в fileName. Аргумент
fileName берется так, как он есть. Если расширения файла нет,
.dwg не подставляется.
Если база данных, в которой исполняется метод, не является
текущей, растровое изображение
чертежа (для дальнейшего предварительного просмотра) не
создается.
Для определения параметров безопасности, установите параметр
security.
fileName: Имя файла или URL, куда записывается
bBakAndRename: Признак, указывающий, надо ли создавать .bak
version\: Версия формата .dwg, в которой сохраняется файл
security: Структура типа SecurityParameters

Teigha.DatabaseServices.Database.SetDimstyleData(Teigha.DatabaseServices.DimStyleTableRecord)
Метод копирует информацию о переменных размеров, которая
содержится в параметре style, в базу данных, в которой этот
метод выполняется, делая эти значения переменных размеров
текущими в базе данных.
style: Указатель на DimStyleTableRecord, из которой

Teigha.DatabaseServices.Database.SetTimeZoneAsUtcOffset(System.Double)
Устанавливает текущую часовую зону, используя смещение
относительно мирового времени/гринвичского меридиана
(UTC/GMT).
Возвращает часовую зону, выбранную и установленную в
соответствии со значением offset. Если есть несколько зон с
одним и тем же смещением, будет возвращена первая найденная
часовая зона.
Note
Допустимые значения параметра offset от -12.0 до 13.0, при
этом параметр должен указывать на известную часовую зону
(определенную в перечислении TimeZone).
offset: Смещение, в часах

Teigha.DatabaseServices.Database.SetWorldPaperspaceUcsBaseOrigin(Teigha.Geometry.Point3d,Teigha.DatabaseServices.OrthographicView)
Этот метод задает точку в пространстве листа, определяющую
новую точку начала пользовательских координат (UCS) для вида,
определенного в orthoView. orthoView может быть любым
элементом из перечисления OrthographicView.
origin: Новая начальная точка в мировых координатах
orthoView: Вид, для которого задается начальная точка

Teigha.DatabaseServices.Database.SetWorldUcsBaseOrigin(Teigha.Geometry.Point3d,Teigha.DatabaseServices.OrthographicView)
Этот метод задает точку в пространстве модели, определяющую
новую точку начала пользовательских координат (UCS) для вида,
определенного в orthoView. orthoView должен быть одним из
элементов перечисления OrthographicView.
origin: Новая начальная точка в мировых координатах
orthoView: Вид, для которого задается начальная точка

Teigha.DatabaseServices.Database.TimeZoneDescription(DatabaseServices.TimeZone)
Возвращает описание часовой зоны. Этот метод не влияет на
текущие настройки часовой зоны базы данных.
tz: Значение из перечисления TimeZone

Teigha.DatabaseServices.Database.TimeZoneOffset(DatabaseServices.TimeZone)
Эта функция возвращает смещение в часах от мирового времени
(UTC/GMT) часовой зоны, заданной в параметре tz.
Exceptions
validInput :  Возникает, если передается некорректное значение
TimeZone
Note
Этот метод не влияет на текущие настройки часовой зоны базы
данных.
tz: Одна из часовых зон, находящихся в перечислении TimeZone

Teigha.DatabaseServices.Database.UnloadXrefs(Teigha.DatabaseServices.ObjectIdCollection)
Выгружает внешние ссылки, чьи Id таблицы записей блоков есть
в xrefIds.
xrefIds: Входная коллекция Id объектов для таблиц записей

Teigha.DatabaseServices.Database.UpdateExt(System.Boolean)
Этот метод просматривает все геометрические объекты
пространства модели базы данных и обновляет переменные
размера пространства модели EXTMAX и EXTMIN в соответствии со
значениями, определенными в процессе перебора геометрических
объектов.
Установка аргумента doBestFit в true означает, что при
переборе объектов базы данных, все геометрические объекты из
BlockReference должны иметь метод geomExtentsBestFit(),
вызываемый вместо geomExtents(). Он работает медленнее, но
позволяет создавать ограничивающий объект параллелепипед (для
получения размера, занимаемого геометрическим объектом).
Использование аргумента по умолчанию (false) работает
быстрее, но может не создавать ограничивающий объект
параллелепипед.
doBestFit: Определяет, нужно ли создавать ограничивающий

Teigha.DatabaseServices.Database.Wblock(Teigha.DatabaseServices.Database,Teigha.DatabaseServices.ObjectIdCollection,Teigha.Geometry.Point3d,Teigha.DatabaseServices.DuplicateRecordCloning)
Создает новый объект типа база данных, и затем использует
механизм wblockClone для записи содержимого геометрических
объектов базы данных, из которой вызывается метод, в новую
базу данных.

Teigha.DatabaseServices.Database.Wblock(Teigha.DatabaseServices.ObjectId)
Создает новый объект типа база данных, и затем использует
механизм wblockClone для записи содержимого геометрических
объектов базы данных, из которой вызывается метод, в новую
базу данных.

Teigha.DatabaseServices.Database.Wblock(Teigha.DatabaseServices.ObjectIdCollection,Teigha.Geometry.Point3d)
Создает новый объект типа база данных, и затем использует
механизм wblockClone для записи содержимого геометрических
объектов базы данных, из которой вызывается метод, в новую
базу данных.

Teigha.DatabaseServices.Database.WblockCloneObjects(Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.IdMapping,Teigha.DatabaseServices.DuplicateRecordCloning,System.Boolean)
Клонирует все объекты коллекции identifiers и добавляет их в
контейнер, с заданным параметром id владельцем. Объекты могут
быть из разных баз данных, и должны соответствовать типу
владельца и быть из другой базы данных, чем та, в которой
находится объект-владелец.
id может относиться только к объектам типа BlockTableRecord,
Dictionary или SymbolTable. Если владелец — Dictionary, вновь
клонированные геометрические объекты будут заданы как
анонимные.
mapping заполняется IdPair объектов, которые содержат пары Id
объектов — исходного и клонированного. Этот объект может
использоваться для последующей обработки объектов, включенных
в операцию deepClone.
Значение cloning определяет, что произойдет, если символы
словаря будут клонированы и будет обнаружено их совпадение с
уже существующими в базе данных назначения. Параметр cloning
должен иметь одно и то же значение при множественных вызовах,
и это должно быть одно из следующих значений:
* Ignore — если совпадение с существующим символом
произойдет, клон игнорируется, и продолжает использоваться
существующая запись в базе данных назначения. Это такой же
режим, как в команде INSERT и методе Database.insert().
* Replace — если совпадение с существующим символом
произойдет, запись заменяется на запись клонированного
объекта.
* MangleName — изменяет все входящие имена записей. Это
изменение гарантирует уникальность имен. Это такой же режим,
как при работе команды RefEdit.
* UnmangleName — сначала используется RefEdit, и он
проверяет записи в базах данных источников. Любые изменения,
сделанные kDrcMangleName, отменяются и затем параметр
устанавливается в Ignore. Другими словами, если повторения
обнаружатся после удаления переименований, nanoCAD продолжит
использовать существующую запись и игнорирует клонированную.
identifiers: Входная коллекция Id клонируемых объектов
id: Id объекта, который будет владельцем
mapping: Коллекция IdPair пар объектов для
cloning: Действие при обнаружении повторений
deferTranslation: Признак необходимости выполнения Id

Teigha.DatabaseServices.Database.WorldPaperspaceUcsBaseOrigin(Teigha.DatabaseServices.OrthographicView)
Метод возвращает начальную точку пользовательской системы
координат пространства листа (в мировых координатах) для
вида, определенного orthoView. orthoView должен быть одним из
элементов перечисления OrthographicView.
orthoView: Вид, для которого определяется начальная точка

Teigha.DatabaseServices.Database.WorldUcsBaseOrigin(Teigha.DatabaseServices.OrthographicView)
Метод возвращает начальную точку пользовательской системы
координат пространства модели (в мировых координатах) для
вида, определенного orthoView. orthoView должен быть одним из
элементов перечисления OrthographicView.
orthoView: Вид, для которого определяется начальная точка

Teigha.DatabaseServices.Database.XBindXrefs(Teigha.DatabaseServices.ObjectIdCollection,System.Boolean)
Метод связывает записи таблицы символов, чьи Id содержатся в
xrefSymbolIds. Если insertBind равен true, то затем имена
записей таблицы символов будут изменены из имен внешних
ссылок в обычные, вставленные в таблицу символов, имена
записей.
Id объектов в xrefSymbolIds все должны быть из работающей
базы данных и все должны быть из разрешенных внешних ссылок.
xrefSymbolIds может содержать Id объектов следующих типов —
BlockTableRecord, LayerTableRecord, LinetypeTableRecord,
TextStyleTableRecord (если они не представляют файл формы),
RegAppTableRecord and DimStyleTableRecord.
xrefSymbolIds: Коллекция Id объектов SymbolTableRecord,
insertBind: Признак, указывающий, должны ли быть

Teigha.DatabaseServices.Database.CurrentViewportTableRecordId
Возвращает Id текущей ViewportTableRecord для данной базы
данных.

Teigha.DatabaseServices.Database.Handseed
Обеспечивает доступ к значению переменной HANDSEED базы
данных. HANDSEED представляет собой счетчик, который содержит
следующий возможный номер дескриптора. Дескрипторы — это 64
разрядные целые числа, в шестнадцатеричном виде, 64 битовое целое может
содержать до 16 цифр.

Teigha.DatabaseServices.Database.LastSavedAsMaintenanceVersion
Возвращает минорную (maintenance) версию, в
которой в текущей сессии чертеж был сохранен как. Если в
текущей сессии еще не было сохранения чертежа, метод
возвращает 0.

Teigha.DatabaseServices.Database.LastSavedAsVersion
Возвращает версию, в
которой в текущей сессии чертеж был сохранен как. Если в
текущей сессии еще не было сохранения чертежа, метод
возвращает 0.

Teigha.DatabaseServices.Database.MaintenanceReleaseVersion
Возвращает минорную (maintenance) версию базы данных.

Teigha.DatabaseServices.Database.ObjectContextManager
Возвращает менеджер контекста объекта.

Teigha.DatabaseServices.Database.OriginalFileMaintenanceVersion
Возвращает минорную (maintenance) версию, которая была при открытии файла чертежа.

Teigha.DatabaseServices.Database.OriginalFileSavedByMaintenanceVersion
Возвращает минорную (maintenance) версию, в которой был последний раз сохранен файл чертежа, не
считая текущую сессию.

Teigha.DatabaseServices.Database.OriginalFileSavedByVersion
Возвращает версию, в которой был последний раз сохранен файл чертежа, не
считая текущую сессию.

Teigha.DatabaseServices.Database.OriginalFileVersion
Возвращает версию, которая была при открытии файла чертежа.

Teigha.DatabaseServices.Database.PaperSpaceVportId
Обеспечивает доступ к Id видового экрана пространства листа
для базы данных.

Teigha.DatabaseServices.Database.PlotStyleNameId
Обеспечивает доступ к Id входа в словаре имен стилей печати
для plotStyleName в записи таблицы слоев.

Teigha.DatabaseServices.Database.SecurityParameters
Обеспечивает доступ к параметрам безопасности, связанным с
базой данных.

Teigha.DatabaseServices.Database.SummaryInfo
Возвращает общую информацию о базе данных.

Teigha.DatabaseServices.Database.ThumbnailBitmap
Обеспечивает доступ к растровому изображению чертежа.

Teigha.DatabaseServices.Database.TransactionManager
Обеспечивает доступ к менеджеру транзакций базы данных.

Teigha.DatabaseServices.Database.UcsOrthographic
Возвращает текущий ортогональный вид.

Teigha.DatabaseServices.Database.UndoRecording
Возвращает true, если буфер Undo доступен в базе данных.

Teigha.DatabaseServices.Database.AcadDatabase
Возвращает текущую баз данных.

Teigha.DatabaseServices.Database.AllowExtendedNames
Возвращает или устанавливает признак, равный true, если
допустимы расширенные имена.

Teigha.DatabaseServices.Database.Angbase
Возвращает или устанавливает текущее значение ANGBASE для
базы данных.

Teigha.DatabaseServices.Database.Angdir
Возвращает или устанавливает текущее значение ANGDIR для базы
данных. Значение false равно 0. Значение true равно 1.

Teigha.DatabaseServices.Database.AnnoAllVisible
Возвращает или устанавливает текущее значение переменной базы данных ANNOALLVISIBLE.

Teigha.DatabaseServices.Database.ApproxNumObjects
Возвращает значение, которое по крайней мере так же велико,
как количество объектов в базе данных.
Назначение этой функции заключается в определении, какое
максимальное значение элементов ObjectIdCollection
потребуется, чтобы хранить все объекты базы данных. Тогда
этот массив может быть создан сразу необходимого размера
вместо того, чтобы увеличивать размер пассива при
присоединении объектов. Для больших массивов, это может
привести к заметному увеличению производительности и
уменьшению фрагментации памяти.

Teigha.DatabaseServices.Database.Attmode
Возвращает или устанавливает текущее значение ATTMODE для
базы данных.

Teigha.DatabaseServices.Database.Aunits
Возвращает или устанавливает текущее значение AUNITS для базы
данных.

Teigha.DatabaseServices.Database.Auprec
Возвращает или устанавливает текущее значение AUPREC для базы
данных.

Teigha.DatabaseServices.Database.BlockTableId
Возвращает Id объекта BlockTable базы данных.

Teigha.DatabaseServices.Database.ByBlockLinetype
Возвращает Id объекта LinetypeTableRecord базы данных
(BYBLOCK).

Teigha.DatabaseServices.Database.ByLayerLinetype
Возвращает Id объекта LinetypeTableRecord базы данных
(BYLAYER).

Teigha.DatabaseServices.Database.CameraDisplay
Возвращает или устанавливает текущее значение системной
переменной CAMERADISPLAY для базы данных (переменная
указывает, надо отображать или скрыть камеры).

Teigha.DatabaseServices.Database.CameraHeight
Возвращает или устанавливает текущее значение системной
переменной CAMERAHEIGHT (значение этой переменной
используется как значение по умолчанию при создании новой
камеры).

Teigha.DatabaseServices.Database.Cannoscale
Возвращает или устанавливает текущее значение объекта
AnnotationScale, являющегося значением CANNOSCALE для базы
данных, когда пространство модели является текущим.

Teigha.DatabaseServices.Database.Cecolor
Возвращает или устанавливает текущее значение CECOLOR для
базы данных.

Teigha.DatabaseServices.Database.Celtscale
Возвращает или устанавливает текущее значение CELTSCALE для
базы данных.

Teigha.DatabaseServices.Database.Celtype
Возвращает или устанавливает Id типа линии, определенной
текущим значением CELTYPE для базы данных.

Teigha.DatabaseServices.Database.Celweight
Возвращает или устанавливает значение LineWeight,
определяющее текущее значение ширины линии для базы данных.

Teigha.DatabaseServices.Database.Chamfera
Возвращает или устанавливает текущее значение CHAMFERA для
базы данных.

Teigha.DatabaseServices.Database.Chamferb
Возвращает или устанавливает текущее значение CHAMFERB для
базы данных.

Teigha.DatabaseServices.Database.Chamferc
Возвращает или устанавливает текущее значение CHAMFERC для
базы данных.

Teigha.DatabaseServices.Database.Chamferd
Возвращает или устанавливает текущее значение CHAMFERD для
базы данных.

Teigha.DatabaseServices.Database.Clayer
Возвращает или устанавливает текущее значение ID слоя,
являющегося текущим значением переменной CLAYER для базы
данных.

Teigha.DatabaseServices.Database.Cmaterial
Возвращает или устанавливает значение ID материала слоя.

Teigha.DatabaseServices.Database.Cmljust
Возвращает или устанавливает текущее значение CMLJUST для
базы данных.

Teigha.DatabaseServices.Database.Cmlscale
Возвращает или устанавливает текущее значение CMLSCALE для
базы данных.

Teigha.DatabaseServices.Database.CmlstyleID
Возвращает или устанавливает текущее значение ID мультилинии,
определенной текущим значением переменной CMLSTYLEID для базы
данных.

Teigha.DatabaseServices.Database.ColorDictionaryId
Возвращает Id словаря цветов базы данных.

Teigha.DatabaseServices.Database.ContinuousLinetype
Возвращает Id типа линии LinetypeTableRecord базы данных.

Teigha.DatabaseServices.Database.Cshadow
Возвращает или устанавливает текущее значение CSHADOW для
базы данных.

Teigha.DatabaseServices.Database.CurrentSpaceId
Возвращает Id BlockTableRecord текущего пространства
(пространства модели или пространства страницы).

Teigha.DatabaseServices.Database.DgnFrame
Зарезервировано для будущего использования.

Teigha.DatabaseServices.Database.Dimadec
Возвращает или устанавливает текущее значение DIMADEC для
базы данных.

Teigha.DatabaseServices.Database.Dimalt
Возвращает или устанавливает текущее значение DIMALT для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimaltd
Возвращает или устанавливает текущее значение DIMALTD для
базы данных.

Teigha.DatabaseServices.Database.Dimaltf
Возвращает или устанавливает текущее значение DIMALTF для
базы данных.

Teigha.DatabaseServices.Database.Dimaltrnd
Возвращает или устанавливает текущее значение DIMALTRND для
базы данных.

Teigha.DatabaseServices.Database.Dimalttd
Возвращает или устанавливает текущее значение DIMALTTD для
базы данных.

Teigha.DatabaseServices.Database.Dimalttz
Возвращает или устанавливает текущее значение DIMALTTZ для
базы данных.

Teigha.DatabaseServices.Database.Dimaltu
Возвращает или устанавливает текущее значение DIMALTU для
базы данных.

Teigha.DatabaseServices.Database.Dimaltz
Возвращает или устанавливает текущее значение DIMALTZ для
базы данных.

Teigha.DatabaseServices.Database.Dimaso
Возвращает или устанавливает текущее значение DIMASO для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.DimAssoc
Возвращает или устанавливает текущее значение DIMASSOC для
базы данных.

Teigha.DatabaseServices.Database.Dimasz
Возвращает или устанавливает текущее значение DIMASZ для базы
данных.

Teigha.DatabaseServices.Database.Dimatfit
Возвращает или устанавливает текущее значение DIMATFIT для
базы данных.

Teigha.DatabaseServices.Database.Dimaunit
Возвращает или устанавливает текущее значение DIMAUNIT для
базы данных.

Teigha.DatabaseServices.Database.Dimazin
Возвращает или устанавливает текущее значение DIMAZIN для
базы данных.

Teigha.DatabaseServices.Database.Dimblk
Возвращает или устанавливает текущее значение DIMBLK для базы
данных.

Teigha.DatabaseServices.Database.Dimblk1
Возвращает или устанавливает текущее значение DIMBLK1 для
базы данных.

Teigha.DatabaseServices.Database.Dimblk2
Возвращает или устанавливает текущее значение DIMBLK2 для
базы данных.

Teigha.DatabaseServices.Database.Dimcen
Возвращает или устанавливает текущее значение DIMCEN для базы
данных.

Teigha.DatabaseServices.Database.Dimclrd
Возвращает или устанавливает текущее значение DIMCLRD для
базы данных.

Teigha.DatabaseServices.Database.Dimclre
Возвращает или устанавливает текущее значение DIMCLRE для
базы данных.

Teigha.DatabaseServices.Database.Dimclrt
Возвращает или устанавливает текущее значение DIMCLRT для
базы данных.

Teigha.DatabaseServices.Database.Dimdec
Возвращает или устанавливает текущее значение DIMDEC для базы
данных.

Teigha.DatabaseServices.Database.Dimdle
Возвращает или устанавливает текущее значение DIMDLE для базы
данных.

Teigha.DatabaseServices.Database.Dimdli
Возвращает или устанавливает текущее значение DIMDLI для базы
данных.

Teigha.DatabaseServices.Database.Dimdsep
Возвращает или устанавливает текущее значение DIMDSEP для
базы данных.

Teigha.DatabaseServices.Database.Dimexe
Возвращает или устанавливает текущее значение DIMEXE для базы
данных.

Teigha.DatabaseServices.Database.Dimexo
Возвращает или устанавливает текущее значение DIMEXO для базы
данных.

Teigha.DatabaseServices.Database.Dimfrac
Возвращает или устанавливает текущее значение DIMFRAC для
базы данных.

Teigha.DatabaseServices.Database.Dimfxl
Возвращает значение фиксированной выносной линии.

Teigha.DatabaseServices.Database.DimfxlenOn
Возвращает признак того, включены ли фиксированные выносные
линии.

Teigha.DatabaseServices.Database.Dimgap
Возвращает или устанавливает текущее значение DIMGAP для базы
данных.

Teigha.DatabaseServices.Database.Dimjogang
Устанавливает или возвращает текущий большой радиальный угол
(угол пересекающегося сегмента размерной линии,
представляющей собой ломаную линию размера радиуса. Ломаные
линии размеров радиуса строятся в случаях, когда центр
расположен за пределами страницы).

Teigha.DatabaseServices.Database.Dimjust
Возвращает или устанавливает текущее значение DIMJUST для
базы данных.

Teigha.DatabaseServices.Database.Dimldrblk
Возвращает или устанавливает Id ссылки на блок, определенной
текущим значением DIMLDRBLK для базы данных.

Teigha.DatabaseServices.Database.Dimlfac
Возвращает или устанавливает текущее значение DIMLFAC для
базы данных.

Teigha.DatabaseServices.Database.Dimlim
Возвращает или устанавливает текущее значение DIMLIM для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimltex1
Возвращает Id типа линии для выносной линии 1.

Teigha.DatabaseServices.Database.Dimltex2
Возвращает Id типа линии для выносной линии 2.

Teigha.DatabaseServices.Database.Dimltype
Устанавливает или возвращает тип линии размера.

Teigha.DatabaseServices.Database.Dimlunit
Возвращает или устанавливает текущее значение DIMLUNIT для
базы данных.

Teigha.DatabaseServices.Database.Dimlwd
Возвращает или устанавливает текущее значение DIMLWD для базы
данных.

Teigha.DatabaseServices.Database.Dimlwe
Возвращает или устанавливает текущее значение DIMLWE для базы
данных.

Teigha.DatabaseServices.Database.Dimapost
Возвращает или устанавливает текущее значение DIMAPOST для
базы данных.

Teigha.DatabaseServices.Database.Dimarcsym
Устанавливает или возвращает значение отображения обозначения
дуги в размере длины дуги.

Teigha.DatabaseServices.Database.Dimpost
Возвращает или устанавливает текущее значение DIMPOST для
базы данных.

Teigha.DatabaseServices.Database.Dimrnd
Возвращает или устанавливает текущее значение DIMRND для базы
данных.

Teigha.DatabaseServices.Database.Dimsah
Возвращает или устанавливает текущее значение DIMSAH для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimscale
Возвращает или устанавливает текущее значение DIMSCALE для
базы данных.

Teigha.DatabaseServices.Database.Dimsd1
Возвращает или устанавливает текущее значение DIMSD1 для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimsd2
Возвращает или устанавливает текущее значение DIMSD2 для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimse1
Возвращает или устанавливает текущее значение DIMSE1 для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimse2
Возвращает или устанавливает текущее значение DIMSE2 для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimsoxd
Возвращает или устанавливает текущее значение DIMSOXD для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.Dimstyle
Возвращает или устанавливает Id размерного стиля,
определенного текущим значением DIMSTYLE для базы данных.

Teigha.DatabaseServices.Database.DimStyleTableId
Возвращает Id объекта DimStyleTable базы данных.

Teigha.DatabaseServices.Database.Dimtad
Возвращает или устанавливает текущее значение DIMTAD для базы
данных.

Teigha.DatabaseServices.Database.Dimtdec
Возвращает или устанавливает текущее значение DIMTDEC для
базы данных.

Teigha.DatabaseServices.Database.Dimtfac
Возвращает или устанавливает текущее значение DIMTFAC для
базы данных.

Teigha.DatabaseServices.Database.Dimtfill
Возвращает или устанавливает состояние цвета фона
размерности, который может принимать одно из трех значений:
* 0 означает, что цвет фона не доступен;
* 1 означает использование цвета фона из dimtfillclr;
* 2 означает, что используется цвет фона чертежа.

Teigha.DatabaseServices.Database.Dimtfillclr
Возвращает или устанавливает текущий размерный цвет фона
(если dimtfill установлен в 1).

Teigha.DatabaseServices.Database.Dimtih
Возвращает или устанавливает текущее значение DIMTIH для базы
данных.

Teigha.DatabaseServices.Database.Dimtix
Возвращает или устанавливает текущее значение DIMTIX для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimtm
Возвращает или устанавливает текущее значение DIMTM для базы
данных.

Teigha.DatabaseServices.Database.Dimtmove
Возвращает или устанавливает текущее значение DIMTMOVE для
базы данных.

Teigha.DatabaseServices.Database.Dimtofl
Возвращает или устанавливает текущее значение DIMTOFL для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.Dimtoh
Возвращает или устанавливает текущее значение DIMTOH для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimtol
Возвращает или устанавливает текущее значение DIMTOL для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimtolj
Возвращает или устанавливает текущее значение DIMTOLJ для
базы данных.

Teigha.DatabaseServices.Database.Dimtp
Возвращает или устанавливает текущее значение DIMTP для базы
данных.

Teigha.DatabaseServices.Database.Dimtsz
Возвращает или устанавливает текущее значение DIMTSZ для базы
данных.

Teigha.DatabaseServices.Database.Dimtvp
Возвращает или устанавливает текущее значение DIMTVP для базы
данных.

Teigha.DatabaseServices.Database.Dimtxsty
Возвращает или устанавливает Id текстового стиля,
определенного в текущем значении DIMTXSTY для базы данных.

Teigha.DatabaseServices.Database.Dimtxt
Возвращает или устанавливает текущее значение DIMTXT для базы
данных.

Teigha.DatabaseServices.Database.Dimtzin
Возвращает или устанавливает текущее значение DIMTZIN для
базы данных.

Teigha.DatabaseServices.Database.Dimupt
Возвращает или устанавливает текущее значение DIMUPT для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Dimzin
Возвращает или устанавливает текущее значение DIMZIN для базы
данных.

Teigha.DatabaseServices.Database.DispSilh
Возвращает или устанавливает текущее значение DISPSILH для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.dragvs
Возвращает или устанавливает Id визуального стиля, заданного
в DRAGVS для базы данных.

Teigha.DatabaseServices.Database.DrawOrderCtl
Устанавливает или возвращает значение системной переменной
DRAWORDERCTL, которая позволяет пользователю вернуться к
прежнему режиму работы с чертежом, если это требуется. Эта
переменная в чертеже должна быть согласована со значением
SORTENTS.
Значения определяются следующим образом:
* 0 — полная функциональность чертежа;
* 1 — отсутствует оперативное обновление графики. Когда
этот бит установлен, измененные объекты появляются перед
остальными. Важно отметить, что это в действительности не
гарантирует, что они останутся на том же месте после
выполнения команды REGEN, сохранения файла, его закрытия и
повторного открытия или при его печати;
* 2 — установка этого бита закрывает наследование объектов,
полученное от других объектов, таких как разделяемые объекты.
Если он выключен, новая линия, созданная из разделяемой
линии, будет располагаться перед всеми объектами, а старая
линия будет на своем старом месте чертежа;
* 3 — и оперативное обновление графики, и наследование
объектов, полученное от других объектов, запрещены.

Teigha.DatabaseServices.Database.DwfFrame
Возвращает или устанавливает текущее значение DWFFRAME для
базы данных.

Teigha.DatabaseServices.Database.Elevation
Возвращает или устанавливает значение переменной ELEVATION
пространства модели базы данных.

Teigha.DatabaseServices.Database.EndCaps
Возвращает или устанавливает значение заголовка переменной
endCaps базы данных.

Teigha.DatabaseServices.Database.Extmax
Возвращает или устанавливает текущее значение EXTMAX
пространства модели базы данных.

Teigha.DatabaseServices.Database.Extmin
Возвращает или устанавливает текущее значение EXTMIN
пространства модели базы данных.

Teigha.DatabaseServices.Database.Facetres
Возвращает или устанавливает текущее значение FACETRES
пространства модели базы данных.

Teigha.DatabaseServices.Database.FileDependencyManager
Возвращает объект FileDependencyManager базы данных.

Teigha.DatabaseServices.Database.Filename
Возвращает имя файла, связанного с базой данных.

Teigha.DatabaseServices.Database.Filletrad
Возвращает или устанавливает текущее значение FILLETRAD для
базы данных.

Teigha.DatabaseServices.Database.Fillmode
Возвращает или устанавливает текущее значение FILLMODE для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.FingerprintGuid
Устанавливает или возвращает заголовок переменной
fingerprintguid базы данных.

Teigha.DatabaseServices.Database.GroupDictionaryId
Возвращает Id группового словаря базы данных.

Teigha.DatabaseServices.Database.HaloGap
Возвращает или устанавливает текущее значение HALOGAP для
базы данных.

Teigha.DatabaseServices.Database.HideText
Возвращает или устанавливает текущее значение HIDETEXT для
базы данных.

Teigha.DatabaseServices.Database.HpInherit
Возвращает или устанавливает логический признак, определенный
значением HPINHERIT для базы данных.

Teigha.DatabaseServices.Database.HpOrigin
Возвращает или устанавливает 2D точку, которая представляет
текущее значение HPORIGIN для базы данных.

Teigha.DatabaseServices.Database.HyperlinkBase
Возвращает или устанавливает копию пути как новое значение
заголовка переменной HYPERLINKBASE.

Teigha.DatabaseServices.Database.Indexctl
Возвращает или устанавливает значение заголовка переменной
INDEXCTL.

Teigha.DatabaseServices.Database.Insbase
Возвращает или устанавливает текущее значение INSBASE
пространства модели базы данных. Точка задается в WCS
координатах.

Teigha.DatabaseServices.Database.Insunits
Возвращает или устанавливает текущее значение INSUNITS для
базы данных.

Teigha.DatabaseServices.Database.Interferecolor
Возвращает или устанавливает цвет объектов взаимодействия,
определенный в системной переменной INTERFERECOLOR для базы
данных.

Teigha.DatabaseServices.Database.Interfereobjvs
Возвращает или устанавливает визуальный стиль объектов
взаимодействия, определенный в системной переменной
INTERFEREOBJVS для базы данных.

Teigha.DatabaseServices.Database.Interferevpvs
Возвращает или устанавливает визуальный стиль объектов
взаимодействия, определенный в системной переменной
INTERFEREVPVS для базы данных.

Teigha.DatabaseServices.Database.IntersectColor
Возвращает или устанавливает текущее значение заголовка
INTERSECTIONCOLOR для базы данных.

Teigha.DatabaseServices.Database.IntersectDisplay
Возвращает или устанавливает текущее значение заголовка
INTERSECTIONDISPLAY для базы данных.

Teigha.DatabaseServices.Database.IsEmr
Всегда возвращает false.

Teigha.DatabaseServices.Database.Isolines
Возвращает или устанавливает текущее значение ISOLINES для
базы данных.

Teigha.DatabaseServices.Database.IsPartiallyOpened
Возвращает true, если база данных имеет статус частично
открытой, в противном случае возвращает false.

Teigha.DatabaseServices.Database.JoinStyle
Устанавливает или возвращает значение заголовка переменой
стиля соединения базы данных.

Teigha.DatabaseServices.Database.Latitude
Возвращает или устанавливает широту модели, в градусах.
Допустимые значения от -90 до +90 градусов, а положительные
значения соответствуют северной широте.

Teigha.DatabaseServices.Database.LayerEval
Возвращает или устанавливает текущее значение заголовка
LAYEREVAL.

Teigha.DatabaseServices.Database.LayerNotify
Возвращает или устанавливает текущее значение заголовка
LAYERNOTIFY.

Teigha.DatabaseServices.Database.LayerTableId
Возвращает Id таблицы слоев базы данных.

Teigha.DatabaseServices.Database.LayerZero
Возвращает Id слоя 0 таблицы записей слоев базы данных.

Teigha.DatabaseServices.Database.LayoutDictionaryId
Возвращает Id словаря ACAD_LAYOUT, который содержит объекты
типа Layout. Словарь листов содержит характеристики каждого
листа пространства листов.

Teigha.DatabaseServices.Database.LensLength
Возвращает или устанавливает значение системной переменной
LENSLENGTH.

Teigha.DatabaseServices.Database.LightGlyphDisplay
Устанавливает или возвращает признак того, отображаются ли
источники света в видовом экране. 1 соответствует тому, что
источники света отображаются и 0 в противном случае.

Teigha.DatabaseServices.Database.LightingUnits
Устанавливает или возвращает единицы света для чертежа, где 0
\- Общие, 1 - Международные, 2 - Американские.

Teigha.DatabaseServices.Database.LightsInBlocks
Устанавливает или возвращает признак, что блоки игнорируются
и не способствуют освещению общей сцены.

Teigha.DatabaseServices.Database.Limcheck
Возвращает или устанавливает текущее значение LIMCHECK
пространства модели для базы данных. Значение false
соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Limmax
Возвращает или устанавливает текущее значение LIMMAX
пространства модели для базы данных.

Teigha.DatabaseServices.Database.Limmin
Возвращает или устанавливает текущее значение LIMMIN
пространства модели для базы данных.

Teigha.DatabaseServices.Database.LinetypeTableId
Возвращает Id таблицы типов линий базы данных.

Teigha.DatabaseServices.Database.LineWeightDisplay
Возвращает или устанавливает статус ширины отображаемой
линии.

Teigha.DatabaseServices.Database.LoftAng1
Возвращает или устанавливает текущее значение LOFTANG1 для
базы данных.

Teigha.DatabaseServices.Database.LoftAng2
Возвращает или устанавливает текущее значение LOFTANG2 для
базы данных.

Teigha.DatabaseServices.Database.LoftMag1
Возвращает или устанавливает текущее значение LOFTMAG1 для
базы данных.

Teigha.DatabaseServices.Database.LoftMag2
Возвращает или устанавливает текущее значение LOFTMAG2 для
базы данных.

Teigha.DatabaseServices.Database.LoftNormals
Возвращает или устанавливает текущее значение LOFTNORMALS для
базы данных.

Teigha.DatabaseServices.Database.LoftParam
Возвращает или устанавливает текущее значение LOFTPARAM для
базы данных.

Teigha.DatabaseServices.Database.Longitude
Возвращает или устанавливает долготу расположения модели, в
градусах. Допустимые значения от -180 до +180 градусов, а
положительные значения соответствуют западной долготе.

Teigha.DatabaseServices.Database.Ltscale
Возвращает или устанавливает текущее значение LTSCALE для
базы данных.

Teigha.DatabaseServices.Database.Lunits
Возвращает или устанавливает текущее значение LUNITS для базы
данных.

Teigha.DatabaseServices.Database.Luprec
Возвращает или устанавливает текущее значение LUPREC для базы
данных.

Teigha.DatabaseServices.Database.MaterialDictionaryId
Возвращает Id словаря ACAD_MATERIAL, который содержит объекты
типа "Материалы".

Teigha.DatabaseServices.Database.Maxactvp
Возвращает или устанавливает текущее значение MAXACTVP для
базы данных.

Teigha.DatabaseServices.Database.Measurement
Возвращает или устанавливает текущее значение MEASUREMENT для
базы данных.

Teigha.DatabaseServices.Database.Menu
Возвращает текст, отображаемый в меню.

Teigha.DatabaseServices.Database.Mirrtext
Возвращает или устанавливает текущее значение MIRRTEXT для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.MLeaderstyle
Возвращает или устанавливает Id стиля мультивыносок,
определенных текущим значением CMLEADERSTYLE базы данных.

Teigha.DatabaseServices.Database.MLeaderStyleDictionaryId
Для словаря ACAD_MLEADERSTYLE.

Teigha.DatabaseServices.Database.MLStyleDictionaryId
Возвращает Id словаря стиля мультивыносок базы данных.

Teigha.DatabaseServices.Database.MsLtScale
Возвращает или устанавливает текущее значение MSLTSCALE для
базы данных.

Teigha.DatabaseServices.Database.MsOleScale
Возвращает или устанавливает значение заголовка LAYERNOTIFY.

Teigha.DatabaseServices.Database.NamedObjectsDictionaryId
Возвращает Id словаря именованных объектов базы данных.

Teigha.DatabaseServices.Database.NorthDirection
Возвращает или устанавливает угол, определяющий направление
на Север, базирующееся на ориентации модели чертежа в WCS
координатах.

Teigha.DatabaseServices.Database.NumberOfSaves
Возвращает или устанавливает, сколько раз сохранялась база
данных в текущей сессии, или 0, если сохранение не
производилось не разу.

Teigha.DatabaseServices.Database.ObscuredColor
Возвращает или устанавливает текущее значение OBSCUREDCOLOR
для базы данных.

Teigha.DatabaseServices.Database.OleStartUp
Возвращает или устанавливает текущее значение заголовка
OLESTARTUP.

Teigha.DatabaseServices.Database.Orthomode
Возвращает или устанавливает текущее значение ORTHOMODE для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.Pdmode
Возвращает или устанавливает текущее значение PDMODE для базы
данных.

Teigha.DatabaseServices.Database.Pdsize
Возвращает или устанавливает текущее значение PDSIZE для базы
данных.

Teigha.DatabaseServices.Database.Pelevation
Возвращает или устанавливает текущее значение ELEVATION для
базы данных.

Teigha.DatabaseServices.Database.Pextmax
Возвращает или устанавливает текущее значение EXTMAX для базы
данных.

Teigha.DatabaseServices.Database.Pextmin
Возвращает или устанавливает текущее значение EXTMIN для базы
данных.

Teigha.DatabaseServices.Database.Pinsbase
Возвращает или устанавливает текущее значение INSBASE для
базы данных.

Teigha.DatabaseServices.Database.Plimcheck
Возвращает или устанавливает текущее значение LIMCHECK
пространства листа для базы данных. Значение false
соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Plimmax
Возвращает или устанавливает текущее значение LIMMAX для базы
данных.

Teigha.DatabaseServices.Database.Plimmin
Возвращает или устанавливает текущее значение LIMMIN для базы
данных.

Teigha.DatabaseServices.Database.PlineEllipse
Возвращает или устанавливает текущее значение PELLIPSE для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.Plinegen
Возвращает или устанавливает текущее значение PLINEGEN для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.Plinewid
Возвращает или устанавливает текущее значение PLINEWID для
базы данных.

Teigha.DatabaseServices.Database.PlotSettingsDictionaryId
Возвращает Id словаря ACAD_PLOTSETTINGS.

Teigha.DatabaseServices.Database.PlotStyleMode
Возвращает true, если база данных использует цвето-зависимые
стили печати и false для именованных стилей печати.

Teigha.DatabaseServices.Database.PlotStyleNameDictionaryId
Возвращает Id словаря имен стилей печати базы данных.

Teigha.DatabaseServices.Database.ProjectName
Обеспечивает доступ к строке заголовка переменной
PROJECTNAME.

Teigha.DatabaseServices.Database.Psltscale
Возвращает или устанавливает текущее значение PSLTSCALE для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.PsolHeight
Возвращает или устанавливает текущее значение PSOLHEIGHT для
базы данных.

Teigha.DatabaseServices.Database.PsolWidth
Возвращает или устанавливает текущее значение PSOLWIDTH для
базы данных.

Teigha.DatabaseServices.Database.PucsBase
Представляет доступ к Id таблицы записей UCS
(пользовательской системы координат), которая определяет
положение и ориентацию ортогональной UCS для текущего
пространства листа базы данных.

Teigha.DatabaseServices.Database.Pucsname
Предоставляет доступ к Id записи таблицы UCS, которая в
данный момент используется в пространстве листа базы данных
(значение UCSNAME пространства листа).

Teigha.DatabaseServices.Database.Pucsorg
Возвращает текущее значение UCSORG пространства листа базы
данных.

Teigha.DatabaseServices.Database.Pucsxdir
Возвращает текущее значение UCSXDIR пространства листа базы
данных.

Teigha.DatabaseServices.Database.Pucsydir
Возвращает текущее значение UCSYDIR пространства листа базы
данных.

Teigha.DatabaseServices.Database.Qtextmode
Возвращает текущее значение QTEXTMODE для базы данных.
Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.RegAppTableId
Возвращает Id RegAppTable базы данных.

Teigha.DatabaseServices.Database.Regenmode
Возвращает или устанавливает текущее значение REGENMODE для
базы данных. Значение false соответствует 0. Значение true —
1.

Teigha.DatabaseServices.Database.RetainOriginalThumbnailBitmap
Возвращает или устанавливает состояние переключателя
растрового изображения. По умолчанию установлено в false.
Если переключатель установлен в true, база данных всегда
пытается сохранять оригинальное изображение независимо от
того, что указывают другие действия.

Teigha.DatabaseServices.Database.Saveproxygraphics
Возвращает или устанавливает текущее значение PROXYGRAPHICS
для базы данных.

Teigha.DatabaseServices.Database.SectionManagerId
Возвращает Id менеджера сечений, связанного с базой
данных.

Teigha.DatabaseServices.Database.Shadedge
Обеспечивает доступ к текущему значению SHADEDGE для базы
данных.

Teigha.DatabaseServices.Database.Shadedif
Обеспечивает доступ к текущему значению SHADEDIF для базы
данных.

Teigha.DatabaseServices.Database.ShadowPlaneLocation
Обеспечивает доступ к текущему значению Z плоскости земли в
мировых координатах. Плоскость земли всегда параллельна
плоскости X-Y.

Teigha.DatabaseServices.Database.ShowHist
Обеспечивает доступ к текущему значению SHOWHIST для базы
данных.

Teigha.DatabaseServices.Database.Sketchinc
Обеспечивает доступ к текущему значению SKETCHINC для базы
данных.

Teigha.DatabaseServices.Database.Skpoly
Обеспечивает доступ к текущему значению SKPOLY для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.SolidHist
Обеспечивает доступ к текущему значению SOLIDHIST для базы
данных.

Teigha.DatabaseServices.Database.SortEnts
Обеспечивает доступ к текущему значению SORTENTS для базы
данных.

Teigha.DatabaseServices.Database.Splframe
Обеспечивает доступ к текущему значению SPLFRAME для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.Splinesegs
Обеспечивает доступ к текущему значению SPLINESEGS для базы
данных.

Teigha.DatabaseServices.Database.Splinetype
Обеспечивает доступ к текущему значению SPLINETYPE для базы
данных.

Teigha.DatabaseServices.Database.StepSize
Обеспечивает доступ к текущему значению STEPSIZE для базы
данных.

Teigha.DatabaseServices.Database.StepsPerSec
Обеспечивает доступ к текущему значению STEPSPERSEC для базы
данных.

Teigha.DatabaseServices.Database.StyleSheet
Обеспечивает доступ к текущему стилю печати листа.

Teigha.DatabaseServices.Database.Surftab1
Обеспечивает доступ к текущему значению SURFTAB1 для базы
данных.

Teigha.DatabaseServices.Database.Surftab2
Обеспечивает доступ к текущему значению SURFTAB2 для базы
данных.

Teigha.DatabaseServices.Database.Surftype
Обеспечивает доступ к текущему значению SURFTYPE для базы
данных.

Teigha.DatabaseServices.Database.Surfu
Обеспечивает доступ к текущему значению SURFU для базы
данных.

Teigha.DatabaseServices.Database.Surfv
Обеспечивает доступ к текущему значению SURFV для базы
данных.

Teigha.DatabaseServices.Database.Tablestyle
Обеспечивает доступ к Id таблицы стилей, определенной текущим
значением CTABLESTYLE для базы данных.

Teigha.DatabaseServices.Database.TableStyleDictionaryId
Обеспечивает доступ к Id словаря таблицы стилей в словаре
именованных объектов.

Teigha.DatabaseServices.Database.Tdcreate
Обеспечивает доступ к текущему значению TDCREATE для базы
данных.

Teigha.DatabaseServices.Database.Tdindwg
Обеспечивает доступ к текущему значению TDINDWG для базы
данных.

Teigha.DatabaseServices.Database.Tducreate
Обеспечивает доступ к текущему значению TDUCREATE для базы
данных.

Teigha.DatabaseServices.Database.Tdupdate
Обеспечивает доступ к текущему значению TDUPDATE для базы
данных.

Teigha.DatabaseServices.Database.Tdusrtimer
Обеспечивает доступ к текущему значению TDUSRTIMER для базы
данных.

Teigha.DatabaseServices.Database.Tduupdate
Обеспечивает доступ к текущему значению TDUUPDATE для базы
данных.

Teigha.DatabaseServices.Database.Textsize
Обеспечивает доступ к текущему значению TEXTSIZE для базы
данных.

Teigha.DatabaseServices.Database.Textstyle
Обеспечивает доступ к текущему значению TEXTSTYLE для базы
данных.

Teigha.DatabaseServices.Database.TextStyleTableId
Обеспечивает доступ к Id таблицы текстовых стилей базы
данных.

Teigha.DatabaseServices.Database.Thickness
Обеспечивает доступ к текущему значению THICKNESS для базы
данных.

Teigha.DatabaseServices.Database.TileMode
Обеспечивает доступ к текущему значению TILEMODE для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.TimeZone
Обеспечивает доступ к значению часовой зоны для чертежа
(одному из значений перечисления).

Teigha.DatabaseServices.Database.Tracewid
Обеспечивает доступ к текущему значению TRACEWID для базы
данных.

Teigha.DatabaseServices.Database.Treedepth
Обеспечивает доступ к текущему значению TREEDEPTH для базы
данных.

Teigha.DatabaseServices.Database.TStackAlign
Обеспечивает доступ к текущему значению TSTACKALIGN для базы
данных.

Teigha.DatabaseServices.Database.TstackSize
Обеспечивает доступ к текущему значению TSTACKSIZE для базы
данных.

Teigha.DatabaseServices.Database.UcsBase
Обеспечивает доступ к Id таблицы записей UCS, которая
определяет положение и ориентацию настроек ортогонального UCS
для пространства модели базы данных.

Teigha.DatabaseServices.Database.Ucsname
Возвращает Id записи таблицы UCS, которая в данный момент
используется в пространстве модели базы данных; это значение
переменной пространства модели UCSNAME.

Teigha.DatabaseServices.Database.Ucsorg
Обеспечивает доступ к текущему значению UCSORG для базы
данных.

Teigha.DatabaseServices.Database.UcsTableId
Возвращает Id таблицы пользовательских координат базы данных.

Teigha.DatabaseServices.Database.Ucsxdir
Обеспечивает доступ к текущему значению UCSXDIR для базы
данных.

Teigha.DatabaseServices.Database.Ucsydir
Обеспечивает доступ к текущему значению UCSYDIR для базы
данных.

Teigha.DatabaseServices.Database.Unitmode
Обеспечивает доступ к текущему значению UNITMODE для базы
данных.

Teigha.DatabaseServices.Database.UpdateThumbnail
Предоставляет доступ к значению заголовка переменной
UPDATETHUMBNAIL.

Teigha.DatabaseServices.Database.Useri1
Обеспечивает доступ к текущему значению USERI1 для базы
данных.

Teigha.DatabaseServices.Database.Useri2
Обеспечивает доступ к текущему значению USERI2 для базы
данных.

Teigha.DatabaseServices.Database.Useri3
Обеспечивает доступ к текущему значению USERI3 для базы
данных.

Teigha.DatabaseServices.Database.Useri4
Обеспечивает доступ к текущему значению USERI4 для базы
данных.

Teigha.DatabaseServices.Database.Useri5
Обеспечивает доступ к текущему значению USERI5 для базы
данных.

Teigha.DatabaseServices.Database.Userr1
Обеспечивает доступ к текущему значению USERR1 для базы
данных.

Teigha.DatabaseServices.Database.Userr2
Обеспечивает доступ к текущему значению USERR2 для базы
данных.

Teigha.DatabaseServices.Database.Userr3
Обеспечивает доступ к текущему значению USERR3 для базы
данных.

Teigha.DatabaseServices.Database.Userr4
Обеспечивает доступ к текущему значению USERR4 для базы
данных.

Teigha.DatabaseServices.Database.Userr5
Обеспечивает доступ к текущему значению USERR5 для базы
данных.

Teigha.DatabaseServices.Database.Usrtimer
Возвращает текущее значение переменной USRTIMER базы данных.
Значение false соответствует выключенному положение, а true —
включенному положению.

Teigha.DatabaseServices.Database.VersionGuid
Возвращает строку GUID версии базы данных.

Teigha.DatabaseServices.Database.ViewportScaleDefault
Обеспечивает доступ к значению по умолчанию масштаба видового
экрана базы данных.

Teigha.DatabaseServices.Database.ViewportTableId
Возвращает Id таблицы видовых экранов базы данных.

Teigha.DatabaseServices.Database.ViewTableId
Возвращает Id таблицы видов базы данных.

Teigha.DatabaseServices.Database.Visretain
Обеспечивает доступ к текущему значению VISRETAIN для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.VisualStyleDictionaryId
Возвращает Id словаря ACAD_VISUALSTYLE, который содержит
объекты типа "визуальный стиль".

Teigha.DatabaseServices.Database.Worldview
Обеспечивает доступ к текущему значению WORLDVIEW для базы
данных. Значение false соответствует 0. Значение true — 1.

Teigha.DatabaseServices.Database.XrefBlockId
Возвращает ID записи таблицы блоков, которая ссылается на
данную базу данных как на внешнюю ссылку.

Teigha.DatabaseServices.Database.XrefEditEnabled
Обеспечивает доступ к текущему значению XEDIT для базы
данных. Значение false соответствует 0. Значение true — 1.