Teigha.Geometry.Surface.GetEnvelope
Метод позволяет найти минимальный прямоугольник в пространстве параметров, в который вписана вся область параметров данной поверхности.
Метод позволяет найти минимальный прямоугольник в пространстве параметров, в который вписана вся область параметров данной поверхности.
Предполагает реализацию в производных классах.
Индексы возвращаемого массива:
* 0 - интервал параметра U.
* 1 - интервал параметра V.
Returns: Возвращает двухэлементный массив параметрических интервалов по U и V, соответственно.
Тип Interval[].