Teigha.DatabaseServices.RevolvedSurface
Класс RevolvedSurface представляет объект трехмерной поверхности вращения.
Класс RevolvedSurface представляет объект трехмерной поверхности вращения.
Он реализует методы для создания и изменения таких поверхностей.

Teigha.DatabaseServices.RevolvedSurface.#ctor
Конструктор по умолчанию класса RevolvedSurface.
Конструктор по умолчанию класса RevolvedSurface.

Teigha.DatabaseServices.RevolvedSurface.CreateRevolvedSurface(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,DatabaseServices.RevolveOptions)
Метод предназначен для создания поверхности вращения с указанными параметрами.
Метод предназначен для создания поверхности вращения с указанными параметрами.
revolveEntity: Плоская кривая, область или плоская поверхность, которая служит образующей для создания поверхности вращения. Тип Entity.
axisPoint: Точка, через которую проходит ось вращения. Тип Point3d.
axisDirection: Направляющий вектор оси вращения. Тип Vector3d.
revolveAngle: Угол поворота (в радианах). Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения. Тип double.
startAngle: Начальный угол поворота (в радианах).  Тип double.
revolveOptions: Опции операции вращения. Тип DatabaseServices.RevolveOptions.

Teigha.DatabaseServices.RevolvedSurface.SetRevolve(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,Teigha.DatabaseServices.RevolveOptions)
Метод позволяет установить в данном объекте новые значения указанных параметров поверхности вращения.
Метод позволяет установить в данном объекте новые значения указанных параметров поверхности вращения.
axisPoint: Точка, через которую проходит ось вращения. Тип Point3d.
axisDirection: Направляющий вектор оси вращения. Тип Vector3d.
revolveAngle: Угол поворота (в радианах). Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения. Тип double.
revolveOptions: Опции операции вращения. Тип DatabaseServices.RevolveOptions.

Teigha.DatabaseServices.RevolvedSurface.AxisDirection
Свойство AxisDirection представляет направляющий вектор оси вращения данного объекта.
Свойство AxisDirection представляет направляющий вектор оси вращения данного объекта.
Returns: Возвращает направляющий вектор оси вращения. Тип Vector3d.

Teigha.DatabaseServices.RevolvedSurface.AxisPoint
Свойство AxisPoint представляет 3D-точку, через которую проходит ось вращения.
Свойство AxisPoint представляет 3D-точку, через которую проходит ось вращения.
Returns: Возвращает 3D-точку на оси вращения. Тип Point3d.

Teigha.DatabaseServices.RevolvedSurface.RevolveAngle
Свойство RevolveAngle представляет угол поворота данного объекта.
Свойство RevolveAngle представляет угол поворота данного объекта (в радианах).
Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения.
Returns: Возвращает угол поворота для данной поверхности. Тип double.

Teigha.DatabaseServices.RevolvedSurface.RevolveEntity
Свойство RevolveEntity представляет геометрию образующей данной поверхности вращения.
Свойство RevolveEntity представляет геометрию образующей данной поверхности вращения.
В этом качестве допускается использовать плоские кривые, области или плоские поверхности.
Returns: Возвращает объект чертежа. Тип Entity.

Teigha.DatabaseServices.RevolvedSurface.RevolveOptions
Свойство RevolveOptions представляет опции операции вращения, влияющие на форму получаемой поверхности.
Свойство RevolveOptions представляет опции операции вращения, влияющие на форму получаемой поверхности.
Returns: Возвращает опции операции вращения. Тип DatabaseServices.RevolveOptions.

Teigha.DatabaseServices.RevolvedSurface.StartAngle
Свойство StartAngle представляет начальный угол операции вращения.
Свойство StartAngle представляет начальный угол операции вращения (в радианах).
Returns: Возвращает начальный угол операции вращения (в радианах). Тип double.