Teigha.GraphicsSystem.ModuleEventArgs
Класс ModuleEventArgs представляет аргументы для различных событий, связанных с объектами GsModule.
Класс ModuleEventArgs представляет аргументы для различных событий, связанных с объектами GsModule.

Teigha.GraphicsSystem.ModuleEventArgs.Module
Свойство Module предоставляет доступ к связанному объекту GsModule.
Свойство Module предоставляет доступ к связанному объекту GsModule.
Returns: Возвращает связанный модуль графической системы. Тип GsModule.