Teigha.LayerManager.LayerGroup
Класс LayerGroup представляет в базе данных объект фильтра группы слоёв.
Класс LayerGroup является производным от класса LayerFilter и обслуживает доступ к фильтрам групп слоев.
Он позволяет клиенту указывать и извлекать наборы идентификаторов объектов слоев.
Метод Filter() возвращает true, если идентификатор объекта интересующего слоя содержится в наборе идентификаторов слоев для LayerGroup.
Указание критериев фильтра выполняется исключительно с помощью Id слоев.
LayerGroup не использует строку выражения фильтра, поэтому FilterExpression возвращает нулевой указатель.
Для идентификации фильтров типа LayerGroup среди прочих фильтров слоев рекомендуется проверять свойство IsIdFilter, которое для фильтра типа LayerGroup возвращает значение true.

Teigha.LayerManager.LayerGroup.#ctor
Конструктор по умолчанию класса LayerGroup.
Конструктор по умолчанию класса LayerGroup.

Teigha.LayerManager.LayerGroup.LayerIds
Свойство LayerIds представляет коллекцию идентификаторов слоев в данном фильтре группы слоев.
Свойство LayerIds представляет коллекцию идентификаторов слоев в данном фильтре группы слоев.
Returns: Возвращает коллекцию идентификаторов слоев в данном групповом фильтре слоев.
Тип LayerCollection.