Teigha.BoundaryRepresentation.Complex
Класс Complex является интерфейсным классом для комплексов в иерархии топологической смежности B-Rep.
Класс Complex является интерфейсным классом для комплексов в иерархии топологической смежности B-Rep.
Комплексы представляют границы смежных оболочек в трехмерном пространстве.
Комплексы не представимы в типах подобъектов nanoCAD и, таким образом, не могут напрямую определяться пользователем.
Экземпляры класса создаются неявным образом процедурами обхода дерева объектов B-Rep.

Teigha.BoundaryRepresentation.Complex.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса Complex. Создает экземпляр класса по заданному пути подобъекта.
Конструктор класса Complex. Создает экземпляр класса по заданному пути подобъекта.
fullSubentPath: Входной полный путь подобъекта.

Teigha.BoundaryRepresentation.Complex.GetShellsStartingFrom(Teigha.BoundaryRepresentation.Shell)
Метод позволяет получить коллекцию оболочек комплекса, которая начинается с указанной начальной оболочки.
Метод позволяет получить коллекцию оболочек комплекса, которая начинается с указанной начальной оболочки.
startFrom: Начальная оболочка, с которой начинается коллекция оболочек.
Returns: Возвращает коллекцию оболочек комплекса.
Тип ComplexShellCollection.

Teigha.BoundaryRepresentation.Complex.Shells
Свойство Shells представляет коллекцию всех оболочек данного комплекса.
Свойство Shells представляет коллекцию всех оболочек данного комплекса.
Returns: Возвращает коллекцию всех оболочек комплекса.
Тип ComplexShellCollection.