Teigha.GraphicsInterface.EdgeData.GetVisibility
Метод предоставляет массив флагов видимости рёбер, используемых этим объектом.
Метод предоставляет массив флагов видимости рёбер, по одному для каждого ребра в сети или оболочке, с которыми используется данный объект.
Значение 1 означает видимое состояние, значение 0 - невидимое.
Notes
Возвращается фактический массив флагов видимости, используемый графической системой, а не его копию.
Не удаляйте этот массив, если только память массива не была выделена динамически и функция WorldDraw() или ViewportDraw(), в которой он используется, не собирается возвращать управление.
Returns: Возвращает массив флагов видимости рёбер.
Тип unsigned char[].
Возвращается NULL, если массив флагов видимости не был задан.