HostMgd.EditorInput.DraggingEndedEventHandler
Делегат предназначен для обработки событий, возникающих при завершении операции перетаскивания.
Делегат используется для подключения методов, которые реагируют на завершение интерактивной операции
перетаскивания объекта в чертеже nanoCAD.
Он передает данные события через объект типа DraggingEndedEventArgs,
что позволяет получить информацию о результате перетаскивания и выполнить пользовательские действия — например,
обновление состояния объекта или отрисовку. Делегат применяется совместно с событием DraggingEnded.
sender: Источник события — обычно объект редактора или элемент интерфейса, который инициировал завершение перетаскивания.
e: Объект, содержащий дополнительные данные о завершённой операции перетаскивания, такие как

HostMgd.EditorInput.DraggingEndedEventHandler
Делегат уведомления о конце метода перетаскивания класса Edit