Teigha.DatabaseServices.MTextFragmentCallbackStatus
Перечисление MTextFragmentCallbackStatus определяет статусы возвращаемого результата обратного вызова MTextFragmentCallback.
Перечисление MTextFragmentCallbackStatus определяет статусы возвращаемого результата обратного вызова MTextFragmentCallback.