HostMgd.EditorInput.JigPromptOptions.UserInputControls
Пользовательские настройки ввода, используемые во время выполнения технологии .
Свойство предназначено для определения пользовательских настроек ввода при запросе во время использования технологии Jig.
Пользовательские настройки ввода определяются одним из элементов перечисления .
Returns: Возвращает тип данных  - набор пользовательских настроек ввода, установленных для операции Jig.