Teigha.DatabaseServices.Layout
Объект Layout хранит характеристики каждого листа.
Объекты Layout хранятся в объекте Dictionary с ключом ACAD_LAYOUT, что облегчает их перебор и индексирование.
Объект Layout хранит характеристики каждого листа.
Объекты Layout хранятся в объекте Dictionary с ключом ACAD_LAYOUT, что облегчает их перебор и индексирование.

Teigha.DatabaseServices.Layout.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.Layout.AddToLayoutDictionary(DatabaseServices.Database,DatabaseServices.ObjectId)
Этот метод добавляет лист в словарь листов указанной базы данных и определяет для использования запись таблицы блоков.
Этот метод добавляет лист в словарь листов указанной базы данных и определяет для использования запись таблицы блоков.
toWhichDatabase: База данных, в которую добавляется лист, тип Database.
blockTableRecordId: Идентификатор используемой записи в таблице блоков, тип ObjectId.

Teigha.DatabaseServices.Layout.AnnoAllVisible
Свойство обеспечивает доступ к текущему значению системной переменной ANNOALLVISIBLE для базы данных.
Свойство обеспечивает доступ к текущему значению системной переменной ANNOALLVISIBLE для базы данных.
Это функция запроса переменных заголовка базы данных.
Returns: Возвращает true, если отображаются все аннотативные объекты, и false, если отображаются только те аннотативные объекты, которые поддерживают текущий аннотативный масштаб.

Teigha.DatabaseServices.Layout.BlockTableRecordId
Получает доступ к ObjectId связанной с листом записи BlockTableRecord.
Получает доступ к ObjectId связанной с листом записи BlockTableRecord.  Соответствующие методы в BlockTableRecord реализуют прямой указатель на лист.
Returns: Возвращает ObjectId связанной с листом записи BlockTableRecord.

Teigha.DatabaseServices.Layout.Extents
Предоставляет доступ к текущей настройке границ листа.  Это значение может быть не фактическим размером геометрии на листе, а лишь последним сохраненным в листе значением.
Предоставляет доступ к текущей настройке границ листа.  Это значение может быть не фактическим размером геометрии на листе, а лишь последним сохраненным в листе значением.
Returns: Возвращает границы листа в виде объекта Extents3d.

Teigha.DatabaseServices.Layout.LayoutName
Обеспечивает доступ к имени листа, которое отображается на вкладке листа.
Обеспечивает доступ к имени листа, которое отображается на вкладке листа.
Returns: Возвращает отображаемое на вкладке имя листа, тип String.

Teigha.DatabaseServices.Layout.Limits
Обеспечивает доступ к лимитам листа.
Обеспечивает доступ к лимитам листа.
Returns: Возвращает лимиты листа в виде объекта Extents2d.

Teigha.DatabaseServices.Layout.TabOrder
Предоставляет доступ к полю, управляющему порядком отображения листов в элементе управления вкладками, которое располагается в нижней части видового экрана.
Предоставляет доступ к полю, управляющему порядком отображения листов в элементе управления вкладками, которое располагается в нижней части видового экрана.
Последовательность отображения на вкладках листов в базе данных должна быть уникальной.
Returns: Возвращает целочисленное значение, int.

Teigha.DatabaseServices.Layout.TabSelected
Включает/выключает доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок.
Включает/выключает доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок.
Для множественного выделения в пользовательском интерфейсе можно использовать клик мышью при нажатой клавише Shift.
Returns: Возвращает true, если включен доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок, и false в противном случае.

Teigha.DatabaseServices.Layout.Thumbnail
Предоставляет доступ к текущему буферу, в котором хранится растровая миниатюра данного листа.
Предоставляет доступ к текущему буферу, в котором хранится растровая миниатюра данного листа.
Returns: Возвращает/получает тип Bitmap.

Teigha.DatabaseServices.Layout.CurrentViewportId
Свойство предоставляет доступ к ObjectId активного видового экрана документа.
Свойство предоставляет доступ к ObjectId активного видового экрана документа.
Returns: Возвращает ObjectId активного видового экрана документа.