Teigha.DatabaseServices.AttributeDefinition.UpdateMTextAttributeDefinition
Метод позволяет обновить внутренний объект MText, который в базовых свойствах AttributeDefinition представляет определение многострочного атрибута.
Метод позволяет обновить внутренний объект MText, который в базовых свойствах AttributeDefinition представляет определение многострочного атрибута.