Teigha.DatabaseServices.DecomposeForSaveReplacementRecord
Структура DecomposeForSaveReplacementRecord инкапсулирует три выходных параметра, используемых методом Object.DecomposeForSave().
Структура DecomposeForSaveReplacementRecord инкапсулирует три выходных параметра, используемых методом Object.DecomposeForSave(). Эти значения относятся:
* к замещающему объекту, если он не является резидентом базы данных,
* к идентификатору замещающего объекта, если он является резидентом базы данных, и
* к флагу, который определяет, следует ли передавать расширенные данные XData замещающему объекту.

Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.#ctor(Teigha.DatabaseServices.ObjectId,System.Boolean)
Конструктор структуры DecomposeForSaveReplacementRecord.
Создает экземпляр структуры для замещающего объекта, который не является резидентом базы данных.
Конструктор структуры DecomposeForSaveReplacementRecord.
Создает экземпляр структуры для случая, когда замещающий объект не является резидентом базы данных.
replacement: Идентификатор замещающего объекта. Тип ObjectId.
exchangeXData: Входной флаг, который определяет, следует ли передавать расширенные данные XData замещающему объекту. Тип bool.

Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.#ctor(Teigha.DatabaseServices.DBObject,System.Boolean)
Конструктор структуры DecomposeForSaveReplacementRecord.
Создает экземпляр структуры для замещающего объекта, который является резидентом базы данных.
Конструктор структуры DecomposeForSaveReplacementRecord.
Создает экземпляр структуры для замещающего объекта, который является резидентом базы данных.
replacement: Идентификатор замещающего объекта. Тип DBObject.
exchangeXData: Входной флаг, который определяет, следует ли передавать расширенные данные XData замещающему объекту. Тип bool.

Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.ExchangeXData
Свойство ExchangeXData позволяет проверить, передаются ли XData замещающему объекту.
Свойство ExchangeXData позволяет проверить, передаются ли расширенные данные XData замещающему объекту.
Returns: Возвращает true, если расширенные данные XData передаются замещающему объекту.
В противном случае возвращает false.

Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementId
Свойство ReplacementId предоставляет идентификатор нерезидентного замещающего объекта.
Свойство ReplacementId предоставляет идентификатор нерезидентного замещающего объекта.
Returns: Возвращает идентификатор нерезидентного замещающего объекта.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DecomposeForSaveReplacementRecord.ReplacementObject
Свойство ReplacementObject предоставляет идентификатор резидентного замещающего объекта.
Свойство ReplacementObject предоставляет идентификатор резидентного замещающего объекта.
Returns: Возвращает идентификатор резидентного замещающего объекта.
Тип DBObject.