Teigha.DatabaseServices.MTextFragment.GetOverLinePoints
Метод возвращает массив из двух точек, определяющих линию надчёркивания текста, если таковая используется.
Метод возвращает массив из двух точек, определяющих линию надчёркивания текста, если таковая используется.
Returns: Возвращает массив из двух точек, которые определяют линию надчёркивания.
Тип Point3d[].