HostMgd.EditorInput.PromptDoubleResultEventHandler
Делегат уведомления в конце метода указания угла (GetAngle, GetDistance) класса Edit при успешном выполнении метода

HostMgd.EditorInput.PromptDoubleResultEventHandler
Делегат предназначен для обработки событий, связанных с завершением ввода
числового значения типа double, такого как угол или расстояние.
Делегат используется в .NET API nanoCAD для обработки событий, возникающих после завершения интерактивного ввода
пользователем числовых значений типа double. Он применяется в таких операциях, как GetAngle(), GetDistance() и другие,
где требуется ввод вещественного числа. Делегат принимает два параметра: источник события (sender) и объект PromptDoubleResultEventArgs,
содержащий результат ввода — значение угла или расстояния, а также статус выполнения (успех, отмена, ошибка).
Этот тип делегата часто используется при подписке на события, такие как PromptedForAngle, PromptedForDistance,
и других, связанных с числовым вводом.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий данные о результате ввода