Teigha.DatabaseServices.TextHorizontalMode
Перечисление TextHorizontalMode определяет типы горизонтального выравнивания текста.
Перечисление TextHorizontalMode определяет поддерживаемые типы горизонтального выравнивания текста.