Teigha.DatabaseServices.CellReference
Структура CellReference представляет текущую ячейку таблицы.
Структура CellReference представляет текущую ячейку таблицы.

Teigha.DatabaseServices.CellReference.Column
Свойство Column представляет столбец таблицы, в котором располагается текущая ячейка.
Свойство Column представляет столбец таблицы, в котором располагается текущая ячейка.
Returns: Возвращает индекс столбца с текущей ячейкой.
Тип int.

Teigha.DatabaseServices.CellReference.Row
Свойство Row представляет строку таблицы, в которой располагается текущая ячейка.
Свойство Row представляет строку таблицы, в которой располагается текущая ячейка.
Returns: Возвращает индекс строки с текущей ячейкой.
Тип int.