Teigha.DatabaseServices.GradientBackground
Класс представляет градиентный фон.
Класс представляет градиентный фон.

Teigha.DatabaseServices.GradientBackground.#ctor
Конструктор по умолчанию класса GradientBackground.
Конструктор по умолчанию класса GradientBackground.

Teigha.DatabaseServices.GradientBackground.ColorBottom
Свойство обеспечивает доступ к нижнему цвету градиентного фона.
Свойство обеспечивает доступ к нижнему цвету градиентного фона.
Returns: Возвращает нижний цвет градиента.  Тип Teigha.Colors.EntityColor.

Teigha.DatabaseServices.GradientBackground.ColorMiddle
Свойство обеспечивает доступ к среднему (промежуточному) цвету градиентного фона.
Свойство обеспечивает доступ к среднему (промежуточному) цвету градиентного фона.
Returns: Возвращает средний цвет градиента. Тип Teigha.Colors.EntityColor.

Teigha.DatabaseServices.GradientBackground.ColorTop
Свойство обеспечивает доступ к верхнему цвету градиентного фона.
Свойство обеспечивает доступ к верхнему цвету градиентного фона.
Returns: Возвращает верхний цвет градиента. Тип Teigha.Colors.EntityColor.

Teigha.DatabaseServices.GradientBackground.Height
Свойство предоставляет доступ к текущей высоте среднего (промежуточного) цвета, которая определяет его положение в трехцветном градиенте и выражается в процентах. Значению 0 соответствует двухцветный градиент с переходом от цвета ColorBottom к цвету ColorTop.
Свойство предоставляет доступ к текущей высоте среднего (промежуточного) цвета, которая определяет его положение в трехцветном градиенте и выражается в процентах. Значению 0 соответствует двухцветный градиент с переходом от цвета ColorBottom к цвету ColorTop.
Returns: Возвращает высоту в процентах среднего (промежуточного) цвета градиента. Тип double.

Teigha.DatabaseServices.GradientBackground.Horizon
Свойство обеспечивает доступ к значению горизонта в данном градиенте.
Свойство обеспечивает доступ к значению горизонта в данном градиенте, которое определяет начальную точку среднего цвета.
Returns: Возвращает значение горизонта. Тип double.

Teigha.DatabaseServices.GradientBackground.Rotation
Свойство обеспечивает доступ к углу поворота градиентного фона.
Свойство обеспечивает доступ к углу поворота градиентного фона относительно текущей ПСК.
Returns: Возвращает угол поворота градиентного фона.  Тип double.