Teigha.DatabaseServices.Assoc2dConstraintGroup
Класс Assoc2dConstraintGroup представляет совокупность геометрических и размерных зависимостей между подобъектами геометрических объектов.  Все связанные элементы геометрии должны лежать в одной плоскости.
Класс Assoc2dConstraintGroup представляет совокупность геометрических и размерных зависимостей, связывающих между собой подобъекты геометрических объектов.  Все участвующие элементы геометрии должны лежать в одной плоскости.
Объект Assoc2dConstraintGroup владеет ограничениями, производными от класса GeometricalConstraint, и «прокси»-объектами участвующей в ограничениях геометрии, которые унаследованы от класса ConstrainedGeometry.   Экземпляры класса ConstrainedGeometry часто представляют подобъекты геометрических объектов, а объект Assoc2dConstraintGroup владеет экземплярами класса AssocGeomDepedency, которые представляют в этих объектах геометрические зависимости.  Он также владеет экземплярами AssocValueDependency в объектах AssocVariables, которые представляют текущие значения размеров в размерных ограничениях (они описываются классами, производными от ExplicitConstraint).
Если размерное ограничение имеет графическое представление, например, в виде объекта Dimension, то объект ExplicitConstraint владеет также объектом AssocDependency, который в свою очередь владеет объектом, производным от AssocDimDependencyBody. Последний обеспечивает взаимодействие между объектом ExplicitConstraint, объектом AssocVariable, который сохраняет значение размерного ограничения, и объектом Dimension (или другим объектом), который отвечает за графическое представление размерного ограничения.
Метод evaluate() принимает текущие свойства участвующей геометрии и текущие значения переменных, на которые ссылаются объекты ExplicitConstraint. Затем он вызывает решатель ограничений, который находит такие новые положения и формы связанной зависимостями геометрии, чтобы удовлетворялись наложенные ограничения.  После этого задействованная геометрия обновляется, отражая новые положения и формы.  Вызов метода evaluate() может завершиться неудачей, если ему не удастся найти решение, удовлетворяющее всем наложенным ограничениям.

Teigha.DatabaseServices.Assoc2dConstraintGroup.#ctor(Teigha.Geometry.Plane)
Конструктор по умолчанию.
Конструктор по умолчанию.
plane: Плоскость вновь созданной группы ограничений. По умолчанию используется плоскость XY.

Teigha.DatabaseServices.Assoc2dConstraintGroup.DeleteConstrainedGeometry(Teigha.DatabaseServices.ObjectId)
Метод удаляет используемый группой ограничений объект ConstrainedGeometry, а также связанный с ним объект AssocGeomDependency.
Метод удаляет используемый группой ограничений объект ConstrainedGeometry, а также связанный с ним объект AssocGeomDependency.
geomDependencyId: Идентификатор удаляемого объекта. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.Assoc2dConstraintGroup.SolutionStatus(System.Boolean)
Метод позволяет получить статус решения, полученного для данной группы ограничений.
Метод позволяет получить статус решения, полученного для данной группы ограничений.
Как правило этот метод следует вызывать только после получения решения.
alsoCheckForConstraints: Входной флаг, указывающий, следует ли выполнить проверку ограничений. Значение по умолчанию — true.
Returns: Возвращает элемент перечисления SolutionStatusType.

Teigha.DatabaseServices.Assoc2dConstraintGroup.TransformActionBy(Teigha.Geometry.Matrix3d)
Метод применяет заданное геометрическое преобразование к рабочей плоскости данной группы ограничений.
Метод применяет заданное геометрическое преобразование к рабочей плоскости данной группы ограничений.
Геометрические зависимости сохраняются, если преобразование ограничивается параллельным переносом и вращением.
Если матрица преобразования предполагает равномерное масштабирование, будут удалены все узлы ExplicitConstraint.
В случае преобразования общего вида будут удалены все узлы GeometricalConstraint.
transform: Входная матрица геометрического преобразования. Тип Geometry.Matrix3d.

Teigha.DatabaseServices.Assoc2dConstraintGroup.GetDOF
Свойство позволяет получить число степеней свободы (DOF) данной группы ограничений.
Свойство позволяет получить число степеней свободы (DOF) данной группы ограничений.
Это число включает в себя позиционные степени свободы корректно заданной модели.
Returns: Возвращает количество степеней свободы. Тип int.

Teigha.DatabaseServices.Assoc2dConstraintGroup.WorkPlane
Свойство предоставляет доступ к рабочей плоскости данной группы ограничений.
Свойство предоставляет доступ к рабочей плоскости данной группы ограничений.
Returns: Возвращает рабочую плоскость данной группы ограничений. Тип Teigha.Geometry.Plane.