HostMgd.PlottingServices.CustomSizeResults.PC3FileReadOnly
Значение: 64 (0x40).
Файл PC3 доступен только для чтения.
Пользовательские размеры бумаги доступны только при условии создания временного PC3-файла.