Teigha.DatabaseServices.AssocArrayParameters
Класс предоставляет интерфейс для управления параметрами ассоциативного массива.
Класс предоставляет интерфейс для управления параметрами ассоциативного массива.
Производные от него классы реализуют логику для геометрических преобразований элементов массива, а также манипуляций с ручками.
Объект AssocArray владеет объектом этого класса, используя его методы для вычисления всего массива.

Teigha.DatabaseServices.AssocArrayParameters.Owner
Свойство обеспечивает доступ к владельцу данного объекта AssocArrayParameters (т.е. к объекту AssocArray).
Свойство обеспечивает доступ к владельцу данного объекта AssocArrayParameters (т.е. к объекту AssocArray).
Returns: Возвращает объект AssocArray.