Teigha.Editor.CommandContext
Класс CommandContext предоставляет пользовательским командам интерфейс для операций ввода-вывода и доступа к базе данных во время выполнения команды.
Класс CommandContext предоставляет пользовательским командам интерфейс для операций ввода-вывода и доступа к базе данных во время выполнения команды.
Notes
Клиентские приложения, вызывающие пользовательские команды, должны использовать экземпляр этого класса (или его подкласса) для вызова метода OdEdCommandStack.executeCommand.
Использование этого класса вместо собственно экземпляра OdEdCommandContext предоставляет пользовательским командам доступ к базе данных.

Teigha.Editor.CommandContext.#ctor
Конструктор по умолчанию класса CommandContext.
Конструктор по умолчанию класса CommandContext.