HostMgd.EditorInput.DraggingEndedEventArgs
Класс предоставляет данные о завершении операции перетаскивания,
включая её статус и конечную позицию.
Класс является наследником EventArgs и используется для передачи контекстной информации
при возникновении события DraggingEnded, которое происходит после окончания операции
перетаскивания объекта. Он содержит сведения о том, как завершилась операция — успешно,
отменено пользователем или с ошибкой, а также координаты точки завершения перетаскивания.
Этот класс применяется совместно с делегатом DraggingEndedEventHandler.
Notes
Данный класс предоставляет расширенные данные о событии,
что позволяет разработчику реагировать на результат
перетаскивания в зависимости от его исхода.
Example
C#

HostMgd.EditorInput.DraggingEndedEventArgs.Offset
Свойство предоставляет вектор смещения, применённый к объекту в процессе операции перетаскивания.
Свойство возвращает значение типа Vector3d, представляющее собой смещение
(разницу между начальной и конечной точками перемещения) объекта в мировой системе координат (WCS).
Оно используется для определения направления и величины перемещения при завершении операции перетаскивания.
Это позволяет разработчикам корректно обновить положение объекта в чертеже
или выполнить дополнительные вычисления на основе его нового положения.
Returns: Возвращает объект типа Vector3d, содержащий значения смещения по осям X, Y и Z.
Если операция перетаскивания не была выполнена или смещение отсутствует,
возвращается нулевой вектор (Vector3d.Zero).
Example
C#

HostMgd.EditorInput.DraggingEndedEventArgs.PickPoint
Свойство предоставляет начальную точку, в которой была начата операция перетаскивания.
Свойство возвращает координаты точки в мировой системе координат (WCS),
где пользователь начал операцию перетаскивания.
Оно используется для определения исходного положения объекта или как базовая точка
при расчёте смещения. Это значение особенно полезно при обработке событий
после завершения перетаскивания — например, для вычисления перемещения
или изменения состояния объекта на основе начальной и конечной позиции.
Returns: Возвращает объект типа Point3d, представляющий трёхмерные координаты
точки начала перетаскивания в мировой системе координат (WCS).
Если точка не была зафиксирована (например, операция прервана до начала),
возвращается недопустимая точка или значение по умолчанию.
Example
C#

HostMgd.EditorInput.DraggingEndedEventArgs.Status
Свойство возвращает статус завершения операции перетаскивания,
указывая на успешное выполнение, отмену или ошибку.
Свойство используется для получения информации о результате завершения
операции перетаскивания. Оно возвращает значение из перечисления PromptStatus,
которое может быть OK, Cancel, Error и другими — в зависимости от того,
как была завершена операция. Это позволяет разработчику обрабатывать
различные сценарии окончания перетаскивания и реагировать на них соответствующим образом,
например, сохранять новое положение объекта при успешном завершении
или отменять изменения, если операция была прервана.
Returns: Возвращает значение типа PromptStatus, представляющее статус завершения операции перетаскивания. Возможные значения:
* PromptStatus.OK — операция успешно завершена.
* PromptStatus.Cancel — пользователь отменил операцию.
* PromptStatus.Error — произошла ошибка во время операции.
Другие специфичные статусы, в зависимости от реализации nanoCAD.
Example
C#