Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Reset
Этот метод сбрасывает позицию указателя перечислителя в начальное положение.
Метод Reset() сбрасывает позицию указателя перечислителя в начальное положение.