Teigha.DatabaseServices.BlockBegin
Класс представляет объекты BlockBegin в базе данных.
Класс представляет объекты BlockBegin в базе данных.
Эти объекты создаются и обрабатываются автоматически для каждой записи BlockTableRecord и не имеют связанной с ними геометрии.
Клиентские приложения могут свободно добавлять к объектам BlockBegin расширенные данные (xdata) или словари расширений, но не должны создавать или удалять их. Не следует создавать классы, производные от класса BlockBegin.

Teigha.DatabaseServices.BlockBegin.#ctor
Конструктор по умолчанию класса BlockBegin.
Конструктор по умолчанию класса BlockBegin.