Teigha.DatabaseServices.MentalRayRenderSettings
Класс MentalRayRenderSettings является классом-контейнером для свойств, связанных с рендерерами Mental Ray.
Класс MentalRayRenderSettings является классом-контейнером для свойств, связанных с рендерерами Mental Ray.

Teigha.DatabaseServices.MentalRayRenderSettings.#ctor
Конструктор по умолчанию класса MentalRayRenderSettings.
Конструктор по умолчанию класса MentalRayRenderSettings.

Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticBSPMode
Свойство DiagnosticBSPMode представляет используемый режим диагностики BSP.
Свойство DiagnosticBSPMode представляет используемый режим диагностики BSP (Binary Space Partitioning).
Returns: Возвращает значение из перечисления GraphicsInterface.DiagnosticBSPMode.

Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticGridMode
Свойство DiagnosticGridMode представляет параметры диагностической сетки.
Свойство DiagnosticGridMode представляет параметры диагностической сетки.
Returns: Возвращает параметры диагностической сетки.
Тип MentalRayRenderSettingsTraitsDiagnosticGridModeParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticMode
Свойство DiagnosticMode представляет текущий режим диагностической визуализации.
Свойство DiagnosticMode представляет текущий режим диагностической визуализации.
Returns: Возвращает режим диагностической визуализации.
Значение из перечисления GraphicsInterface.DiagnosticMode.

Teigha.DatabaseServices.MentalRayRenderSettings.DiagnosticPhotonMode
Свойство DiagnosticPhotonMode представляет используемый режим фотонной диагностики.
Свойство DiagnosticPhotonMode представляет используемый режим фотонной диагностики.
Returns: Возвращает режим фотонной диагностики как значение из перечисления GraphicsInterface.DiagnosticPhotonMode.

Teigha.DatabaseServices.MentalRayRenderSettings.EnergyMultiplier
Свойство EnergyMultiplier представляет энергетический множитель для управления величиной непрямого освещения.
Свойство EnergyMultiplier представляет текущее значение энергетического множителя для управления величиной непрямого освещения.
Returns: Возвращает текущее значение энергетического множителя.
Тип float.

Teigha.DatabaseServices.MentalRayRenderSettings.ExportMIEnabled
Свойство ExportMIEnabled позволяет определить, следует ли экспортировать файл MI после рендеринга изображения.
Свойство ExportMIEnabled позволяет определить, следует ли экспортировать файл MI после рендеринга изображения.
Returns: Возвращает true, если требуется экспортировать файл MI.
В противном случае возвращает false.

Teigha.DatabaseServices.MentalRayRenderSettings.ExportMIFileName
Свойство ExportMIFileName представляет используемое имя MI-файла.
Свойство ExportMIFileName представляет используемое имя MI-файла.
Returns: Возвращает имя MI-файла. Тип String.

Teigha.DatabaseServices.MentalRayRenderSettings.FGRayCount
Свойство FGRayCount представляет количество лучей, испускаемых из каждой точки в режиме финальной сборки.
Свойство FGRayCount представляет количество лучей, испускаемых из каждой точки в режиме финальной сборки (final gather).
Returns: Возвращает количество лучей, испускаемых из каждой точки в режиме финальной сборки.
Тип int.

Teigha.DatabaseServices.MentalRayRenderSettings.FGSampleRadius
Свойство FGSampleRadius представляет минимальный и максимальный радиусы выборки финальной сборки.
Свойство FGSampleRadius представляет минимальный и максимальный радиусы выборки финальной сборки.
Returns: Возвращает минимальный и максимальный радиусы выборки финальной сборки.
Тип MentalRayRenderSettingsTraitsDoubleRangeParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.FGSampleRadiusState
Свойство FGSampleRadiusState позволяет определить, следует ли использовать заданные пользователем минимальный и максимальный радиусы финальной сборки.
Свойство FGSampleRadiusState позволяет определить, следует ли использовать заданные пользователем минимальный и максимальный радиусы финальной сборки.
Returns: Возвращает значение логического параметра в настройках Mental Ray.
Тип MentalRayRenderSettingsTraitsBoolParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.FinalGatheringEnabled
Свойство FinalGatheringEnabled позволяет определить, включен ли режим финальной сборки.
Свойство FinalGatheringEnabled позволяет определить, включен ли режим финальной сборки.
Returns: Возвращает true, если режим финальной сборки активен.
В противном случае возвращает false.

Teigha.DatabaseServices.MentalRayRenderSettings.FinalGatheringMode
Свойство FinalGatheringMode представляет текущий режим финальной сборки. Не реализовано.
Свойство FinalGatheringMode представляет текущий режим финальной сборки.
В текущей версии данное свойство не реализовано.
Returns: Возвращает режим финальной сборки.
Тип GraphicsInterface.FinalGatheringMode.

Teigha.DatabaseServices.MentalRayRenderSettings.GIPhotonsPerLight
Свойство GIPhotonsPerLight представляет среднее количество фотонов, испускаемых каждым источником света в режиме Global Illumination.
Свойство GIPhotonsPerLight представляет среднее количество фотонов, испускаемых каждым источником света в режиме глобального освещения (Global Illumination).
Returns: Возвращает среднее количество фотонов, испускаемых каждым источником света в режиме GI.
Тип int.

Teigha.DatabaseServices.MentalRayRenderSettings.GISampleCount
Свойство GISampleCount представляет максимальное количество фотонов в области точки выборки рендеринга, которые используются при расчете глобального освещения.
Свойство GISampleCount представляет максимальное количество фотонов в области точки выборки рендеринга, которые используются при расчете глобального освещения.
Returns: Возвращает максимальное количество фотонов в области точки выборки рендеринга.
Тип int.

Teigha.DatabaseServices.MentalRayRenderSettings.GISampleRadius
Свойство GISampleRadius представляет радиус области выборки для испускания фотонов в режиме глобального освещения.
Свойство GISampleRadius представляет радиус области выборки для испускания фотонов в режиме глобального освещения.
Returns: Возвращает радиус области выборки.
Тип double.

Teigha.DatabaseServices.MentalRayRenderSettings.GISampleRadiusEnabled
Свойство GISampleRadiusEnabled позволяет определить, следует ли использовать заданный пользователем радиус фотона.
Свойство GISampleRadiusEnabled позволяет определить, следует ли использовать заданный пользователем радиус фотона.
Returns: Возвращает true, если следует использовать заданный пользователем радиус фотона.
В противном случае возвращает false.

Teigha.DatabaseServices.MentalRayRenderSettings.GlobalIlluminationEnabled
Свойство GlobalIlluminationEnabled позволяет определить, следует ли включать расчет глобального освещения.
Свойство GlobalIlluminationEnabled позволяет определить, следует ли включать расчет эффектов глобального освещения (например, цветовое смешение).
Returns: Возвращает true, если режим расчета глобального освещения включен.
В противном случае возвращает false.

Teigha.DatabaseServices.MentalRayRenderSettings.LightLuminanceScale
Свойство LightLuminanceScale представляет физическую яркость света с интенсивностью 1.0 (в канделах).
Не реализовано.
Свойство LightLuminanceScale представляет физическую яркость света с интенсивностью 1.0 (в канделах).
В текущей версии это свойство не реализовано.
Returns: Возвращает физическую яркость света с единичной интенсивностью в канделах.
Тип double.

Teigha.DatabaseServices.MentalRayRenderSettings.MemoryLimit
Свойство MemoryLimit представляет максимальный объем памяти, который может быть выделен для рендеринга.
Свойство MemoryLimit представляет максимальный объем памяти, который может быть выделен для рендеринга.
Returns: Возвращает максимальный объем памяти, доступный для рендеринга.
Тип int.

Teigha.DatabaseServices.MentalRayRenderSettings.PhotonTraceDepth
Свойство PhotonTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке фотонов.
Свойство PhotonTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке фотонов.
Параметр MentalRayRenderSettingsTraitsTraceParameter хранит значения
для максимальных уровней рекурсии фотонов отражения, фотонов преломления,
а также суммарно фотонов отражения и преломления.
Returns: Возвращает максимальную глубину (уровень рекурсии) при трассировке фотонов.
Тип MentalRayRenderSettingsTraitsTraceParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.RayTraceDepth
Свойство RayTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке лучей.
Свойство RayTraceDepth представляет максимальную глубину (уровень рекурсии) при трассировке лучей.
Параметр MentalRayRenderSettingsTraitsTraceParameter хранит значения
для максимальных уровней рекурсии отраженных лучей, преломленных лучей,
а также суммарно отраженных и преломленных лучей.
Returns: Возвращает максимальную глубину (уровень рекурсии) при трассировке лучей.
Тип MentalRayRenderSettingsTraitsTraceParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.RayTracingEnabled
Свойство RayTracingEnabled позволяет определить, включена ли трассировка лучей.
Свойство RayTracingEnabled позволяет определить, включена ли трассировка лучей.
Returns: Возвращает true, если трассировка лучей включена.
В противном случае возвращает false.

Teigha.DatabaseServices.MentalRayRenderSettings.Sampling
Свойство Sampling представляет минимальный и максимальный размеры выборки для оценки затенения пикселей при рендеринге.
Свойство Sampling представляет минимальный и максимальный размеры выборки для оценки затенения пикселей при рендеринге.
Параметр MentalRayRenderSettingsTraitsIntegerRangeParameter представляет значения в диапазоне [-3..5].
Значение -3 соответствует размеру выборки 1 на каждые 64 пикселя (1/64), а значение 5 соответствует размеру выборки 1024 на один пиксель.
Returns: Возвращает минимальный и максимальный размеры выборки для оценки затенения пикселей.
Тип MentalRayRenderSettingsTraitsIntegerRangeParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.SamplingContrastColor
Свойство SamplingContrastColor представляет пороговые нижние границы отсечения для цветовых каналов, ниже которых выборочные значения игнорируются.
Свойство SamplingContrastColor представляет пороговые нижние границы отсечения для цветовых каналов, ниже которых выборочные значения игнорируются.
Параметр MentalRayRenderSettingsTraitsFloatParameter хранит значения красного, зеленого, синего и альфа-каналов в диапазоне [0..1].
Returns: Возвращает пороговые нижние границы отсечения для цветовых каналов.
Тип MentalRayRenderSettingsTraitsFloatParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.SamplingFilter
Свойство SamplingFilter представляет параметры фильтрации для слияния нескольких выборочных значений в общий цвет пикселя.
Свойство SamplingFilter представляет параметры фильтрации для слияния нескольких выборочных значений в общий цвет пикселя.
Параметр MentalRayRenderSettingsTraitsSamplingParameter хранит следующие данные:
* Метод фильтрации для слияния нескольких выборочных значений в общий цвет пикселя;
* Ширина области фильтра для группы соседних пикселей в диапазоне [0..8];
* Высота области фильтра для группы соседних пикселей в диапазоне [0..8].
Returns: Возвращает параметры фильтрации.
Тип MentalRayRenderSettingsTraitsSamplingParameter.

Teigha.DatabaseServices.MentalRayRenderSettings.ShadowMapsEnabled
Свойство ShadowMapsEnabled позволяет определить, следует ли активировать теневые карты.
Свойство ShadowMapsEnabled позволяет определить, следует ли активировать теневые карты.
Влияет только на источники света, использующие теневые карты.
Returns: Возвращает true, если использование теневых карт включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MentalRayRenderSettings.ShadowMode
Свойство ShadowMode представляет используемый метод вычисления теней методом трассировки лучей.
Свойство ShadowMode представляет используемый метод вычисления теней методом трассировки лучей.
Влияет только на источники света, использующие расчет теней методом трассировки лучей.
Returns: Возвращает метод вычисления теней методом трассировки лучей.
Значение из перечисления GraphicsInterface.ShadowMode.

Teigha.DatabaseServices.MentalRayRenderSettings.ShadowSamplingMultiplier
Свойство ShadowSamplingMultiplier представляет текущее значение множителя выборки для теней.
Не реализовано.
Свойство ShadowSamplingMultiplier представляет текущее значение множителя выборки для теней.
В текущей версии это свойство не реализовано.
Returns: Возвращает значение множителя выборки для теней.
Перечисление DatabaseServices.ShadowSamplingMultiplier.

Teigha.DatabaseServices.MentalRayRenderSettings.TileOrder
Свойство TileOrder представляет порядок тайлинга (укладки) фрагментов изображения при рендеринге.
Свойство TileOrder представляет порядок тайлинга (укладки) фрагментов изображения при рендеринге.
Returns: Возвращает порядок тайлинга фрагментов изображения при рендеринге.
Значение из перечисления GraphicsInterface.TileOrder.

Teigha.DatabaseServices.MentalRayRenderSettings.TileSize
Свойство TileSize представляет размер фрагментов при тайлинге изображения в процессе рендеринга.
Свойство TileSize представляет размер фрагментов при тайлинге изображения в процессе рендеринга.
Малые значения увеличивают длительность рендеринга, но обеспечивают более частые обновления в процессе рендеринга.
Значения TileSize должны находиться в диапазоне [4..512].
Returns: Возвращает размер фрагментов при тайлинге в процессе рендеринга.
Тип int.