HostMgd.ApplicationServices.InplaceTextEditorSettings.EditFlags.SelectAll
Значение: 2. Вызов текстового редактора с этим флагом предписывает изначальное выделение всего редактируемого текста.
Если флаг SelectAll установлен, то состояние флага CursorAtEnd игнорируется.