Teigha.DatabaseServices.FileOpenMode.OpenForReadAndWriteNoShare
Значение: 2.
Файл открывается на чтение и запись, но совместный доступ к файлу не разрешается.
Использование метода Database.ReadDwgFile() в этом режиме исключает возможность выполнять операции чтения и записи в файл другими приложениями.
Вызов метода Database.ReadDwgFile() в этом режиме завершается ошибкой, если на этот момент файл уже открыт каким-либо другим приложением, либо доступ к файлу разрешен только на чтение.