Teigha.DatabaseServices.Leader
Класс Leader представляет типовой геометрический объект
"выноска".
Класс Leader представляет типовой геометрический объект
"выноска". Эти выноски следует отличать от выноск, доступных
для создания пользователю nanoCAD, которые являются объектами
библиотеки MultiCAD API. Выноски класса Leader воспринимаются
в большинстве CAD-систем как стандартный объект "выноска", в
то время как выноски MultiCAD API, при открытии в сторонних
CAD-системах, часто преобразуются в прокси-объекты.
Данные выноски считаются объектами, аналогичными размерам в
nanoCAD, что означает, что они контролируются установками
переменных размеров и размерными стилями.
Данный класс содержит динамический массив точек, которые
являются вершинами линии выноски. Первая точка массива
является точкой начала выноски. Если выноска имеет наконечник
в виде стрелки, то он располагается в этой точке. Если длина
первого сегмента выноски меньше, чем двойной размер стрелки,
стрелка подавляется. Если выноска имеет ассоциированный
аннотационный объект, последняя точка выноски располагается
около него.
По умолчанию выноска состоит из сегментов прямых линий, но
она может быть установлена соответствующей сплайну с этими же
вершинами.
Для обновления положения конечной точки выноски, относящейся
к соответствующей аннотации, используйте метод
EvaluateLeader().
Note
Данный класс переопределяет метод
Entity.SubSetDatabaseDefaults(), чтобы установить размерный
стиль объекта к текущему стилю базы данных. Обычно объекты
класса инициализируются с помощью вызова метода
SetDatabaseDefaults() , следующему за вызовом
SetDimstyleData(), используя данные, полученные при вызове
метода DatabaseGetDimstyleData().
Если выноска ассоциирована с аннотационным объектом, конечная
точка выноски располагается так, чтобы присоединить
аннотацию, поэтому заданная конечная точка массива
игнорируется. Вы можете также заставить использовать
указанную точку с помощью метода Leader.EvaluateLeader().

Teigha.DatabaseServices.Leader.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Leader.AppendVertex(Teigha.Geometry.Point3d)
Добавляет вершину в конец списка вершин для выноски. Если
вершина не находится в плоскости выноски, то она
проектируется параллельно вектору нормали на эту плоскость и
эта проекция добавляется в конец списка вершин. Если новая
вершина слишком близко к предыдущей (не дальше чем 1.е-10 по
осям X, Y и Z), новая точка не появляется.
Метод возвращает true, если вершина успешно добавлена и false
в противном случае.
Note
Эта функция сбрасывает установленную ассоциативность.
pointToAdd: Точка (в WCS координатах) для добавления вершины

Teigha.DatabaseServices.Leader.SetDimstyleData(Teigha.DatabaseServices.DimStyleTableRecord)
Устанавливает, что выноска использует размерный стиль (и
переопределяет размер, связанный с ним), заданный в параметре
style.
style: Id объекта требуемого размерного стиля

Teigha.DatabaseServices.Leader.SetPlane(Teigha.Geometry.Plane)
Задает плоскость, которая содержит выноску. Элементы данных
выноски будут изменены для того, чтобы отражать это изменение
плоскости. Чтобы выполнить эти действия, будет создана
матрица преобразования для преобразования всех точек из
текущей координатной системы плоскости в систему координат
новой плоскости — проекция не используется.
Note
Метод сбрасывает установленные ассоциативности.

Teigha.DatabaseServices.Leader.SetVertexAt(System.Int32,Teigha.Geometry.Point3d)
Переустанавливает вершину с индексом index в точку
pointValue, проецированную (вдоль вектора нормали плоскости)
на плоскость, содержащую выноску. Метод не переустанавливает
вершину, если один из сегментов объекта станет слишком
маленьким (меньше 1e-10).
Возвращает true, если новая вершина успешно задана. В
противном случае возвращает false.
index: Индекс вершины (начинающийся с 0), которая
pointValue: Значение новой точки (в WCS координатах)

Teigha.DatabaseServices.Leader.VertexAt(System.Int32)
Возвращает Point3d, содержащую положение вершины с индексом
(начинающимся с 0), указанным в параметре value массива
вершин выноски.
value: Значение индекса (начинающееся с 0) требуемой вершины

Teigha.DatabaseServices.Leader.AnnoHeight
Возвращает высоту аннотации.
Если аннотация имеет тип MText (мультитекст), то возвращаемое
значение является действительной высотой текста. Если
аннотация имеет тип FeatureControlFrame, то возвращаемое
значение представляет высоту ограничивающего прямоугольника.
Для остальных типов аннотации возвращается значение 0.0.

Teigha.DatabaseServices.Leader.Annotation
Устанавливает или возвращает Id аннотации выноски.

Teigha.DatabaseServices.Leader.AnnoWidth
Возвращает ширину аннотации.
Если аннотация имеет тип MText, то возвращаемое значение
является действительной шириной текста. Если аннотация имеет
тип FeatureControlFrame, то возвращаемое значение представляет
ширину ограничивающего прямоугольника. Для остальных типов
аннотации возвращается значение 0.0.

Teigha.DatabaseServices.Leader.AnnoType
Возвращает тип аннотации выноски.

Teigha.DatabaseServices.Leader.Dimasz
Возвращает или устанавливает текущее значение DIMASZ для
выноски. Если значение переопределено для объекта, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMASZ смотрите секцию
"Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.Dimclrd
Возвращает или устанавливает текущее значение DIMCLRD для
выноски. Если значение переопределено для объекта, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMCLRD смотрите секцию
"Системные переменные" Руководства по командам nanoCAD.
Note
Вы можете использовать метод Color.ColorIndex() для получения
индекса цвета nanoCAD из возвращенного объекта Color.

Teigha.DatabaseServices.Leader.DimensionStyle
Возвращает или устанавливает Id объекта размерного стиля, на
который ссылается выноска.

Teigha.DatabaseServices.Leader.DimensionStyleName
Возвращает или устанавливает ассоциированное имя размерного
стиля.

Teigha.DatabaseServices.Leader.Dimgap
Возвращает или устанавливает текущее значение DIMGAP для
выноски. Если значение переопределено для объекта, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMGAP смотрите секцию
"Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.Dimldrblk
Возвращает или устанавливает Id ссылки блока, которая
представляет собой текущее значение DIMLDRBLK для выноски.
Если значение переопределено для объекта, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMLDRBLK смотрите
секцию "Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.Dimlwd
Возвращает или устанавливает текущее значение DIMLWD для
выноски. Если значение переопределено для объекта, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMLWD смотрите секцию
"Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.Dimsah
Возвращает или устанавливает текущее значение DIMSAH для
выноски. Если значение переопределено для выноски, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMSAH смотрите секцию
"Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.Dimscale
Возвращает или устанавливает текущее значение DIMSCALE для
выноски. Если значение переопределено для выноски, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMSCALE смотрите
секцию "Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.Dimtad
Возвращает или устанавливает текущее значение DIMTAD для
выноски. Если значение переопределено для выноски, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMTAD смотрите секцию
"Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.Dimtxt
Возвращает или устанавливает текущее значение DIMTXT для
выноски. Если значение переопределено для выноски, то это
переопределенное значение возвращается. В противном случае
возвращается значение из размерности размерного стиля. Для
получения дополнительной информации о DIMTXT смотрите секцию
"Системные переменные" Руководства по командам nanoCAD.

Teigha.DatabaseServices.Leader.FirstVertex
Возвращает стартовую точку выноски в WCS координатах. Эта
точка будет началом стрелки, если она доступна.

Teigha.DatabaseServices.Leader.HasArrowHead
Возвращает или устанавливает признак того, используется ли
стрелка для данной выноски.

Teigha.DatabaseServices.Leader.HasHookLine
Возвращает признак того, используется ли "полка" в выноске.
"Полка" представляет собой маленькую горизонтальную линию в
конце линии выноски сразу перед аннотацией.

Teigha.DatabaseServices.Leader.IsSplined
Возвращает признак того, является ли выноска сглаженной
сплайном.

Teigha.DatabaseServices.Leader.LastVertex
Возвращает последнюю точку выноски в WCS координатах. Эта
точка будет в конце выноски, где к ней присоединяется
аннотация. Заметим, что это может быть значение, отличное от
того, которое установлено для вершины, если связанная с
объектом аннотация была изменена.

Teigha.DatabaseServices.Leader.Normal
Возвращает единичный нормальный вектор выноски.

Teigha.DatabaseServices.Leader.NumVertices
Возвращает количество вершин выноски.