Teigha.BoundaryRepresentation.BrepShellCollection
Класс BrepShellCollection представляет коллекцию оболочек, соответствующих граничному представлению.
Класс BrepShellCollection представляет коллекцию оболочек, соответствующих граничному представлению.