Teigha.DatabaseServices.DxfCode.TxtStylePSize
Значение: 42.
Горизонтальная ширина символов многострочного текста.
Это значение всегда будет равно или меньше значения группового кода 41 (только для чтения, игнорируется, если оно указано).