Teigha.BoundaryRepresentation.BrepComplexCollection
Класс BrepComplexCollection представляет набор комплексов, соответствующих граничному представлению.
Класс BrepComplexCollection представляет набор комплексов, соответствующих граничному представлению.