HostMgd.EditorInput
Пространство имён предоставляет классы и события для обработки пользовательского ввода в nanoCAD,
такие как выбор объектов, ввод точек, углов, чисел и текста.
Пространство имён содержит типы, предназначенные для взаимодействия с интерактивным вводом пользователя
через редактор nanoCAD. Оно предоставляет функционал для получения данных о мыши, клавиатуре,
выборе геометрических объектов, подобъектов, а также управления командами ввода —
такими как GetPoint, GetEntity, GetString, GetAngle и другие.
Пространство включает классы для работы с событиями ввода (DraggingEventArgs, PromptForEntityEndingEventArgs, PointMonitorEventArgs и др.),
делегаты и обработчики, позволяющие отслеживать и модифицировать действия пользователя
в реальном времени.
Это пространство имён используется разработчиками надстроек и плагинов для расширения функциональности nanoCAD,
реализации пользовательских команд, реакции на события выбора и перемещения,
а также для создания интерактивных операций перетаскивания, фильтрации точек и привязок.