Teigha.DatabaseServices.HatchLoopTypes.External
Значение: 1.
Контур, состоящий из внешних объектов (производных от Entity и принадлежащих базе данных документа).
Штриховка может быть ассоциативно связана с этими объектами.