Teigha.Geometry.Scale3d.ToString
Метод предоставляет эквивалентное строковое представление данного объекта.
Метод предоставляет эквивалентное строковое представление данного объекта.
Возвращаемая строка содержит компоненты вектора масштабирования.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.