Teigha.DatabaseServices.CellEdgeMasks
Перечисление CellEdgeMasks определяет индексы расположения границы ячейки таблицы.
Перечисление CellEdgeMasks определяет индексы расположения границы ячейки (слева, справа, сверху, снизу).