Teigha.DatabaseServices.Spline.UpdateFitData
Метод обновляет данные аппроксимации сплайна.
Метод обновляет данные аппроксимации сплайна.
Если допуск аппроксимации равен нулю, то сплайн перестраивается; в противном случае данные аппроксимации удаляются.