HostMgd.ApplicationServices.LongTransactionManager.CheckingOut
Событие CheckingOut возникает перед началом выгрузки объектов в длительную транзакцию (операция CheckOut).
В текущей версии не реализовано.
Событие CheckingOut возникает перед началом выгрузки объектов в длительную транзакцию (операция CheckOut).
Позволяет выполнить предварительную обработку или отменить операцию.
В текущей версии не реализовано.