HostMgd.EditorInput.PickPointDescriptor
Структура описывает форму точки выбора.

HostMgd.EditorInput.PickPointDescriptor.==(HostMgd.EditorInput.PickPointDescriptor,HostMgd.EditorInput.PickPointDescriptor)
Возвращает true, если а равно b.
a: Левый операнд
b: Правый операнд

HostMgd.EditorInput.PickPointDescriptor.Direction
Возвращает вектор, который описывает направление линии или
направление и длину для луча и отрезка линии.

HostMgd.EditorInput.PickPointDescriptor.Equals(System.Object)
Возвращает true, если объект идентичен объекту, являющемуся
параметром метода.

HostMgd.EditorInput.PickPointDescriptor.IsEqualTo(HostMgd.EditorInput.PickPointDescriptor)
Этот метод сравнивает свойства PointOnLine (базовая точка) и
Direction (направление) объекта a, являющегося параметром
метода, с такими же свойствами данного объекта с допуском
Global.
a: Объект для сравнения

HostMgd.EditorInput.PickPointDescriptor.IsEqualTo(HostMgd.EditorInput.PickPointDescriptor,Teigha.Geometry.Tolerance)
Этот метод сравнивает свойства PointOnLine (базовая точка) и
Direction (направление) объекта a, являющегося параметром
метода, с такими же свойствами данного объекта с допуском,
заданным параметром метода.
a: Объект для сравнения
tolerance: Значение допуска

HostMgd.EditorInput.PickPointDescriptor.Kind
Возвращает общую "форму" точки выбора.

HostMgd.EditorInput.PickPointDescriptor.#ctor(HostMgd.EditorInput.PickPointKind,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор.
kind: Тип базовой точки.
pointOnLine: Указатель на линию.
direction: Направление указателя.

HostMgd.EditorInput.PickPointDescriptor.PointOnLine
Возвращает точку линии, луча или отрезка, которая
представляет точку выбора. Для луча или отрезка это
первая точка.