Teigha.DatabaseServices.MLeader
Класс MLeader представляет объект мультивыноски.
Класс MLeader представляет объект мультивыноски.

Teigha.DatabaseServices.MLeader.#ctor
Конструктор по умолчанию класса MLeader.
Конструктор по умолчанию класса MLeader.

Teigha.DatabaseServices.MLeader.AddFirstVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет вставить новую первую вершину в указанную линию выноски.
Метод позволяет вставить новую первую вершину в линию выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски, в которую будет добавлена вершина. Тип int.
point: Точка, определяющая положение новой вершины. Тип Point3d.

Teigha.DatabaseServices.MLeader.AddLastVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет добавить новую последнюю вершину в указанную линию выноски.
Метод позволяет добавить новую последнюю вершину в линию выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски, в которую будет добавлена вершина. Тип int.
point: Точка, определяющая положение новой вершины. Тип Point3d.

Teigha.DatabaseServices.MLeader.AddLeaderLine(System.Int32)
Добавляет линию выноски в кластер выноски с указанным индексом.
Добавляет линию выноски в кластер выноски с указанным индексом.
leaderIndex: Индекс кластера выноски. Тип int.
Returns: Возвращает индекс добавленной линии выноски. Тип int.

Teigha.DatabaseServices.MLeader.AddLeaderLine(Teigha.Geometry.Point3d)
Метод позволяет добавить к данному объекту MLeader новую линию выноски с началом в указанной точке.
Метод позволяет добавить к данному объекту MLeader новую линию выноски с началом в указанной точке.
point: Первая точка новой линии выноски. Тип Point3d.
Returns: Возвращает индекс добавленной линии выноски. Тип int.

Teigha.DatabaseServices.MLeader.ConnectionPoint(Teigha.Geometry.Vector3d)
Метод возвращает точку присоединения этой мультивыноски в указанном направлении.
Метод возвращает точку присоединения этой мультивыноски в указанном направлении.
direction: Направление для искомой точки. Тип Vector3d.
Returns: Возвращает точку присоединения. Тип Point3d.

Teigha.DatabaseServices.MLeader.ConnectionPoint(Teigha.Geometry.Vector3d,Teigha.DatabaseServices.TextAttachmentDirection)
Метод возвращает точку присоединения линии выноски в заданном направлении с учетом ориентации полки.
Метод возвращает точку присоединения линии выноски в заданном направлении с учетом ориентации полки.
direction: Направление для искомой точки. Тип Vector3d.
attachDirection: Ориентация полки.  Перечисление
<link Teigha:
Returns: Возвращает точку присоединения. Тип Point3d.

Teigha.DatabaseServices.MLeader.GetArrowSize(System.Int32)
Метод возвращает размер стрелки для указанной линии выноски.
Метод возвращает размер стрелки для линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает размер стрелки. Тип double.

Teigha.DatabaseServices.MLeader.GetArrowSymbolId(System.Int32)
Метод предоставляет идентификатор объекта символа стрелки для указанной линии выноски.
Метод предоставляет идентификатор объекта символа стрелки для линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает идентификатор объекта символа стрелки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.GetBlockAttribute(DatabaseServices.ObjectId)
Метод позволяет получить атрибут блока данной мультивыноски с указанным определением атрибута.
Метод позволяет получить атрибут блока данной мультивыноски с указанным определением атрибута.
attDefId: Идентификатор определения атрибута блока. Тип DatabaseServices.ObjectId.
Returns: Возвращает атрибут блока. Тип AttributeReference.

Teigha.DatabaseServices.MLeader.GetDogleg(System.Int32)
Метод предоставляет направление полки для указанного кластера выносной линии.
Метод предоставляет направление полки для кластера выносной линии с указанным индексом.
leaderIndex: индекс кластера выносной линии. Тип int.
Returns: Возвращает направление полки. Тип Vector3d.

Teigha.DatabaseServices.MLeader.GetDoglegLength(System.Int32)
Метод позволяет определить длину полки для указанного кластера выносной линии.
Метод позволяет определить длину полки для кластера выносной линии с указанным индексом.
leaderIndex: Индекс кластера выносной линии. Тип int.
Returns: Возвращает длину указанной полки. Тип double.

Teigha.DatabaseServices.MLeader.GetFirstVertex(System.Int32)
Метод позволяет определить первую вершину выносной линии с указанным индексом.
Метод позволяет определить первую вершину выносной линии с указанным индексом.
leaderLineIndex: Индекс выносной линии. Тип int.
Returns: Возвращает точку первой вершины. Тип Point3d.

Teigha.DatabaseServices.MLeader.GetLastVertex(System.Int32)
Метод позволяет определить последнюю вершину выносной линии с указанным индексом.
Метод позволяет определить последнюю вершину выносной линии с указанным индексом.
leaderLineIndex: Индекс выносной линии. Тип int.
Returns: Возвращает точку последней вершины. Тип Point3d.

Teigha.DatabaseServices.MLeader.GetLeaderIndex(System.Int32)
Метод предоставляет возможность получить индекс кластера, в котором содержится линия выноски с указанным индексом.
Метод позволяет получить индекс кластера, в котором содержится линия выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает индекс кластера с искомой выносной линией. Тип int.

Teigha.DatabaseServices.MLeader.GetLeaderLineColor(System.Int32)
Метод предоставляет цвет линии выноски с указанным индексом.
Метод предоставляет цвет линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает цвет линии выноски. Тип Colors.Color.

Teigha.DatabaseServices.MLeader.GetLeaderLineIndexes(System.Int32)
Метод предоставляет массив индексов всех линейных сегментов указанной линии выноски.
Метод предоставляет массив индексов всех линейных сегментов указанной линии выноски.
leaderIndex: индекс выноски. Тип int.
Returns: Возвращает массив индексов всех линейных сегментов указанной линии выноски. Тип ArrayList.

Teigha.DatabaseServices.MLeader.GetLeaderLineType(System.Int32)
Метод позволяет получить тип линии выноски с указанным индексом.
Метод позволяет получить тип линии выноски с указанным индексом (видимая, прямая, сплайн).
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает тип линии выноски. Перечисление Teigha.DatabaseServices.LeaderType.

Teigha.DatabaseServices.MLeader.GetLeaderLineTypeId(System.Int32)
Метод возвращает идентификатор объекта типа линии для выноски с указанным индексом.
Метод возвращает идентификатор объекта типа линии для выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает идентификатор объекта типа линии для выноски. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.GetLeaderLineWeight(System.Int32)
Метод возвращает толщину (вес) линии выноски с указанным индексом.
Метод возвращает толщину (вес) линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает толщину (вес) линии выноски. Перечисление DatabaseServices.LineWeight.

Teigha.DatabaseServices.MLeader.getOverridedMLeaderStyle(Teigha.DatabaseServices.MLeaderStyle)
Метод предоставляет набор свойств данной мультивыноски, включая значения переопределений.
Метод предоставляет набор свойств данной мультивыноски, включая значения переопределений.
mleaderStyle: Возвращаемые свойства объекта MLeader. Тип MLeaderStyle.

Teigha.DatabaseServices.MLeader.GetTextAttachmentType(Teigha.DatabaseServices.LeaderDirectionType)
Метод позволяет получить вариант расположения точки прикрепления выносной линии к объекту MText.
Метод позволяет получить вариант расположения точки прикрепления выносной линии к объекту MText.
leaderDirection: Вариант ориентации полки из перечисления LeaderDirectionType.
Returns: Возвращает тип прикрепления выносной линии к многострочному тексту. Перечисление TextAttachmentType.

Teigha.DatabaseServices.MLeader.GetVertex(System.Int32,System.Int32)
Метод позволяет получить точку заданной вершины линии выноски с указанным индексом.
Метод позволяет получить точку заданной вершины линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски.         Тип int.
index: Индекс вершины линии выноски. Тип int.
Returns: Возвращает точку указанной вершины. Тип Point3d.

Teigha.DatabaseServices.MLeader.MoveMLeader(Teigha.Geometry.Vector3d,Teigha.DatabaseServices.MoveType)
Метод перемещает данный объект MLeader на заданный вектор.
Метод перемещает данный объект MLeader на заданный вектор.
Аргумент type позволяет настроить опции перемещения.
vec: Вектор, определяющий направление и величину перемещения объекта. Тип Vector3d.
type: Вариант перемещения мультивыноски. Значение из перечисления MoveType.

Teigha.DatabaseServices.MLeader.PostMLeaderToDb(DatabaseServices.Database)
Метод предназначен для добавления этого объекта MLeader в блок пространства модели указанной базы данных.
Метод предназначен для добавления этого объекта MLeader в блок пространства модели указанной базы данных db.
db: База данных, в которую следует добавить мультивыноску MLeader.

Teigha.DatabaseServices.MLeader.RemoveFirstVertex(System.Int32)
Метод позволяет удалить первую вершину из указанной линии выноски.
Метод позволяет удалить первую вершину из линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски, у которой удаляется вершина. Тип int.

Teigha.DatabaseServices.MLeader.RemoveLastVertex(System.Int32)
Метод позволяет удалить последнюю вершину из указанной линии выноски.
Метод позволяет удалить последнюю вершину из линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски, у которой удаляется вершина. Тип int.

Teigha.DatabaseServices.MLeader.RemoveLeader(System.Int32)
Метод позволяет удалить из данной мультивыноски кластер с указанным индексом
Метод позволяет удалить из данной мультивыноски кластер с указанным индексом
index: Индекс удаляемого кластера. Тип int.

Teigha.DatabaseServices.MLeader.RemoveLeaderLine(System.Int32)
Метод удаляет линию выноски с указанным индексом.
Метод удаляет линию выноски с указанным индексом.
Удаление всех линий выноски приводит также к удалению кластера выноски.
leaderLineIndex: Индекс удаляемой линии выноски. Тип int.

Teigha.DatabaseServices.MLeader.SetArrowSize(System.Int32,System.Double)
Метод позволяет задать размер стрелки для линии выноски с указанным индексом.
Метод позволяет задать размер стрелки для линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
arrowSize: Размер стрелки. Тип double.

Teigha.DatabaseServices.MLeader.SetArrowSymbolId(System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать символ стрелки для указанной линии выноски.
Метод позволяет задать символ стрелки для линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
id: Идентификатор символа стрелки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.SetBlockAttribute(DatabaseServices.ObjectId,Teigha.DatabaseServices.AttributeReference)
Метод задает значение указанному атрибуту в содержимом блока данной мультивыноски.
Метод задает значение указанному атрибуту в содержимом блока данной мультивыноски.
attDefId: Идентификатор объекта определения атрибута блока. Тип DatabaseServices.ObjectId.
attributeValue: Задаваемое значение атрибута. Тип AttributeReference.

Teigha.DatabaseServices.MLeader.SetContextDataManager(IntPtr)
Метод позволяет задать указатель на менеджер данных контекста этой мультивыноски.
Метод позволяет задать указатель на менеджер данных контекста этой мультивыноски.
contextDataManager: Менеджер данных контекста. Тип IntPtr.

Teigha.DatabaseServices.MLeader.SetDogleg(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет задать направление полки линии выноски с указанным индексом.
Метод позволяет задать направление полки линии выноски с указанным индексом.
leaderIndex: Индекс линии выноски. Тип int.
vector: Направление полки.    Тип Vector3d.

Teigha.DatabaseServices.MLeader.SetDoglegLength(System.Int32,System.Double)
Метод позволяет задать длину полки в указанном кластере линии выноски.
Метод позволяет задать длину полки в указанном кластере линии выноски.
leaderIndex: Индекс линии выноски. Тип int.
doglegLength: Длина полки. Тип double.

Teigha.DatabaseServices.MLeader.SetFirstVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет переопределить положение первой вершины указанной линии выноски.
Метод позволяет переопределить положение первой вершины линии выноски с указанным индексом.
Новых вершин этот метод не создает.
leaderLineIndex: Индекс линии выноски. Тип int.
point: Новое положение вершины линии выноски. Тип Point3d.

Teigha.DatabaseServices.MLeader.SetLastVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет изменить положение последней вершины указанной линии выноски.
Метод позволяет изменить положение последней вершины линии выноски с указанным индексом.
Новых вершин этот метод не создает.
leaderLineIndex: Индекс линии выноски. Тип int.
point: Новое положение вершины линии выноски. Тип Point3d.

Teigha.DatabaseServices.MLeader.SetLeaderLineColor(System.Int32,Colors.Color)
Метод позволяет задать цвет линии выноски с указанным индексом.
Метод позволяет задать цвет линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
leaderLineTypeId: Новый цвет линии выноски.  Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MLeader.SetLeaderLineType(System.Int32,DatabaseServices.LeaderType)
Метод позволяет задать тип линии выноски с указанным индексом (прямая, сплайн, невидимая).
Метод позволяет задать тип линии выноски с указанным индексом (прямая, сплайн, невидимая).
leaderLineIndex: Индекс линии выноски. Тип int.
leaderLineType: Тип линии выноски из перечисления DatabaseServices.LeaderType.

Teigha.DatabaseServices.MLeader.SetLeaderLineTypeId(System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать новый тип линии для линии выноски с указанным индексом.
Метод позволяет задать новый тип линии для линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
leaderLineTypeId: Идентификатор нового типа линии. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.SetLeaderLineWeight(System.Int32,DatabaseServices.LineWeight)
Метод позволяет задать новое значение толщины (вес) линии выноски с указанным индексом.
Метод позволяет задать новое значение толщины (вес) линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
leaderLineWeight: Новое значение толщины (вес) линии выноски из перечисления DatabaseServices.LineWeight.

Teigha.DatabaseServices.MLeader.SetPlane(Teigha.Geometry.Plane)
Метод позволяет переопределить плоскость, в которой располагается данная мультивыноска.
Метод позволяет переопределить плоскость, в которой располагается данная мультивыноска.
Плоскость задается в мировой системе координат (WCS).
value: Новая плоскость для мультивыноски. Тип Plane.

Teigha.DatabaseServices.MLeader.SetTextAttachmentType(Teigha.DatabaseServices.TextAttachmentType,Teigha.DatabaseServices.LeaderDirectionType)
Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
textAttachmentType: Тип прикрепления выносной линии к многострочному тексту из перечисления
<link Teigha:
leaderDirection: Вариант ориентации полки из перечисления LeaderDirectionType.

Teigha.DatabaseServices.MLeader.SetVertex(System.Int32,System.Int32,Teigha.Geometry.Point3d)
Метод позволяет переопределить положение конкретной вершины указанной линии выноски.
Метод позволяет переопределить положение конкретной вершины указанной линии выноски.
leaderLineIndex: Индекс линии выноски. Тип int.
index: Индекс вершины. Тип int.
point: Новое положение вершины. Тип Point3d.

Teigha.DatabaseServices.MLeader.VerticesCount(System.Int32)
Метод позволяет получить количество вершин у линии выноски с указанным индексом.
Метод позволяет получить количество вершин у линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип int.
Returns: Возвращает количество вершин. Тип int.

Teigha.DatabaseServices.MLeader.ArrowSize
Свойство представляет размер стрелки для данного объекта MLeader.
Свойство представляет размер стрелки для данного объекта MLeader.
Returns: Возвращает размер стрелки. Тип double.

Teigha.DatabaseServices.MLeader.ArrowSymbolId
Свойство представляет идентификатор объекта символа стрелки для данного объекта MLeader.
Свойство представляет идентификатор объекта символа стрелки для данного объекта MLeader.
Returns: Возвращает идентификатор объекта символа стрелки. Тип ObjectId.

Teigha.DatabaseServices.MLeader.BlockColor
Свойство представляет цвет, используемый для отрисовки содержимого блока.
Свойство представляет цвет, используемый для отрисовки содержимого блока.
Returns: Возвращает цвет содержимого блока. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MLeader.BlockConnectionType
Свойство представляет вариант соединения блока с линиями выноски в данном объекте MLeader.
Свойство представляет вариант соединения блока с линиями выноски  (по границам блока, в базовой точке).
Returns: Возвращает вариант соединения блока с линиями выноски из перечисления DatabaseServices.BlockConnectionType.

Teigha.DatabaseServices.MLeader.BlockContentId
Свойство представляет идентификатор ObjectId блока, на который ссылается данный объект MLeader.
Свойство представляет идентификатор ObjectId блока, на который ссылается данный объект MLeader.
Returns: Возвращает идентификатор объекта блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.BlockPosition
Свойство представляет точку вставки блока, на который ссылается данный объект MLeader.
Свойство представляет точку вставки блока, на который ссылается данный объект MLeader.
Returns: Возвращает точку вставки блока. Тип Point3d.

Teigha.DatabaseServices.MLeader.BlockRotation
Свойство представляет угол поворота блока, используемого данным объектом MLeader.
Свойство представляет угол поворота блока, используемого данным объектом MLeader.
Returns: Возвращает угол поворота блока (в радианах). Тип double.

Teigha.DatabaseServices.MLeader.blockScale
Свойство представляет масштаб отрисовки блока, используемого данным объектом MLeader.
Свойство представляет масштаб отрисовки блока, используемого данным объектом MLeader.
Returns: Возвращает масштаб блока. Тип Scale3d.

Teigha.DatabaseServices.MLeader.ContentType
Свойство представляет тип содержимого данного объекта MLeader.
Свойство представляет тип содержимого данного объекта MLeader.
Returns: Возвращает тип содержимого мультивыноски. Значение из перечисления DatabaseServices.ContentType.

Teigha.DatabaseServices.MLeader.DoglegLength
Свойство представляет длину полки в данном объекте MLeader.
Свойство представляет длину полки в данном объекте MLeader.
Returns: Возвращает длину полки. Тип double.

Teigha.DatabaseServices.MLeader.EnableAnnotationScale
Свойство позволяет проверить, включено ли масштабирование аннотаций для данной мультивыноски.
Свойство позволяет проверить, включено ли масштабирование аннотаций для данной мультивыноски.
Returns: Возвращает true, если масштабирование аннотаций включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeader.EnableDogleg
Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
Returns: Возвращает true, если отображение линии полки включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeader.EnableFrameText
Свойство позволяет проверить видимость рамки вокруг текста у данной мультивыноски.
Свойство позволяет проверить видимость рамки вокруг текста у данной мультивыноски.
Returns: Возвращает true, если рамка отображается.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeader.EnableLanding
Свойство должно управлять отображением зазора между концом линии полки и содержимым мультивыноски.
В текущей реализации платформы всегда считается равным true.
Данное свойство позволяет проверить, должен ли отображаться зазор между концом линии полки и содержимым мультивыноски (многострочным текстом или блоком).
По замыслу разработчиков, если данный флаг принимает значение true, величина зазора должна определяться значением свойства LandingGap. В противном случае значение зазора LandingGap должно игнорироваться (просто считается равным нулю).
Но в текущей реализации платформы флаг EnableLanding выставлен всегда (равен true).  Таким образом, для отрисовки зазора между концом линии полки и контентом мультивыноски всегда используется текущее значение свойства LandingGap.
Изменять состояние флага EnableLanding через API технически возможно, но бессмысленно, поскольку в текущей реализации состояние флага не анализируется, а принимается всегда равным true.
Returns: Всегда возвращает true, т.е. отображение зазора между линией полки и контентом мультивыноски всегда включено.

Teigha.DatabaseServices.MLeader.ExtendLeaderToText
Свойство позволяет проверить, продлеваются ли горизонтальные линии выносок автоматически до текста.
Свойство позволяет проверить, продлеваются ли горизонтальные линии выносок автоматически до текста.
Returns: Возвращает true, если линии выноски автоматически продлеваются до текста.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeader.LandingGap
Свойство представляет величину зазора между концом линии полки и связанным многострочным текстом данной мультивыноски.
Свойство представляет величину зазора между концом линии полки и многострочным текстом (либо блоком) данной мультивыноски.
Returns: Возвращает величину зазора между концом линии полки и содержимым мультивыноски. Тип double.

Teigha.DatabaseServices.MLeader.LeaderCount
Свойство представляет количество выносных линий у этой мультивыноски.
В текущей версии не реализовано.
Рекомендуется использовать метод GetLeaderIndexes.
Свойство представляет количество выносных линий у этой мультивыноски.
В текущей версии не реализовано.
Рекомендуется использовать метод GetLeaderIndexes
Returns: Возвращает количество выносных линий. Тип int.

Teigha.DatabaseServices.MLeader.LeaderLineColor
Свойство представляет цвет линии выноски у данного объекта MLeader.
Свойство представляет цвет линии выноски у данного объекта MLeader.
Returns: Возвращает цвет линии выноски. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MLeader.LeaderLineCount
Свойство представляет количество выносных линий у данного объекта MLeader.
В текущей версии не реализовано.
Используйте метод GetLeaderLineIndexes.
Свойство представляет количество выносных линий у данного объекта MLeader.
В текущей версии не реализовано.
Используйте метод GetLeaderLineIndexes.
Returns: Возвращает количество выносных линий. Тип int.

Teigha.DatabaseServices.MLeader.LeaderLineType
Свойство представляет тип линий выноски (прямая, сплайн, невидимая).
Свойство представляет тип линий выноски (прямая, сплайн, невидимая).
Returns: Возвращает тип линий выноски из перечисления DatabaseServices.LeaderType.

Teigha.DatabaseServices.MLeader.LeaderLineTypeId
Свойство представляет идентификатор ObjectId типа линии, используемого для отрисовки выносных линий данного объекта MLeader.
Свойство представляет идентификатор ObjectId типа линии, используемого для отрисовки выносных линий данного объекта MLeader.
Returns: Возвращает идентификатор типа линии. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.LeaderLineWeight
Свойство представляет толщину (вес) линий, которая используется данным объектом MLeader.
Свойство представляет толщину (вес) линий, которая используется данным объектом MLeader.
Returns: Возвращает толщину (вес) линий из перечисления DatabaseServices.LineWeight.

Teigha.DatabaseServices.MLeader.MLeaderStyle
Свойство представляет идентификатор ObjectId используемого стиля мультивыноски.
Свойство представляет идентификатор ObjectId используемого стиля мультивыноски.
Returns: Возвращает идентификатор стиля мультивыноски. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.MText
Свойство представляет многострочный текст, связанный с данной мультивыноской.
Свойство представляет многострочный текст, связанный с данной мультивыноской.
Returns: Возвращает объект многострочного текста. Тип DatabaseServices.MText.

Teigha.DatabaseServices.MLeader.Normal
Свойство представляет вектор нормали плоскости, в которой располагается данная мультивыноска.
Свойство представляет вектор нормали плоскости, в которой располагается данная мультивыноска.
Returns: Возвращает вектор нормали плоскости. Тип Vector3d.

Teigha.DatabaseServices.MLeader.TextAlignmentType
Свойство представляет тип выравнивания многострочного текста данного объекта MLeader.
Свойство представляет тип выравнивания многострочного текста данного объекта MLeader.
Returns: Возвращает тип выравнивания многострочного текста. Значение из перечисления DatabaseServices.TextAlignmentType.

Teigha.DatabaseServices.MLeader.TextAngleType
Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
Returns: Возвращает выбор угла для размещения текста.
Значение из перечисления DatabaseServices.TextAngleType.

Teigha.DatabaseServices.MLeader.TextAttachmentDirection
Свойство представляет направление полки линий выноски данного объекта MLeader.
Свойство представляет направление полки линий выноски данного объекта MLeader.
Returns: Возвращает ориентацию полки выносной линии. Значение из перечисления DatabaseServices.TextAttachmentDirection.

Teigha.DatabaseServices.MLeader.TextAttachmentType
Свойство представляет вариант расположения точки прикрепления выносной линии к многострочному тексту.
Свойство представляет вариант расположения точки прикрепления выносной линии к многострочному тексту.
Returns: Возвращает вариант расположения точки прикрепления. Перечисление DatabaseServices.TextAttachmentType.

Teigha.DatabaseServices.MLeader.TextColor
Свойство представляет цвет многострочного текста данного объекта MLeader.
Свойство представляет цвет многострочного текста данного объекта MLeader.
Returns: Возвращает цвет многострочного текста. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MLeader.TextHeight
Свойство представляет текущую высоту многострочного текста.
Свойство представляет текущую высоту многострочного текста.
Returns: Возвращает высоту текста. Тип double.

Teigha.DatabaseServices.MLeader.TextLocation
Свойство представляет точку привязки многострочного текста данного объекта MLeader.
Свойство представляет точку привязки многострочного текста данного объекта MLeader.
Returns: Возвращает точку привязки многострочного текста.  Тип Point3d.

Teigha.DatabaseServices.MLeader.TextStyleId
Свойство представляет идентификатор ObjectId текстового стиля, который применяется к многострочному тексту данной мультивыноски.
Свойство представляет идентификатор ObjectId текстового стиля, который применяется к многострочному тексту данной мультивыноски.
Returns: Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeader.ToleranceLocation
Свойство представляет точку привязки содержимого допуска данной мультивыноски.
Свойство представляет точку привязки содержимого допуска данной мультивыноски.
Returns: Возвращает точку привязки допуска. Тип Point3d.