HostMgd.GraphicsSystem.ConfigWasModifiedEventHandler
Делегат предназначен для обработки событий, возникающих в процессе изменения конфигурации менеджера графической системы dwg-документа nanoCAD.
Делегат ConfigWasModifiedEventHandler используется для обработки событий, возникающих в процессе изменения конфигурации объекта HostMgd.GraphicsSystem.Manager.
Параметры события передаются через аргументы sender и e, где
sender представляет объект Manager как инициатор события, а аргумент e определяет контекст события в виде экземпляра класса EventArgs.
sender: Объект-инициатор события. Тип Object.
e: Аргументы события. Тип EventArgs.