HostMgd.EditorInput.PromptDistanceOptionsEventHandler
Делегат предназначен для обработки события, возникающего перед началом
операции ввода расстояния, и позволяет изменить параметры команды ввода.
Делегат используется как сигнатура метода-обработчика для события PromptingForDistance,
которое инициируется перед началом интерактивного ввода расстояния — например,
при вызове метода GetDistance() или GetAngle() с параметром расстояния.
Он предоставляет доступ к параметрам ввода через объект PromptDistanceOptionsEventArgs,
что позволяет программно изменять:
* сообщение приглашения (Message),
* начальное значение (DefaultValue),
* режимы ввода (AllowNone, AllowNegative и др.).
Этот делегат особенно полезен при разработке надстроек,
где требуется динамически изменять поведение команды
ввода расстояния в зависимости от контекста.
sender: Источник события, обычно представляет экземпляр редактора (Editor), в котором происходит ввод расстояния.
e: Объект, содержащий параметры ввода расстояния