Teigha.DatabaseServices.FieldCodeFlags.AddMarkers
Значение: 16.
Если этот флаг установлен, внедренные в текст поля заключаются в маркеры полей %%.
Этот флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.