Teigha.Geometry.CoordinateSystem2d
Структура CoordinateSystem2d представляет двумерную систему координат, которая определяется точкой начала и направлениями осей X и Y.
Структура CoordinateSystem2d представляет двумерную систему координат, которая определяется точкой начала и направлениями осей X и Y.

Teigha.Geometry.CoordinateSystem2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Конструктор класса CoordinateSystem2d.
Создает экземпляр класса с указанными параметрами.
Конструктор класса CoordinateSystem2d.
Создает экземпляр класса с указанными параметрами.
o: Точка начала системы координат.   Тип Point2d.
x: Направляющий вектор оси X. Тип Vector2d.
y: Направляющий вектор оси Y. Тип Vector2d.

Teigha.Geometry.CoordinateSystem2d.Equals(Object)
Метод предназначен для проверки равенства объектов.
Метод предназначен для проверки равенства объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() из этого класса, в то время как метод Equals() может быть переопределен в производном классе.
obj: Объект, с которым проверяется равенство.
Returns: Возвращает true, если переданная система координат obj не является нулевой и имеет те же начальную точку и направляющие векторы осей X и Y.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem2d.IsEqualTo(Teigha.Geometry.CoordinateSystem2d)
Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом.
Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом.
Используется вызов метода CoordinateSystem2d.IsEqualTo(CoordinateSystem2d a, Tolerance tolerance) с точностью, равной Tolerance.Global.
a: Входная система координат, которая сравнивается с данной.  Тип CoordinateSystem2d.
Returns: Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X и Y.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem2d.IsEqualTo(Teigha.Geometry.CoordinateSystem2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом в пределах заданной точности.
Метод позволяет проверить, совпадает ли переданная в метод координатная система CoordinateSystem2d с данным объектом в пределах заданной точности.
a: Проверяемая система координат. Тип CoordinateSystem2d.
tolerance: Заданная точность вычислений.  Тип Tolerance.
Returns: Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X и Y.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
Возвращаемая строка включает начало этой системы координат и направления её осей X и Y.
provider: Заданный провайдер региональных и языковых настроек.  Тип IFormatProvider.
Returns: Возвращает строковое представление данного объекта.  Тип String.

Teigha.Geometry.CoordinateSystem2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.  Возвращаемая строка включает начало этой системы координат и направления её осей X и Y.
format: Предписанный формат строки. Тип String.
provider: Входной провайдер региональных и языковых настроек.  Тип IFormatProvider.
Returns: Возвращает строковое представление данного объекта.
Тип String.

Teigha.Geometry.CoordinateSystem2d.!=(Teigha.Geometry.CoordinateSystem2d,Teigha.Geometry.CoordinateSystem2d)
Оператор неравенства структуры CoordinateSystem2d.
Оператор неравенства структуры CoordinateSystem2d.
a: Левый  операнд. Тип CoordinateSystem2d.
b: Правый операнд. Тип CoordinateSystem2d.
Returns: Возвращает true, если не выполняется хотя бы одно из следующих условий:
1. совпадают начальные точки;
2. совпадают направляющие векторы осей X;
3. совпадают направляющие векторы осей Y.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem2d.==(Teigha.Geometry.CoordinateSystem2d,Teigha.Geometry.CoordinateSystem2d)
Оператор равенства структуры CoordinateSystem2d.
Оператор равенства структуры CoordinateSystem2d.
a: Левый  операнд. Тип CoordinateSystem2d.
b: Правый операнд. Тип CoordinateSystem2d.
Returns: Возвращает true, если одновременно выполняются все перечисленные ниже условия:
1. совпадают начальные точки;
2. совпадают направляющие векторы осей X;
3. совпадают направляющие векторы осей Y.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem2d.Origin
Свойство Origin представляет точку начала данной системы координат.
Свойство Origin представляет точку начала данной системы координат.
Returns: Возвращает точку начала системы координат. Тип Point2d.

Teigha.Geometry.CoordinateSystem2d.Xaxis
Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
Returns: Возвращает направляющий вектор оси X данной системы координат.
Тип Vector2d.

Teigha.Geometry.CoordinateSystem2d.Yaxis
Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
Returns: Возвращает направляющий вектор оси Y данной системы координат.
Тип Vector2d.