Teigha.DatabaseServices.SkyBackground
Класс SkyBackground представляет небо для объекта фона в видовом экране.
Класс SkyBackground реализует небо для объекта фона в видовом экране.

Teigha.DatabaseServices.SkyBackground.#ctor
Конструктор по умолчанию класса SkyBackground.
Конструктор по умолчанию класса SkyBackground.

Teigha.DatabaseServices.SkyBackground.SunId
Свойство SunId представляет идентификатор объекта солнца.
Свойство SunId представляет доступ к идентификатору объекта солнца.
Returns: Возвращает идентификатор объекта солнца.
Тип DatabaseServices.ObjectId.