Teigha.DatabaseServices.UcsTableRecord
Класс UcsTableRecord представляет записи в таблице UcsTable, каждая из которых связана с конкретной пользовательской системой координат, сохраненной в базе данных чертежа.
Класс UcsTableRecord представляет записи в таблице UcsTable, каждая из которых связана с конкретной пользовательской системой координат, сохраненной в базе данных чертежа.  Этот класс наследует базовую функциональность именованных записей.

Teigha.DatabaseServices.UcsTableRecord.#ctor
Конструктор по умолчанию класса UcsTableRecord.
Конструктор по умолчанию класса UcsTableRecord.

Teigha.DatabaseServices.UcsTableRecord.GetUcsBaseOrigin(DatabaseServices.OrthographicView)
Метод позволяет получить трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS.
Метод позволяет получить трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS.
Координаты начала предоставляются в мировой системе координат (WCS, МСК).
view: Тип ортогонального вида из перечисления DatabaseServices.OrthographicView.
Returns: Возвращает точку начала пользовательской системы координат. Тип Point3d.

Teigha.DatabaseServices.UcsTableRecord.SetUcsBaseOrigin(Teigha.Geometry.Point3d,DatabaseServices.OrthographicView)
Метод позволяет задать трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS.
Метод позволяет задать трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной UCSBASE сохранено имя данной UCS.
origin: Точка начала пользовательской системы координат. Тип Point3d.
view: Тип ортогонального вида из перечисления DatabaseServices.OrthographicView.

Teigha.DatabaseServices.UcsTableRecord.Origin
Свойство Origin представляет 3D-точку начала пользовательской системы координат для данной записи UCS.
Свойство Origin представляет трехмерную точку начала пользовательской системы координат (UCS, ПСК) для данной записи UCS. Точка представлена в мировой системе координат.
Returns: Возвращает точку начала пользовательской системы координат. Тип Point3d.

Teigha.DatabaseServices.UcsTableRecord.XAxis
Свойство XAxis представляет 3D-вектор в мировой системе координат, который определяет направление оси X пользовательской системы координат для данного объекта UcsTableRecord.
Свойство XAxis представляет 3D-вектор в мировой системе координат (WCS, МСК), который определяет направление оси X пользовательской системы координат (UCS, ПСК) для данного объекта UcsTableRecord.
Returns: Возвращает направление оси X пользовательской системы координат. Тип Vector3d. Задан в мировой системе координат.

Teigha.DatabaseServices.UcsTableRecord.YAxis
Свойство YAxis представляет 3D-вектор в мировой системе координат, который определяет направление оси Y пользовательской системы координат для данного объекта UcsTableRecord.
Свойство YAxis представляет 3D-вектор в мировой системе координат (WCS, МСК), который определяет направление оси Y пользовательской системы координат (UCS, ПСК) для данного объекта UcsTableRecord.
Returns: Возвращает направление оси Y пользовательской системы координат. Тип Vector3d. Задан в мировой системе координат.