Teigha.GraphicsInterface.ImageOrg
Данное перечисление определяет схему организации точек исходного файла растрового изображения.
Данное перечисление определяет схему организации точек исходного файла растрового изображения.