Teigha.DatabaseServices.ResultBufferEnumerator.Reset
Метод реинициализирует данный перечислитель, устанавливая его указатель на первый элемент результирующего буфера.
Метод реинициализирует данный перечислитель, устанавливая его указатель на первый элемент результирующего буфера.