Teigha.Runtime.StreamBuf.Rewind
Метод реинициализирует данный буфер, устанавливая текущую позицию файлового указателя для данного буфера в начальное положение (на ноль).
Метод реинициализирует данный буфер, устанавливая текущую позицию файлового указателя для данного буфера в начальное положение (на ноль).