Teigha.GraphicsInterface.Mapper
Класс Mapper управляет наложением текстуры (карты) материала на поверхность объектов.
Класс Mapper реализует мапперы, которые определяют характер наложения текстуры (карты) материала на поверхность объектов.
Маппер управляет расположением, размером и поворотом объектов MaterialMap при наложении текстуры материала на поверхность объекта.
Маппер характеризуется типом, тайлингом, типом автоматического преобразования и свойствами преобразования.

Teigha.GraphicsInterface.Mapper.#ctor
Конструктор по умолчанию класса Mapper.
Конструктор по умолчанию класса Mapper.
Создает плоский маппер, который повторяет текстуру (карту) материала вдоль осей (мозаичное наложение по направлениям
U и V) без автоматического преобразования.
Матрица преобразования у маппера по умолчанию является единичной, соответственно, такой маппер реализует тождественное преобразование.

Teigha.GraphicsInterface.Mapper.#ctor(GraphicsInterface.Projection,GraphicsInterface.Tiling,GraphicsInterface.Tiling,GraphicsInterface.AutoTransform,Teigha.Geometry.Matrix3d)
Конструктор класса Mapper.
Создает экземпляр класса с указанными параметрами.
Конструктор класса Mapper.
Создает новый маппер с указанными типом проецирования, мозаичным наложением (тайлингом) по направлениям
U и V, автоматическим типом преобразования и заданной матрицей преобразования.
projection: Тип проецирования из перечисления GraphicsInterface.Projection (плоское, кубическое, сферическое, цилиндрическое).
Utiling: Тип мозаичности в направлении U. Значение из перечисления GraphicsInterface.Tiling.
Vtiling: Тип мозаичности в направлении V. Значение из перечисления GraphicsInterface.Tiling.
autoTransform: Тип автопреобразования из перечисления GraphicsInterface.AutoTransform.
transform: Матрица геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Mapper.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.Mapper.AutoTransform
Свойство AutoTransform представляет текущий тип автоматического преобразования у данного объекта.
Свойство AutoTransform представляет текущий тип автоматического преобразования у данного объекта.
Returns: Возвращает тип автоматического преобразования.
Перечисление GraphicsInterface.AutoTransform.

Teigha.GraphicsInterface.Mapper.Projection
Свойство Projection представляет тип проецирования у данного объекта.
Свойство Projection представляет тип проецирования у данного объекта.
Returns: Возвращает тип проецирования. Перечисление GraphicsInterface.Projection.

Teigha.GraphicsInterface.Mapper.Transform
Свойство Transform представляет геометрическое преобразование, выполняемое данным объектом.
Свойство Transform представляет геометрическое преобразование, выполняемое данным объектом.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix3d.

Teigha.GraphicsInterface.Mapper.UTiling
Свойство UTiling представляет тип мозаичности в направлении U.
Свойство UTiling представляет тип мозаичности в направлении U.
Returns: Возвращает тип мозаичности в направлении U.
Перечисление GraphicsInterface.Tiling.

Teigha.GraphicsInterface.Mapper.VTiling
Свойство VTiling представляет тип мозаичности в направлении V.
Свойство VTiling представляет тип мозаичности в направлении V.
Returns: Возвращает тип мозаичности в направлении V.
Перечисление GraphicsInterface.Tiling.