Teigha.Geometry.Point2dCollection.DefaultSize
Поле DefaultSize представляет ёмкость по умолчанию новой коллекции Point2dCollection, создаваемой конструктором по умолчанию.
Поле DefaultSize представляет ёмкость по умолчанию новой коллекции Point2dCollection, создаваемой конструктором по умолчанию.
Returns: Возвращает ёмкость по умолчанию для новой коллекции. Тип int.