Teigha.DatabaseServices.Database.GetDimRecentStyleList
Эта функция позволяет получить Id геометрических объектов
последних используемых размерных стилей (до 6) для поддержки
списка наиболее часто используемых размерных стилей.
Последние используемые размерные стили отслеживаются с
помощью определения последних шести объектов размерных
стилей, которые были текущими в базе данных.