Teigha.DatabaseServices.DBObject.CreateExtensionDictionary
Метод создает словарь расширения этого объекта.
Создает объект DBDictionary и устанавливает его как
расширенный словарь для объекта DBObject.