Teigha.DatabaseServices.Intersect
Перечисление Intersect определяет действия, выполняемые с граничными рамками геометрических объектов при вычислении пересечений между этими объектами.
Перечисление Intersect определяет действия, выполняемые с граничными рамками геометрических объектов при вычислении пересечений между этими объектами.