Teigha.GraphicsSystem.StereoParameters
Структура StereoParameters предназначена для хранения параметров стереоскопических видов.
Структура StereoParameters предназначена для хранения параметров стереоскопических видов.

Teigha.GraphicsSystem.StereoParameters.#ctor(System.Double,System.Double)
Конструктор структуры StereoParameters. Создает экземпляр структуры с указанными магнитудой и параллаксом.
Конструктор структуры StereoParameters. Создает экземпляр структуры с указанными магнитудой и параллаксом.
Notes
Значение параметра magnitude управляет разделением видов.
Диапазон изменения - от 0.0 до 2.0, включительно.
Значение 0.0 означает отсутствие стереоэффекта, а значение 2.0 его удваивает.
Значение по умолчанию равно 1.0.
Параметр parallax позволяет настроить положение плоскости нулевого параллакса.
Значение по умолчанию 1.0 соответствует положению плоскости нулевого параллакса в точке цели вида.
Диапазон изменения - от 0.0 до 2.0, включительно.
Отметим, что для наблюдения стереоэффекта следует переключиться в режим перспективной проекции.
magnitude: Магнитуда разделения видов. Тип double.
parallax: Значение параллакса. Тип double.

Teigha.GraphicsSystem.StereoParameters.Magnitude
Свойство Magnitude управляет разделением видов.
Свойство Magnitude управляет разделением видов.
Returns: Возвращает значение магнитуды. Тип double.

Teigha.GraphicsSystem.StereoParameters.Parallax
Свойство Parallax представляет текущее значение параллакса.
Свойство Parallax представляет текущее значение параллакса.
Returns: Возвращает текущее значение параллакса.  Тип double.