Teigha.GraphicsInterface.EdgeModifiers.Jitter
Значение: 2.
Этот модификатор обеспечивает эффект дрожания рёбер (джиттер). Эффект легкой неровности (дрожания) ребра порождается отрисовкой дополнительных линий вблизи, но с определенным отклонением от исходной линии. Используется при создании эффекта карандашного наброска от руки.