Teigha.GraphicsSystem.GsModule.ViewToBeDestroyed
Событие ViewToBeDestroyed создается непосредственно перед уничтожением вида.
Событие ViewToBeDestroyed создается непосредственно перед уничтожением вида.