Teigha.DatabaseServices.Polyline2d.GetEnumerator
Метод предназначен для получения перечислителя коллекции.
Метод предназначен для получения перечислителя коллекции.
Returns: Возвращает перечислитель, тип System.Collections.IEnumerator.