Teigha.GraphicsSystem.ImpDevice.Invalidate
Метод реализует уведомление о том, что вся отображаемая область стала недействительной и требует обновления.
Метод предназначен для уведомления о том, что вся отображаемая область стала недействительной и нуждается в обновлении.