Teigha.GraphicsInterface.EdgeData.GetSelectionMarkers
Метод предоставляет массив маркеров выделения графической системы для ребер, используемых этим объектом.
Метод предоставляет массив маркеров выделения графической системы, по одному для каждого ребра сети или оболочки, с которыми используется данный объект EdgeData.
Notes
Возвращается фактический массив указателей маркеров выделения, используемый графической системой, а не их копии.
Не удаляйте этот массив, если только память массива не была выделена динамически и функция WorldDraw() или ViewportDraw(), в которой он используется, не собирается возвращать управление.
Returns: Возвращает массив маркеров выделения графической системы.
Тип IntPtr[].
Возвращает NULL, если массив маркеров выделения не был задан.