Teigha.GraphicsSystem.ViewEventArgs
Класс ViewEventArgs представляет аргументы для различных событий объектов View.
Класс ViewEventArgs представляет аргументы для различных событий объектов View.

Teigha.GraphicsSystem.ViewEventArgs.View
Свойство View представляет объект вида View, с которым ассоциирован данный объект.
Свойство View представляет объект вида View, с которым ассоциирован данный объект.
Returns: Возвращает объект вида. Тип GraphicsSystem.View.