Teigha.DatabaseServices.GradientColor
Этот класс является контейнером для градиентных цветов, используемых объектом Hatch.
Этот класс является контейнером для градиентных цветов, используемых объектом Hatch.

Teigha.DatabaseServices.GradientColor.#ctor
Конструктор по умолчанию класса GradientColor.
Конструктор класса GradientColor.

Teigha.DatabaseServices.GradientColor.#ctor(Teigha.Colors.Color,System.Single)
Конструктор класса GradientColor.
Конструктор класса GradientColor. Создает новый экземпляр класса с указанными значениями параметров.
color: Входной цвет.  Тип Teigha.Colors.Color.
value: Входное число с плавающей точкой, представляющее интерполированное значение, которое определяется градиентом. Тип float.