Teigha.Geometry.Matrix3dBuilder.ToMatrix3d
Метод предоставляет трехмерную матрицу, связанную с данным объектом.
Метод предоставляет трехмерную матрицу, связанную с данным объектом.
Returns: Возвращает матрицу, связанную с данным объектом.
Тип Matrix3d.