Teigha.GraphicsSystem.ImpDevice
Класс ImpDevice представляет реализацию графического устройства (объекта Device), в котором отображается чертеж.
Класс ImpDevice представляет реализацию графического устройства (объекта Device) как окна графического интерфейса (GUI), в котором отображается чертеж.

Teigha.GraphicsSystem.ImpDevice.Add(Teigha.GraphicsSystem.View)
Метод добавляет графический вид для отображения чертежа на устройстве.
Метод добавляет графический вид для отображения чертежа на устройстве.
pView: Добавляемый вид, который связывается с данным устройством. Тип View.

Teigha.GraphicsSystem.ImpDevice.CreateView(Teigha.GraphicsSystem.ClientViewInfo)
Метод создает новый вид на основе информации о клиентском виде и связывает его с данным устройством.
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
pViewInfo: Информация о клиентском виде, на основе которого создается вид.  Тип ClientViewInfo.
Returns: Возвращает дескриптор созданного вида.
Тип View.

Teigha.GraphicsSystem.ImpDevice.CreateView(Teigha.GraphicsSystem.ClientViewInfo,System.Boolean)
Метод создает новый вид на основе информации о клиентском виде и связывает его с данным устройством.
Дополнительно метод позволяет включить поддержку видимости слоев индивидуально в каждом видовом экране.
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
Дополнительно метод позволяет включить поддержку видимости слоев индивидуально в каждом из видовых экранов.
pViewInfo: Информация о клиентском виде, на основе которого создается вид.  Тип ClientViewInfo.
enableLayerVisibilityPerView: Флаг включения поддержки видимости слоев индивидуально для каждого видового экрана.  Тип bool.
Returns: Возвращает дескриптор созданного вида.
Тип View.

Teigha.GraphicsSystem.ImpDevice.Erase(System.Int32)
Метод удаляет вид с указанным индексом.
Метод предназначен для удаления вида с индексом viewIndex.
viewIndex: Индекс удаляемого вида.  Тип int.
Returns: Возвращает true, если удаление вида завершилось успешно.
В противном случае возвращает false.

Teigha.GraphicsSystem.ImpDevice.Erase(Teigha.GraphicsSystem.View)
Метод удаляет указанный вид.
Метод предназначен для удаления указанного вида.
pView: Удаляемый вид. Тип View.
Returns: Возвращает true, если удаление вида завершилось успешно.
В противном случае возвращает false.

Teigha.GraphicsSystem.ImpDevice.GetSnapshot(System.Drawing.Rectangle)
Метод предоставляет снимок текущего состояния графики на данном устройстве.
Метод позволяет получить снимок текущего состояния графики на данном устройстве.
rectangle: Область снимка на устройстве. Тип System.Drawing.Rectangle.
Returns: Возвращает снимок состояния графики в формате System.Drawing.Bitmap.

Teigha.GraphicsSystem.ImpDevice.InsertView(System.Int32,Teigha.GraphicsSystem.View)
Метод вставляет указанный вид в заданную индексом позицию на этом устройстве.
Метод позволяет вставить указанный вид в заданную индексом позицию на этом устройстве.
viewIndex: Индекс вида на устройстве. Тип int.
pView: Вставляемый в устройство вид. Тип View.

Teigha.GraphicsSystem.ImpDevice.Invalidate(System.Drawing.Rectangle)
Метод реализует уведомление о том, что указанная прямоугольная область экрана стала недействительной и требует обновления.
Метод предназначен для уведомления о том, что указанная прямоугольная область экрана стала недействительной и требует обновления.
screenRect: Границы области. Тип System.Drawing.Rectangle.

Teigha.GraphicsSystem.ImpDevice.OnDisplayChange(System.Int32,System.Int32,System.Int32)
Метод заставляет данное устройство принимать новое разрешение экрана и глубину цвета всякий раз, когда операционная система меняет указанные параметры.
Метод заставляет данное устройство принимать новое разрешение экрана и глубину цвета всякий раз, когда операционная система меняет указанные параметры.
bitsPerPixel: Новая глубина цвета в битах на пиксель. Тип int.
xPixels: Разрешение по оси X. Тип int.
yPixels: Разрешение по оси Y. Тип int.

Teigha.GraphicsSystem.ImpDevice.OnSize(DatabaseServices.Extents2d)
Метод сообщает устройству новые размеры, используя объект DatabaseServices.Extents2d.
Этот метод следует вызывать при каждом изменении размеров устройства.
Метод позволяет сообщить устройству новые размеры, используя объект DatabaseServices.Extents2d.
Этот метод следует вызывать при каждом изменении размеров устройства.
outputRect: Новые размеры устройства. Тип DatabaseServices.Extents2d.

Teigha.GraphicsSystem.ImpDevice.OnSize(System.Drawing.Rectangle)
Метод сообщает устройству новые размеры, используя объект System.Drawing.Rectangle.
Этот метод следует вызывать при каждом изменении размеров устройства.
Метод позволяет сообщить устройству новые размеры, используя объект System.Drawing.Rectangle.
Этот метод следует вызывать при каждом изменении размеров устройства.
outputRect: Прямоугольник, который определяет новые размеры устройства.  Тип System.Drawing.Rectangle.

Teigha.GraphicsSystem.ImpDevice.OnSize(System.Drawing.Size)
Метод сообщает устройству новые размеры, используя объект System.Drawing.Size.
Этот метод следует вызывать при каждом изменении размеров устройства.
Метод позволяет сообщить устройству новые размеры, используя объект System.Drawing.Size.
Этот метод следует вызывать при каждом изменении размеров устройства.
size: Новые размеры устройства. Тип System.Drawing.Size.

Teigha.GraphicsSystem.ImpDevice.SetLogicalPalette(array)
Метод предоставляет возможность задать на данном устройстве логическую цветовую палитру.
В дальнейшем эта палитра позволит использовать индексированные цвета.
Метод предоставляет возможность задать на данном устройстве логическую цветовую палитру.
В дальнейшем эта палитра позволит использовать индексированные цвета.
logicalPalette: Входной массив цветов для палитры. Тип Drawing.Color[].

Teigha.GraphicsSystem.ImpDevice.Update(System.Drawing.Rectangle)
Метод уведомляет все принадлежащие устройству виды о необходимости обновить указанную область с целью актуализировать текущее изображение.
Метод уведомляет все принадлежащие устройству виды о необходимости обновить указанную область с целью актуализировать текущее изображение.
pUpdatedRect: Область экрана для обновления. Тип System.Drawing.Rectangle.

Teigha.GraphicsSystem.ImpDevice.ViewAt(System.Int32)
Метод предоставляет вид по его индексу.
Метод позволяет получить вид по его индексу.
viewIndex: Входной индекс вида. Тип int.
Returns: Возвращает дескриптор найденного вида.
Тип View.

Teigha.GraphicsSystem.ImpDevice.BackgroundColor
Свойство BackgroundColor представляет цвет фона в окне GUI данного устройства.
Свойство BackgroundColor представляет цвет фона в окне графического интерфейса данного устройства.
Returns: Возвращает цвет фона в окне GUI.
Тип System.Drawing.Color.

Teigha.GraphicsSystem.ImpDevice.IsValid
Свойство IsValid позволяет проверить, актуально ли изображение в окне GUI данного устройства.
Свойство IsValid позволяет проверить, корректное ли изображение отображается в окне GUI данного устройства.
Returns: Возвращает true, если изображение является корректным.
В противном случае возвращает false.

Teigha.GraphicsSystem.ImpDevice.LogicalPalette
Свойство LogicalPalette представляет логическую палитру, которая будет использоваться данным устройством.
Свойство LogicalPalette представляет логическую палитру, которая будет использоваться данным устройством.
Returns: Возвращает массив цветов палитры.
Тип System.Drawing.Color[].

Teigha.GraphicsSystem.ImpDevice.NumViews
Свойство NumViews представляет количество видов, связанных с данным устройством.
Свойство NumViews представляет количество видов, связанных с данным устройством.
Returns: Возвращает количество видов, связанных с устройством. Тип int.

Teigha.GraphicsSystem.ImpDevice.Properties
Свойство Properties представляет набор свойств данного устройства, хранимых в виде словаря.
Свойство Properties представляет набор свойств данного устройства, хранимых в виде словаря.
Returns: Возвращает словарь со свойствами устройства.
Тип Dictionary.

Teigha.GraphicsSystem.ImpDevice.UserGiContext
Свойство UserGiContext представляет пользовательский контекст для графического интерфейса.
Свойство UserGiContext представляет пользовательский контекст для графического интерфейса устройства.
Returns: Возвращает пользовательский контекст для графического интерфейса.
Тип Context.