Teigha.DatabaseServices.RadialDimensionLarge
Класс RadialDimensionLarge представляет радиальный размер с изломом.
Класс RadialDimensionLarge представляет радиальный размер с изломом.

Teigha.DatabaseServices.RadialDimensionLarge.#ctor
Конструктор по умолчанию класса RadialDimensionLarge.
Конструктор по умолчанию класса RadialDimensionLarge.
Создает радиальный размер с центром, переопределенным центром, точками излома и хорды в точке (0, 0, 0)
и углом излома 0.785398 (PI/4) рад.

Teigha.DatabaseServices.RadialDimensionLarge.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Double,String,DatabaseServices.ObjectId)
Конструктор класса RadialDimensionLarge.
Конструктор класса RadialDimensionLarge. Создает экземпляр класса с указанными параметрами.
center: Центр измеряемой дуги или окружности. Тип Point3d.
chordPoint: Конец хорды на измеряемой окружности или дуге, к которому подводится размерная линия. Тип Point3d.
overrideCenter: Точка переопределенного центра, от которой строится размерная линия. Тип Point3d.
jogPoint: Точка излома размерной линии при переходе от переопределенного центра к точке хорды. Тип Point3d.
jogAngle: Угол излома между линией, проходящей через переопределенный центр, и линией, проходящей через точку излома.                 Тип double.
dimensionText: Размерный текст для замены текста измеренного значения. Тип String.
dimensionStyle: Идентификатор объекта размерного стиля, который используется для отрисовки размера.

Teigha.DatabaseServices.RadialDimensionLarge.center
Свойство Center представляет центр измеряемой окружности или дуги.
Свойство Center представляет центр измеряемой окружности или дуги.
Координаты центра приводятся в мировой системе координат (WCS).
Returns: Возвращает точку центра окружности или дуги. Тип Point3d.

Teigha.DatabaseServices.RadialDimensionLarge.chordPoint
Свойство ChordPoint представляет точку пересечения размерной линии и измеряемой дуги или окружности.
Свойство ChordPoint представляет точку пересечения размерной линии и измеряемой дуги или окружности.
Returns: Возвращает точку пересечения размерной линии и дуги / окружности. Тип Point3d.

Teigha.DatabaseServices.RadialDimensionLarge.JogAngle
Свойство JogAngle представляет угол излома данного размера.
Свойство JogAngle представляет угол излома данного размера (угол между линией, проходящей через переопределенный центр, и линией, проходящей через точку излома).
Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть навстречу вектору нормали плоскости размера.
Returns: Возвращает угол излома в радианах.
Тип double.

Teigha.DatabaseServices.RadialDimensionLarge.jogPoint
Свойство JogPoint представляет точку излома линии размера.
Свойство JogPoint представляет точку излома линии размера.
В этой точке размерная линия претерпевает излом при переходе от переопределенного центра к точке хорды.
Returns: Возвращает точку излома в мировой системе координат (WCS). Тип Point3d.

Teigha.DatabaseServices.RadialDimensionLarge.overrideCenter
Свойство OverrideCenter представляет точку переопределенного центра, из которой строится размерная линия.
Свойство OverrideCenter представляет точку переопределенного центра, из которой строится размерная линия.
Returns: Возвращает точку переопределенного центра размера (в мировой системе координат, WCS).
Тип Point3d.