Teigha.GraphicsSystem.InvalidationHint
Данное перечисление определяет типы данных, которые, будучи в кэше, могут потерять актуальность и требовать перестроения. Используется графической системой для управления методом GraphicsSystem.Model.Invalidate().
Данное перечисление определяет типы данных, которые, будучи в кэше, могут потерять актуальность и требовать перестроения.
Перечисление используется графической системой для тонкой настройки работы метода GraphicsSystem.Model.Invalidate().