Teigha.GraphicsInterface.TransientDrawingMode.Sprite
Значение: 1.
Режим отрисовки спрайтов (предназначен для внутреннего использования).
В 3D-графической системе для отрисовки спрайтов этот режим использует отдельный Z-буфер.