HostMgd.ApplicationServices.ProfileEventArgs
Класс ProfileEventArgs представляет данные события ProfileEvent.
В текущей версии данный класс не реализован.
Класс ProfileEventArgs представляет данные события ProfileEvent.
В текущей версии данный класс не реализован.

HostMgd.ApplicationServices.ProfileEventArgs.ProfileName
Свойство ProfileName представляет имя профиля.
В текущей версии данное свойство не реализовано.
Свойство ProfileName представляет имя профиля.
В текущей версии данное свойство не реализовано.
Returns: Возвращает имя профиля.
Тип String.