Teigha.Geometry.Sphere.IsClosed
Метод позволяет проверить, является ли данный объект полной сферой.
Метод позволяет проверить, является ли данный объект полной сферой.
Экватор полной (замкнутой) сферической поверхности представляет собой полную окружность.
Используется вызов метода CircularArc2d.IsClosed(Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
Returns: Возвращает true, если данный объект представляет собой полную сферу.
В противном случае возвращает false.