Teigha.DatabaseServices.HighlightOverrule.SetCustomFilter
Включает режим использования метода IsApplicable базового класса Overrule, чтобы установить допустимость применения объектных переопределений.
Включает режим использования метода IsApplicable базового класса Overrule, чтобы установить допустимость применения объектных переопределений.