Teigha.DatabaseServices.BeginInsertEventArgs
Класс представляет данные для события BeginInsert базы данных.
Этот класс представляет данные для события BeginInsert базы данных.

Teigha.DatabaseServices.BeginInsertEventArgs.From
Свойство обеспечивает доступ к вставляемой базе данных.
Свойство обеспечивает доступ к вставляемой базе данных.
Returns: Возвращает вставляемую базу данных. Тип Database.