Teigha.Geometry.EllipticalArc2d.IsCircular
Метод позволяет проверить, не является ли данная дуга круглой.
Используется геометрическая точность по умолчанию.
Метод позволяет проверить, не является ли данная дуга круглой.
Используется вызов метода EllipticalArc2d.IsCircular(Tolerance tolerance)
с геометрической точностью, равной Tolerance.Global.
Returns: Возвращает true, если с используемой точностью данную дугу можно считать круглой.
В противном случае возвращает false.