Teigha.DatabaseServices.Handle.ToString
Возвращает эквивалентное строковое представление данного объекта.
Возвращает эквивалентное строковое представление данного объекта.
Подробнее см. в документации Microsoft по .NET API.
Returns: Возвращает эквивалентное строковое представление данного объекта, тип String.