Teigha.GraphicsInterface.TransientDrawingMode.Main
Значение: 0.
Основной режим отрисовки (предназначен для внутреннего использования).
В случае 3D-графической системы этот режим использует основной Z-буфер.