Teigha.Runtime.DisposableWrapper
Класс DisposableWrapper реализует интерфейс IDisposable и является общим базовым классом для всех управляемых классов-обёрток.
Класс DisposableWrapper реализует интерфейс IDisposable и является общим базовым классом для всех управляемых классов-обёрток.
Он предоставляет обёртку, которая создает управляемый объект из неуправляемого указателя.
Он также предоставляет доступ к базовому неуправляемому указателю объекта-обёртки.

Teigha.Runtime.DisposableWrapper.Create(Type,IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
type: Тип исходного объекта. Тип Type.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип DisposableWrapper.

Teigha.Runtime.DisposableWrapper.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.Runtime.DisposableWrapper.!=(Teigha.Runtime.DisposableWrapper,Teigha.Runtime.DisposableWrapper)
Оператор неравенства для класса DisposableWrapper.
Оператор неравенства для класса DisposableWrapper.
a: Левый операнд.  Тип DisposableWrapper.
b: Правый операнд. Тип DisposableWrapper.
Returns: Возвращает true при несовпадении операндов.
В противном случае возвращает false.

Teigha.Runtime.DisposableWrapper.==(Teigha.Runtime.DisposableWrapper,Teigha.Runtime.DisposableWrapper)
Оператор равенства для класса DisposableWrapper.
Оператор равенства для класса DisposableWrapper.
a: Левый операнд.  Тип DisposableWrapper.
b: Правый операнд. Тип DisposableWrapper.
Returns: Возвращает true в случае равенства операндов.
В противном случае возвращает false.

Teigha.Runtime.DisposableWrapper.AutoDelete
Свойство AutoDelete позволяет проверить, должен ли нативный объект удаляться автоматически после удаления обёртки.
Свойство AutoDelete позволяет проверить, должен ли нативный объект удаляться автоматически после удаления обёртки.
Returns: Возвращает true, если объект должен удаляться автоматически после удаления обёртки.
В противном случае возвращает false.

Teigha.Runtime.DisposableWrapper.IsDisposed
Свойство IsDisposed позволяет проверить, был ли удален объект.
Свойство IsDisposed позволяет проверить, был ли удален объект.
Returns: Возвращает true, если объект уже удален.
В противном случае возвращает false.

Teigha.Runtime.DisposableWrapper.UnmanagedObject
Свойство UnmanagedObject возвращает указатель на исходный неуправляемый объект.
Свойство UnmanagedObject возвращает указатель на исходный неуправляемый объект.
Returns: Возвращает указатель на исходный неуправляемый объект.
Тип IntPtr.