Teigha.DatabaseServices.MeasurementValue
Перечисление MeasurementValue определяет используемую систему единиц измерения.
Перечисление MeasurementValue определяет используемую систему единиц измерения.