Teigha.DatabaseServices.LoftOptionsBuilder.ToLoftOptions
Метод позволяет преобразовать данный объект в объект LoftOptions.
Метод позволяет преобразовать данный объект в объект LoftOptions.
Returns: Возвращает результат преобразования. Тип LoftOptions.