HostMgd.ApplicationServices.DocumentLockModeWillChangeEventArgs
Класс, обеспечивающий данными событие
DocumentLockModeWillChange класса DocumentCollection.

HostMgd.ApplicationServices.DocumentLockModeWillChangeEventArgs.CurrentMode
Возвращает текущий режим блокировки документа.

HostMgd.ApplicationServices.DocumentLockModeWillChangeEventArgs.Document
Соответствует функции HostApDocManager::document() nanoCAD.
Ссылка на документ, соответствующий входной базе данных.

HostMgd.ApplicationServices.DocumentLockModeWillChangeEventArgs.GlobalCommandName
Возвращает имя команды, которая запрашивает произведение
изменений.

HostMgd.ApplicationServices.DocumentLockModeWillChangeEventArgs.MyCurrentMode
Возвращает режим блокировки документа, который был установлен
текущим слоем.

HostMgd.ApplicationServices.DocumentLockModeWillChangeEventArgs.MyNewMode
Возвращает режим блокировки, который будет установлен.