Teigha.DatabaseServices.AssocFlags
Перечисление AssocFlags определяет, какая опорная точка ассоциативного размера используется.
Перечисление AssocFlags определяет, какая опорная точка ассоциативного размера используется.