HostMgd.EditorInput.Editor.Rollover
Событие возникает при наведении курсора на графический примитив,
вызывая его подсветку и позволяя выполнить действие на основе
объекта под курсором.
Событие не реализовано.
Событие инициируется системой nanoCAD при перемещении курсора
над геометрическим объектом, который поддерживает подсветку
(например, линия, окружность, полилиния и др.). Оно срабатывает
до выбора объекта и используется для реализации интерактивного
поведения — например, отображения подсказок, визуальных эффектов,
контекстной информации или динамического анализа объекта под курсором.
Example
C#