Teigha.GraphicsInterface.FinalGatherMode
Данное перечисление определяет режим финальной сборки при расчете общего освещения.
Данное перечисление определяет режим финальной сборки при расчете общего освещения.