Teigha.DatabaseServices.Vertex2dType.SplineFitVertex
Значение: 2. Определяющая точка, автоматически созданная в результате аппроксимации сплайном.
Этот тип вершин может исчезнуть или измениться автоматически при последующих операциях редактирования полилинии.