Teigha.DatabaseServices.Curve.GetGeCurve
Метод предназначен для преобразования объекта Curve в объект типа Curve3d.
Метод предназначен для преобразования объекта Curve в объект типа Curve3d.
Returns: Метод возвращает экземпляр класса Curve3d для данной кривой.