Teigha.DatabaseServices.GridPropertyParameter
Эта структура представляет свойства линий сетки для объектов Table.
Эта структура представляет свойства линий сетки для объектов Table.

Teigha.DatabaseServices.GridPropertyParameter.Color
Свойство представляет цвет линии сетки.
Свойство представляет цвет линии сетки.
Returns: Возвращает цвет линий сетки.  Тип Teigha.Colors.Color.

Teigha.DatabaseServices.GridPropertyParameter.DoubleLineSpacing
Свойство представляет расстояние между двойными линиями, используемое в стиле двойной линии сетки.
Свойство представляет расстояние между двойными линиями, используемое в стиле двойной линии сетки.
Returns: Возвращает расстояние между двойными линиями. Тип double.

Teigha.DatabaseServices.GridPropertyParameter.LineStyle
Свойство представляет стиль линий сетки GridLineStyle.
Свойство представляет стиль линий сетки GridLineStyle.
Returns: Возвращает стиль линий сетки. Тип DatabaseServices.GridLineStyle.

Teigha.DatabaseServices.GridPropertyParameter.LineWeight
Свойство представляет толщину линий сетки.
Свойство представляет толщину линий сетки.
Returns: Возвращает тип линий сетки. Тип DatabaseServices..

Teigha.DatabaseServices.GridPropertyParameter.Linetype
Свойство представляет тип линий сетки.
Свойство представляет тип линий сетки.
Returns: Возвращает идентификатор типа линий сетки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.GridPropertyParameter.PropertyMask
Свойство представляет маску для указания параметров сетки.
Свойства сетки можно комбинировать с помощью операции OR для масок.
Свойство представляет маску для указания параметров сетки.
Свойства сетки можно комбинировать с помощью операции OR для масок.
Returns: Возвращает свойство или комбинацию свойств сетки таблицы. Тип DatabaseServices.GridProperties.

Teigha.DatabaseServices.GridPropertyParameter.Visibility
Свойство представляет видимость линий сетки.
Свойство представляет видимость линий сетки.
Returns: Возвращает видимость линий сетки. Тип DatabaseServices.Visibility.