Teigha.DatabaseServices.DataLinkManager.GetDataLink
Метод позволяет получить коллекцию идентификаторов ObjectId внешних ссылок.
Метод позволяет получить коллекцию идентификаторов ObjectId внешних ссылок.
Returns: Возвращает коллекцию внешних ссылок. Тип ObjectIdCollection.