HostMgd.EditorInput.Editor.SelectLast
Метод предоставляет объект, который был создан последним в чертеже.
Метод используется для получения ссылки на последний созданный
геометрический объект в чертеже. Это может быть полезно
при выполнении команд, которые должны автоматически работать
с самым новым объектом без необходимости его ручного выбора.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, если объект найден, и Cancel, если нет подходящих объектов).
* Value — объект типа SelectionSet, содержащий идентификатор (ObjectId) последнего созданного объекта.
* StringResult — строковое значение (используется, если в запросе были ключевые слова).
Если последний объект успешно найден, статус будет равен PromptStatus.OK, и в Value будет содержаться набор с одним объектом.
Example
C#