HostMgd.EditorInput.JigPrompts.AcquireString
Метод запрашивает у пользователя строку/текстовые данные.
Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры.
После вызова создает пустой экземпляр класса JigPromptStringOptions и
вызывает свою перегрузку JigPrompts.AcquireString(JigPromptStringOptions options).
Returns: Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.