Teigha.DatabaseServices.XrefOperation.XrefDetachOperation
Значение: 2.
Отключает заданный по имени блок внешней ссылки.
Предполагается, что валидный блок внешней ссылки с этим именем существует в базе данных, указанной в базе HostDb (или в текущем документе, если HostDb имеет значение null).