Teigha.DatabaseServices.MLeader.AddLeader
Метод позволяет добавить к данному объекту MLeader новый кластер выноски, состоящий из выносной линии и полки.
Метод позволяет добавить к данному объекту MLeader новый кластер выноски, состоящий из выносной линии и полки.
Returns: Возвращает индекс добавленного кластера. Тип int.