HostMgd.EditorInput.Editor.Dragging
Событие возникает перед началом операции перетаскивания объекта в чертеже.
Событие не реализовано.
Событие предназначено для обработки действий, выполняемых перед началом
интерактивной операции перетаскивания. Оно позволяет приложениям
отслеживать момент начала перемещения объектов с помощью мыши и выполнять
пользовательские действия — например, изменять внешний вид объекта,
сохранять состояние или отменять операцию на уровне приложения.
Событие реализуется через делегат DraggingEventHandler и вызывается до того,
как начнётся фактическая операция перетаскивания.
Notes
В текущей версии не реализовано.
Example
C#