Teigha.DatabaseServices.DimAssoc.RemoveAssociativity
Метод удаляет все связи между размером, объектом DimAssoc и всеми опорными точками.
Метод удаляет все связи между размером, объектом DimAssoc и всеми опорными точками.