Teigha.GraphicsSystem.RenderType.DirectTopmost
Значение: 5.
Режим отрисовки поверх всех других типов рендеринга без использования Z-буфера.
Относится к группе основных предопределенных типов рендеринга.