Teigha.GraphicsInterface.DiagnosticMode.BSP
Значение: 4.
Режим отрисовки псевдоцветного изображения, которое иллюстрируюет затраты на создание и обход BSP-дерева, используемого для трассировки лучей.
Визуализация глубины или размера листьев BSP-дерева задается значением из перечисления DiagnosticBSPMode.