Teigha.BoundaryRepresentation.LoopType.LoopUnclassified
Значение: 0.  Тип цикла ребер в данный момент не может быть определен или является неоднозначным
(например, для циклов на сферических, тороидальных или периодических NURB поверхностях).