HostMgd.EditorInput.ObjectSnapMasks.ApparentIntersection
Значение: 2048 (0x800).
Привязка к кажущемуся пересечению двух объектов, которые не пересекаются в 3D пространстве, но на текущем виде выглядят пересекающимися.