Teigha.DatabaseServices.ProxyEntity
Класс ProxyEntity является базовым классом для прокси-объектов, производных от объектов чертежа в базе данных.
Класс ProxyEntity является базовым классом для прокси-объектов, производных от объектов чертежа в базе данных.

Teigha.DatabaseServices.ProxyEntity.ApplicationDescription
Свойство ApplicationDescription обеспечивает доступ к строке с описанием приложения класса, представленного данным прокси-объектом.
Свойство ApplicationDescription обеспечивает доступ к строке с описанием приложения класса, представленного данным прокси-объектом.
Returns: Возвращает строку с описанием приложения. Тип String.

Teigha.DatabaseServices.ProxyEntity.GraphicsMetafileType
Свойство GraphicsMetafileType представляет тип графического метафайла данного прокси-объекта.
Свойство GraphicsMetafileType представляет тип графического метафайла данного прокси-объекта.
Returns: Возвращает тип графического метафайла.
Значение из перечисления DatabaseServices.GraphicsMetafileType.

Teigha.DatabaseServices.ProxyEntity.OriginalClassName
Свойство OriginalClassName возвращает имя класса пользовательского объекта, представленного данным прокси-объектом.
Свойство OriginalClassName возвращает имя класса пользовательского объекта, представленного данным прокси-объектом.
Returns: Возвращает имя класса пользовательского объекта. Тип String.

Teigha.DatabaseServices.ProxyEntity.OriginalDxfName
Свойство OriginalDxfName возвращает имя DXF пользовательского объекта, представленного данным прокси-объектом.
Свойство OriginalDxfName возвращает имя DXF пользовательского объекта, представленного данным прокси-объектом.
Returns: Возвращает имя DXF пользовательского объекта. Тип String.

Teigha.DatabaseServices.ProxyEntity.ProxyFlags
Свойство ProxyFlags представляет флаги редактирования для класса, связанного с данным прокси-объектом.
Свойство ProxyFlags представляет флаги редактирования для класса, связанного с данным прокси-объектом.
Эти битовые флаги определяют операции, допустимые для этого прокси-объекта.
Свойство возвращает комбинацию одного или нескольких свойств из следующего списка:
Имя                           Значение    Используемый метод
----------------------------  --------    -----------------------------------
kNoOperation                  0x0         Отсутствует.
kEraseAllowed                 0x1         erase()
kTransformAllowed             0x2         transformBy()
kColorChangeAllowed           0x4         setColor(), setColorIndex()
kLayerChangeAllowed           0x8         setLayer()
kLinetypeChangeAllowed        0x10        setLinetype()
kLinetypeScaleChangeAllowed   0x20        setLinetypeScale()
kVisibilityChangeAllowed      0x40        setVisibility()
kCloningAllowed               0x80        subDeepClone(), subWblockClone()
kLineWeightChangeAllowed      0x100       setLineWeight()
kPlotStyleNameChangeAllowed   0x200       setPlotStyleName()
kDisableProxyWarning          0x400       Отключить предупреждения о прокси-объектах.
kMaterialChangeAllowed        0x800       setMaterial()
kAllButCloningAllowed         0xB7F       Все перечисленные выше, кроме клонирования.
kAllAllowedBits               0xBFF       Все перечисленные выше.
Returns: Возвращает флаги редактирования. Тип int.