Teigha.DatabaseServices.PlotSettingsShadePlotType
Данное перечисление определяет режимы тонированной печати, используемые объектом PlotSettings.
От режима тонирования зависит, как будут отображаться видовые экраны при выводе на печать.
Данное перечисление определяет режимы тонированной печати, используемые объектом PlotSettings.
От режима тонирования зависит, как будут отображаться видовые экраны при выводе на печать.