Teigha.DatabaseServices.Polyline.MaximizeMemory
Этот метод "распаковывает" любые запакованные данные памяти,
которые могут быть использованы в полилинии. Это позволяет
ускорить доступ к полилинии для изменения.