Teigha.DatabaseServices.GripOverrule
Данный класс предоставляет методы переопределения ручек объекта.
Данный класс переопределяет подмножество специфических для данного объекта операций, связанных с ручками.
Используется как базовый класс для настройки поведения классов-наследников класса Entity.

Teigha.DatabaseServices.GripOverrule.GetGripPoints(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.GripDataCollection,System.Double,System.Int32,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.GetGripPointsFlags)
Метод предоставляет данные о всех ручках объекта чертежа.
Метод предоставляет данные о всех ручках объекта чертежа.
entity: Объект, тип Entity,
grips: Коллекция ручек, тип GripDataCollection. Может содержать элементы до выполнения метода. Новые элементы вставляются в конец коллекции.
curViewUnitSize: Размер в пикселах единицы измерения чертежа в текущем видовом экране, тип double,
gripSize: Текущий размер ручек в пикселах, тип int,
curViewDir: Текущая ориентация видового экрана, вектор Vector3d,
bitFlags: Флаги из перечисления GetGripPointsFlags.

Teigha.DatabaseServices.GripOverrule.GetGripPoints(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection,Teigha.Geometry.IntegerCollection)
Метод предоставляет данные о всех ручках объекта чертежа.
Метод предоставляет данные о всех ручках объекта чертежа.
entity: Объект чертежа, тип Entity,
gripPoints: Коллекция точек Point3d для ручек а мировой системе координат, тип Point3dCollection,
snapModes: Режимы привязки, коллекция IntegerCollection,
geometryIds: Зарезервирован для будущего использования.

Teigha.DatabaseServices.GripOverrule.GetStretchPoints(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3dCollection)
Метод предоставляет все ручки, позволяющие растягивать объект чертежа.
Метод предоставляет все ручки, позволяющие растягивать объект чертежа.
entity: Объект, тип Entity,
stretchPoints: Коллекция Point3dCollection точек для ручек.

Teigha.DatabaseServices.GripOverrule.MoveGripPointsAt(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.GripDataCollection,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.MoveGripPointsFlags)
Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором.
Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором.
entity: Объект, тип Entity.
grips: Коллекция GripDataCollection перемещаемых ручек. Элементы коллекции должны содержать данные соответствующих ручек.
offset: Вектор Vector3d в мировой системе координат, определяющий направление и величину перемещения ручек.
bitFlags: Битовые флаги из перечисления MoveGripPointsFlags.

Teigha.DatabaseServices.GripOverrule.MoveGripPointsAt(Teigha.DatabaseServices.Entity,Teigha.Geometry.IntegerCollection,Teigha.Geometry.Vector3d)
Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором.
Данный метод осуществляет перемещение указанных ручек, определяемое заданным вектором.
Ручки задаются массивом соответствующих им индексов в коллекции, которую формирует метод GetGripPoints.
entity: Объект, тип Entity,
indices: Массив индексов, тип IntegerCollection.  Порядок индексов ручек определяется методом GetGripPoints.
offset: Вектор смещения ручек в WCS, тип Vector3d.

Teigha.DatabaseServices.GripOverrule.MoveStretchPointsAt(Teigha.DatabaseServices.Entity,Teigha.Geometry.IntegerCollection,Teigha.Geometry.Vector3d)
Метод растягивает объект чертежа, используя заданные ручки.
Метод растягивает объект чертежа, используя заданные ручки.
Вектор перемещения задается в мировой системе координат.
Ручки задаются массивом соответствующих им индексов в коллекции, которую формирует метод GetStretchPoints.
entity: Объект, тип Entity,
indices: Коллекция индексов ручек, тип IntegerCollection,
offset: Вектор смещения ручек, тип Vector3d.

Teigha.DatabaseServices.GripOverrule.OnGripStatusChanged(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.GripStatus)
Метод вызывается, когда объект чертежа оказывается задействованным в операциях с ручками.
Метод вызывается, когда объект чертежа оказывается задействованным в операциях с ручками.
entity: Объект, тип Entity,
status: Статус операции с ручками из перечисления Teigha.DatabaseServices.GripStatus.

Teigha.DatabaseServices.GripOverrule.SetExtensionDictionaryEntryFilter(String)
Включает фильтрацию объектов в словаре расширений перед объектным переопределением.
Включает фильтрацию объектов в словаре расширений перед объектным переопределением.
Используйте этот метод, если требуется, чтобы nanoCAD искал в словаре расширений запись с именем entryName  перед вызовом любого из ваших переопределений.  Переопределения не будут вызываться, если entryName в словаре расширений отсутствует.
entryName: Имя записи в словаре расширений, тип String.

Teigha.DatabaseServices.GripOverrule.SetIdFilter(array)
Включает фильтрацию объектов по идентификатору перед объектным переопределением.
Включает фильтрацию объектов по идентификатору перед объектным переопределением.
Используйте этот метод, когда требуется, чтобы nanoCAD вызывал ваши переопределения только для объектов с идентификаторами из заданного списка.
ids: Массив идентификаторов ObjectId, используемых для фильтрации.

Teigha.DatabaseServices.GripOverrule.SetXDataFilter(String)
Включает фильтрацию по расширенным данным (xdata) прежде чем применить переопределения.
Включает фильтрацию по расширенным данным (xdata) прежде чем применить переопределения.
Используйте этот метод, когда требуется, чтобы nanoCAD выполнял поиск xdata с RegisteredApplicationName в переопределяемом объекте перед вызовом любого из ваших переопределений.
registeredApplicationName: Имя зарегистрированного приложения, тип String.