Teigha.Runtime.WrapperAttribute
Класс WrapperAttribute определяет атрибут, который идентифицирует соответствующий обернутый класс NRX или член класса.
Класс WrapperAttribute определяет атрибут, который идентифицирует соответствующий обернутый класс NRX или член класса.

Teigha.Runtime.WrapperAttribute.#ctor(String)
Конструктор класса WrapperAttribute.
Создает экземпляр класса с указанной входной строкой.
Конструктор класса WrapperAttribute.
Создает экземпляр класса с указанной входной строкой.
wrappedClass: Входная строка. Тип String.

Teigha.Runtime.WrapperAttribute.WrappedClass
Свойство WrappedClass представляет строковое значение атрибута.
Свойство WrappedClass представляет строковое значение атрибута.
Returns: Возвращает строковое значение атрибута. Тип String.