Teigha.GraphicsSystem.View.RemoveViewportClipRegion
Метод удаляет область обрезки, которая была сформирована с использованием свойства ViewportClipRegion.
Метод удаляет область обрезки, которая была сформирована с использованием свойства ViewportClipRegion.