HostMgd.EditorInput.PromptDistanceOptionsEventArgs
Класс предоставляет данные для события PromptingForDistance
и позволяет настроить параметры ввода расстояния перед началом интерактивной операции.
Класс наследуется от EventArgs и используется в .NET API nanoCAD
для передачи параметров ввода расстояния в обработчик события PromptingForDistance.
Он предоставляет доступ к объекту PromptDistanceOptions,
который содержит настройки, передаваемые в команду ввода расстояния — такие как:
* текст приглашения (Message),
* начальное значение (DefaultValue),
* допустимый диапазон (LowerLimit, UpperLimit),
* режимы ввода (AllowNone, AllowNegative, AllowAngle и др.).
Этот класс позволяет разработчикам надстроек динамически изменять параметры
команды ввода расстояния в зависимости от контекста или состояния чертежа.
Example
C#

HostMgd.EditorInput.PromptDistanceOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам ввода расстояния,
используемым при интерактивной команде.
Свойство редназначено для получения объекта PromptDistanceOptions,
который содержит настройки команды ввода расстояния — такие как сообщение,
начальное значение, допустимый диапазон и режимы ввода.
Оно используется, например, в событии PromptingForDistance,
чтобы дать разработчику возможность изменить параметры ввода
перед началом взаимодействия с пользователем.
Свойство позволяет настраивать:
* сообщение приглашения (Message),
* значение по умолчанию (DefaultValue),
* возможность пропуска ввода (AllowNone) и другие параметры.
Это свойство особенно полезно при разработке интерактивных команд,
где требуется гибкая настройка поведения ввода расстояния в зависимости
от контекста или состояния чертежа.
Returns: Возвращает объект типа PromptDistanceOptions, содержащий параметры ввода расстояния.
Если параметры не были инициализированы, может вернуть null.
Example
C#