HostMgd.EditorInput.PromptForEntityEndingEventArgs
Класс предоставляет данные для события PromptForEntityEnding,
возникающего при завершении операции выбора геометрического объекта в редакторе nanoCAD.
Класс наследуется от EventArgs и реализует интерфейс IDisposable.
Он используется для передачи контекстной информации при завершении операции выбора объекта
— например, после вызова методов GetEntity() или других команд,
где пользователь указывает на элемент чертежа. Объект этого класса содержит результат выборки
(идентификатор объекта, точку выбора и статус), что позволяет обработать эти данные до окончательного применения.
Класс создаётся системой при возникновении события PromptForEntityEnding
и должен быть корректно освобождён после использования, так как реализует IDisposable.
Notes
Этот класс применяется для пост-обработки выбора объекта — позволяет получить доступ
к результату выборки и при необходимости изменить его или выполнить дополнительные действия
перед тем, как результат будет использован в команде.
Example
C#

HostMgd.EditorInput.PromptForEntityEndingEventArgs.ReplaceSelectedObject(SelectedObject)
Метод заменяет выделенный объект на новый, переданный в параметре.
Метод используется для замены ранее выбранного пользователем объекта
на другой объект, который должен быть подготовлен и передан в виде
экземпляра класса SelectedObject. Метод применяется в интерактивных командах,
где требуется модифицировать выборку — например, при редактировании
или замене элементов чертежа. После вызова метода выбранный объект
в контексте ввода заменяется на указанный newValue.
newValue: Новый объект, который будет использован для замены текущего

HostMgd.EditorInput.PromptForEntityEndingEventArgs.Result
Свойство предоставляет доступ к результату операции выбора объекта,
включая статус и данные о выбранном элементе.
Свойство возвращает объект типа PromptEntityResult,
который содержит информацию о результате интерактивной операции
выбора геометрического объекта — например, после вызова методов
GetEntity() или других команд, где пользователь выбирает объект мышью.
Статус операции (успех, отмена, ошибка) и данные о выбранной точке
или объекте становятся доступны через это свойство.
Оно используется, в том числе при обработке событий PromptForEntityEnding.
Returns: Возвращает объект типа PromptEntityResult, который может содержать:
* Status — статус выполнения (PromptStatus.OK, PromptStatus.Cancel, PromptStatus.Error и др.).
* ObjectId — идентификатор выбранного объекта.
* PickedPoint — координата точки, в которой был выбран объект.
* InputString — строковое значение, если операция завершилась вводом с клавиатуры.
Если операция не была выполнена или произошла ошибка,
результат может быть равен null или содержать статус Cancel.
Example
C#