Teigha.DatabaseServices.SelectType.Crossing
Значение: 2. Режим выбора секущей рамкой.
Область выбора определяется двумя точками, которые задают прямоугольную рамку.
Выбираются только те объекты, которые полностью находятся внутри рамки или пересекают ее.