Teigha.Geometry.Position3d
Класс Position3d представляет точки как позиции в трехмерном пространстве.
Класс Position3d представляет точки как позиции в трехмерном пространстве.

Teigha.Geometry.Position3d.#ctor
Конструктор по умолчанию класса Position3d.
Создает объект позиции с координатами (0,0,0).
Конструктор по умолчанию класса Position3d.
Создает объект позиции с координатами (0,0,0).

Teigha.Geometry.Position3d.#ctor(System.Double,System.Double,System.Double)
Конструктор класса Position3d.
Создает экземпляр класса с указанными параметрами.
Создает объект позиции в точке c указанными координатами (x,y,z).
Конструктор класса Position3d.
Создает экземпляр класса с указанными параметрами.
Создает объект позиции в точке c указанными координатами (x,y,z).
x: Координата позиции по оси X. Тип double.
y: Координата позиции по оси Y. Тип double
z: Координата позиции по оси Z. Тип double.

Teigha.Geometry.Position3d.#ctor(Teigha.Geometry.Point3d)
Конструктор класса Position3d.
Создает объект позиции в указанной 3D-точке.
Конструктор класса Position3d.
Создает объект позиции в указанной 3D-точке.
point: Входная точка, в которой создается объект позиции. Тип Point3d.

Teigha.Geometry.Position3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Position3d.

Teigha.Geometry.Position3d.Set(System.Double,System.Double,System.Double)
Метод переопределяет координатную привязку данного объекта позиции, используя указанные значения (x,y,z).
Метод переопределяет координатную привязку данного объекта позиции, используя указанные значения (x,y,z).
x: Входная координата по оси X. Тип double.
y: Входная координата по оси Y. Тип double.
z: Входная координата по оси Z. Тип double.

Teigha.Geometry.Position3d.Set(Teigha.Geometry.Point3d)
Метод переопределяет координатную привязку данного объекта позиции на основе указанной 3D-точки.
Метод переопределяет координатную привязку данного объекта позиции на основе указанной 3D-точки.
point: Входная 3D-точка, определяющая новое положение данного объекта позиции. Тип Point3d.