Teigha.DatabaseServices.SectionGeometry
Перечисление SectionGeometry определяет типы элементов геометрии, составляющих сечения и разрезы.
Перечисление SectionGeometry определяет типы элементов геометрии, составляющих сечения и разрезы.
Используется для настройки свойств этой геометрии.