Teigha.Geometry.GeoDataLonLatAltInfo
Структура GeoDataLonLatAltInfo представляет географические координаты точки, включающие долготу, широту и высоту.
Структура GeoDataLonLatAltInfo представляет географические координаты точки, включающие долготу, широту и высоту.

Teigha.Geometry.GeoDataLonLatAltInfo.#ctor(System.Double,System.Double,System.Double)
Конструктор структуры GeoDataLonLatAltInfo.
Создает новый экземпляр структуры с указанными значениями долготы, широты и высоты.
Конструктор структуры GeoDataLonLatAltInfo.
Создает новый экземпляр структуры с указанными значениями долготы, широты и высоты.
Notes
Эта структура удобна для хранения и передачи геопространственных данных.
dbLong: Долгота в градусах. Тип double.
dbLat: Широта в градусах. Тип double.
dbAlt: Высота над уровнем моря в метрах. Тип double.

Teigha.Geometry.GeoDataLonLatAltInfo.Altitude
Свойство Altitude представляет долготу в градусах.
Свойство Altitude представляет долготу в градусах.
Returns: Возвращает долготу в градусах.
Тип double.

Teigha.Geometry.GeoDataLonLatAltInfo.Latitude
Свойство Latitude представляет широту в градусах.
Свойство Latitude представляет широту в градусах.
Returns: Возвращает широту в градусах.
Тип double.

Teigha.Geometry.GeoDataLonLatAltInfo.Longitude
Свойство Longitude представляет высоту над уровнем моря в метрах.
Свойство Longitude представляет высоту над уровнем моря в метрах.
Returns: Возвращает высоту над уровнем моря в метрах.
Тип double.