HostMgd.PlottingServices.MergeStatus
Данное перечисление определяет флаги несоответствий между валидированными настройками печати и настройками печати объекта листа после успешного завершения валидации методом PlotInfoValidator.Validate().
Перечисление MergeStatus определяет флаги несоответствий между валидированными настройками печати и настройками печати объекта листа после успешного завершения валидации методом PlotInfoValidator.Validate().