HostMgd.EditorInput.PromptIntegerOptionsEventHandler
Делегат предназначен для обработки события, возникающего перед началом ввода
целого числа, и позволяет настроить параметры команды.
Делегат используется как тип обработчика для события PromptingForInteger,
которое генерируется перед началом интерактивного ввода целого числа — например,
при вызове метода GetInteger() в .NET API nanoCAD.
Он позволяет разработчику изменить параметры ввода в реальном времени, такие как:
* текст приглашения (Message),
* значение по умолчанию (DefaultValue),
* допустимый диапазон (LowerLimit, UpperLimit),
* режимы ввода (AllowNone, AllowZero, AllowNegative и др.).
Этот делегат является ключевым элементом при создании интерактивных команд,
где требуется точная настройка поведения ввода целого числа в зависимости от контекста — например,
при задании количества, номера слоя или параметра операции.
sender: Источник события — обычно экземпляр редактора (Editor), в котором происходит ввод.
e: Объект, содержащий параметры ввода целого числа