Teigha.DatabaseServices.TextHorizontalMode.TextFit
Значение: 5.
Текст вписывается в заданную ширину за счет равномерного растяжения всех символов текста, включая пробелы, межбуквенные интервалы и сами буквы. Высота текста  остается без изменения.