Teigha.Geometry.NurbCurve2d.MakeNonPeriodic
Метод делает данную кривую непериодической (если она таковой еще не является).
Метод позволяет сделать периодическую кривую непериодической.
Закрепление на концах обеспечивается введением полной кратности узлов в начальной и конечной точках.