Teigha.DatabaseServices.Table.TableStyleOverrides
Метод получает переопределения табличных стилей.
Метод получает переопределения табличных стилей объекта Table.
Returns: Возвращает массив переопределений табличных стилей. Тип TableStyleOverride[].