Teigha.DatabaseServices.CustomScale.ToString
Метод предназначен для формирования эквивалентного строкового представления данного объекта.
Метод предназначен для формирования эквивалентного строкового представления данного объекта.
Returns: Возвращает строку, которая содержит значения числителя и знаменателя пользовательского масштаба. Тип String.