Teigha.Geometry.Sphere
Класс Sphere представляет сферическую поверхность.
Класс Sphere представляет сферическую поверхность.
Объект сферы описывается ее центром center и радиусом radius, а также двумя векторами northAxis и refAxis.  Вектор northAxis определяет направление от центра сферы к ее северному полюсу.  Вектор refAxis, ортогональный вектору northAxis, определяет положение нулевого меридиана.
Широта определяется параметром U, который для замкнутой сферы по умолчанию определен на интервале [-PI/2, +PI/2].  Нижняя граница соответствует южному полюсу, ноль соответствует экватору, а верхняя граница соответствует северному полюсу.
Долгота определяется параметром V, который для замкнутой сферы по умолчанию определен на интервале [-PI, +PI).  Нулевое значение V соответствует меридиану, положение которого определяется вектором refAxis этой сферы.  Положительное направление изменения параметра V определяется правилом правой руки при вращении вдоль вектора northAxis.
Поверхность полной сферы является периодической по V с периодом 2*PI.
Всякая комбинация двух параметрических интервалов [umin, umax] и [vmin, vmax] определяет четырехсторонний участок сферы, ограниченный двумя меридиональными и двумя широтными дугами. Здесь применяются следующие ограничения:
* umin  и |umin - umax| .
* vmin  и |vmin - vmax| .

Teigha.Geometry.Sphere.#ctor
Конструктор по умолчанию класса Sphere.
Создает единичную сферу с центром в начале координат.
Конструктор по умолчанию класса Sphere.
Создает единичную сферу с центром в начале координат.

Teigha.Geometry.Sphere.#ctor(System.Double,Teigha.Geometry.Point3d)
Конструктор класса Sphere.
Создает сферу с указанными центром и радиусом.
Конструктор класса Sphere.
Создает сферу с указанными центром и радиусом.
radius: Радиус сферы. Тип double.
center: Точка центра сферы. Тип Point3d.

Teigha.Geometry.Sphere.#ctor(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса Sphere.
Создает сферическую поверхность с заданными центром и радиусом, направлениями на северный полюс и нулевой меридиан, а также с заданными пределами изменения параметров по широте и долготе.
Конструктор класса Sphere.
Создает сферическую поверхность с заданными центром и радиусом, направлениями на северный полюс и нулевой меридиан, а также с заданными пределами изменения параметров по широте и долготе.
radius: Радиус сферы. Тип double.
center: Точка центра сферы. Тип Point3d.
northAxis: Направление на северный полюс из центра сферы. Тип Vector3d.
referenceAxis: Направление, определяющее положение нулевого меридиана. Тип Vector3d.
startAngleU: Начальная долгота, определяемая параметром U.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен -PI/2 .
endAngleU: Конечная  долгота, определяемая параметром U.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен +PI/2 .
startAngleV: Начальная широта,  определяемая параметром V.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен -PI.
endAngleV: Конечная  широта,  определяемая параметром V.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен +PI.

Teigha.Geometry.Sphere.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Sphere.

Teigha.Geometry.Sphere.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точки пересечения данной сферы с указанным линейным объектом.
Используется точность по умолчанию.
Метод вычисляет точки пересечения данной сферы с указанным линейным объектом.
Используется вызов метода Sphere.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
linearEntity: Линейный объект, для которого требуется определить точки пересечения с данной сферой. Тип LinearEntity3d.
Returns: Возвращает двухэлементный массив.  Тип Point3d[].
Элемент с индексом 0 соответствует первой точке пересечения (если она существует), а элемент с индексом 1 - второй точке пересечения (если она существует).  Метод возвращает NULL при отсутствии точек пересечения, а также если метод не смог их определить.

Teigha.Geometry.Sphere.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данной сферы с указанным линейным объектом, используя заданную точность.
Метод вычисляет точки пересечения данной сферы с указанным линейным объектом, используя заданную точность.
linearEntity: Линейный объект, для которого требуется определить точки пересечения с данной сферой. Тип LinearEntity3d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает двухэлементный массив.  Тип Point3d[].
Элемент с индексом 0 соответствует первой точке пересечения (если она существует), а элемент с индексом 1 - второй точке пересечения (если она существует).
Метод возвращает NULL при отсутствии точек пересечения, а также если метод не смог их определить.

Teigha.Geometry.Sphere.IsClosed(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный объект полной сферой в пределах указанной точности.
Метод позволяет проверить, является ли данный объект полной сферой в пределах указанной точности.
Экватор полной (замкнутой) сферической поверхности представляет собой полную окружность.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный объект можно считать полной сферой.
В противном случае возвращает false.

Teigha.Geometry.Sphere.Set(System.Double,Teigha.Geometry.Point3d)
Метод позволяет переопределить точку центра и радиус данной сферы.
Метод позволяет переопределить точку центра и радиус данной сферы.
radius: Новое значение радиуса сферы.  Тип double.
center: Новая точка центра сферы.  Тип Point3d.

Teigha.Geometry.Sphere.Set(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Метод позволяет переопределить все параметры данной сферической поверхности.
Метод позволяет переопределить все параметры данной сферической поверхности, задав новые центр и радиус, направления на северный полюс и нулевой меридиан, а также новые пределы изменения параметров по широте и долготе.
radius: Радиус сферы. Тип double.
center: Точка центра сферы. Тип Point3d.
northAxis: Направление на северный полюс из центра сферы. Тип Vector3d.
referenceAxis: Направление, определяющее положение нулевого меридиана. Тип Vector3d.
startAngleU: Начальная долгота, определяемая параметром U.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен -PI/2 .
endAngleU: Конечная  долгота, определяемая параметром U.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен +PI/2 .
startAngleV: Начальная широта,  определяемая параметром V.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен -PI.
endAngleV: Конечная  широта,  определяемая параметром V.  Тип double. В случае полной (замкнутой) сферы угол должен быть равен +PI.

Teigha.Geometry.Sphere.SetAnglesInU(System.Double,System.Double)
Метод переопределяет параметрический диапазон данной сферической поверхности по долготе (параметр U).
Метод переопределяет параметрический диапазон данной сферической поверхности по долготе (параметр U).
startAngle: Новое значение начальной долготы, которая определяется параметром U. Тип double. В случае полной (замкнутой) сферы этот угол должен быть равен -PI/2 .
endAngle: Новое значение конечной долготы, которая определяется параметром U.  Тип double. В случае полной (замкнутой) сферы этот угол должен быть равен +PI/2 .

Teigha.Geometry.Sphere.SetAnglesInV(System.Double,System.Double)
Метод переопределяет параметрический диапазон данной сферической поверхности по широте (параметр V).
Метод переопределяет параметрический диапазон данной сферической поверхности по широте (параметр V).
startAngle: Новое значение начальной широты, которая определяется параметром V.  Тип double.  В случае полной (замкнутой) сферы этот угол должен быть равен -PI.
endAngle: Новое значение конечной широты,  которая определяется параметром V.  Тип double.  В случае полной (замкнутой) сферы этот угол должен быть равен +PI.

Teigha.Geometry.Sphere.Center
Свойство Center представляет текущее положение центра данной сферической поверхности.
Свойство Center представляет текущее положение центра данной сферической поверхности.
Returns: Возвращает точку центра данной сферической поверхности.
Тип Point3d.

Teigha.Geometry.Sphere.IsOuterNormal
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль данной сферической поверхности наружу.
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль данной сферической поверхности наружу.
Returns: Возвращает true, если нормаль данной сферической поверхности направлена наружу.
В противном случае возвращает false.

Teigha.Geometry.Sphere.NorthAxis
Свойство NorthAxis представляет направление на северный полюс данной сферы.
Свойство NorthAxis представляет направление на северный полюс данной сферы.
Returns: Возвращает направление на северный полюс данной сферы.
Тип Vector3d.

Teigha.Geometry.Sphere.NorthPole
Свойство NorthPole представляет положение северного полюса данной сферы.
Свойство NorthPole представляет положение северного полюса данной сферы.
Returns: Возвращает точку северного полюса данной сферы.
Тип Point3d.

Teigha.Geometry.Sphere.Radius
Свойство Radius представляет текущее значение радиуса данной сферы.
Свойство Radius представляет текущее значение радиуса данной сферы.
Returns: Возвращает текущее значение радиуса данной сферы.
Тип double.

Teigha.Geometry.Sphere.ReferenceAxis
Свойство ReferenceAxis представляет направление из центра сферы на нулевой меридиан.
Свойство ReferenceAxis представляет направление из центра сферы на нулевой меридиан.
Returns: Возвращает направление из центра сферы на нулевой меридиан.
Тип Vector3d.

Teigha.Geometry.Sphere.SouthPole
Свойство SouthPole представляет положение южного полюса данной сферы.
Свойство SouthPole представляет положение южного полюса данной сферы.
Returns: Возвращает точку южного полюса данной сферы.
Тип Point3d.