Teigha.DatabaseServices.DwgFiler.ReadVector3d
Метод предназначен для получения трехмерного вектора из текущего элемента данного объекта Filer.
Метод предназначен для получения трехмерного вектора из текущего элемента данного объекта Filer.
Returns: Возвращает трехмерный вектор. Тип Vector3d.