Teigha.DatabaseServices.UnderlayReference.GetClipBoundary
Метод предоставляет массив точек, определяющих границу обрезки данной подложки.
Метод предоставляет массив точек, определяющих границу обрезки данной подложки.
Notes
Граница определяется в координатах модели.
Для перехода к координатам мировой системы координат (WCS) используйте матрицу преобразования, возвращаемую свойством UnderlayReference.Transform.
Returns: Возвращает массив точек границы обрезки. Тип Point2d[].