Teigha.DatabaseServices.Light
Этот класс представляет шаблон для всех общих свойств источников света, хранящихся в базе данных.
Этот класс представляет шаблон для всех общих свойств источников света, хранящихся в базе данных.

Teigha.DatabaseServices.Light.#ctor
Конструктор по умолчанию класса Light.
Конструктор по умолчанию класса Light.

Teigha.DatabaseServices.Light.SetHotspotAndFalloff(System.Double,System.Double)
Метод определяет световое пятно и спад освещенности конуса направленного света.
Метод определяет световое пятно и спад освещенности конуса направленного света.
hotspot: Угол светового конуса в радианах. Тип double. Определяет наиболее яркую часть светового пучка.
falloff: Угол поля направленного света, в радианах. Тип double. Определяет полный световой конус.

Teigha.DatabaseServices.Light.Attenuation
Свойство предоставляет доступ к информации о пределах затухания источника света.
Свойство предоставляет доступ к информации о пределах затухания источника света.
Returns: Возвращает объект LightAttenuation с информацией о пределах затухания источника света.

Teigha.DatabaseServices.Light.AttenuationType
Свойство представляет тип затухания данного источника света.
Свойство представляет тип затухания данного источника света (линейная / квадратичная инверсия, либо отсутствие затухания).
Returns: Возвращает тип затухания. Перечисление AttenuationType.

Teigha.DatabaseServices.Light.Direction
Свойство представляет направление удаленного источника света.
Свойство представляет направление удаленного источника света.
Returns: Возвращает направление излучения света. Тип Vector3d.

Teigha.DatabaseServices.Light.EndLimitOffset
Свойство представляет конечный предел затухания источника света.
Свойство представляет конечный предел затухания источника света.
В областях за этим пределом уровни освещенности считаются пренебрежимо малыми и не вычисляются.
Returns: Возвращает удаление плоскости отсечения конечного предела затухания источника света.
Тип double.

Teigha.DatabaseServices.Light.FalloffAngle
Свойство представляет полный угол светового конуса, геометрически определяющий спад освещенности для данного источника света.
Свойство представляет полный угол светового конуса, геометрически определяющий спад освещенности для данного источника света.
Returns: Возвращает полный угол светового конуса (в радианах). Тип double.

Teigha.DatabaseServices.Light.GlyphDisplayType
Свойство представляет вариант отображения глифа для данного источника света.
Свойство представляет вариант отображения глифа для данного источника света.
Returns: Возвращает вариант отображения глифа для данного источника света. Перечисление GlyphDisplayType.

Teigha.DatabaseServices.Light.HasTarget
Свойство позволяет проверить, отображает ли данный источник света ручку цели для выбора направления распространения света.
Свойство позволяет проверить, отображает ли данный источник света ручку цели для выбора направления распространения света.
Returns: Возвращает true, если ручка отображается.
В противном случае возвращает false.

Teigha.DatabaseServices.Light.HotspotAngle
Свойство возвращает угол светового пучка источника света, определяющий самую яркую его часть (наиболее яркое пятно данного источника).
Свойство возвращает угол светового пучка источника света, определяющий самую яркую его часть (наиболее яркое пятно данного источника).
Returns: Возвращает угол светового пучка (в радианах). Тип double.

Teigha.DatabaseServices.Light.IlluminanceDistance
Свойство представляет дальность освещения для данного источника света.
Свойство представляет дальность освещения для данного источника света.
Имеет смысл при условии, что свойству Light.PhysicalIntensity присвоено значение Illuminance.
Returns: Возвращает дальность освещения. Тип double.

Teigha.DatabaseServices.Light.Intensity
Свойство представляет интенсивность данного источника света.
Свойство представляет интенсивность данного источника света.
Значение 0.0 означает, что источник выключен.
Returns: Возвращает интенсивность источника света. Тип double.

Teigha.DatabaseServices.Light.IsOn
Свойство позволяет проверить, включен ли данный источник света.
Свойство позволяет проверить, включен ли данный источник света.
Returns: Возвращает true, если источник света включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Light.IsPlottable
Свойство позволяет проверить, отображается ли этот источник света при печати.
Свойство позволяет проверить, отображается ли этот источник света при печати.
Returns: Возвращает true, если источник при печати отображается.
В противном случае возвращает false.

Teigha.DatabaseServices.Light.LampColorPreset
Свойство представляет предустановленный цвет лампы данного источника света.
Свойство представляет предустановленный цвет лампы данного источника света.
Returns: Возвращает цвет лампы. Перечисление LampColorPreset.

Teigha.DatabaseServices.Light.LampColorRGB
Свойство представляет значение RGB цвета лампы данного источника света.
Свойство представляет значение RGB цвета лампы данного источника света.
Returns: Возвращает значение RGB цвета лампы. Тип ColorRGB.

Teigha.DatabaseServices.Light.LampColorTemp
Свойство представляет цветовую температуру источника в Кельвинах, если в свойстве Light.LampColorType задан тип
LampColorType.Kelvin.
Свойство представляет цветовую температуру источника в Кельвинах, если в свойстве Light.LampColorType задан тип
LampColorType.Kelvin.
Returns: Возвращает цветовую температуру источника в Кельвинах. Тип double.

Teigha.DatabaseServices.Light.LampColorType
Свойство представляет тип цвета лампы, который определяет, как именно задается цвет лампы (цветовая температура в Кельвинах или предустановленный цвет лампы).
Свойство представляет тип цвета лампы, который определяет, как именно задается цвет лампы (цветовая температура в Кельвинах или предустановленный цвет лампы).
Returns: Возвращает тип цвета лампы. Перечисление LampColorType.

Teigha.DatabaseServices.Light.LightColor
Свойство представляет цвет данного источника света.
Свойство представляет цвет данного источника света.
Returns: Возвращает цвет источника света.  Тип Color.

Teigha.DatabaseServices.Light.LightType
Свойство представляет тип данного источника света: DistantLight, PointLight, SpotLight или WebLight.
Свойство представляет тип данного источника света: DistantLight, PointLight, SpotLight или WebLight.
Returns: Возвращает тип источника света. Перечисление DrawableType.

Teigha.DatabaseServices.Light.MapSize
Свойство представляет размер карты теней. Возможные значения: 64, 128, 256, 512, 1024, 2048 или 4096.
Свойство представляет размер карты теней. Возможные значения: 64, 128, 256, 512, 1024, 2048 или 4096.
Returns: Возвращает размер карты теней.
Тип int.

Teigha.DatabaseServices.Light.Name
Свойство представляет наименование данного источника света.
Свойство представляет наименование данного источника света.
Returns: Возвращает наименование источника света.
Тип String.

Teigha.DatabaseServices.Light.PhysicalIntensity
Свойство представляет физическую интенсивность источника света.
Свойство представляет физическую интенсивность источника света.
Используемые единицы измерения зависят от выбора метода расчета физической интенсивности, заданного в свойстве
Light.PhysicalIntensityMethod (т.е. кандела для PeakIntensity, люмен для Flux и люкс для Illuminance).
Returns: Возвращает физическую интенсивность источника света.
Тип double.

Teigha.DatabaseServices.Light.PhysicalIntensityMethod
Свойство представляет способ задания физической интенсивности данного источника света. Он определяет метод вычисления физической интенсивности света (по пиковой интенсивности, по потоку или по освещенности).
Свойство представляет способ задания физической интенсивности данного источника света. Он определяет метод вычисления физической интенсивности света (по пиковой интенсивности, по потоку или по освещенности).
Returns: Возвращает метод вычисления физической интенсивности света. Перечисление PhysicalIntensityMethod.

Teigha.DatabaseServices.Light.Position
Свойство представляет положение точечного источника света и прожектора.
Свойство представляет положение точечного источника света и прожектора.
Returns: Возвращает положение источника света в пространстве.  Тип Point3d.

Teigha.DatabaseServices.Light.Shadow
Свойство представляет параметры тени для данного источника света.
Свойство представляет параметры тени для данного источника света.
Returns: Возвращает параметры тени для источника света.
Тип ShadowParameters.

Teigha.DatabaseServices.Light.ShadowType
Свойство представляет тип тени для данного источника света.
Свойство представляет тип тени для данного источника света.
Returns: Возвращает тип тени для источника света.
Перечисление ShadowType.

Teigha.DatabaseServices.Light.Softness
Свойство представляет параметр мягкости тени для данного источника света.
Свойство представляет параметр мягкости тени для данного источника света.
Returns: Возвращает параметр мягкости тени.
Тип int.

Teigha.DatabaseServices.Light.StartLimitOffset
Свойство представляет начальный предел затухания для данного источника света.
Свойство представляет начальный предел затухания для данного источника света.
В областях до этого предела уровни освещенности считаются близкими к максимальным и не вычисляются.
Returns: Возвращает начальный предел затухания освещения.
Тип double.

Teigha.DatabaseServices.Light.TargetLocation
Свойство представляет положение цели данного источника света.
Свойство представляет положение цели данного источника света.
Returns: Возвращает положение цели источника света.
Тип Point3d.

Teigha.DatabaseServices.Light.UseLimits
Свойство позволяет проверить, используются ли пределы в расчетах затухания света от источника.
Свойство позволяет проверить, используются ли пределы в расчетах затухания света от источника.
Returns: Возвращает true, если пределы используются в расчетах затухания света.
В противном случае возвращает false.

Teigha.DatabaseServices.Light.WebFile
Свойство представляет полный путь к файлу световой сетки с гониометрическими данными источника света (файл IES).
Свойство представляет полный путь к файлу световой сетки, в котором хранятся гониометрические данные источника света (файл IES).
Returns: Возвращает полный путь к файлу световой сетки.
Тип String.

Teigha.DatabaseServices.Light.WebRotation
Свойство представляет угловые смещения световой сетки, необходимые для ориентирования гониометрических данных относительно текущей ориентации источника света.
Свойство представляет угловые смещения световой сетки вокруг оптических осей X, Y и Z, необходимые для ориентирования гониометрических данных относительно текущей ориентации источника света.
Returns: Возвращает угловые смещения световой сетки вокруг оптических осей X, Y и Z (в радианах).
Тип Vector3d.