Teigha.DatabaseServices.FitData.GetFitPoints
Метод предоставляет коллекцию определяющих точек сплайна, заданных в координатах WCS.
Метод предоставляет коллекцию определяющих точек сплайна, заданных в координатах WCS.
Returns: Возвращает коллекцию определяющих точек сплайна. Тип Point3dCollection.