Teigha.GraphicsInterface.VisualStyle
Класс VisualStyle представляет набор визуальных свойств, которые можно применять к графическим объектам.
Класс VisualStyle представляет визуальный стиль как набор визуальных свойств, которые можно применять к графическим объектам.

Teigha.GraphicsInterface.VisualStyle.#ctor
Конструктор по умолчанию класса VisualStyle.
Конструктор по умолчанию класса VisualStyle.
Создает новый экземпляр класса со свойствами по умолчанию.

Teigha.GraphicsInterface.VisualStyle.#ctor(Teigha.GraphicsInterface.VisualStyleType)
Конструктор класса VisualStyle.
Создает новый объект визуального стиля указанного типа.
Конструктор класса VisualStyle.
Создает новый объект визуального стиля, тип которого определяется аргументом type.
Notes
Этот конструктор изменяет ряд свойств объекта VisualStyle для создания визуального стиля заказанного типа.
type: Тип визуального стиля. Перечисление VisualStyleType.

Teigha.GraphicsInterface.VisualStyle.ConfigureForType(Teigha.GraphicsInterface.VisualStyleType)
Метод позволяет переопределить все свойства данного объекта, чтобы обеспечить соответствие визуальному стилю указанного типа.
Метод позволяет переопределить все свойства данного объекта, чтобы обеспечить соответствие визуальному стилю указанного типа.
Notes
Метод выбрасывает исключение, если входной тип оказывается недопустимым.
type: Тип визуального стиля. Перечисление VisualStyleType.

Teigha.GraphicsInterface.VisualStyle.DisplayStyle
Свойство DisplayStyle представляет стиль отображения DisplayStyle данного визуального стиля.
Свойство DisplayStyle представляет стиль отображения DisplayStyle данного визуального стиля.
Returns: Возвращает стиль отображения для данного объекта.
Тип GraphicsInterface.DisplayStyle.

Teigha.GraphicsInterface.VisualStyle.EdgeStyle
Свойство EdgeStyle представляет стиль представления рёбер EdgeStyle для этого визуального стиля.
Свойство EdgeStyle представляет стиль представления рёбер EdgeStyle для этого визуального стиля.
Returns: Возвращает стиль представления рёбер.
Тип GraphicsInterface.EdgeStyle.

Teigha.GraphicsInterface.VisualStyle.FaceStyle
Свойство FaceStyle представляет стиль представления граней FaceStyle для этого визуального стиля.
Свойство FaceStyle представляет стиль представления граней FaceStyle для этого визуального стиля.
Returns: Возвращает стиль представления граней.
Тип GraphicsInterface.FaceStyle.