HostMgd.ApplicationServices.InplaceTextEditor.Undo
Метод отменяет последнюю выполненную операцию.
В текущей версии не реализован.
Метод реализует отмену последней выполненной операции.
В текущей версии данный метод не реализован.