Teigha.DatabaseServices.NewLayerNotification.NotifyOnXrefAttachAndReload
Значение: 4.
Выводить уведомление всякий раз, когда новые слои существуют во внешней ссылке, которая на данный момент вставлена или перезагружена.