Teigha.DatabaseServices.GeoLocationData.PostToDb
Метод позволяет отправить этот объект в словарь расширений размера или объекта MLeader.
Метод позволяет отправить этот объект в словарь расширений размера или объекта MLeader.
Returns: Возвращает идентификатор полученного объекта. Тип ObjectId.