Teigha.DatabaseServices.RadialDimension
Класс RadialDimension представляет радиальный размер в базе данных.
Класс RadialDimension представляет радиальный размер в базе данных.

Teigha.DatabaseServices.RadialDimension.#ctor
Конструктор по умолчанию класса RadialDimension.
Конструктор по умолчанию класса RadialDimension.
Создает объект радиального размера с координатами центра и концов хорды (0, 0, 0) и нулевой длиной выноски.

Teigha.DatabaseServices.RadialDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Double,String,DatabaseServices.ObjectId)
Конструктор класса RadialDimension. Создает объект радиального размера с указанными параметрами.
Конструктор класса RadialDimension. Создает объект радиального размера с указанными параметрами.
center: Точка центра измеряемой окружности или дуги. Тип Point3d.
chordPoint: Точка хорды на измеряемой окружности или дуге, к которой проводится размерная линия. Тип Point3d.
leaderLength: Длина линии выноски (расстояние от точки хорды до линии полки размера). Тип double.
dimensionText: Размерный текст для замены текста измеренного значения. Тип String.
dimensionStyle: Идентификатор объекта размерного стиля, который используется для отрисовки объекта измерения.

Teigha.DatabaseServices.RadialDimension.center
Свойство Center представляет трехмерные координаты (WCS) центра измеряемой дуги или окружности.
Свойство Center представляет трехмерные координаты (WCS) центра измеряемой дуги или окружности.
Returns: Возвращает центр дуги или окружности в мировой системе координат (WCS).
Тип Point3d.

Teigha.DatabaseServices.RadialDimension.chordPoint
Свойство ChordPoint представляет точку пересечения размерной линии и дуги или окружности, для которых проставляется размер.
Свойство ChordPoint представляет точку пересечения размерной линии и дуги или окружности, для которых проставляется размер.
Returns: Возвращает координаты точки в мировой системе координат (WCS). Тип Point3d.

Teigha.DatabaseServices.RadialDimension.LeaderLength
Свойство LeaderLength представляет длину линии выноски данного размера.
Свойство LeaderLength представляет длину линии выноски данного размера.
Это расстояние от точки хорды ChordPoint до начала линии полки.
Returns: Возвращает длину линии выноски. Тип double.