Teigha.GraphicsInterface.GIRasterImage.PaletteData
Метод извлекает из данного растрового изображения его цветовую палитру в формате BMP.
Метод извлекает из данного растрового изображения его цветовую палитру в формате BMP.
Returns: Возвращает массив, который представляет цветовую палитру.
Тип unsigned char[].