Teigha.DatabaseServices.Wipeout
Класс Wipeout представляет в базе данных растровые объекты с полигональной границей, которые используются в качестве масок (маскирующих объектов), чтобы перекрывать элементы других объектов на чертеже.
Класс Wipeout представляет в базе данных растровые объекты с полигональной границей, которые используются в качестве масок (маскирующих объектов) для перекрытия элементов других объектов на чертеже.
Чаще всего применяются в качестве фоновой маски для текстовых объектов.

Teigha.DatabaseServices.Wipeout.#ctor
Конструктор по умолчанию класса Wipeout.
Конструктор по умолчанию класса Wipeout.

Teigha.DatabaseServices.Wipeout.SetFrom(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector3d)
Метод позволяет задать ориентацию и границу данной маски.
Метод позволяет задать ориентацию и границу данной маски.
Граница определяется массивом двумерных вершин, а ориентация - вектором нормали плоскости границы.
points: Коллекция 2D-точек, которые определяют новую границу данной маски.  Тип Point2dCollection.
normal: Вектор нормали плоскости границы. Тип Vector3d.

Teigha.DatabaseServices.Wipeout.HasFrame
Свойство HasFrame позволяет определить, отображается ли граница данной маски.
Свойство HasFrame позволяет определить, отображается ли граница (рамка) данной маски.
Returns: Возвращает true, если граница маски отображается.
В противном случае возвращает false.