Teigha.DatabaseServices.DBObject.UpgradeOpen
Метод обновляет этот объект из режима "для чтения" в режим "для записи".
Если объект в текущее время открыт в режиме OpenMode.ForRead для
единственного контекста, читающего объект, то эта функция обновляет
режим открытия до уровня доступа OpenMode.ForWrite. В процессе изменения режима
открытия как открытия на запись, объект закрывается, что вызывает
соответствующие уведомления.
Note
Вызов этого метода не должен быть согласован с вызовом
DowngradeOpen(), поскольку вызова Close() или Cancel()
достаточно для очистки статуса открытия геометрического
объекта.