Teigha.DatabaseServices.ObjectId.!=
Возвращает true, если a не равно b.
Возвращает true, если a не равно b.
a: Левый операнд, тип ObjectId.
b: Правый операнд, тип ObjectId.
Returns: Возвращает true, если a не равно b, иначе - false.