Teigha.BoundaryRepresentation.BoundaryLoop
Класс BoundaryLoop представляет функционал, относящийся к уровню цикла грани BREP.
Класс BoundaryLoop — это интерфейсный класс, который определяет функционал, относящийся к уровню цикла грани BREP.
Циклы представляют наборы кривых, определяющих границы ограниченных поверхностей.
Класс BoundaryLoop используется при создании циклов для описания в контексте BREP граней с общими рёбрами.
Циклы, будучи вторичными элементами BREP, не имеют связанной геометрии, однако они предоставляют контекст для кривых в параметрическом пространстве.

Teigha.BoundaryRepresentation.BoundaryLoop.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса BoundaryLoop. Создает экземпляр класса с указанными параметрами.
Конструктор класса BoundaryLoop. Создает экземпляр класса с указанными параметрами.
fullSubentPath: Полный путь к подобъекту.  Тип DatabaseServices.FullSubentityPath.

Teigha.BoundaryRepresentation.BoundaryLoop.GetEdgesStartingFrom(Teigha.BoundaryRepresentation.Edge)
Метод позволяет получить коллекцию рёбер цикла, которая начинается с указанного ребра.
Метод позволяет получить коллекцию рёбер цикла, которая начинается с указанного ребра.
startFrom: Начальное ребро для построения списка рёбер цикла.  Тип Edge.
Returns: Возвращает коллекцию рёбер цикла.  Тип LoopEdgeCollection.

Teigha.BoundaryRepresentation.BoundaryLoop.GetVerticesStartingFrom(Teigha.BoundaryRepresentation.Vertex)
Метод позволяет получить коллекцию вершин цикла, которая начинается с указанной стартовой вершины.
Метод позволяет получить коллекцию вершин цикла, которая начинается с указанной стартовой вершины.
startFrom: Начальная вершина.  Тип Vertex.
Returns: Возвращает коллекцию вершин цикла. Тип LoopVertexCollection.

Teigha.BoundaryRepresentation.BoundaryLoop.Edges
Свойство Edges предоставляет доступ ко всем ребрам, связанным с данным циклом.
Свойство Edges предоставляет доступ ко всем ребрам, связанным с данным циклом.
Returns: Возвращает коллекцию ребер цикла. Тип LoopEdgeCollection.

Teigha.BoundaryRepresentation.BoundaryLoop.Face
Свойство Face предоставляет доступ к грани, с которой связан данный цикл.
Свойство Face предоставляет доступ к грани, с которой связан данный цикл.
Returns: Возвращает грань цикла. Тип BoundaryRepresentation.Face.

Teigha.BoundaryRepresentation.BoundaryLoop.LoopType
Свойство LoopType представляет тип данного цикла.
Свойство LoopType представляет тип данного цикла.
Returns: Возвращает тип цикла из перечисления Teigha.BoundaryRepresentation.LoopType.

Teigha.BoundaryRepresentation.BoundaryLoop.Vertices
Свойство Vertices предоставляет доступ ко всем вершинам, связанным с данным циклом.
Свойство Vertices предоставляет доступ ко всем вершинам, связанным с данным циклом.
Returns: Возвращает коллекцию вершин цикла.
Тип LoopVertexCollection.