Teigha.DatabaseServices.AbstractViewportData.GetClass
Метод предоставляет класс, связанный c данным объектом AbstractViewportData.
Метод предоставляет класс, связанный c данным объектом AbstractViewportData.
Returns: Возвращает класс, связанный с данным расширением протокола.
Тип RXClass.