Teigha.DatabaseServices.AssocManager.Initialize
Внутренний метод инициализации ассоциативного фреймворка.
Внутренний метод инициализации ассоциативного фреймворка.
Он должен быть вызван до первого использования подсистемы ассоциативных связей.
Метод можно безопасно выполнять более одного раза.
Клиентскому коду не обязательно вызывать этот метод.