Teigha.GraphicsInterface.FrontAndBackClipping
Структура FrontAndBackClipping представляет данные, которые используются при обрезке видовых экранов.
Структура FrontAndBackClipping представляет данные, которые используются при обрезке видовых экранов.
Эти данные определяют наличие и расположение передней и задней плоскостей отсечения.
Notes
Плоскости отсечения всегда перпендикулярны текущему вектору цели камеры.
Когда плоскости отсечения активны, геометрия перед передней плоскостью отсечения или позади задней плоскости отсечения не отображается.

Teigha.GraphicsInterface.FrontAndBackClipping.#ctor(System.Boolean,System.Boolean,System.Double,System.Double)
Конструктор структуры FrontAndBackClipping.
Создает экземпляр структуры, который задаёт активность и расположение передней и задней плоскостей отсечения.
Конструктор структуры FrontAndBackClipping.
Создает экземпляр структуры, который задаёт активность переднего и заднего отсечения и, соответственно, расстояния до передней и задней плоскостей отсечения.
Notes
Плоскости отсечения всегда перпендикулярны текущему вектору цели камеры.
Когда плоскости отсечения активны, геометрия перед передней плоскостью отсечения или позади задней плоскости отсечения не отображается.
clipFront: Флаг, определяющий активность переднего отсечения. Тип bool.
clipBack: Флаг, определяющий активность заднего отсечения.   Тип bool.
front: Расстояние до передней плоскости отсечения. Тип double.
back: Расстояние до задней плоскости отсечения.   Тип double.

Teigha.GraphicsInterface.FrontAndBackClipping.Equals(Object)
Метод предназначен для проверки равенства указанного объекта и данного объекта
Метод предназначен для проверки равенства указанного объекта и данного объекта
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.FrontAndBackClipping.IsEqualTo(Teigha.GraphicsInterface.FrontAndBackClipping)
Метод проверяет, равен ли данный объект указанному объекту FrontAndBackClipping.
Метод проверяет, равен ли данный объект указанному объекту FrontAndBackClipping.
Условием равенства объектов типа FrontAndBackClipping является совпадение состояния флагов активности и расстояний до плоскостей переднего и заднего отсечения.
Notes
Реализация использует вызов метода FrontAndBackClipping.IsEqualTo(FrontAndBackClipping a, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
a: Объект для сравнения с данным объектом. Тип FrontAndBackClipping.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.FrontAndBackClipping.IsEqualTo(Teigha.GraphicsInterface.FrontAndBackClipping,Teigha.Geometry.Tolerance)
Метод проверяет, равен ли данный объект указанному объекту FrontAndBackClipping с учетом предписанной геометрической точности.
Метод проверяет, равен ли данный объект указанному объекту FrontAndBackClipping с учетом предписанной геометрической точности.
Условием равенства объектов типа FrontAndBackClipping является совпадение состояния флагов активности и расстояний до плоскостей переднего и заднего отсечения.
a: Объект, который сравнивается с данным объектом. Тип FrontAndBackClipping.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.FrontAndBackClipping.!=(Teigha.GraphicsInterface.FrontAndBackClipping,Teigha.GraphicsInterface.FrontAndBackClipping)
Оператор неравенства структуры FrontAndBackClipping.
Оператор неравенства структуры FrontAndBackClipping.
Условием неравенства объектов FrontAndBackClipping является нарушение по крайней мере одного из следующих условий:
* Состояния флагов активности переднего отсечения совпадают;
* Состояния флагов активности заднего отсечения совпадают;
* Расстояния до передней плоскости отсечения совпадают;
* Расстояния до задней плоскости отсечения совпадают.
a: Левый операнд.  Тип FrontAndBackClipping.
b: Правый операнд. Тип FrontAndBackClipping.
Returns: Возвращает true, если левый операнд не равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.FrontAndBackClipping.==(Teigha.GraphicsInterface.FrontAndBackClipping,Teigha.GraphicsInterface.FrontAndBackClipping)
Оператор равенства структуры FrontAndBackClipping.
Оператор равенства структуры FrontAndBackClipping.
Условием равенства объектов FrontAndBackClipping является совместное выполнение следующих условий:
* Состояния флагов активности переднего отсечения совпадают;
* Состояния флагов активности заднего отсечения совпадают;
* Расстояния до передней плоскости отсечения совпадают;
* Расстояния до задней плоскости отсечения совпадают.
a: Левый операнд.  Тип FrontAndBackClipping.
b: Правый операнд. Тип FrontAndBackClipping.
Returns: Возвращает true, если левый операнд равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.FrontAndBackClipping.Back
Свойство Back представляет расстояние до задней плоскости отсечения.
Свойство Back представляет расстояние до задней плоскости отсечения.
Положение плоскости определяется как расстояние от точки камеры до плоскости, измеряемое вдоль вектора взгляда в мировой системе координат.
Returns: Возвращает расстояние до задней плоскости отсечения.
Тип double.

Teigha.GraphicsInterface.FrontAndBackClipping.ClipBack
Свойство ClipBack представляет состояние флага активности заднего отсечения.
Свойство ClipBack представляет состояние флага активности заднего отсечения.
Returns: Возвращает true, если режим заднего отсечения включен.
В противном случае возвращает false.

Teigha.GraphicsInterface.FrontAndBackClipping.ClipFront
Свойство ClipFront представляет состояние флага активности переднего отсечения.
Свойство ClipFront представляет состояние флага активности переднего отсечения.
Returns: Возвращает true, если режим переднего отсечения включен.
В противном случае возвращает false.

Teigha.GraphicsInterface.FrontAndBackClipping.Front
Свойство Front представляет расстояние до передней плоскости отсечения.
Свойство Front представляет расстояние до передней плоскости отсечения.
Положение плоскости определяется как расстояние от точки камеры до плоскости, измеряемое вдоль вектора взгляда в мировой системе координат.
Returns: Возвращает расстояние до передней плоскости отсечения.
Тип double.