Teigha.Geometry.Scale2d
Структура Scale2d представляет преобразование масштаба в двумерном пространстве.
Структура Scale2d представляет преобразования масштаба в двумерном пространстве (векторы 2D-масштабирования).
Scale2d можно рассматривать как двухэлементный массив вещественных чисел двойной точности.
Каждый из элементов представляет свой масштабный коэффициент:
* 0 — масштабный коэффициент для оси X.
* 1 — масштабный коэффициент для оси Y.
Notes
Вектор масштабирования не должен иметь нулевых компонентов.

Teigha.Geometry.Scale2d.#ctor(System.Double)
Конструктор структуры Scale2d.
Создает экземпляр структуры, который представляет равномерное преобразование масштаба вдоль осей X и Y с указанным коэффициентом.
Конструктор структуры Scale2d.
Создает экземпляр структуры, который представляет равномерное преобразование масштаба вдоль осей X и Y с масштабным коэффициентом factor.
factor: Масштабный множитель, одинаковый для осей X и Y. Тип double.

Teigha.Geometry.Scale2d.#ctor(System.Double,System.Double)
Конструктор структуры Scale2d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X и Y.
Конструктор структуры Scale2d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанными масштабными коэффициентами вдоль осей X и Y.
x: Масштабный коэффициент для оси X. Тип double.
y: Масштабный коэффициент для оси Y. Тип double.

Teigha.Geometry.Scale2d.#ctor(array)
Конструктор структуры Scale2d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
Конструктор структуры Scale2d.
Создает экземпляр структуры, который представляет преобразование масштаба с указанным массивом масштабных коэффициентов.
xy: Входной массив масштабных коэффициентов. Тип double[].
Каждый из элементов массива xy представляет свой масштабный коэффициент:

Teigha.Geometry.Scale2d.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true в случае равенства сравниваемых объектов.
В противном случае возвращает false.

Teigha.Geometry.Scale2d.ExtractScale(Teigha.Geometry.Matrix2d)
Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования.
Метод предоставляет вектор масштабирования, который соответствует длинам вектор-столбцов матрицы геометрического преобразования mat.
mat: Входная матрица геометрического преобразования. Тип Matrix2d.
Returns: Возвращает вектор масштабирования, представленный преобразованием mat.
Тип Scale2d.

Teigha.Geometry.Scale2d.IsEqualTo(Teigha.Geometry.Scale2d)
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием точности по умолчанию.
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе.
Используется вызов метода Scale2d.IsEqualTo(Scale2d a, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
Два экземпляра структуры Scale2d считаются равными, если в пределах предписанной точности одновременно выполняются следующие условия:
* Равны масштабные коэффициенты по оси X;
* Равны масштабные коэффициенты по оси Y.
a: Входной вектор масштабирования, который сравнивается с данным объектом. Тип Scale2d.
Returns: Возвращает true, если в пределах используемой точности данный объект можно считать равным вектору масштабирования a.
В противном случае возвращает false.

Teigha.Geometry.Scale2d.IsEqualTo(Teigha.Geometry.Scale2d,Teigha.Geometry.Tolerance)
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
Метод проверяет равенство данного объекта вектору масштабирования, переданному в аргументе, с использованием заданной точности.
Два экземпляра структуры Scale2d считаются равными, если в пределах предписанной точности одновременно выполняются следующие условия:
* Равны масштабные коэффициенты по оси X;
* Равны масштабные коэффициенты по оси Y.
a: Входной вектор масштабирования, который сравнивается с данным объектом. Тип Scale2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой точности данный объект можно считать равным вектору масштабирования a.
В противном случае возвращает false.

Teigha.Geometry.Scale2d.IsProportional(Teigha.Geometry.Tolerance)
Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X и Y.
При проверке используется указанная в аргументе точность.
Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X и Y.
При проверке используется указанная в аргументе точность.
tolerance: Заданная точность для сравнения. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance компоненты данного вектора масштабирования можно считать равными по модулю.
В противном случае возвращает false.

Teigha.Geometry.Scale2d.MultiplyBy(System.Double)
Метод реализует умножение данного вектора масштабирования на заданный скалярный множитель.
Метод реализует умножение данного вектора масштабирования на переданный в аргументе скалярный множитель factor.
factor: Входное значение множителя. Тип double.
Returns: Возвращает результат умножения данного объекта на множитель factor.
Тип Scale2d.

Teigha.Geometry.Scale2d.PostMultiplyBy(Teigha.Geometry.Scale2d)
Метод реализует векторное произведение данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования (данный вектор) * (rightSide).
Notes
Умножение векторов масштабирования является коммутативным.
rightSide: Входной вектор масштабирования, используемый в качестве множителя. Тип Scale2d.
Returns: Возвращает результат векторного умножения.
Тип Scale2d.

Teigha.Geometry.Scale2d.PreMultiplyBy(Teigha.Geometry.Scale2d)
Метод реализует векторное произведение указанного вектора масштабирования на данный объект (leftSide) * (данный вектор).
Метод сохраняет в данном объекте результат векторного произведения данного объекта на указанный вектор масштабирования  (leftSide) * (данный вектор).
Notes
Умножение векторов масштабирования является коммутативным.
leftSide: Входной вектор масштабирования, используемый в качестве множителя. Тип Scale2d.
Returns: Возвращает результат векторного умножения.
Тип Scale2d.

Teigha.Geometry.Scale2d.RemoveScale(Teigha.Geometry.Matrix2d)
Метод вычисляет вектор масштабирования, который соответствует указанной матрице преобразования, после чего исключает из этой матрицы компоненту масштабирования.
Метод извлекает вектор масштабирования из указанной матрицы преобразования, после чего исключает из этой матрицы компоненту масштабирования, приводя ее вектор-столбцы к единичной длине.
mat: Входная матрица преобразования. Тип Matrix2d.
Returns: Возвращает вектор масштабирования в матрице mat в ее исходном состоянии.
Тип Scale2d.

Teigha.Geometry.Scale2d.ToString(IFormatProvider)
Метод предоставляет эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
Метод предоставляет эквивалентное строковое представление данного объекта.
Возвращаемая строка содержит компоненты вектора масштабирования, отформатированные с учетом указанных языковых и региональных настроек.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
Тип String.

Teigha.Geometry.Scale2d.!=(Teigha.Geometry.Scale2d,Teigha.Geometry.Scale2d)
Оператор неравенства структуры Scale2d.
Оператор неравенства структуры Scale2d.
Два экземпляра структуры Scale2d считаются неравными, если в пределах используемой точности нарушается хотя бы одно из следующих условий:
* масштабные коэффициенты по оси X равны;
* масштабные коэффициенты по оси Y равны.
a: Левый операнд.  Тип Scale2d.
b: Правый операнд. Тип Scale2d.
Returns: Возвращает true в случае неравенства левого и правого операндов.
В противном случае возвращает false.

Teigha.Geometry.Scale2d.*(System.Double,Teigha.Geometry.Scale2d)
Оператор умножения структуры Scale2d.
Реализует умножение скалярного множителя на вектор масштабирования.
Оператор умножения структуры Scale2d.
Возвращает результат умножения скалярного множителя factor на вектор масштабирования a.
factor: Левый операнд.  Представляет скалярный множитель. Тип double.
a: Правый операнд. Представляет вектор масштабирования. Тип Scale2d.
Returns: Возвращает результат умножения скалярного множителя factor на вектор масштабирования a.
Тип Scale2d.

Teigha.Geometry.Scale2d.*(Teigha.Geometry.Scale2d,System.Double)
Оператор умножения структуры Scale2d.
Реализует умножение вектора масштабирования на скалярный множитель.
Оператор умножения структуры Scale2d.
Реализует умножение вектора масштабирования a на скалярный множитель factor.
a: Левый операнд.  Представляет вектор масштабирования. Тип Scale2d.
factor: Правый операнд. Представляет скалярный множитель.    Тип double.
Returns: Возвращает результат умножения вектора масштабирования a на скалярный множитель factor.
Тип Scale2d.

Teigha.Geometry.Scale2d.*(Teigha.Geometry.Scale2d,Teigha.Geometry.Scale2d)
Оператор умножения структуры Scale2d.
Реализует векторное умножение двух векторов масштабирования.
Оператор умножения структуры Scale2d.
Реализует умножение (a * b) двух векторов масштабирования a и b.
a: Левый операнд.  Тип Scale2d.
b: Правый операнд. Тип Scale2d.
Returns: Возвращает результат умножения (a * b) двух операндов a и b.
Тип Scale2d.

Teigha.Geometry.Scale2d.==(Teigha.Geometry.Scale2d,Teigha.Geometry.Scale2d)
Оператор равенства структуры Scale2d.
Оператор равенства структуры Scale2d.
Два экземпляра структуры Scale2d считаются равными, если в пределах используемой точности одновременно выполняются следующие условия:
* масштабные коэффициенты по оси X равны;
* масштабные коэффициенты по оси Y равны.
a: Левый операнд.  Тип Scale2d.
b: Правый операнд. Тип Scale2d.
Returns: Возвращает true в случае равенства левого и правого операндов.
В противном случае возвращает false.

Teigha.Geometry.Scale2d.Coordinate
Свойство Coordinate представляет масштабный коэффициент с указанным индексом.
Свойство Coordinate представляет масштабный коэффициент с указанным индексом.
index: Входной индекс масштабного коэффициента. Тип int.
Returns: Возвращает значение масштабного коэффициента.
Тип double.

Teigha.Geometry.Scale2d.X
Свойство X представляет масштабный коэффициент по оси X.
Свойство X представляет масштабный коэффициент по оси X.
Returns: Возвращает значение масштабного коэффициента по оси X.
Тип double.

Teigha.Geometry.Scale2d.Y
Свойство Y представляет масштабный коэффициент по оси Y.
Свойство Y представляет масштабный коэффициент по оси Y.
Returns: Возвращает значение масштабного коэффициента по оси Y.
Тип double.