HostMgd.Windows.ToolPalette.CustomToolBase
Класс CustomToolBase является абстрактным классом, который определяет универсальный пользовательский инструмент, пригодный для реализации инструмента любого типа, поддерживаемого панелями инструментов.
В текущей версии не реализован.
Класс CustomToolBase является абстрактным классом, который определяет универсальный пользовательский инструмент, пригодный для реализации инструмента любого типа, поддерживаемого панелями инструментов.
Класс обеспечивает поддержку ряда характерных для инструментов интерфейсов и предоставляет шаблоны создания пользовательских инструментов.
В текущей версии не реализован.

HostMgd.Windows.ToolPalette.CustomToolBase.#ctor
Конструктор по умолчанию класса CustomToolBase.
Конструктор по умолчанию класса CustomToolBase.

HostMgd.Windows.ToolPalette.CustomToolBase.BeginMultipleEdit(System.Object,System.Object)
Метод позволяет начать операцию группового редактирования сразу нескольких инструментов на панели инструментов.
Не реализован.
Метод позволяет начать групповое редактирование сразу нескольких инструментов, заданных входными массивами.
В текущей версии не реализован.
Notes
Для завершения группового редактирование используется метод EndMultipleEdit().
tools: Входной массив инструментов. Тип System.Object.
stockToolIds: Входной массив идентификаторов стандартных инструментов. Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.CreateCommandTool(HostMgd.Windows.ToolPalette.Package,System.String,HostMgd.Windows.ToolPalette.ImageInfo,System.String)
Метод вызывается фреймворком для стандартного инструмента при перетаскивании объекта на панель инструментов.
Не реализован.
Метод вызывается фреймворком для стандартного инструмента при перетаскивании объекта на панель инструментов.
В текущей версии не реализован.
palette: Пакет инструментов. Тип HostMgd.Windows.ToolPalette.Package.
toolName: Наименование инструмента. Тип System.String.
bitmapName: Связанное с инструментом изображение. Тип HostMgd.Windows.ToolPalette.ImageInfo.
macro: Имя макроса. Тип System.String.
Returns: Возвращает созданный инструмент в панели инструментов palette.
Тип HostMgd.Windows.ToolPalette.Tool.

HostMgd.Windows.ToolPalette.CustomToolBase.CreateFlyoutTool(HostMgd.Windows.ToolPalette.Package,HostMgd.Windows.ToolPalette.Package,System.String)
Метод создает выпадающий инструмент, который может содержать пакеты других инструментов.
Не реализован.
Метод создает выпадающий инструмент, который может содержать пакеты других инструментов.
В текущей версии не реализован.
palette: Входной пакет инструментов. Тип HostMgd.Windows.ToolPalette.Package.
shapePackage: Входная форма пакета инструментов. Тип HostMgd.Windows.ToolPalette.Package.
toolNameOverride: Входное переопределение имени инструмента. Тип System.String.
Returns: Возвращает созданный выпадающий инструмент.
Тип HostMgd.Windows.ToolPalette.Tool.

HostMgd.Windows.ToolPalette.CustomToolBase.CreatePalette(HostMgd.Windows.ToolPalette.Catalog,System.String)
Метод создает панель инструментов с заданным именем и добавляет в неё указанный каталог.
Не реализован.
Метод создает панель инструментов с заданным именем catalogName и добавляет в неё указанный каталог catalogName.
В текущей версии не реализован.
catalogName: Входное имя каталога. Тип HostMgd.Windows.ToolPalette.Catalog.
paletteName: Входное имя панели инструментов. Тип System.String.
Returns: Возвращает созданную панель инструментов.
Тип HostMgd.Windows.Palette.

HostMgd.Windows.ToolPalette.CustomToolBase.CreateShapeCatalog(System.String)
Метод создает для единственной формы каталог, содержащий пакеты форм.
Не реализован.
Метод создает для единственной формы каталог, содержащий пакеты форм.
В текущей версии не реализован.
shapeName: Входное имя формы для каталога. Тип System.String.
Returns: Возвращает созданный каталог.
Тип HostMgd.Windows.ToolPalette.Package.

HostMgd.Windows.ToolPalette.CustomToolBase.CreateStockTool(System.String)
Метод создает именованный каталог для стандартных инструментов.
Не реализован.
Метод создает именованный каталог для стандартных инструментов.
В текущей версии не реализован.
catalogName: Входное имя каталога. Тип System.String.
Returns: Возвращает созданный каталог.
Тип HostMgd.Windows.ToolPalette.Catalog.

HostMgd.Windows.ToolPalette.CustomToolBase.CreateTool(HostMgd.Windows.ToolPalette.Package,System.String,HostMgd.Windows.ToolPalette.ImageInfo)
Метод создаёт новый объект инструмента с заданным пакетом инструментов, именем инструмента и связанным изображением.
Не реализован.
Метод создаёт новый объект инструмента с заданным пакетом инструментов palette, именем инструмента toolNameOverride и связанным изображением toolImageOverride.
В текущей версии не реализован.
palette: Входной пакет инструментов. Тип HostMgd.Windows.ToolPalette.Package.
toolNameOverride: Входное имя инструмента. Тип System.String.
toolImageOverride: Входной объект связанного с инструментом изображения. Тип HostMgd.Windows.ToolPalette.ImageInfo.
Returns: Возвращает созданный объект инструмента.
Тип HostMgd.Windows.ToolPalette.Tool.

HostMgd.Windows.ToolPalette.CustomToolBase.Customize(System.Int32,UInt32,UInt32,UInt32,Guid)
Метод реализует настройку инструмента любого типа, поддерживаемого панелями инструментов.
Не реализован.
Метод реализует настройку инструмента любого типа, поддерживаемого панелями инструментов.
В частности, метод позволяет настроить команды пользовательского меню, отражающие специфику инструмента.
В текущей версии не реализован.
contextFlag: Входные флаги контекста вызова. Тип int.
menuHandle: Входной дескриптор меню для пользовательских команд. Тип UInt32.
idCommandFirst: Входной ID первой команды диапазона настраиваемых команд.    Тип UInt32.
idCommandLast: Входной ID последней команды диапазона настраиваемых команд. Тип UInt32.
paletteId: Входной идентификатор настраиваемой панели инструментов. Тип Guid.
Returns: Возвращает идентификатор выбранной команды.
Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.DoModal(System.String,Teigha.DatabaseServices.ObjectIdCollection )
Метод отображает модальное диалоговое окно для взаимодействия с пользовательским инструментом.
Не реализован.
Метод отображает модальное диалоговое окно для взаимодействия с пользовательским инструментом, когда пользователь активирует настраиваемый инструмент на панели инструментов.
В текущей версии не реализован.
propertyValue: Значение пользовательского свойства инструмента. Тип System.String.
activeShapes: Коллекция идентификаторов объектов активных форм, связанных с инструментом. Тип Teigha.DatabaseServices.ObjectIdCollection.

HostMgd.Windows.ToolPalette.CustomToolBase.DragEnter(System.Windows.Forms.IDataObject,UInt32,HostMgd.ApplicationServices.POINTL,UInt32)
Метод вызывается, когда перетаскиваемый объект стандартного инструмента попадает в область панели инструментов.
Не реализован.
Метод DragEnter() используется для настройки поведения панели инструментов в процессе перетаскивания (Drag-and-Drop) и вызывается, когда перетаскиваемый объект стандартного инструмента попадает в область панели инструментов.
Метод позволяет сообщить системе, какое действие разрешено (например, копирование, перемещение или запрет операции), а также учитывать типы данных и состояния клавиш-модификаторов и кнопок мыши.
В текущей версии не реализован.
data: Входной объект данных, связанный с перетаскиваемым инструментом. Тип System.Windows.Forms.IDataObject.
keyState: Входное состояние клавиш-модификаторов (например, Ctrl, Shift, Alt) и кнопок мыши во время перетаскивания. Тип UInt32.
point: Позиция курсора мыши в момент входа в область панели инструментов (в экранных координатах). Тип HostMgd.ApplicationServices.POINTL.
effect: Входной/выходной параметр, определяющий эффект перетаскивания (копирование, перемещение и т.п.). Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.DragOver(UInt32,HostMgd.ApplicationServices.POINTL,UInt32)
Метод вызывается, когда перетаскиваемый объект стандартного инструмента движется в пределах области панели инструментов.
Не реализован.
Метод предназначен для поддержки панелями инструментов процесса перетаскивания (Drag-and-Drop) и  вызывается, когда перетаскиваемый объект стандартного инструмента движется в пределах области панели инструментов.
В текущей версии не реализован.
keyState: Входное состояние клавиш-модификаторов (например, Ctrl, Shift, Alt) и кнопок мыши во время перетаскивания. Тип UInt32.
pt: Входная позиция курсора мыши в пределах области панели инструментов (в экранных координатах). Тип HostMgd.ApplicationServices.POINTL.
effect: Входной/выходной параметр, определяющий эффект перетаскивания (копирование, перемещение и т.п.). Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.Drop(System.Windows.Forms.IDataObject,UInt32,HostMgd.ApplicationServices.POINTL,UInt32)
Метод вызывается, когда перетаскиваемый объект стандартного инструмента бросается на панель инструментов.
Не реализован.
Метод предназначен для поддержки панелями инструментов процесса перетаскивания (Drag-and-Drop) и  вызывается, когда перетаскиваемый объект стандартного инструмента бросается на панель инструментов.
В текущей версии не реализован.
data: Входной объект данных, связанный с перетаскиваемым инструментом. Тип System.Windows.Forms.IDataObject.
keyState: Входное состояние клавиш-модификаторов (например, Ctrl, Shift, Alt) и кнопок мыши во время перетаскивания. Тип UInt32.
pt: Позиция курсора мыши в момент бросания перемещенного объекта на панель инструментов (в экранных координатах). Тип HostMgd.ApplicationServices.POINTL.
effect: Входной/выходной параметр, определяющий эффект перетаскивания (копирование, перемещение и т.п.). Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.DropCallback(Teigha.DatabaseServices.Entity)
Метод определяет реакцию приложения, когда пользователь завершает операцию перетаскивания объекта чертежа из редактора nanoCAD на панель инструментов. Не реализован.
Метод предоставляет возможность задать реакцию приложения, когда пользователь завершает операцию перетаскивания (Drag-and-Drop) объекта чертежа entity из редактора nanoCAD на панель инструментов.
Метод позволяет реализовать дополнительную обработку объекта entity, например, изменить его свойства, атрибуты или, например, выполнить необходимые проверки.
В текущей версии не реализован.
Notes
Метод вызывается после перетаскивания объекта на панель, но до завершения транзакции, что позволяет изменить свойства объекта, если это допустимо.
entity: Входной объект чертежа. Тип Teigha.DatabaseServices.Entity.
Returns: Возвращает true, если операция перетаскивания была успешно обработана.
В противном случае возвращает false.

HostMgd.Windows.ToolPalette.CustomToolBase.Dropped(System.String)
Метод вызывается после того, как пользователь перетащил инструмент на панель инструментов с помощью пользовательской процедуры  перетаскивания или IDrop.
Не реализован.
Метод вызывается после того, как пользователь завершил операцию перетаскивания (drag-and-drop)  инструмента на панель инструментов с помощью пользовательской процедуры перетаскивания или IDrop.
В текущей версии не реализован.
url: Входной/выходной URL, связанный с инструментом. Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.Edit(System.Object,System.Int32,System.Boolean)
Метод предназначен для редактирования свойства инструмента в окне, заданном целочисленным дескриптором окна.
Не реализован.
Метод предназначен для редактирования свойства property инструмента в окне, заданном целочисленным дескриптором окна parentWindow.
В текущей версии не реализован.
property: Входной объект, определяющий редактируемое свойство. Тип System.Object.
parentWindow: Дескриптор родительского окна. Тип int.
success: Флаг завершения процедуры. Тип bool. Возвращает true в случае успешного завершения и false в противном случае.

HostMgd.Windows.ToolPalette.CustomToolBase.Edit(System.Object,long,System.Boolean)
Метод предназначен для редактирования свойства инструмента в окне, заданном дескриптором окна типа long.
Не реализован.
Метод предназначен для редактирования свойства property инструмента в окне, заданном дескриптором окна parentWindow типа long.
В текущей версии не реализован.
property: Входной объект, определяющий редактируемое свойство. Тип System.Object.
parentWindow: Дескриптор родительского окна. Тип long.
success: Флаг завершения процедуры. Тип bool. Возвращает true в случае успешного завершения и false в противном случае.

HostMgd.Windows.ToolPalette.CustomToolBase.Edit(System.Object,System.IntPtr,System.Boolean)
Метод предназначен для редактирования свойства инструмента в окне, заданном указателем.
Не реализован.
Метод предназначен для редактирования свойства property инструмента в окне, заданном указателем IntPtr.
В текущей версии не реализован.
property: Входной объект, определяющий редактируемое свойство. Тип System.Object.
parentWindow: Указатель на родительское окно. Тип System.IntPtr.
success: Флаг завершения процедуры. Тип bool. Возвращает true в случае успешного завершения и false в противном случае.

HostMgd.Windows.ToolPalette.CustomToolBase.Editable(System.Int32,System.Int32)
Метод позволяет управлять возможностью редактирования пользовательского инструмента на панели инструментов.
Не реализован.
Метод предназначен для управления редактируемостью пользовательского инструмента на панели инструментов.
Он позволяет указать, может ли элемент инструмента (например, свойство), идентифицируемый по dispatchId, быть изменён пользователем через интерфейс панели инструментов.
В текущей версии не реализован.
dispatchId: Диспетчерский идентификатор. Тип int.
editable: Флаг редактируемости. Тип int.  Если равен нулю, редактирование не допускается. В противном случае оно возможно.

HostMgd.Windows.ToolPalette.CustomToolBase.EndEdit(System.Boolean)
Метод завершает редактирование пользовательского инструмента с опцией отмены изменений.
Не реализован.
Метод позволяет завершить редактирование пользовательского инструмента.
Входной флаг bEditcanceled используется для отмены сделанных изменений.
В текущей версии не реализован.
bEditCancelled: Входной флаг отмены изменений. Тип bool. Значение true означает отмену всех сделанных изменений. В противном случае редактирование считается завершенным успешно.

HostMgd.Windows.ToolPalette.CustomToolBase.EndMultipleEdit(System.Object,System.Object,System.Boolean)
Метод вызывается для завершения операции группового редактирования пользовательских инструментов на панели инструментов.
Не реализован.
Метод предназначен для завершения операции группового редактирования пользовательских инструментов на панели инструментов.
Редактируемые объекты задаются массивами tools и stockToolIds.
Флаг editCancelled позволяет отменить все сделанные изменения.
В текущей версии не реализован.
Notes
Чтобы начать групповое редактирование пользовательских инструментов, используется метод BeginMultipleEdit().
tools: Входной массив инструментов. Тип System.Object.
stockToolIds: Входной массив идентификаторов стандартных инструментов. Тип System.Object.
editCancelled: Входной флаг отмены изменений. Тип bool. Значение true означает отмену всех сделанных изменений.

HostMgd.Windows.ToolPalette.CustomToolBase.Execute(System.Int32,UInt32,UInt32,UInt32)
Метод запускает в действие логику пользовательского инструмента при его активации на панели инструментов.
Не реализован.
Метод предназначен для исполнения логики пользовательского инструмента при его активации на панели инструментов.
Контекст активации (способ запуска, координаты, модификаторы) предоставляют аргументы.
Код реализации инструмента может выполнять самые разнообразные действия: запускать команду, создавать объект, переопределять состояние объекта и т.д. Этот процесс является модальным.
В текущей версии не реализован.
flag: Входной флаг способа активации инструмента. Тип int.
window: Дескриптор окна (HWND) nanoCAD, в котором будет работать инструмент. Тип UInt32.
point: Координаты точки, в которой начинается выполнение логики инструмента (в экранных координатах). Тип UInt32.  Младшие 16 бит определяют координату X, а старшие 16 бит - координату Y.
keyState: Состояние клавиш-модификаторов (Ctrl, Shift, Alt и др.) в момент активации данного инструмента. Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.GetCommandString(UInt32)
Метод отображает однострочный поясняющий текст для команды, добавленной в контекстное меню методом GetContextMenu().
Не реализован.
Метод отображает однострочный поясняющий текст для команды, добавленной в контекстное меню методом GetContextMenu().
В текущей версии не реализован.
idCommand: Входной идентификатор команды. Тип UInt32.
Returns: Возвращает текст краткой справки для команды idCommand.
Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.GetContextMenu(System.Int32,UInt32,UInt32,UInt32)
Метод позволяет получить пользовательское контекстное меню, связанное с пользовательским инструментом на панели инструментов.
Не реализован.
Метод позволяет получить пользовательское контекстное меню, связанное с пользовательским инструментом на панели инструментов, и вызывается перед отображением контекстного меню.
Меню menu предварительно заполняется стандартными пунктами меню, применимыми в данном контексте.
Соответственно, пользовательский инструмент может донастроить контекстное меню, добавляя туда собственные команды и при необходимости удаляя ненужные стандартные.
Идентификаторы добавляемых в меню команд должны находиться в диапазоне от idCommandFirst до idCommandLast, чтобы исключить конфликт с идентификаторами стандартных команд.
Любые пользовательские пункты меню должны использовать ID в диапазоне: idCommandFirst .. idCommandLast.
Когда пользователь выбирает команду, добавленную пользовательским инструментом, вызывается метод InvokeCommand() с переданным ему идентификатором команды, что позволяет инструменту обработать команду.
В текущей версии не реализован.
contextFlag: Указывает контекст, в котором запрашивается меню. Тип int.  Контекст определяет, где именно щёлкнул мышью пользователь
menu: Дескриптор стандартного контекстного меню Windows (HMENU).  Тип UInt32.
idCommandFirst: Нижняя граница для идентификаторов команд (ID), которые можно использовать для новых пунктов меню. Тип UInt32. Значение не должно конфликтовать с диапазоном идентификаторов, зарезервированных платформой nanoCAD для системных команд.
idCommandLast: Верхняя граница для идентификаторов команд (ID), которые можно использовать для новых пунктов меню. Тип UInt32. Значение не должно конфликтовать с диапазоном идентификаторов, зарезервированных платформой nanoCAD для системных команд.
Returns: Возвращает значение, определяющее итог операции. Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.GetCustomPropertyCtrl(System.Object,UInt32,System.String)
Метод предоставляет настраиваемый элемент управления ActiveX для отображения и редактирования свойств пользовательского инструмента.
Не реализован.
Метод предоставляет настраиваемый элемент управления ActiveX для отображения и редактирования свойств пользовательского инструмента.
При выборе на панели инструментов пользовательского инструмента в окне свойств (Properties window) будет отображаться пользовательский элемент управления ActiveX с указанными  идентификатором id и программным идентификатором programId.
В текущей версии не реализован.
id: Идентификатор пользовательского элемента управления. Тип System.Object.
lcid: Идентификатор региональных параметров (локаль) Windows для локализации интерфейса элемента управления. Тип UInt32.
programId: Программный идентификатор элемента управления ActiveX. Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.GetData(System.Object,System.Object)
Метод предоставляет COM-интерфейсы, необходимые для редактирования свойств пользовательского инструмента.
Не реализован.
Метод предоставляет COM-интерфейсы, необходимые для редактирования свойств пользовательского инструмента.
Метод используется в случае, когда требуется редактирование свойств инструмента в модальном диалоговом окне инспектора свойств.
В текущей версии не реализован.
staticProperties: Статические свойства инструмента.  Тип System.Object.
dynamicProperties: Динамические свойства инструмента. Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.GetDisplayName(System.Int32,System.String)
Метод предоставляет альтернативное или локализованное имя для свойства с заданным идентификатором.
Не реализован.
Метод предоставляет альтернативное или локализованное имя для свойства с заданным идентификатором dispatchId.
Эта строка переопределит имя свойства в информации о типе объекта.
В текущей версии не реализован.
dispatchId: Диспетчерский идентификатор свойства. Тип int.
propertyName: Имя свойства. Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.GetDisplayString(System.Int32,System.String)
Метод предоставляет отображаемый текст, связанный со свойством пользовательского инструмента.
Не реализован.
Метод предоставляет отображаемый текст, связанный со свойством пользовательского инструмента.
Текстовая строка может быть, например, локализованной.
В текущей версии не реализован.
dispatchId: Диспетчерский идентификатор свойства.  Тип int.
value: Строка, отображаемая для свойства.     Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.GetDragDropContextInfo(System.Object,System.String,UInt32)
Метод вызывается во время перетаскивания правой кнопкой мыши (drag-and-drop) пользовательского инструмента из панели инструментов.
Не реализован.
Метод вызывается во время перетаскивания правой кнопкой мыши (drag-and-drop) пользовательского инструмента из панели инструментов.
Ожидается, что метод предоставит контекстную информацию о перетаскиваемом инструменте, включая ссылку на COM-объект (IUnknown), представляющий данные перетаскивания, отображаемое имя инструмента и флаги, уточняющие контекст операции.
В текущей версии не реализован.
pIUnknown: Входной объект, реализующий интерфейс IUnknown. Тип System.Object.
toolName: Выходное имя инструмента, отображаемое пользователю при перетаскивании.  Тип System.String.
flag: Выходная комбинация флагов, уточняющих контекст операции перетаскивания. Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.GetMenuHelp(UInt32)
Метод вызывается для отображения всплывающей однострочной справки для команды, добавленной в контекстное меню методом GetContextMenu() инструмента. Не реализован.
Метод вызывается для отображения всплывающей однострочной справки для команды, добавленной в контекстное меню методом GetContextMenu() инструмента.
В текущей версии не реализован.
idCmd: Входной идентификатор команды. Тип UInt32.
Returns: Возвращает строку справки для команды. Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.GetPredefinedStrings(System.Int32,tagCALPOLESTR,tagCADWORD)
Метод предоставляет список предопределённых строковых значений для конкретного свойства пользовательского инструмента.
Не реализован.
Метод предоставляет список предопределённых строковых значений для конкретного свойства пользовательского инструмента.
Свойство специфицируется по заданному dispatchId.
В текущей версии не реализован.
dispatchId: Диспетчерский идентификатор свойства пользовательского инструмента. Тип int.
value: Выходной объект-контейнер для массива предопределённых строк. Тип tagCALPOLESTR.
cookie: Выходной объект-контейнер для массива значений, сопоставленных предопределенным строкам в value. Тип tagCADWORD.

HostMgd.Windows.ToolPalette.CustomToolBase.GetPredefinedValue(System.Int32,UInt32,System.Object)
Метод вызывается для получения фактического значения свойства, когда пользователь выбирает один из предопределённых вариантов.
Не реализован.
Метод вызывается для получения фактического значения свойства по значению идентификатора cookie, которое соответствует выбору пользователя из списка предопределённых вариантов (например, из выпадающего списка свойств).
В текущей версии не реализован.
dispatchId: Входной диспетчерский идентификатор свойства (DispID), для которого запрашивается значение. Тип int.
cookie: Входной числовой идентификатор выбранного варианта, заданный ранее методом GetPredefinedStrings(). Тип UInt32.
value: Выходное значение, соответствующее значению cookie. Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.GetPropertyIcon(System.Object,System.Object)
Метод позволяет добавлять пользовательские иконки для каждого свойства пользовательского инструмента.
Не реализован.
Метод позволяет добавлять пользовательские иконки размером 16x16 пикселей для каждого свойства пользовательского инструмента.
Инспектор свойств отображает эти иконки слева от метки свойства.
В текущей версии не реализован.
id: Входной идентификатор свойства. Тип System.Object.
icon: Иконка для свойства с идентификатором id. Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.GetPropertyWeight(System.Object,System.Int32)
Метод задает относительный вес (приоритет) категории или свойства на панели инструментов, влияющий на порядок отображения категорий и свойств в пользовательском интерфейсе.
Не реализован.
Метод используется для получения веса (приоритета) указанного свойства инструмента или категории на панели инструментов. Вес свойства влияет на порядок отображения или важность свойства в пользовательском интерфейсе и используется, например, при сортировке.
В текущей версии не реализован.
id: Идентификатор свойства (или категории), для которого запрашивается вес. Тип System.Object.
pPropertyWeight: Выходной вес указанного свойства. Тип int. Чем выше значение, тем выше приоритет или важность свойства.

HostMgd.Windows.ToolPalette.CustomToolBase.GetPropTextColor(System.Object,UInt32)
Метод задает пользовательский цвет текста метки для свойства.
Не реализован.
Метод позволяет задать пользовательский цвет для текста метки указанного свойства пользовательского инструмента.
В текущей версии не реализован.
id: Идентификатор свойства, для которого запрашивается цвет текста.  Тип System.Object.
textColor: Выходной цвет текста для указанного свойства. Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.GetUnspecifiedString(System.Object)
Метод предоставляет текстовую строку со значением свойства, которое не указано явно или которое помечено как "не указано" (unspecified).
Не реализован.
Метод используется для получения текстового представления свойств инструмента, значение которых помечено как "не указано" (unspecified).
В текущей версии не реализован.
id: Идентификатор свойства, для которого запрашивается текстовая строка в случае "неуказанного" значения. Тип System.Object.
Returns: Возвращает текстовую строку, связанную со свойством id.
Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.InvokeCommand(UInt32,UInt32)
Метод предназначен для выполнения пользовательских команд, связанных с данным инструментом и выполняющих дополнительные действия с инструментом. Не реализован.
Метод предназначен для выполнения пользовательских команд, связанных с данным инструментом и выполняющих дополнительные действия с инструментом (например, при нажатии кнопки в расширенном UI инструмента).
В текущей версии не реализован.
Notes
Метод InvokeCommand() не вызывается при обычной активации инструмента, для этого используется метод Execute().
idCommand: Идентификатор пользовательской команды. Тип UInt32.
window: Дескриптор (HWND) родительского окна, в котором могут отображаться связанные с командой диалоги или всплывающие окна. Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.InvokeMenuCommand(UInt32,Guid,UInt32)
Метод вызывается при активации пользовательского пункта контекстного меню, связанного с данным инструментом.
Не реализован.
Метод вызывается при активации пользовательского пункта контекстного меню, связанного с данным инструментом.
В текущей версии не реализован.
idCmd: Пользовательский идентификатор команды. Тип UInt32.
paletteId: Идентификатор панели инструментов, на которой располагается инструмент. Тип Guid.
windowHandle: Дескриптор окна (HWND), который можно использовать как родительский для модальных диалогов. Тип UInt32.
Returns: Возвращает код результата выполнения метода. Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.IsFullView(System.Object,System.Boolean,UInt32)
Метод вызывается, чтобы выяснить требуемый размер отображаемого свойства данного инструмента в расширенном (full) виде (например, как многострочный текст).  Не реализован.
Метод вызывается, чтобы определить, должно ли свойство с заданным идентификатором id отображаться в расширенном (full) виде и задать высоту integralHeight такого представления в пикселях. Метод полезен для отображения сложных свойств, представление которых не сводится к простому однострочному тексту.
В текущей версии не реализован.
id: Входной идентификатор свойства, для которого запрашивается расширенный режим отображения. Тип System.Object.
visible: Флаг режима отображения свойства. Тип bool. Возвращает true, если свойство должно отображаться в full-режиме. В противном случае возвращает false.
integralHeight: Возвращает требуемую высоту (в пикселях) для отображения этого свойства в full-режиме. Тип UInt32.

HostMgd.Windows.ToolPalette.CustomToolBase.IsUnspecifiedAllowed(System.Object,System.Boolean)
Метод позволяет определить, допустимо ли для указанного свойства использовать представление "не указано" (unspecified).
Не реализован.
Метод позволяет определить, допустимо ли для указанного свойства использовать представление "не указано" (unspecified).
В текущей версии не реализован.
Notes
Для получения текстового представления свойств инструмента, значение которых помечено как "не указано" (unspecified) используется
метод GetUnspecifiedString().
id: Входной идентификатор свойства инструмента. Тип System.Object.
returnValue: Возвращаемое значение.  Тип bool.
Returns: Возвращает код завершения метода. Тип int.

HostMgd.Windows.ToolPalette.CustomToolBase.IsValueUnspecified(System.Object,System.Boolean)
Метод позволяет определить, является ли текущим значением указанного свойства значение "не указано" (unspecified).
Не реализован.
Метод позволяет определить, является ли текущим значением указанного свойства значение "не указано" (unspecified).
В текущей версии не реализован.
id: Входной идентификатор свойства инструмента. Тип System.Object.
returnValue: Возвращаемое значение.  Тип bool.
Returns: Возвращает код завершения метода. Тип int.

HostMgd.Windows.ToolPalette.CustomToolBase.Load(System.Object)
Метод загружает данные инструмента из XML-узла в XmlElement перед использованием инструмента.
Не реализован.
Метод загружает данные инструмента из XML-узла в XmlElement перед использованием инструмента.
В текущей версии не реализован.
Notes
За загрузку своих данных из XML-узла отвечает сам инструмент.
Структура XML в этом узле определяется инструментом.
xmlElement: Входной загружаемый элемент.

HostMgd.Windows.ToolPalette.CustomToolBase.MapPropertyToPage(System.Int32,Guid)
Метод выполняет сопоставление идентификатора COM-класса CLSID со страницей свойств в диалоговом окне для указанного свойства данного инструмента. Не реализован.
Метод выполняет сопоставление идентификатора COM-класса CLSID со страницей свойств в диалоговом окне для указанного свойства данного инструмента.
В текущей версии не реализован.
dispatchId: Диспетчерский идентификатор (DispID) свойства инструмента.  Тип int.
clsid: Идентификатор COM-класса, представляющего страницу свойств. Тип Guid.

HostMgd.Windows.ToolPalette.CustomToolBase.MultipleEdit(System.Object,System.Object,System.Int32,System.Boolean)
Метод предназначен для группового редактирования пользовательских инструментов.
Не реализован.
Метод предназначен для группового редактирования пользовательских инструментов.
В текущей версии не реализован.
tools: Входной массив инструментов. Тип System.Object.
stockToolIds: Входной массив идентификаторов стандартных инструментов. Тип System.Object.
parentWindow: Дескриптор родительского окна. Тип int.
success: Флаг завершения. Тип bool. Возвращает true в случае успешного завершения метода, в противном случае возвращает false.

HostMgd.Windows.ToolPalette.CustomToolBase.Refreshed(System.String)
Метод вызывается после обновления данного пользовательского инструмента.
Не реализован.
Метод вызывается после обновления данного пользовательского инструмента.
Метод обеспечивает обновление всех загруженных данных инструмента.
В текущей версии не реализован.
url: Входной URL, связанный с инструментом. Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.Save(System.Object)
Метод предназначен для сохранения данных элемента каталога в XML-узле.
Не реализован.
Метод предназначен для сохранения состояния инструмента в XML-представлении.
Производные классы реализуют этот метод для сохранения в XML-узле своих специфичных данных.
Переопределения должны вызывать реализацию базового класса перед сохранением своих пользовательских данных.
В текущей версии не реализован.
Notes
Метод является парным к методу Load(), который восстанавливает состояние инструмента при загрузке из XML-представления.
xmlElement: Входной сохраняемый элемент. Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.SetEditorWindow(System.Int32,System.Object)
Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента.
Использует для окна редактора дескриптор типа int.
Не реализован.
Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента.
Он использует целочисленный дескриптор окна редактора и объект инспектора свойств.
Инструмент может кэшировать эти значения для использования в процессе редактирования.
В текущей версии не реализован.
editorWindow: Входной дескриптор окна редактора свойств.  Тип int.
propertyInspector: Входной объект инспектора свойств.          Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.SetEditorWindow(long,System.Object)
Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента.
Использует для окна редактора дескриптор типа long.
Не реализован.
Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента.
Он использует для окна редактора дескриптор типа long и объект инспектора свойств.
Инструмент может кэшировать эти значения для использования в процессе редактирования.
В текущей версии не реализован.
editorWindow: Входной дескриптор окна редактора свойств.  Тип long.
propertyInspector: Входной объект инспектора свойств.          Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.SetEditorWindow(System.IntPtr,System.Object)
Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента.
Использует входные указатели окна редактора и инспектора свойств.
Не реализован.
Метод вызывается непосредственно перед отображением диалогового окна редактора свойств инструмента.
Он использует входной указатель окна редактора и входной указатель инспектора свойств.
Инструмент может кэшировать эти значения для использования в процессе редактирования.
В текущей версии не реализован.
editorWindow: Входной указатель окна редактора свойств.   Тип System.IntPtr.
propertyInspector: Входной объект инспектора свойств.          Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.SetFlyoutTools(System.Object)
Метод вызывается для инструмента, отображаемого в виде формы на выпадающей панели инструментов, когда выпадающий инструмент выполняется или перетаскивается.
Не реализован.
Метод вызывается для инструмента, отображаемого в виде формы на выпадающей панели инструментов, когда выпадающий инструмент выполняется или перетаскивается. Метод передаёт ID выпадающего инструмента COM-объекту инструмента во время выполнения или перетаскивания.
В текущей версии не реализован.
flyoutToolIds: Входной массив идентификаторов инструментов на выпадающей панели инструментов.  Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.SetToolProperties(System.Object)
Метод используется для инициализации или получения свойств инструмента.
Не реализован.
Метод используется для инициализации или получения свойств инструмента.
В качестве аргумента используется объект, реализующий интерфейс соответствующего COM-объекта.
В текущей версии не реализован.
toolProperties: Указатель на COM-объект, реализующий свойства инструмента. Тип System.Object.

HostMgd.Windows.ToolPalette.CustomToolBase.SetUnspecified(System.Object,System.Boolean)
Метод позволяет определить, использует ли указанное свойство представление "не указано" (unspecified).
Не реализован.
Метод позволяет определить, использует ли указанное по id свойство представление "не указано" (unspecified).
В текущей версии не реализован.
id: Входной идентификатор свойства. Тип System.Object.
isUnspecified: Флаг, определяющий, использует ли указанное по id свойство представление "не указано" (unspecified). Тип bool.

HostMgd.Windows.ToolPalette.CustomToolBase.ShowProperty(System.Int32,System.Int32)
Метод позволяет динамически управлять отображением свойства инструмента.
Не реализован.
Метод позволяет управлять отображением свойства инструмента во время выполнения.
Это бывает полезно, если некоторые свойства не должны быть видны или не имеют смысла, исходя из значения другого свойства.
В текущей версии не реализован.
dispatchId: Входной диспетчерский идентификатор свойства. Тип int.
show: Флаг, указывающий, отображается ли свойство.  Тип int.

HostMgd.Windows.ToolPalette.CustomToolBase.CurrentShapeId
Свойство CurrentShapeId представляет текущее значение идентификатора формы.
Не реализовано.
Свойство CurrentShapeId представляет текущее значение идентификатора формы (Guid).
В текущей версии не реализовано.
Returns: Возвращает текущее значение идентификатора формы. Тип Guid.

HostMgd.Windows.ToolPalette.CustomToolBase.EditMode
Свойство EditMode позволяет проверить, находится ли данный инструмент в режиме редактирования.
Не реализовано.
Свойство EditMode позволяет проверить, находится ли данный инструмент в режиме редактирования.
В текущей версии не реализовано.
Returns: Возвращает значение флага режима редактирования инструмента.
Тип int.

HostMgd.Windows.ToolPalette.CustomToolBase.FlayoutPackageID
Свойство FlayoutPackageID предоставляет доступ к пакету инструментов выпадающего инструмента.
Не реализовано.
Свойство FlayoutPackageID предоставляет доступ к пакету инструментов выпадающего инструмента.
В текущей версии не реализовано.
Returns: Возвращает идентификатор пакета инструментов. Тип Guid.

HostMgd.Windows.ToolPalette.CustomToolBase.ToolGuid
Свойство ToolGuid представляет уникальный идентификатор данного пользовательского инструмента.
Не реализовано.
Свойство ToolGuid представляет уникальный идентификатор данного пользовательского инструмента.
В текущей версии не реализовано.
Returns: Возвращает идентификатор пользовательского инструмента.
Тип Guid.

HostMgd.Windows.ToolPalette.CustomToolBase.ToolImage
Свойство ToolImage представляет имя связанного с инструментом изображения.
Не реализовано.
Свойство ToolImage представляет имя связанного с инструментом изображения.
В текущей версии не реализовано.
Returns: Возвращает имя связанного с инструментом изображения.
Тип System.String.

HostMgd.Windows.ToolPalette.CustomToolBase.ToolName
Свойство ToolName представляет имя пользовательского инструмента.
Не реализовано.
Свойство ToolName представляет имя пользовательского инструмента.
В текущей версии не реализовано.
Returns: Возвращает имя инструмента.
Тип System.String.