HostMgd.EditorInput.Editor.GetCurrentView
Метод предоставляет ссылку на текущую активную конфигурацию вида (запись таблицы видов),
или null, если получить вид не удалось.
Метод используется для получения объекта ViewTableRecord, представляющего текущий активный вид
в редакторе nanoCAD. Вид включает параметры отображения, такие как положение камеры,
направление взгляда, окно просмотра и другие настройки, используемые при отрисовке чертежа.
Метод может вернуть null, если активный вид недоступен или не установлен.
Returns: Возвращает объект типа ViewTableRecord, представляющий текущий активный вид в чертеже.
Если текущий вид не определён или произошла ошибка, возвращается null.
Example
C#