Teigha.Geometry.EllipticalArc3d.IsCircular
Метод позволяет проверить, является ли данная дуга круглой.
Используется геометрическая точность по умолчанию.
Метод позволяет проверить, не является ли данная дуга круглой.
Используется вызов метода EllipticalArc3d.IsCircular(Tolerance tolerance)
с геометрической точностью, равной Tolerance.Global.
Returns: Возвращает true, если в пределах используемой геометрической точности данную эллиптическую дугу можно считать круглой.
В противном случае возвращает false.