HostMgd.EditorInput.UserInputControls.NoNegativeResponseAccepted
Значение: 64 (0x40).
Маска определяет режим "Не принимать отрицательные значения".
По умолчанию отрицательные значения принимаются.
Работает только для методов JigPrompts.AcquireDistance() и JigPrompts.AcquireAngle().