Teigha.DatabaseServices.XrefNotificationStatus
Перечисление XrefNotificationStatus определяет статусы уведомлений о разрешении внешних ссылок.
Перечисление XrefNotificationStatus определяет статусы уведомлений о разрешении внешних ссылок.