Teigha.DatabaseServices.OpenCloseTransaction
Класс OpenCloseTransaction предназначен для использования в определенных сценариях вместо класса Transaction.
Класс OpenCloseTransaction предназначен для использования в определенных сценариях вместо класса Transaction.
Он оборачивает методы ObjectId.Open/Close, но упрощает их корректное совместное применение, сохраняя ссылки на каждый открытый объект и обеспечивая автоматическое закрытие открытых объектов.

Teigha.DatabaseServices.OpenCloseTransaction.#ctor
Конструктор по умолчанию класса OpenCloseTransaction.
Конструктор по умолчанию класса OpenCloseTransaction.

Teigha.DatabaseServices.OpenCloseTransaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode)
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Используется обращение к методу Open() транзакции верхнего уровня с передачей ему всех полученных аргументов.
Доступ к объектам возможен только в рамках транзакции верхнего уровня, поэтому этот метод избавляет от необходимости сохранять указатель на транзакцию верхнего уровня или использовать для этого свойство TransactionManager.TopTransaction.
Рекомендуется проверять валидность полученного объекта.
id: Идентификатор объекта, к которому требуется получить доступ. Тип ObjectId.
mode: Требуемый режим доступа к объекту.  Перечисление OpenMode.
Returns: Возвращает дескриптор полученного объекта.
Тип DBObject.

Teigha.DatabaseServices.OpenCloseTransaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean)
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Дополнительный аргумент позволяет управлять опцией доступа к ранее удаленным объектам.
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Аргумент openErased делает возможным доступ к удаленным объектам, если передать с ним значение true.
Если передать значение false, попытка доступа к удалённому объекту приведёт к получению кода ошибки.
Используется обращение к методу Open() транзакции верхнего уровня с передачей ему всех полученных аргументов.
Доступ к объектам возможен только в рамках транзакции верхнего уровня, поэтому этот метод избавляет от необходимости сохранять указатель на транзакцию верхнего уровня или использовать для этого свойство TransactionManager.TopTransaction.
Рекомендуется проверять валидность полученного объекта.
id: Идентификатор объекта, к которому требуется получить доступ. Тип ObjectId.
mode: Требуемый режим доступа к объекту.  Перечисление OpenMode.
openErased: Данный флаг определяет, следует ли получать доступ к объекту, если он был удалён. Тип bool.
Returns: Возвращает дескриптор полученного объекта.
Тип DBObject.

Teigha.DatabaseServices.OpenCloseTransaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Дополнительные аргументы позволяют управлять опцией доступа к ранее удаленным объектам, а также к объектам на заблокированных слоях.
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Аргумент openErased делает возможным доступ к удаленным объектам, если передать с ним значение true.
Если передать значение false, попытка доступа к удалённому объекту приведёт к получению кода ошибки.
Аргумент forceOpenOnLockedLayer со значение true делает возможным доступ к объектам на заблокированных слоях.
Используется обращение к методу Open() транзакции верхнего уровня с передачей ему всех полученных аргументов.
Доступ к объектам возможен только в рамках транзакции верхнего уровня, поэтому этот метод избавляет от необходимости сохранять указатель на транзакцию верхнего уровня или использовать для этого свойство TransactionManager.TopTransaction.
Рекомендуется проверять валидность полученного объекта.
id: Идентификатор объекта, к которому требуется получить доступ. Тип ObjectId.
mode: Требуемый режим доступа к объекту.  Перечисление OpenMode.
openErased: Этот флаг определяет, следует ли получать доступ к объекту, если он был удалён. Тип bool.
forceOpenOnLockedLayer: Этот флаг определяет, следует ли открывать заблокированные слои. Тип bool.
Returns: Возвращает дескриптор полученного объекта.
Тип DBObject.

Teigha.DatabaseServices.OpenCloseTransaction.TransactionManager
Свойство представляет менеджер транзакций, связанный с сданным объектом.
Свойство представляет менеджер транзакций, связанный с сданным объектом.
Returns: Возвращает менеджер транзакций. Тип TransactionManager.