Teigha.DatabaseServices.DxfFiler.WriteEmbeddedObjectStart
Метод записывает в данный объект Filer строковые данные «встроенного объекта» для группового кода DxfCode.EmbeddedObjectStart.
Метод записывает в данный объект Filer строковые данные «встроенного объекта» для группового кода DxfCode.EmbeddedObjectStart.
Реализация этого метода по умолчанию не делает ничего.
Метод должен быть переопределен в производных классах.