Teigha.DatabaseServices.BlockTableRecord.UpdateAnonymousBlocks
Метод обновляет анонимные блоки, созданные на основе данного
динамического блока, чтобы отобразить изменения в определении
блока.
Метод обновляет анонимные блоки, созданные на основе данного
динамического блока, чтобы отобразить изменения в определении
блока.
Вызов этого метода после изменений в определении
динамического блока заменяет все определения анонимных
блоков, созданные на основе данного динамического блока, на
новые определения анонимных блоков. Обновление сохраняет
значения свойств динамического блока в ссылках, где это
возможно, добавляя вновь созданные свойства и удаляя те
свойства, которые больше не существуют.