Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.MoveNext
Этот метод перемещает указатель на следующий элемент или на маркер конца данной коллекции, если текущий элемент находится в конце коллекции.
Метод MoveNext() перемещает указатель на следующий элемент или на маркер конца данной коллекции, если текущий элемент находится в конце коллекции.
Returns: Возвращает true, если указатель перемещен на следующий элемент коллекции.
Если указатель оказался на маркере конца коллекции, возвращает false.