HostMgd.ApplicationServices.InplaceTextEditorSettings
Класс InplaceTextEditorSettings представляет входные параметры для встроенного текстового редактора InplaceTextEditor.
В текущей версии не реализован.
Класс InplaceTextEditorSettings представляет входные параметры для встроенного текстового редактора InplaceTextEditor.
Эти настройки влияют на пользовательский интерфейс и свойства редактора.
В текущей версии не реализован.

HostMgd.ApplicationServices.InplaceTextEditorSettings.#ctor
Конструктор по умолчанию класса InplaceTextEditorSettings.
В текущей версии не реализован.
Конструктор по умолчанию класса InplaceTextEditorSettings.
Создаёт экземпляр InplaceTextEditorSettings с настройками по умолчанию для типичного объекта MTEXT.
В текущей версии не реализован.

HostMgd.ApplicationServices.InplaceTextEditorSettings.DefinedHeight
Свойство DefinedHeight управляет назначенной высотой текста во встроенном текстовом редакторе.
В текущей версии не реализовано.
Свойство DefinedHeight представляет назначенную высоту текста во встроенном текстовом редакторе.
Эта настройка используется, если входной объект не является резидентным объектом текущей базы данных.
В противном случае назначенная высота приравнивается высоте самого объекта MTEXT или TEXT.
В текущей версии не реализовано.
Returns: Возвращает назначенную высоту текста в настройках редактора.
Тип double.

HostMgd.ApplicationServices.InplaceTextEditorSettings.Flags
Свойство Flags предоставляет доступ к флагам редактирования.
В текущей версии не реализовано.
Свойство Flags предоставляет доступ на изменение к флагам редактирования в настройках встроенного текстового редактора.
В текущей версии не реализовано.
Returns: Возвращает флаги редактирования в настройках встроенного текстового редактора.
Тип InplaceTextEditorSettings.EditFlags.

HostMgd.ApplicationServices.InplaceTextEditorSettings.SimpleMText
Свойство SimpleMText позволяет указать или проверить, что входным является простой объект MTEXT.
В текущей версии не реализовано.
Свойство SimpleMText позволяет задать или проверить, что входным объектом встроенного текстового редактора является простой объект MTEXT.
В текущей версии не реализовано.
Returns: Возвращает true, если входным объектом редактора является простой объект MTEXT.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditorSettings.TabSupported
Свойство TabSupported позволяет указать, поддерживает ли текстовый редактор вставку символов табуляции.
В текущей версии не реализовано.
Свойство TabSupported позволяет указать, поддерживает ли текстовый редактор вставку символов табуляции.
Notes
Если текущим редактируемым объектом является ячейка таблицы или простой многострочный текст, эта настройка будет проигнорирована, т.к. в этих объектах символы табуляции не поддерживаются.
В текущей версии не реализовано.
Returns: Возвращает true, если редактор поддерживает текстовые абзацы.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditorSettings.Type
Свойство Type предоставляет доступ к типу исходного объекта для текущего редактируемого объекта MTEXT.
В текущей версии не реализовано.
Свойство Type предоставляет доступ к типу исходного объекта для текущего редактируемого объекта MTEXT.
Для сложного объекта, например, ячейки таблицы или многострочного атрибута, можно создавать копию объекта MTEXT в памяти.
В текущей версии не реализовано.
Returns: Возвращает заданный вами тип объекта.
Тип InplaceTextEditorSettings.EntityType.