Teigha.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo2
Метод сортирует точки пересечения по возрастанию значений параметра второй кривой.
Метод сортирует точки пересечения по возрастанию значений параметра второй кривой.