Teigha.BoundaryRepresentation.LoopVertexCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель данной коллекции.
Тип LoopVertexEnumerator.