HostMgd.PlottingServices.BeginPlotEventArgs
Класс BeginPlotEventArgs инкапсулирует необходимую для события BeginPlot информацию, относящуюся к выводу на печать.
Класс BeginPlotEventArgs служит контейнером для аргументов события BeginPlot класса PlotReactorManager.
Аргументы включают объекты PlotProgress и PlotType, которые определяют поведение диалога прогресса печати и тип печати, соответственно. Экземпляры класса используются делегатом HostMgd.PlottingServices.BeginPlotEventHandler.

HostMgd.PlottingServices.BeginPlotEventArgs.#ctor(HostMgd.PlottingServices.PlotProgress,HostMgd.PlottingServices.PlotType)
Конструктор класса BeginPlotEventArgs.
Создает экземпляр класса с указанными параметрами.
Конструктор класса BeginPlotEventArgs.
Создает экземпляр класса с указанными параметрами.
progress: Назначенное поведение диалога прогресса печати. Тип HostMgd.PlottingServices.PlotProgress.
plotType: Тип печати. Значение из перечисления HostMgd.PlottingServices.PlotType.

HostMgd.PlottingServices.BeginPlotEventArgs.PlotProgress
Свойство PlotProgress предоставляет доступ к описанию поведения диалога прогресса печати.
Свойство PlotProgress предоставляет доступ к описанию поведения диалога прогресса печати.
Returns: Возвращает объект типа HostMgd.PlottingServices.PlotProgress, который определяет поведение диалогового окна прогресса печати.

HostMgd.PlottingServices.BeginPlotEventArgs.PlotType
Свойство PlotType представляет тип печати из перечисления PlotType.
Свойство PlotType представляет тип печати (предварительная печать, фоновая печать и т.п.) как значение из перечисления HostMgd.PlottingServices.PlotType.
Returns: Возвращает используемый тип печати.
Тип HostMgd.PlottingServices.PlotType.