Teigha.Geometry.PointOnSurface
Класс PointOnSurface представляет точку на трехмерной поверхности.
Класс PointOnSurface представляет точку на трехмерной поверхности.
Этот класс инкапсулирует всю геометрическую информацию о точке на поверхности, включая параметрические координаты точки и ее координаты в 3D-пространстве моделирования, производные и вектор нормали поверхности в этой точке.

Teigha.Geometry.PointOnSurface.#ctor
Конструктор по умолчанию класса PointOnSurface.
Конструктор по умолчанию класса PointOnSurface.
Создает экземпляр класса, представляющий на плоскости XY точку с параметрическим координатами (0,0).

Teigha.Geometry.PointOnSurface.#ctor(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Конструктор класса PointOnSurface.
Создает на указанной поверхности точку с заданными параметрическими координатами.
Конструктор класса PointOnSurface.
Создает на поверхности surf точку с заданными значениями параметра для осей u и v.
surf: Входная поверхность, на которой лежит данная точка. Тип Surface.
point: Значения параметра для этой точки. Тип Point2d. Координата point.x определяет значение параметра по оси u, а координата point.y - значение параметра по оси v.

Teigha.Geometry.PointOnSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип PointOnSurface.

Teigha.Geometry.PointOnSurface.GetInverseTangentVector(Teigha.Geometry.Vector3d)
Метод проецирует указанный 3D-вектор на плоскость, касательную к поверхности в данной точке, и возвращает 2D-вектор в пространстве параметров, который отображается на этот спроецированный вектор.
В текущей версии не реализован.
Метод проецирует указанный 3D-вектор на плоскость, касательную к поверхности в данной точке, и возвращает 2D-вектор в пространстве параметров, который отображается на этот спроецированный вектор.
В текущей версии этот метод не реализован.
vector: Входной вектор. Тип Vector3d.
Returns: Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора vector.
Тип Vector2d.

Teigha.Geometry.PointOnSurface.GetInverseTangentVector(Teigha.Geometry.Vector3d,Teigha.Geometry.Point2d)
Метод проецирует указанный 3D-вектор на касательную плоскость в указанной точке и возвращает вектор в 2D-пространстве параметров, который соответствует полученному вектору-проекции.
Метод проецирует 3D-вектор vector на касательную плоскость в точке point и возвращает вектор в 2D-пространстве параметров, который соответствует полученному вектору-проекции.
vector: Входной вектор, который проецируется на касательную плоскость в точке point.  Тип Vector3d.
point: Входная точка на поверхности.  Тип Point2d.
Returns: Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора vector.  Тип Vector2d.

Teigha.Geometry.PointOnSurface.GetInverseTangentVector(Teigha.Geometry.Vector3d,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Проецирует заданный 3D-вектор на плоскость, касательную к указанной поверхности в точке с заданными параметрическими координатами, и возвращает вектор в параметрическом 2D-пространстве, который отображается на полученный вектор-проекцию.
В текущей версии не реализован.
Проецирует входной 3D-вектор vector на плоскость, касательную к входной поверхности surf в точке с заданными параметрическими координатами, и возвращает вектор в параметрическом 2D-пространстве, который отображается на полученный вектор-проекцию.
В текущей версии этот метод не реализован.
vector: Входной вектор, который проецируется на касательную плоскость в точке point. Тип Vector3d.
surf: Входная поверхность. Тип Surface.
point: Входная точка на поверхности, заданная в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора vector.  Тип Vector2d

Teigha.Geometry.PointOnSurface.GetMixedPartial(Teigha.Geometry.Point2d)
Метод вычисляет смешанную частную производную в указанной точке поверхности.
В текущей версии не реализован.
Метод вычисляет смешанную частную производную в указанной точке поверхности.
В текущей версии не реализован.
point: Точка поверхности, заданная параметрически. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор смешанной частной производной в точке point поверхности.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetMixedPartial(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод вычисляет смешанную частную производную указанной поверхности в параметрически заданной точке.
В текущей версии не реализован.
Метод вычисляет смешанную частную производную поверхности surf в параметрически заданной точке point.
В текущей версии не реализован.
surf: Входная поверхность. Тип Surface.
point: Точка поверхности, заданная параметрически. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор смешанной частной производной в точке point поверхности surf.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetNormal(Teigha.Geometry.Point2d)
Метод вычисляет нормаль к поверхности в указанной точке.
В текущей версии не реализован.
Метод вычисляет нормаль к поверхности в указанной точке.
В текущей версии не реализован.
point: Точка поверхности, заданная параметрически. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор нормали в указанной точке поверхности.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetNormal(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод вычисляет нормаль к указанной поверхности в заданной точке.
В текущей версии не реализован.
Метод вычисляет нормаль к указанной поверхности в заданной точке.
В текущей версии не реализован.
surf: Входная поверхность. Тип Surface.
point: Точка поверхности, заданная параметрически. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор нормали в указанной точке поверхности.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetPoint(Teigha.Geometry.Point2d)
Метод переопределяет параметрические 2D-координаты связанной с данным объектом точки поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
Метод переопределяет параметрические 2D-координаты связанной с данным объектом точки поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
point: Новые параметрические координаты точки на поверхности. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает точку в 3D-пространстве моделирования, которой соответствует точка point в пространстве параметров.
Тип Point3d.

Teigha.Geometry.PointOnSurface.GetPoint(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод переопределяет связанную с данным объектом поверхность и параметрические 2D-координаты точки на этой поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
Метод переопределяет связанную с данным объектом 3D-поверхность и параметрические 2D-координаты точки на этой поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
surface: Новая 3D-поверхность. Тип Surface.
point: Новые параметрические координаты точки на поверхности. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает точку на поверхности surface в 3D-пространстве моделирования, которой соответствует точка point в пространстве параметров.
Тип Point3d.

Teigha.Geometry.PointOnSurface.GetTangentVector(Teigha.Geometry.Vector2d)
Метод позволяет вычислить 3D-вектор в плоскости, касательной к поверхности в данной точке, которому соответствует указанный 2D-вектор в пространстве параметров.
В текущей версии не реализован.
Метод позволяет вычислить 3D-вектор в плоскости, касательной к поверхности в данной точке, которому соответствует указанный 2D-вектор vector в пространстве параметров.
Возвращаемый вектор имеет вид:
tangentVector = GetUDerivative(1) * vector.x + GetVDerivative(1) * vector.y
В текущей версии этот метод не реализован.
vector: Входной 2D-вектор в пространстве параметров. Тип Vector2d.
Returns: Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору vector.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetTangentVector(Teigha.Geometry.Vector2d,Teigha.Geometry.Point2d)
Метод вычисляет 3D-вектор в плоскости, касательной к поверхности в заданной точке, которому соответствует указанный 2D-вектор в пространстве параметров.
В текущей версии этот метод не реализован.
Метод вычисляет 3D-вектор в плоскости, касательной к поверхности в параметрически заданной 2D-точке point, которому соответствует указанный 2D-вектор vector в пространстве параметров.
Возвращаемый вектор имеет вид:
tangentVector = GetUDerivative(1) * vector.x + GetVDerivative(1) * vector.y
В текущей версии этот метод не реализован.
vector: Входной 2D-вектор в пространстве параметров. Тип Vector2d.
point: Входная 2D-точка в пространстве параметров. Тип Point2d.
Returns: Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору vector.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetTangentVector(Teigha.Geometry.Vector2d,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод вычисляет 3D-вектор в касательной плоскости к указанной поверхности в заданной точке, которому соответствует указанный 2D-вектор в пространстве параметров.
В текущей версии этот метод не реализован.
Метод вычисляет 3D-вектор в касательной плоскости к поверхности vectorSurface в параметрически заданной 2D-точке point, которому соответствует 2D-вектор vector в пространстве параметров.
Возвращаемый вектор имеет вид:
tangentVector = GetUDerivative(1) * vector.x + GetVDerivative(1) * vector.y
В текущей версии этот метод не реализован.
vector: Входной 2D-вектор в пространстве параметров. Тип Vector2d.
vectorSurface: Входная поверхность. Тип Surface.
pointer: Входная 2D-точка в пространстве параметров. Тип Point2d.
Returns: Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору vector.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetUDerivative(System.Int32)
Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении U.
В текущей версии этот метод не реализован.
Метод вычисляет в текущей точке частную производную порядка order для поверхности в направлении U.
В текущей версии этот метод не реализован.
order: Порядок вычисляемой производной (1 или 2). Тип int.
Returns: Возвращает вектор частной производной порядка order в направлении U.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetUDerivative(System.Int32,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте точку поверхности, используя новые параметрические координаты, и вычисляет в этой точке частную производную указанного порядка в направлении U.  В текущей версии этот метод не реализован.
Метод переопределяет в данном объекте точку поверхности, используя параметрические координаты point, и вычисляет в этой точке частную производную порядка order в направлении U.  В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип int.
point: Входная 2D-точка в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор частной производной порядка order в направлении U.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetUDerivative(System.Int32,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте поверхность и точку поверхности, используя новые параметрические координаты, и вычисляет в указанной точке частную производную заданного порядка в направлении U.
В текущей версии этот метод не реализован.
Метод переопределяет в данном объекте поверхность surface и точку поверхности, используя новые параметрические координаты point, и вычисляет в указанной точке частную производную порядка order в направлении U.
В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип int.
surface: Входная поверхность. Тип Surface.
point: Входная 2D-точка в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор частной производной порядка order в направлении U.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetVDerivative(System.Int32)
Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении V.
В текущей версии этот метод не реализован.
Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении V.
В текущей версии этот метод не реализован.
order: Порядок вычисляемой производной (1 или 2). Тип int.
Returns: Возвращает вектор частной производной порядка order в направлении V.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetVDerivative(System.Int32,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте точку поверхности, используя новые параметрические координаты, и вычисляет в этой точке частную производную указанного порядка в направлении V.  В текущей версии этот метод не реализован.
Метод переопределяет в данном объекте точку поверхности, используя параметрические координаты point, и вычисляет в этой точке частную производную порядка order в направлении V.  В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип int.
point: Входная 2D-точка в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор частной производной порядка order в направлении V.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.GetVDerivative(System.Int32,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте поверхность и точку поверхности, используя новые параметрические координаты, и вычисляет в указанной точке частную производную заданного порядка в направлении V.
В текущей версии этот метод не реализован.
Метод переопределяет в данном объекте поверхность surface и точку поверхности, используя новые параметрические координаты point, и вычисляет в указанной точке частную производную порядка order в направлении V.
В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип int.
surface: Входная поверхность. Тип Surface.
point: Входная 2D-точка в пространстве параметров. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.
Returns: Возвращает вектор частной производной порядка order в направлении V.
Тип Vector3d.

Teigha.Geometry.PointOnSurface.Parameter
Свойство Parameter представляет текущее параметрическое представление точки поверхности.
Свойство Parameter представляет текущее параметрическое представление точки поверхности.
Returns: Возвращает текущие параметрические координаты точки поверхности. Тип Point2d. Координата point.x определяет значение параметра точки по оси u, а координата point.y - значение параметра по оси v.

Teigha.Geometry.PointOnSurface.Surface
Свойство Surface представляет поверхность, на которой лежит точка данного объекта.
Свойство Surface представляет поверхность, на которой лежит точка данного объекта.
Returns: Возвращает 3D-поверхность. Тип Surface.