Teigha.GraphicsInterface.ScaleBehavior
Перечисление ScaleBehavior определяет преобразования масштаба временной графики.
Перечисление ScaleBehavior определяет преобразования масштаба временной (переходной) графики.