Teigha.DatabaseServices.MText.getMTextWithFieldCodes
Метод позволяет преобразовать многострочный текст в строку, в которой поля представлены своими кодами.
Метод позволяет преобразовать многострочный текст, содержащий автоматические поля, в строку, в которой автоматические поля представлены своими кодами.
Код поля представляет собой пару (ключ - значение), где ключ - наименование поля, значение - код автоматического поля.
Returns: Возвращает строку, в которой автоматические поля представлены своими кодами.
Тип String.