Teigha.DatabaseServices.TableCopyOptions.ExpandOrContractTable
Значение: 1. Создавать новые строки и столбцы, если исходный диапазон не соответствует целевому диапазону.
Удалять пустые строки и столбцы, если целевой диапазон превышает исходный.