Teigha.Geometry.NurbCurve2dData
Структура NurbCurve2dData предназначена для хранения данных, которые определяют объект NurbCurve2d.
Структура NurbCurve2dData предназначена для хранения данных, которые определяют объект NurbCurve2d.
Notes
Если сплайн NurbCurve2d является периодическим, длина узлового вектора будет больше длины массива управляющих вершин на 1.
В противном случае длина узлового вектора будет на degree + 1 больше длины массива управляющих вершин.

Teigha.Geometry.NurbCurve2dData.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если объект obj равен данному объекту.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dData.IsEqualTo(Teigha.Geometry.NurbCurve2dData)
Метод проверяет, совпадают ли данные этой NURBS кривой с данными указанного объекта типа NurbCurve2dData.
Метод проверяет, совпадают ли данные этой NURBS кривой с данными указанного объекта типа NurbCurve2dData.
Notes
Объекты типа NurbCurve2dData считаются равными, если одновременно выполняются следующие условия:
* Обе кривые являются рациональными (назначены веса) или обе являются нерациональными (веса не используются);
* Обе кривые являются периодическими (замкнутыми) или обе являются непериодическими (незамкнутыми);
* Управляющие вершины совпадают;
* Коллекции узлов совпадают;
* Значения весов равны.
a: Проверяемые данные двумерной NURBS кривой. Тип NurbCurve2dData.
Returns: Возвращает true, если сравниваемые объекты можно считать равными.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dData.!=(Teigha.Geometry.NurbCurve2dData,Teigha.Geometry.NurbCurve2dData)
Оператор неравенства структуры NurbCurve2dData.
Оператор неравенства структуры NurbCurve2dData.
Notes
Объекты типа NurbCurve2dData считаются неравными, если нарушается хотя бы одно из следующих условий:
* Обе кривые являются рациональными (назначены веса) или обе являются нерациональными (веса не используются);
* Обе кривые являются периодическими (замкнутыми) или обе являются непериодическими (незамкнутыми);
* Управляющие вершины совпадают;
* Коллекции узлов совпадают;
* Значения весов совпадают.
a: Левый  операнд. Тип NurbCurve2dData.
b: Правый операнд. Тип NurbCurve2dData.
Returns: Возвращает true, если операнды не равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dData.==(Teigha.Geometry.NurbCurve2dData,Teigha.Geometry.NurbCurve2dData)
Оператор равенства структуры NurbCurve2dData.
Оператор равенства структуры NurbCurve2dData.
Notes
Объекты типа NurbCurve2dData считаются равными, если одновременно выполняются следующие условия:
* Обе кривые являются рациональными (назначены веса) или обе являются нерациональными (веса не используются);
* Обе кривые являются периодическими (замкнутыми) или обе являются непериодическими (незамкнутыми);
* Управляющие вершины совпадают;
* Коллекции узлов совпадают;
* Значения весов совпадают.
a: Левый  операнд. Тип NurbCurve2dData.
b: Правый операнд. Тип NurbCurve2dData.
Returns: Возвращает true, если операнды равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dData.ControlPoints
Свойство ControlPoints представляет коллекцию управляющих вершин NURBS кривой.
Свойство ControlPoints представляет коллекцию управляющих вершин NURBS кривой.
Returns: Возвращает коллекцию управляющих вершин кривой. Тип Point2dCollection.

Teigha.Geometry.NurbCurve2dData.Degree
Свойство Degree представляет степень NURBS кривой.
Свойство Degree представляет степень NURBS кривой.
Returns: Возвращает степень NURBS кривой.
Тип int.

Teigha.Geometry.NurbCurve2dData.Knots
Свойство Knots представляет узловой вектор NURBS кривой.
Свойство Knots представляет узловой вектор NURBS кривой.
Returns: Возвращает узловой вектор NURBS кривой.
Тип KnotCollection.

Teigha.Geometry.NurbCurve2dData.Periodic
Свойство Periodic позволяет проверить, является ли данная кривая периодической.
Свойство Periodic позволяет проверить, является ли данная кривая периодической.
Returns: Возвращает true, если кривая является периодической.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dData.Rational
Свойство Rational позволяет проверить, является ли данная NURBS кривая рациональной.
Свойство Rational позволяет проверить, является ли данная NURBS кривая рациональной.
Returns: Возвращает true, если кривая является рациональной.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dData.Weights
Свойство Weights представляет веса NURBS кривой.
Свойство Weights представляет веса NURBS кривой.
Returns: Возвращает массив весов данной NURBS кривой.
Тип DoubleCollection.