Teigha.DatabaseServices.Polyline2d
Класс Polyline2d представляет объект 2D-полилинии в nanoCAD.
Класс Polyline2d представляет объект 2D-полилинии в nanoCAD.

Teigha.DatabaseServices.Polyline2d.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.
Создает незамкнутую полилинию с отключенной генерацией типа линии. Инициализирует начальную и конечную ширину равными 0.0, прогиб — 0.0, уровень — 0.0, тип — SimplePoly, нормаль — (0,0,1) и толщину — 0.0.

Teigha.DatabaseServices.Polyline2d.#ctor(Teigha.DatabaseServices.Poly2dType,Teigha.Geometry.Point3dCollection,System.Double,System.Boolean,System.Double,System.Double,Teigha.Geometry.DoubleCollection)
Конструктор.
Конструктор.
type: Тип полилинии из перечисления Poly2dType.
vertices: Коллекция вершин полилинии, тип Point3dCollection.
elevation: Уровень полилинии, тип double.
closed: Замкнутость полилинии, тип bool.  Если замкнутая, равен true, в противном случае - false.
startWidth: Начальная толщина, тип double.
endWidth: Конечная толщина, тип double.
bulges: Коллекция прогибов, тип DoubleCollection.

Teigha.DatabaseServices.Polyline2d.AppendVertex(Teigha.DatabaseServices.Vertex2d)
Метод добавляет новую вершину Vertex2d в список вершин полилинии.
Метод добавляет объект Vertex2d в список вершин полилинии, делает полилинию владельцем вершины и добавляет вершину в базу данных, в которой содержится полилиния.  Чтобы метод отработал успешно, полилиния должна быть резидентной в этой базе данных.  Метод возвращает ObjectId добавленной вершины.
Добавленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода AppendVertex().
vertexToAppend: Добавляемая вершина, тип Vertex2d.
Returns: Возвращает ObjectId новой вершины полилинии.

Teigha.DatabaseServices.Polyline2d.ConvertToPolyType(Teigha.DatabaseServices.Poly2dType)
Метод предназначен для преобразования полилинии в тип, указанный значением аргумента.
Метод предназначен для преобразования полилинии в тип, указанный значением аргумента newType.
Использует методы SplineFit() и/или CurveFit().
newVal: Новый тип полилинии из перечисления Poly2dType.

Teigha.DatabaseServices.Polyline2d.InsertVertexAt(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.Vertex2d)
Этот метод вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины Vertex2d, у которой objectId равен vertexId.
Этот метод вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины Vertex2d, у которой objectId равен vertexId.  Метод делает полилинию владельцем новой вершины и добавляет вершину в базу данных, в которой содержится сама полилиния.  Для успешного завершения этой операции полилиния должна быть резидентной в базе данных.
Чтобы вставить вершину в начало полилинии, в качестве аргумента vertexId следует передать Null.
Вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt().
Возвращает идентификатор ObjectId объекта newVertex.
vertexId: Идентификатор ObjectId вершины полилинии, после которой должна быть вставлена новая вершина. Чтобы вставить вершину в начало полилинии, в аргументе vertexId следует передать Null.
newVertex: указатель на добавляемую вершину, тип Vertex2d.
Returns: Возвращает ObjectId новой вершины полилинии.

Teigha.DatabaseServices.Polyline2d.InsertVertexAt(Teigha.DatabaseServices.Vertex2d,Teigha.DatabaseServices.Vertex2d)
Эта функция вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины indexVertex.
Эта функция вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины indexVertex.
Если полилиния является резидентной в базе данных, то вершина будет добавлена в ту же базу данных.
Если же полилиния не является резидентной, то вершина будет добавлена в базу данных, как только в базу данных будет добавлена сама полилиния.
Чтобы вставить вершину в начало полилинии, следует передать NULL в аргументе indexVertex.
Если полилиния является резидентной, то вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt().
Если же полилиния не является резидентной, то нет необходимости закрывать вершину, так как она еще не была добавлена в базу данных.
indexVertex: Вершина полилинии Vertex2d, после которой должна быть вставлена новая вершина. Чтобы вставить новую вершину в начало полилинии, в аргументе indexVertex следует передать Null.
newVertex: Вставляемая вершина, тип Vertex2d.

Teigha.DatabaseServices.Polyline2d.NonDBAppendVertex(Teigha.DatabaseServices.Vertex2d)
Метод добавляет объект Vertex2d в список вершин полилинии и делает полилинию владельцем вершины.
Полилиния не должна быть резидентной в базе данных.
Метод добавляет объект Vertex2d в список вершин полилинии и делает полилинию владельцем вершины.
Полилиния не должна быть резидентной в базе данных.
vertexToAppend: Добавляемая в полилинию вершина, тип Vertex2d.

Teigha.DatabaseServices.Polyline2d.SplineFit(Teigha.DatabaseServices.Poly2dType,System.Int32)
Метод выполняет аппроксимацию полилинии сплайном с указанием его типа и количества сегментов сплайна.
Метод выполняет аппроксимацию полилинии сплайном с указанием типа сплайна и количества его сегментов.
Он преобразует все простые вершины в контрольные вершины сплайна и на их основе создает новые вершины аппроксимирующего сплайна указанного типа с учетом требуемого количества сегментов.
value: Тип нового сплайна из перечисления Poly2dType.
segments: Количество сегментов аппроксимирующего сплайна.

Teigha.DatabaseServices.Polyline2d.VertexPosition(Teigha.DatabaseServices.Vertex2d)
Метод предназначен для получения координат вершины в мировой системе координат (WCS).
Метод извлекает координаты X и Y из вершины, а координату Z - из полилинии, после чего применяет преобразование из системы координат полилинии (OCS) в WCS для получения позиции в мировой системе координат.
Метод предназначен для получения координат вершины в мировой системе координат (WCS).
Метод извлекает координаты X и Y из вершины, а координату Z - из полилинии, после чего применяет преобразование из системы координат полилинии (OCS) в WCS для получения позиции в мировой системе координат.
Этот метод будет работать и с теми вершинами, для которых данная полилиния владельцем не является.
Возвращаемое положение будет таким, как если бы такая вершина принадлежала полилинии.
vertex: Вершина Vertex2d, положение которой требуется определить в мировой системе координат.
Returns: Возвращает экземпляр Point3d.

Teigha.DatabaseServices.Polyline2d.Closed
Свойство позволяет определить, является ли данная полилиния замкнутой.
Свойство позволяет определить, является ли данная полилиния замкнутой.
Если требуется замкнуть полилинию, между последней и первой вершинами будет построен линейный сегмент, образующий замкнутый многоугольник.
Returns: Возвращает true, если данная полилиния является замкнутой, и false в противном случае.

Teigha.DatabaseServices.Polyline2d.LinetypeGenerationOn
Свойство определяет, включена ли для данной полилинии генерация типа линии.
Свойство определяет, включена ли для данной полилинии генерация типа линии.
Returns: Возвращает true, если генерация типа линии включена, и false, если отключена.

Teigha.DatabaseServices.Polyline2d.ConstantWidth
Свойство предоставляет доступ к значению толщины полилинии.
Свойство предоставляет доступ к значению толщины полилинии.
Returns: Возвращает толщину полилинии, тип double.

Teigha.DatabaseServices.Polyline2d.DefaultEndWidth
Свойство предоставляет доступ к значению по умолчанию конечной ширины сегмента этой полилинии.
Это значение используется как конечная ширина по умолчанию для всех вершин полилинии.
Свойство предоставляет доступ к значению по умолчанию конечной ширины сегмента этой полилинии.
Это значение используется как конечная ширина по умолчанию для всех вершин полилинии.
Таким образом, в рамках функции DXFOUT вершины с такой конечной шириной не будут записывать это значение в файл.  В случае DXFIN вершины без группового кода DXF 41 будут использовать конечную ширину полилинии по умолчанию.
Returns: Возвращает конечную ширину сегмента полилинии как значение типа double.

Teigha.DatabaseServices.Polyline2d.DefaultStartWidth
Свойство предосталяет доступ к значению по умолчанию начальной ширины сегмента полилинии.
Это значение используется как начальная ширина по умолчанию для всех вершин полилинии.
Свойство предосталяет доступ к значению по умолчанию начальной ширины сегмента полилинии.
Это значение используется как начальная ширина по умолчанию для всех вершин полилинии.
Таким образом, в рамках функции DXFOUT вершины с такой начальной шириной, не будут записывать это значение в файл.  В случае функции DXFIN вершины без группового кода DXF 40 будут использовать начальную ширину полилинии по умолчанию.
Returns: Возвращает начальную ширину сегмента полилинии как значение типа double.

Teigha.DatabaseServices.Polyline2d.Elevation
Свойство предоставляет доступ к знгачению уровня полилинии.
Свойство предоставляет доступ к знгачению уровня полилинии.
Уровень — это значение Z объектной системы координат (OCS) полилинии (то есть кратчайшее расстояние от начала мировой системы координат WCS до плоскости, в которой располагается полилиния).
Returns: Возвращает уровень полилинии, тип double.

Teigha.DatabaseServices.Polyline2d.Length
Свойство предоставляет доступ к текущему значению длины полилинии.
Свойство предоставляет доступ к текущему значению длины полилинии.
Returns: Возвращает длину полилинии как значение типа double.

Teigha.DatabaseServices.Polyline2d.Normal
Свойство обеспечивает доступ к вектору нормали плоскости, в которой располагается полилиния.
Свойство обеспечивает доступ к вектору нормали плоскости, в которой располагается полилиния.
Вектор нормали дается в мировой системе координат (WCS).
Returns: Возвращает вектор типа Vector3d.

Teigha.DatabaseServices.Polyline2d.PolyType
Свойство предоставляет доступ к типу аппроксимации для данной полилинии в виде элемента перечисления Poly2dType.
Свойство предоставляет доступ к типу аппроксимации для данной полилинии в виде значения из перечисления Poly2dType.
Returns: Возвращает значение из перечисления Poly2dType.

Teigha.DatabaseServices.Polyline2d.Thickness
Свойство предоставляет доступ к толщине полилинии.
Свойство предоставляет доступ к толщине полилинии.
Направление этого вектора иногда называют направлением выдавливания.
Returns: Возвращает толщину полилинии, тип double.