Teigha.DatabaseServices.AssocArray.GetParameters
Метод позволяет получить объект параметров данного ассоциативного массива.
Метод позволяет получить объект параметров AssocArrayParameters данного ассоциативного массива.
Returns: Возвращает параметры ассоциативного массива. Тип AssocArrayParameters.