Teigha.Geometry.Vector3d
Этот класс представляет векторы в трехмерном пространстве.
Этот класс представляет векторы в трехмерном пространстве.
Vector3d можно рассматривать как массив из трех вещественных чисел, представляющих компоненты вектора.

Teigha.Geometry.Vector3d.#ctor(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Vector2d)
Этот конструктор создает трехмерный вектор, определяемый заданным двумерным вектором в системе координат заданного плоского объекта.
Этот конструктор создает трехмерный вектор, определяемый двумерным вектором vector2d в системе координат плоского объекта plane.
plane: Входной плоский объект. Тип PlanarEntity.
vector2d: Входной двумерный вектор. Тип Vector2d.

Teigha.Geometry.Vector3d.#ctor(System.Double,System.Double,System.Double)
Конструктор создает трехмерный вектор с заданными компонентами x, y и z.
Конструктор создает трехмерный вектор с заданными компонентами x, y и z.
x: X-компонента вектора. Тип double.
y: Y-компонента вектора. Тип double.
z: Z-компонента вектора. Тип double.

Teigha.Geometry.Vector3d.#ctor(array)
Конструктор создает вектор, используя в качестве его компонент первые три элемента заданного массива.
Конструктор создает новый вектор, используя в качестве его компонент первые три элемента заданного массива xyz.
xyz: Входной массив компонент создаваемого вектора. Тип double[].

Teigha.Geometry.Vector3d.Add(Teigha.Geometry.Vector3d)
Метод реализует сложение данного вектора с заданным 3D-вектором.
Метод реализует сложение данного вектора с заданным 3D-вектором v.
v: Входной вектор. Тип Vector3d.
Returns: Возвращает сумму двух трехмерных векторов как объект типа Vector3d.

Teigha.Geometry.Vector3d.AngleOnPlane(Teigha.Geometry.PlanarEntity)
Метод определяет угол между ортогональной проекцией этого вектора на заданный плоский объект и нулевым базисным вектором v0 этого плоского объекта, который возвращает метод PlanarEntity.GetCoordinateSystem(p, v0, v1).
Метод определяет угол между ортогональной проекцией этого вектора на заданный плоский объект plane и нулевым базисным вектором v0 объекта plane, который возвращает метод PlanarEntity.GetCoordinateSystem(p, v0, v1).
plane: Входной геометрический плоский объект. Тип PlanarEntity.
Returns: Возвращает угол между векторами в плоскости plane. Тип double.

Teigha.Geometry.Vector3d.Convert2d(Teigha.Geometry.PlanarEntity)
Метод позволяет получить представление данного трехмерного вектора в виде 2D-вектора в системе координат входного плоского объекта.
Предполагается, что данный вектор параллелен заданной плоскости.
Метод обеспечивает представление данного трехмерного вектора в виде 2D-вектора в системе координат входного плоского объекта plane. Систему координат плоского объекта возвращает метод PlanarEntity.GetCoordinateSystem().
Предполагается, что данный 3D-вектор параллелен входной плоскости plane.
plane: Входной плоский объект. Тип PlanarEntity.
Returns: Возвращает двумерный вектор. Тип Vector2d.

Teigha.Geometry.Vector3d.CrossProduct(Teigha.Geometry.Vector3d)
Метод реализует векторное произведение данного вектора и входного 3D-вектора.
Метод реализует векторное произведение данного вектора и входного 3D-вектора vector.
vector: Входной 3D-вектор. Тип Vector3d.
Returns: Возвращает результат векторного произведения в виде объекта Vector3d.

Teigha.Geometry.Vector3d.DivideBy(System.Double)
Метод реализует деление компонент данного вектора на входное вещественное значение.
Метод реализует деление компонент данного вектора на входное вещественное значение value.
value: Входное значение делителя. Тип double.
Returns: Возвращает трехмерный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.DotProduct(Teigha.Geometry.Vector3d)
Метод реализует скалярное произведение данного вектора с входным 3D-вектором.
Метод реализует скалярное произведение данного вектора с входным 3D-вектором v.
v: Входной трехмерный вектор. Тип Vector3d.
Returns: Возвращает результат скалярного произведения векторов.  Тип double.

Teigha.Geometry.Vector3d.Equals(Object)
Метод реализует проверку равенства данного вектора и входного объекта.
Метод реализует проверку равенства данного вектора и входного объекта.
В случае равенства возвращает true.
obj: Входной объект, с которым выполняется сравнение. Тип Object.
Returns: Возвращает true, если данный вектор равен входному объекту obj. В противном случае возвращает false.

Teigha.Geometry.Vector3d.GetAngleTo(Teigha.Geometry.Vector3d)
Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором.
Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором.
vector: Входной трехмерный вектор. Тип Vector3d.
Returns: Возвращает угол между двумя трехмерными векторами в интервале [0, Pi].  Тип double.

Teigha.Geometry.Vector3d.GetAngleTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет определить угол в интервале [0, 2*Pi] между данным вектором и входным вектором vector. Результат зависит от взаимной ориентации указанных векторов относительно вспомогательного входного вектора referenceVector.
Метод позволяет определить угол в интервале [0, 2*Pi] между данным вектором и входным вектором vector. Результат зависит от взаимной ориентации указанных векторов относительно вспомогательного входного вектора referenceVector.
Если скалярное произведение вектора referenceVector на результат векторного произведения данного вектора на входной вектор vector >= 0.0, то возвращаемое значение угла совпадает с результатом метода Vector3d.GetAngleTo(Vector3d). В противном случае искомый угол равен 2*Pi - Vector3d.GetAngleTo(Vector3d).
vector: Входной вектор, до которого измеряется угол. Тип Vector3d.
referenceVector: Вспомогательный входной вектор. Тип Vector3d.
Returns: Возвращает угол между векторами (в радианах) в интервале значений [0, 2*Pi]. Тип double.

Teigha.Geometry.Vector3d.GetNormal(Teigha.Geometry.Tolerance)
Метод позволяет получить единичный вектор, сонаправленный данному вектору.
Метод позволяет получить единичный вектор, сонаправленный данному вектору.
Возвращаемый вектор не нормируется, если его длина оказывается меньше допуска Tolerance.EqualVector().
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает единичный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.IsCodirectionalTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору в пределах заданной точности.
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору.
Реализация приводит оба вектора к единичной длине, а затем проверяет их совпадение в пределах заданного допуска Tolerance.EqualVector().
Метод возвращает true, если это условие выполнено, и false в противном случае.
vector: Входной вектор для сравнения на сонаправленность. Тип Vector3d.
tolerance: Входная точность для сравнения векторов. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности оба вектора можно считать сонаправленными. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsCodirectionalTo(Teigha.Geometry.Vector3d)
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору.
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору.
Реализация использует вызов Vector3d.IsCodirectionalTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global.
Метод возвращает true, если это условие выполнено, и false в противном случае.
vector: Входной вектор для сравнения на сонаправленность. Тип Vector3d.
Returns: Возвращает true, если векторы можно считать сонаправленными. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsEqualTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадает ли данный вектор с входным вектором в пределах заданной точности.
Метод позволяет проверить, совпадает ли данный вектор с входным вектором vector в пределах заданной точности tolerance.
В случае совпадения векторов возвращает true. В противном случае возвращает false.
vector: Входной вектор для сравнения. Тип Vector3d.
tolerance: Входная точность для сравнения векторов. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности оба вектора можно считать равными. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsEqualTo(Teigha.Geometry.Vector3d)
Метод позволяет проверить, совпадает ли данный вектор с входным вектором.
Метод позволяет проверить, совпадает ли данный вектор с входным вектором.
Реализация использует вызов Vector3d.IsEqualTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global.
Метод возвращает true, если это условие выполнено, и false в противном случае.
vector: Входной вектор для сравнения. Тип Vector3d.
Returns: Возвращает true, если векторы можно считать совпадающими. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsParallelTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, параллелен ли данный вектор входному вектору в пределах заданной точности.
Метод позволяет проверить, параллелен ли данный вектор входному вектору vector в пределах заданной точности tolerance.
Реализация приводит оба вектора к единичной длине. В случае отрицательного скалярного произведения векторов, изменяет направление данного вектора на противоположное. Затем выполняется проверка на совпадение полученных векторов в пределах заданного допуска Tolerance.EqualVector().
Метод возвращает true, если это условие выполнено, и false в противном случае.
vector: Входной вектор для сравнения. Тип Vector3d.
tolerance: Входная точность для сравнения векторов. Тип Tolerance.
Returns: В случае параллельности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsParallelTo(Teigha.Geometry.Vector3d)
Метод позволяет проверить, параллелен ли данный вектор входному вектору.
Метод позволяет проверить, параллелен ли данный вектор входному вектору vector.
Реализация использует вызов метода Vector3d.IsParallelTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global.
Метод возвращает true, если это условие выполнено, и false в противном случае.
vector: Входной вектор для сравнения. Тип Vector3d.
Returns: В случае параллельности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsPerpendicularTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод проверяет перпендикулярность данного вектора входному вектору в пределах заданной точности tolerance.
Метод позволяет проверить перпендикулярность данного вектора входному вектору vector в пределах заданной точности tolerance.
Реализация приводит оба вектора к единичной длине и вычисляет их скалярное произведение.
Если полученное значение укладывается в пределы заданного допуска Tolerance.EqualVector(), метод возвращает true. В противном случае возвращает false.
vector: Входной вектор для сравнения. Тип Vector3d.
tolerance: Входная точность для сравнения. Тип Tolerance.
Returns: В случае перпендикулярности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsPerpendicularTo(Teigha.Geometry.Vector3d)
Метод проверяет перпендикулярность данного вектора входному вектору.
Метод позволяет проверить перпендикулярность данного вектора входному вектору vector.
Реализация использует вызов метода Vector3d.IsPerpendicularTo(Vector3d vector, Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global.
Метод возвращает true, если это условие выполнено, и false в противном случае.
vector: Входной вектор для сравнения. Тип Vector3d.
Returns: В случае перпендикулярности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsUnitLength(Teigha.Geometry.Tolerance)
Метод проверяет, является ли данный вектор единичным в пределах заданной точности.
Метод проверяет, является ли данный вектор единичным в пределах заданной точности tolerance.
Если данный вектор совпадает с результатом его нормализации (приведения к единичной длине) в пределах заданной точности Tolerance.EqualVector(), метод возвращает значение true.
В противном случае возвращает false.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный вектор можно считать единичным.
В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsZeroLength(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный вектор нулевым в пределах заданной точности.
Метод позволяет проверить, является ли данный вектор нулевым в пределах указанной точности tolerance.
Возвращает true, если вектор можно считать нулевым. В противном случае возвращает false.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true, если данный вектор можно считать нулевым. В противном случае возвращает false.

Teigha.Geometry.Vector3d.Mirror(Teigha.Geometry.Vector3d)
Метод позволяет получить 3D-вектор, который является результатом зеркального отражения данного вектора относительно заданной плоскости.
Метод позволяет получить трехмерный вектор как результат зеркального отражения данного вектора относительно плоскости, которая имеет нормаль NormalToPlane и проходит через начало системы координат.
normalToPlane: Входной вектор нормали плоскости зеркального отражения. Тип Vector3d.
Returns: Возвращает вектор, являющийся зеркальным отражением данного вектора. Тип Vector3d.

Teigha.Geometry.Vector3d.MultiplyBy(System.Double)
Метод реализует умножение данного вектора на заданное число.
Метод реализует умножение данного вектора на заданное вещественное число value.
value: Входной множитель. Тип double.
Returns: Возвращает вектор типа Vector3d.

Teigha.Geometry.Vector3d.OrthoProjectTo(Teigha.Geometry.Vector3d)
Метод строит 3D-вектор, который является ортогональной проекцией данного вектора на заданную плоскость, проходящую через начало координат.
Метод строит 3D-вектор, который является ортогональной проекцией данного вектора на плоскость, проходящую через начало координат и имеющую нормаль planeNormal.
planeNormal: Входной вектор нормали плоскости проецирования. Тип Vector3d.
Returns: Возвращает спроецированный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.ProjectTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод строит трехмерный вектор, который является результатом параллельной проекции данного вектора на указанную плоскость в заданном направлении.
Метод строит трехмерный вектор, который является результатом параллельной проекции данного вектора на плоскость с нормалью planeNormal, проходящей через начало координат. Направление проекцирования определяется входным вектором projectDirection.
planeNormal: Входной вектор нормали плоскости. Тип Vector3d.
projectDirection: Входное направление проецирования. Тип Vector3d.
Returns: Возвращает результат параллельного проецирования на указанную плоскость. Тип Vector3d.

Teigha.Geometry.Vector3d.RotateBy(System.Double,Teigha.Geometry.Vector3d)
Метод создает трехмерный вектор, который образуется в результате вращения данного вектора вокруг заданной оси на заданный угол.
Метод создает трехмерный вектор, который образуется в результате вращения данного вектора вокруг заданного направления axis на заданный угол angle.  Ось вращения проходит через начало координат.  Положительное направление отсчета углов поворота определяется правилом правой руки.
angle: Угол поворота в радианах. Тип double.
axis: Направляющий вектор оси вращения. Тип Vector3d.
Returns: Возвращает трехмерный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.Subtract(Teigha.Geometry.Vector3d)
Метод реализует вычитание указанного вектора из данного вектора.
Метод реализует вычитание указанного вектора v из данного вектора.
v: Вычитаемый вектор. Тип Vector3d.
Returns: Возвращает результат векторного вычитания. Тип Vector3d.

Teigha.Geometry.Vector3d.ToString(IFormatProvider)
Метод реализует эквивалентное представление данного вектора в виде текстовой строки с учетом региональных и языковых настроек.
Метод реализует эквивалентное представление данного вектора в виде текстовой строки с учетом региональных и языковых настроек, определяемых указанным провайдером provider.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данного вектора. Тип String.

Teigha.Geometry.Vector3d.ToString(String,IFormatProvider)
Метод реализует эквивалентное представление данного вектора в виде текстовой строки в предписанном формате и с учетом региональных и языковых настроек.
Метод реализует эквивалентное представление данного вектора в виде текстовой строки, формат которой задается аргументом format, а региональные и языковые настройки определяются указанным провайдером provider.
format: Входной формат строки. Тип String.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данного вектора. Тип String.

Teigha.Geometry.Vector3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод реализует геометрическое преобразование данного вектора, которое определено входной матрицей Matrix3d.
Метод применяет к данному вектору геометрическое преобразование, заданное матрицей leftSide, и возвращает результирующий вектор.
leftSide: Входная матрица геометрического пребразования. Тип Matrix3d.
Returns: Возвращает результат геометрического преобразования данного вектора. Тип Vector3d.

Teigha.Geometry.Vector3d.!=(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Оператор неравенства для класса Vector3d.
Оператор позволяет проверить несовпадение двух указанных векторов на основе их покомпонентного сравнения.
Возвращает true в случае несовпадения векторов.
a: Левый операнд.  Тип Vector3d.
b: Правый операнд. Тип Vector3d.
Returns: Возвращает true, если не совпадают значения по крайней мере у одной пары соответствующих компонент двух векторов.
В противном случае возвращает false.

Teigha.Geometry.Vector3d.*(Teigha.Geometry.Matrix3d,Teigha.Geometry.Vector3d)
Оператор реализует умножение матрицы преобразования на 3D-вектор.
Оператор возвращает вектор, равный произведению матрицы a и вектора b, представленного в виде столбца.
a: Левый операнд.  Тип Matrix3d.
b: Правый операнд. Тип Vector3d.
Returns: Возвращает вектор, являющийся результатом геометрического преобразования. Тип Vector3d.

Teigha.Geometry.Vector3d.*(Teigha.Geometry.Vector3d,System.Double)
Оператор реализует умножение указанного 3D-вектора на заданный масштабный множитель.
Оператор реализует умножение указанного 3D-вектора a на заданный масштабный множитель factor.
a: Левый операнд.  Тип Vector3d.
factor: Правый операнд. Тип double.
Returns: Возвращает результат умножения входного вектора на заданный множитель. Тип Vector3d.

Teigha.Geometry.Vector3d.*(System.Double,Teigha.Geometry.Vector3d)
Оператор реализует умножение заданного масштабного множителя на указанный 3D-вектор.
Оператор реализует умножение масштабного множителя factor на указанный 3D-вектор.
factor: Левый операнд.  Тип double.
a: Правый операнд. Тип Vector3d.
Returns: Возвращает результат умножения входного масштабного множителя на входной 3D-вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.+(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Оператор реализует векторное сложение двух 3D-векторов.
Оператор создает 3D-вектор, который является векторной суммой двух заданных 3D-векторов.
a: Левый операнд.  Тип Vector3d.
b: Правый операнд. Тип Vector3d.
Returns: Возвращает 3D-вектор, который является векторной суммой 3D-векторов a и b. Тип Vector3d.

Teigha.Geometry.Vector3d.-(Teigha.Geometry.Vector3d)
Оператор возвращает вектор, противоположный по направлению входному вектору.
Оператор возвращает вектор, который противоположен по направлению входному вектору a и имеет координаты (-x, -y, -z).
a: Входной вектор. Тип Vector3d.
Returns: Возвращает вектор, который противоположен по направлению входному вектору a. Тип Vector3d.

Teigha.Geometry.Vector3d.-(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Оператор реализует операцию векторного вычитания.
Оператор реализует операцию векторного вычитания вектора b из вектора a.
a: Левый операнд.  Тип Vector3d.
b: Правый операнд. Тип Vector3d.
Returns: Возвращает 3D-вектор, который получен вычитанием вектора b из вектора a. Тип Vector3d.

Teigha.Geometry.Vector3d./(Teigha.Geometry.Vector3d,System.Double)
Оператор реализует деление указанного 3D-вектора на заданный масштабный множитель.
Оператор реализует деление указанного 3D-вектора a на заданный масштабный множитель factor.
a: Входной вектор. Тип Vector3d.
factor: Входной скалярный множитель. Тип double.
Returns: Возвращает вектор, который получен делением 3D-вектора a на заданный масштабный множитель factor.  Тип Vector3d.

Teigha.Geometry.Vector3d.==(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Оператор реализует сравнение на равенство двух 3D-векторов.
Оператор реализует сравнение на равенство двух заданных 3D-векторов.
a: Входной вектор. Тип Vector3d.
b: Входной вектор. Тип Vector3d.
Returns: Возвращает true, если вектора a и b равны друг другу. В противном случае возвращает false.

Teigha.Geometry.Vector3d.Coordinate
Свойство предоставляет доступ к координате данного вектора, заданной её индексом.
Свойство предоставляет доступ к координате данного вектора, заданной индексом index.
index: Индекс координаты; тип int. 0 – координата X, 1 – координата Y, 2 - координата Z.
Returns: Возвращает значение координаты. Тип double

Teigha.Geometry.Vector3d.LargestElement
Свойство возвращает индекс оси с наибольшим значением координаты у данного вектора.
Свойство возвращает индекс оси с наибольшим значением координаты у данного вектора.
Оси X, Y и Z представлены индексами 0, 1 и 2, соответственно.
Returns: Возвращает индекс оси 0, 1 или 2. Тип double.

Teigha.Geometry.Vector3d.Length
Свойство возвращает длину данного вектора.
Свойство возвращает евклидову длину данного вектора.
Returns: Возвращает длину вектора. Тип double.

Teigha.Geometry.Vector3d.LengthSqrd
Свойство возвращает квадрат длины данного вектора.
Свойство возвращает квадрат евклидовой длины данного вектора.
Returns: Возвращает квадрат евклидовой длины данного вектора. Тип double.

Teigha.Geometry.Vector3d.X
Свойство возвращает значение X-координаты данного вектора.
Свойство возвращает значение X-координаты данного вектора.
Returns: Возвращает значение координаты X данного вектора. Тип double.

Teigha.Geometry.Vector3d.Y
Свойство возвращает значение Y-координаты данного вектора.
Свойство возвращает значение Y-координаты данного вектора.
Returns: Возвращает значение координаты Y данного вектора. Тип double.

Teigha.Geometry.Vector3d.Z
Свойство возвращает значение Z-координаты данного вектора.
Свойство возвращает значение Z-координаты данного вектора.
Returns: Возвращает значение координаты Z данного вектора. Тип double.

Teigha.Geometry.Vector3d.XAxis
Свойство возвращает направление оси X.
Свойство возвращает направление оси X.
Returns: Возвращает направление оси X. Тип Vector3d.

Teigha.Geometry.Vector3d.YAxis
Свойство возвращает направление оси Y.
Свойство возвращает направление оси Y.
Returns: Возвращает направление оси Y. Тип Vector3d.

Teigha.Geometry.Vector3d.ZAxis
Свойство возвращает направление оси Z.
Свойство возвращает направление оси Z.
Returns: Возвращает направление оси Z. Тип Vector3d.