Teigha.Geometry.Line3d
Класс представляет бесконечные линии в трехмерном пространстве.
Класс представляет бесконечные линии в трехмерном пространстве.

Teigha.Geometry.Line3d.#ctor
Конструктор по умолчанию. Создает бесконечную линию, совпадающую с осью X.
Конструктор по умолчанию. Создает бесконечную линию, совпадающую с осью X.

Teigha.Geometry.Line3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор. Создает бесконечную линию, проходящую через две несовпадающие точки.
Конструктор. Создает бесконечную линию, проходящую через две несовпадающие точки point1 и point2.
point1: Первая опорная точка. Тип Point3d.
point2: Вторая опорная точка. Тип Point3d.

Teigha.Geometry.Line3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор. Создает бесконечную линию по точке и вектору.
Конструктор. Создает бесконечную линию, проходящую через точку point и имеющую направление вектора vector.
Указанный вектор обязан иметь ненулевую длину.
point: Входная опорная точка. Тип Point3d.
vector: Входной вектор, задающий ориентацию прямой в пространстве. Тип Vector3d.

Teigha.Geometry.Line3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод изменяет определение линии так, чтобы она проходила через две несовпадающие опорные точки.
Метод изменяет определение линии так, чтобы она проходила через две несовпадающие опорные точки point1 и point2.
point1: Первая опорная точка. Тип Point3d.
point2: Вторая опорная точка. Тип Point3d.

Teigha.Geometry.Line3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод изменяет определение линии так, чтобы она проходила через указанную точку в заданном направлении.
Метод изменяет определение линии так, чтобы она проходила через точку point в направлении вектора vector ненулевой длины.
point: Новая опорная точка. Тип Point3d.
vector: Новый вектор, задающий направление прямой. Тип Vector3d.

Teigha.Geometry.Line3d.Create(IntPtr,System.Boolean)
Метод создает новую бесконечную линию Line3d из исходного объекта, который передан через указатель.
Метод создает новую бесконечную линию Line3d из исходного объекта, который передан через указатель.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый объект Line3d.