HostMgd.EditorInput.SelectionRemovedEventArgs
Класс предоставляет данные для события SelectionRemoved,
возникающего при удалении объектов из текущего набора
выделенных в редакторе nanoCAD.
Класс используется для передачи информации о тех объектах,
которые были удалены из выборки — например, при использовании
режима Shift + щелчок, команды "Удалить из выбора" или
программного изменения набора.
Example
C#

HostMgd.EditorInput.SelectionRemovedEventArgs.Remove(System.Int32)
Метод удаляет объект из набора выбранных объектов
по указанному индексу.
Метод предназначен для программного удаления объекта
из коллекции выбранных элементов — например, из объекта
типа SelectionSet. Он использует порядковый индекс элемента
в наборе для определения, какой объект должен быть исключён
из выборки. После удаления все последующие объекты сдвигаются
на одну позицию влево, а общее количество элементов уменьшается
на единицу.
Важно: перед вызовом метода необходимо убедиться, что переданный индекс
находится в допустимом диапазоне (от 0 до Count - 1), иначе будет
выброшено исключение ArgumentOutOfRangeException.
index: Порядковый номер объекта в коллекции,
Пример: значение 0 — удалить первый объект,

HostMgd.EditorInput.SelectionRemovedEventArgs.RemoveSubentity(System.Int32,System.Int32)
Метод удаляет геометрический подобъект из набора выбора
по индексу объекта и индексу подобъекта.
Метод предназначен для удаления отдельного подобъекта — такого
как сегмент полилинии, ребро 3D-тела, грань или вершина — из
состава выбранного объекта в рамках текущей выборки. Он используется
в сценариях, где выборка включает не целые объекты, а их внутренние
компоненты, и требуется точное управление составом выделения.
После выполнения метода указанный подобъект исключается из выборки.
index: Порядковый номер объекта в наборе выбранных объектов (SelectionSet).
Пример: 0 — первый выбранный объект, 1 — второй и т.д.
subentityIndex: Порядковый номер подобъекта внутри указанного объекта.

HostMgd.EditorInput.SelectionRemovedEventArgs.Flags
Свойство возвращает битовые флаги, предоставляющие
детальную информацию о текущем режиме и контексте операции выбора объектов.
Свойство предоставляет доступ к перечислению SelectionFlags,
которое содержит набор флагов, описывающих состояние и параметры
текущей операции выбора в редакторе nanoCAD.
Оно доступно только для чтения и используется в объектах,
связанных с выборкой, таких как SelectionAddedEventArgs,
SelectionRemovedEventArgs или PromptSelectionResult.
Эти флаги позволяют определить:
* Происходит ли добавление или удаление объектов,
* Выполняется ли выбор всех объектов,
* Используется ли выбор подобъектов,
* Является ли выбор одиночным,
* Было ли действие инициировано ключевым словом),
* Выполняется ли выбор автоматически.
Returns: Возвращает значение типа SelectionFlags — побитовое перечисление,
объединяющее один или несколько флагов.
Флаги могут комбинироваться с помощью побитовых операций (например, if ((flags  SelectionFlags.SubSelection) != 0)).
Example
C#

HostMgd.EditorInput.SelectionRemovedEventArgs.RemovedObjects
Свойство возвращает набор объектов,
которые были удалены из текущего выделения.
Свойство предоставляет доступ к объекту типа SelectionSet,
содержащему коллекцию идентификаторов (ObjectId) объектов,
исключённых из выборки в ходе операции выделения — например,
при использовании режима Shift + щелчок или команды "Удалить из выбора".
Оно доступно только для чтения и используется в контексте событий,
связанных с изменением выборки, таких как SelectionRemoved.
Это свойство позволяет разработчику плагина точно определить,
какие именно объекты были удалены, и выполнить соответствующую реакцию —
например, обновить интерфейс, снять выделение в пользовательской панели
или скорректировать логику команды.
Returns: Возвращает объект типа SelectionSet, содержащий:
* Список ObjectId удалённых объектов.
* При необходимости — дополнительную информацию (точки выбора, матрицы преобразования и т.д.).
Если удалённых объектов нет, возвращается пустой SelectionSet (с Count = 0), а не null.
Example
C#

HostMgd.EditorInput.SelectionRemovedEventArgs.Selection
Свойство возвращает текущий набор объектов,
выбранных в редакторе на данный момент.
Свойство предоставляет доступ к объекту типа SelectionSet,
содержащему коллекцию идентификаторов (ObjectId) всех объектов,
находящихся в текущем выделении. Оно доступно только для чтения
и используется для получения актуальной выборки без необходимости
повторного запроса у пользователя.
Свойство часто применяется в обработчиках событий,
пользовательских панелях свойств или при запуске команд,
где входные данные берутся из текущего выделения.
Returns: Возвращает объект типа SelectionSet, который содержит:
* Список ObjectId выбранных объектов.
* Дополнительную информацию о выборе (например, точки выбора, матрицы трансформации — при наличии).
Если объекты не выбраны, возвращается пустой SelectionSet (с Count = 0), а не null.
Рекомендуется проверять количество элементов перед обработкой.
Example
C#