Teigha.Runtime.RXObject
RXObject — это базовый класс для тех классов, чьим объектам во время выполнения требуются идентификация их классов и анализ наследования.  Реализован для поддержки регистрации новых классов из приложений NRX во время выполнения.
RXObject — это базовый класс для тех классов, чьим объектам во время выполнения требуются идентификация их классов и анализ наследования.  Реализован для поддержки регистрации новых классов из приложений NRX во время выполнения.

Teigha.Runtime.RXObject.CompareTo(Object)
Метод реализует процедуру сравнения объектов данного класса и возвращает результат сравнения.
Метод реализует процедуру сравнения объектов данного класса и возвращает результат сравнения.
obj: Входной объект для сравнения. Тип Object.
Returns: Возвращает true в случае равенства сравниваемых объектов. В противном случае возвращает false.

Teigha.Runtime.RXObject.CopyFrom(Teigha.Runtime.RXObject)
Метод копирует в данный объект, если это возможно, содержимое указанного объекта.
Метод копирует в данный объект, если это возможно, содержимое указанного объекта.
source: Входной объект, который следует копировать. Тип RXObject.

Teigha.Runtime.RXObject.Create(IntPtr,System.Boolean)
Метод создает новый экземпляр класса, используя псевдоконструктор класса и данный экземпляр класса.
Метод создает новый экземпляр класса, используя псевдоконструктор класса и данный экземпляр класса.
Возвращает интеллектуальный указатель на вновь созданный экземпляр.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый экземпляр класса. Тип RXObject.

Teigha.Runtime.RXObject.GetClass(Type)
Метод реализует поиск объекта RXClass, который соответствует указанному типу.
Метод реализует поиск объекта RXClass, который соответствует входному типу type.
type: Входной тип искомого объекта. Тип Type.
Returns: Возвращает объект RXClass, который соответствует типу type.

Teigha.Runtime.RXObject.QueryX(Teigha.Runtime.RXClass)
Метод выполняет поиск объекта расширения протокола, связанного с данным объектом.
Метод выполняет поиск объекта расширения протокола, связанного с данным объектом.
Метод начинает поиск с проверки объекта protocolClass, связанного с данным объектом, и если объект расширения протокола не найден, поиск продолжается в базовом классе объекта этого класса и так далее вверх по дереву наследования класса.
Эта процедура предоставляет схему наследования расширения протокола.
Член класса данного объекта может быть найден с помощью метода isA() класса.
Если поиск объекта расширения протокола успехом не увенчался, метод возвращает NULL.
protocolClass: Необработанный указатель на класс, описывающий экземпляр, в который должен быть преобразован объект.  Тип RXClass.
Returns: Возвращает указатель на преобразованный объект. Тип IntPtr.
Возвращает NULL, если преобразование оказалось невозможным.

Teigha.Runtime.RXObject.X(Teigha.Runtime.RXClass)
Метод позволяет проверить, принадлежит ли данный объект указанному классу.
Метод позволяет проверить, принадлежит ли данный объект указанному классу.
Если данный объект допускает преобразование в указанный класс, возвращает указатель на этот объект.
Если преобразование в указанный класс невозможно, метод генерирует исключение eNotThatKindOfClass.
Метод генерирует исключение eInvalidInput, когда аргумент protocolClass имеет значение Null.
Этот метод использует метод QueryX().
Returns: Возвращает указатель на объект расширения протокола. Тип IntPtr.