Teigha.DatabaseServices.GraphNodeCollection
Этот класс представляет коллекцию узлов графа.
Этот класс представляет коллекцию узлов графа.

Teigha.DatabaseServices.GraphNodeCollection.#ctor
Конструктор по умолчанию класса GraphNodeCollection.
Конструктор по умолчанию класса GraphNodeCollection.

Teigha.DatabaseServices.GraphNodeCollection.Add(Teigha.DatabaseServices.GraphNode)
Метод позволяет добавить в коллекцию новый элемент.
Метод позволяет добавить в коллекцию новый элемент.
value: Добавляемый в коллекцию узел графа. Тип GraphNode.
Returns: Возвращает индекс нового элемента коллекции. Тип int.

Teigha.DatabaseServices.GraphNodeCollection.Contains(Teigha.DatabaseServices.GraphNode)
Метод позволяет проверить, содержит ли коллекция элемент, соответствующий указанному объекту.
Метод позволяет проверить, содержит ли коллекция элемент, соответствующий указанному объекту GraphNode.
value: Искомый объект. Тип GraphNode.
Returns: Возвращает true, если объект value содержится в коллекции.
В противном случае возвращает false.

Teigha.DatabaseServices.GraphNodeCollection.CopyTo(array,int  )
Метод предназначен для копирования объектов из массива в данную коллекцию, начиная с указанного индекса.
Метод предназначен для копирования объектов из массива в данную коллекцию, начиная с указанного индекса.
arr: Входной массив узлов. Тип GraphNode[].
index: Индекс элемента массива, с которого начинается копирование элементов массива в коллекцию. Тип int.

Teigha.DatabaseServices.GraphNodeCollection.IndexOf(Teigha.DatabaseServices.GraphNode)
Метод позволяет получить индекс элемента коллекции, который соответствует указанному объекту GraphNode.
Метод позволяет получить индекс элемента коллекции, который соответствует указанному объекту GraphNode.
value: Объект типа GraphNode, для которого предполагается найти индекс.
Returns: Возвращает индекс элемента коллекции, если объект value найден. В противном случае возвращает -1.
Тип int. Индексирование элементов коллекции начинается с нуля.

Teigha.DatabaseServices.GraphNodeCollection.Insert(System.Int32,Teigha.DatabaseServices.GraphNode)
Метод позволяет вставить указанный объект GraphNode в эту коллекцию по заданному индексу.
Метод позволяет вставить указанный объект GraphNode в эту коллекцию по заданному индексу.
index: Индекс, по которому вставляется объект value. Тип int.
value: Вставляемый в коллекцию объект. Тип GraphNode.

Teigha.DatabaseServices.GraphNodeCollection.Remove(Teigha.DatabaseServices.GraphNode)
Метод удаляет из коллекции элемент, соответствующий входному объекту GraphNode.
Метод удаляет из коллекции элемент, соответствующий входному объекту GraphNode.
value: Удаляемый из коллекции элемент. Тип GraphNode.

Teigha.DatabaseServices.GraphNodeCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент по указанному индексу.
Метод удаляет из коллекции элемент по указанному индексу.
Если предоставленный индекс недействителен, метод выбрасывает исключение ArgumentOutOfRangeException.
index: Индекс удаляемого элемента коллекции. Тип int.

Teigha.DatabaseServices.GraphNodeCollection.Item
Свойство предоставляет доступ к элементу коллекции по его индексу.
Свойство предоставляет доступ к элементу коллекции по его индексу.
В случае недействительного индекса выбрасывается исключение ArgumentOutOfRangeException.
Returns: Возвращает элемент коллекции. Тип GraphNode.

Teigha.DatabaseServices.GraphNodeCollection.Count
Свойство возвращает текущее количество элементов в коллекции.
Свойство возвращает текущее количество элементов в коллекции.
Returns: Возвращает количество элементов в коллекции. Тип int.