Teigha.GraphicsInterface.FaceStyle.Clone
Метод клонирует текущий стиль отображения граней.
Метод предназначен для клонирования текущего стиля отображения граней.
Returns: Возвращает клонированный объект.  Тип FaceStyle.