Teigha.DatabaseServices.HatchObjectType
Перечисление HatchObjectType определяет тип объекта, используемого для штриховки.
Перечисление HatchObjectType определяет тип объекта, используемого для штриховки.