HostMgd.EditorInput.UserInputControls.GovernedByOrthoMode
Значение: 1 (0x1).
Маска устанавливает бит "Учитывать системную переменную ORTHOMODE" в пакете запроса пользовательского ввода.
По умолчанию этот бит не установлен.
Заметим, что метод JigPrompts.AcquirePoint() всегда учитывает текущее значение системной переменной ORTHOMODE, независимо от состояния этого бита.