Teigha.DatabaseServices.LayerViewportProperties
Этот класс определяет свойства видовых экранов слоев, которые используются в LayerTableRecord.
Этот класс определяет свойства видовых экранов слоев, которые используются в LayerTableRecord.

Teigha.DatabaseServices.LayerViewportProperties.Color
Свойство представляет цвет слоя.
Свойство представляет цвет слоя.
Returns: Возвращает цвет слоя. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.LayerViewportProperties.IsColorOverridden
Свойство позволяет проверить, переопределён ли цвет для связанного слоя и видового экрана.
Свойство позволяет проверить, переопределён ли цвет для связанного слоя и видового экрана.
Returns: Возвращает true, если цвет переопределен. В противном случае возвращает false.

Teigha.DatabaseServices.LayerViewportProperties.IsLinetypeOverridden
Свойство позволяет проверить, переопределен ли тип линий для связанного слоя и видового экрана.
Свойство позволяет проверить, переопределен ли тип линий для связанного слоя и видового экрана.
Returns: Возвращает true, если тип линий переопределен. В противном случае возвращает false.

Teigha.DatabaseServices.LayerViewportProperties.IsLineWeightOverridden
Свойство позволяет проверить, переопределена ли толщина (вес) линий для связанного слоя и видового экрана.
Свойство позволяет проверить, переопределена ли толщина (вес) линий для связанного слоя и видового экрана.
Returns: Возвращает true, если толщина (вес) линий переопределена.
В противном случае возвращает false.

Teigha.DatabaseServices.LayerViewportProperties.IsPlotStyleOverridden
Свойство позволяет проверить, переопределен ли стиль печати для связанного слоя и видового экрана.
Свойство позволяет проверить, переопределен ли стиль печати для связанного слоя и видового экрана.
Returns: Возвращает true, если стиль печати переопределен.
В противном случае возвращает false.

Teigha.DatabaseServices.LayerViewportProperties.LinetypeObjectId
Свойство представляет идентификатор объекта слоя в связанном видовом экране.
Свойство представляет идентификатор объекта слоя в связанном видовом экране.
Returns: Возвращает идентификатор связанного видового экрана.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LayerViewportProperties.LineWeight
Свойство представляет значение толщины линий на слое в связанном видовом экране.
Свойство представляет значение толщины линий на слое в связанном видовом экране.
Returns: Возвращает толщину линий. Перечисление DatabaseServices.LineWeight.

Teigha.DatabaseServices.LayerViewportProperties.PlotStyleName
Свойство представляет имя стиля печати.
Свойство представляет имя стиля печати.
Returns: Возвращает имя стиля печати. Тип String.

Teigha.DatabaseServices.LayerViewportProperties.PlotStyleNameId
Свойство представляет идентификатор имени стиля печати.
Свойство представляет идентификатор имени стиля печати.
Returns: Возвращает идентификатор имени стиля печати.
Тип DatabaseServices.ObjectId.