HostMgd.PlottingServices.BeginPageEventArgs
Класс BeginPageEventArgs инкапсулирует необходимую для события BeginPage информацию, относящуюся к выводу на печать.
Класс BeginPageEventArgs служит контейнером для аргументов события BeginPage класса PlotReactorManager.
Аргументы включают объекты PlotInfo и PlotPageInfo, а также флаг последней страницы печатаемого документа.
Экземпляры класса используются делегатом HostMgd.PlottingServices.BeginPageEventHandler.

HostMgd.PlottingServices.BeginPageEventArgs.#ctor(HostMgd.PlottingServices.PlotPageInfo,HostMgd.PlottingServices.PlotInfo,System.Boolean)
Конструктор класса BeginPageEventArgs.
Создает экземпляр класса с указанными параметрами.
Конструктор класса BeginPageEventArgs.
Создает экземпляр класса с указанными параметрами.
plotPageInfo: Входные параметры печатаемой страницы. Тип HostMgd.PlottingServices.PlotPageInfo.
plotInfo: Входные параметры печати документа.    Тип HostMgd.PlottingServices.PlotInfo.
lastPage: Флаг последней страницы документа. Тип bool. Значение true соответствует последней странице.

HostMgd.PlottingServices.BeginPageEventArgs.LastPage
Свойство LastPage позволяет проверить состояние флага последней страницы.
Свойство LastPage позволяет проверить состояние флага последней страницы.
Returns: Возвращает true, если аргументы события связаны с печатью последней страницы документа.
В противном случае возвращает false.

HostMgd.PlottingServices.BeginPageEventArgs.PlotInfo
Свойство PlotInfo представляет данные конфигурации печати документа.
Свойство PlotInfo представляет настройки печати документа (конфигурация устройства печати, слои и др.).
Returns: Возвращает настройки печати документа.
Тип HostMgd.PlottingServices.PlotInfo.

HostMgd.PlottingServices.BeginPageEventArgs.PlotPageInfo
Свойство PlotPageInfo представляет характеристики печатаемой страницы.
Свойство PlotPageInfo представляет ряд характеристик печатаемой страницы, которые инкапсулируются объектом
HostMgd.PlottingServices.PlotPageInfo (например, количество на странице различных объектов).
Returns: Возвращает характеристики печатаемой страницы.
Тип HostMgd.PlottingServices.PlotPageInfo.