Teigha.DatabaseServices.PolyFaceMesh.GetEnumerator
Этот метод возвращает перечислитель для данной коллекции.
Метод возвращает перечислитель для данной коллекции.
Returns: Возвращает перечислитель System.Collections.IEnumerator.