HostMgd.GraphicsSystem
Пространство имен HostMgd.GraphicsSystem включает классы, перечисления и делегаты, предназначенные для работы с объектами графической системы nanoCAD.
Пространство имен HostMgd.GraphicsSystem включает классы, перечисления и делегаты, предназначенные для работы с объектами графической системы nanoCAD.