Teigha.DatabaseServices.MLeader.HasContent
Метод позволяет проверить, определено ли содержимое в данном объекте MLeader.
Метод позволяет проверить, определено ли содержимое в данном объекте MLeader.
Returns: Возвращает true, если содержимое определено.
В противном случае возвращает false.