Teigha.BoundaryRepresentation.BrepEntity.GetVolume
Метод позволяет получить объем данного топологического объекта.
Используемая точность вычислений определяется глобальными настройками.
Метод позволяет получить объем данного топологического объекта с применением максимального масштабного коэффициента из вложенных преобразований.
Используемая точность вычислений определяется глобальными настройками.
Свойство объема применимо к большинству объектов, представляющих объемные фигуры.
Returns: Возвращает объем данного объекта.
Тип double.