Teigha.Geometry.Entity3d.Clone
Метод предназначен для создания полной копии данного объекта.
Метод предназначен для создания полной копии данного объекта.
Returns: Возвращает новый объект, являющийся полной копией данного объекта.
Тип Object.