Teigha.Geometry.CurveBoundary
Класс CurveBoundary представляет геометрию криволинейных границ на ограниченной поверхности.
Класс CurveBoundary представляет геометрию криволинейных границ (граничные циклы граней) на ограниченной поверхности.
Каждый граничный цикл описывается четырьмя массивами:
* массив 3D-кривых и/или указателей 3D-позиций;
* массив указателей 2D-кривых в пространстве параметров;
* логический массив, описывающий логическую ориентацию для каждой 3D-кривой;
* логический массив, описывающий логическую ориентацию для каждой 2D-кривой в пространстве параметров.
В совокупности эти четыре массива представляют массив ориентированных пространственных 3D-кривых (и/или 3D-позиций) и массив ориентированных кривых в пространстве параметров.  Между элементами этих массивов существует взаимно однозначное соответствие, при этом некоторые элементы того или иного массива могут быть нулевыми или нерелевантными.
Например, 4-кортеж (curve3d, NULL, False, True) представляет допустимый экземпляр этого класса.
Первый элемент кортежа определяет пространственную 3D-кривую.
Нулевое значение второго элемента кортежа свидетельствует о том, что связанной 2D-кривой в пространстве параметров не существует.
Третий элемент кортежа показывает, что логическое направление пространственной 3D-кривой противоположно параметрическому направлению кривой.
Поскольку кривой в пространстве параметров нет, последний элемент кортежа нерелевантен (в случае существования кривой в пространстве параметров четвертый элемент кортежа представлял бы логическое направление этой кривой).
Случаи вырождения циклов представляются следующим образом.
* Весь цикл выродился в одну точку в пространстве модели, представленную кортежем (numElements = 1, position3d, curve2d).
Кривая curve2d может быть нулевой. Ребро и 2D-кривая в пространстве параметров теряют смысл. Подобные состояния цикла выявляет свойство CurveBoundary.isDegenerate.
* В цикле имеется одно или несколько вырожденных ребер, представленных позициями соответствующих точек position3d.
В общем случае описание геометрии граничной кривой в пространстве модели может включать указатели curve3d и/или position3d.
Соответственно, пользователю эта геометрия предоставляется в виде указателей на объекты Entity3d.
Вырожденность составляющих проверяется по типу геометрии подобъекта в пространстве модели.
Данный класс поддерживает владение своей геометрией.
При уничтожении экземпляра класса, являющегося владельцем своей геометрии, эта геометрия будет удалена.

Teigha.Geometry.CurveBoundary.#ctor
Конструктор по умолчанию класса CurveBoundary.
Конструктор по умолчанию класса CurveBoundary.

Teigha.Geometry.CurveBoundary.#ctor(System.Int32,array,array,System.Boolean,System.Boolean)
Конструктор класса CurveBoundary. Создает экземпляр класса с указанными параметрами.
Конструктор класса CurveBoundary. Создает экземпляр класса с указанными параметрами.
numberOfCurves: Количество кривых в данной криволинейной границе. Тип int.
curve3d: Массив 3D-кривых каждого элемента в криволинейной границе. Тип Curve3d[].
curve2d: Массив 2D-кривых каждого элемента в криволинейной границе. Тип Curve2d[].
orientation3d: Флаг ориентации для каждого элемента 3D-кривой (обычная или обратная). Имеет смысл только если аргумент curve3d не равен NULL.  Тип bool.
orientation2d: Флаг ориентации для каждого элемента 2D-кривой (обычная или обратная). Имеет смысл только если аргумент curve2d не равен NULL.  Тип bool.

Teigha.Geometry.CurveBoundary.Set(System.Int32,array,array,System.Boolean,System.Boolean)
Метод позволяет переопределить все параметры данной криволинейной границы.
Метод позволяет переопределить все параметры данной криволинейной границы.
Notes
Если текущий экземпляр не пуст и владеет данными своего определения, то при выполнении метода будет удалена вся геометрия существующего определения.
Если какой-либо элемент массива curve3ds имеет значение NULL, то соответствующий элемент orientation3d неприменим.
Если какой-либо элемент массива curve2ds имеет значение NULL, то соответствующий элемент orientation2d неприменим.
numElements: Количество элементов в данной граничной кривой. Тип int.
curve3ds: Массив 3D-кривых каждого элемента в граничной кривой. Тип Curve3d[].
curve2ds: Массив 2D-кривых каждого элемента в граничной кривой. Тип Curve2d[].
orientation3d: Флаг ориентации для каждого элемента 3D-кривой (обычная или обратная). Имеет смысл только если аргумент curve3ds не равен NULL.  Тип bool.
orientation2d: Флаг ориентации для каждого элемента 2D-кривой (обычная или обратная). Имеет смысл только если аргумент curve2ds не равен NULL.  Тип bool.

Teigha.Geometry.CurveBoundary.Contour
Свойство Contour представляет данные определения этой криволинейной границы.
Свойство Contour представляет данные определения этой криволинейной границы.
Returns: Возвращает данные определения криволинейной границы.
Тип CurveBoundaryData.

Teigha.Geometry.CurveBoundary.DegenerateCurve
Свойство DegenerateCurve представляет 2D-кривую в параметрическом пространстве для вырожденной границы.
Свойство DegenerateCurve представляет 2D-кривую в параметрическом пространстве для вырожденной границы.
Returns: Возвращает двумерную кривую в параметрическом пространстве, которая соответствует вырожденной границе.
Тип Curve2d.

Teigha.Geometry.CurveBoundary.DegeneratePosition
Свойство DegeneratePosition представляет позицию в трехмерном пространстве для вырожденной границы.
Свойство DegeneratePosition представляет позицию в трехмерном пространстве для вырожденной границы.
Returns: Возвращает позицию вырожденной границы в трехмерном пространстве.
Тип Position3d.

Teigha.Geometry.CurveBoundary.IsDegenerate
Свойство IsDegenerate позволяет проверить тот факт, что граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства.
Свойство IsDegenerate позволяет проверить тот факт, что граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства.
Returns: Возвращает true, если граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства.
В противном случае возвращает false.

Teigha.Geometry.CurveBoundary.IsOwnerOfCurves
Свойство IsOwnerOfCurves позволяет проверить, является ли данный объект CurveBoundary владельцем данных представления границы.
Свойство IsOwnerOfCurves позволяет проверить, является ли данный объект CurveBoundary владельцем данных представления границы.
Returns: Возвращает true, если данные представления границы принадлежат данному объекту.
В противном случае возвращает false.

Teigha.Geometry.CurveBoundary.NumElements
Свойство NumElements представляет количество элементов в данной границе.
Свойство NumElements представляет количество элементов в данной границе.
Returns: Возвращает количество элементов в данной границе. Тип int.