Teigha.Geometry.Matrix3d.ToArray
Метод формирует одномерный массив, содержащий все элементы данной матрицы.
Метод формирует одномерный массив, содержащий все 16 элементов данной матрицы.
Запись элементов двумерной матрицы в одномерный массив выполняется построчно (4 элемента первой строки, 4 элемента второй строки и т.д.).
Returns: Возвращает представление данной матрицы в виде одномерного массива. Тип double[].