Teigha.DatabaseServices.DBObject.SetFromStyle
Метод устанавливает свойство аннотации объекта в соответствии
с соответствующим ему стилем, таким как стили текстовых объектов.
Метод устанавливает аннотационное свойство объекта из его
(необязательного) связанного стиля.
Returns: Возвращает тип данных bool. Возвращает true, если
аннотационное свойство объекта изменено