Teigha.DatabaseServices.Ray
Класс Ray представляет объекты лучей в базе данных.
Класс Ray представляет объекты лучей в базе данных.
Луч – это полубесконечная линия, используемая в чертеже в качестве вспомогательной ссылочной геометрии.
Геометрически луч определяется базовой точкой (началом луча) и направлением.

Teigha.DatabaseServices.Ray.#ctor
Конструктор по умолчанию класса Ray.
Конструктор по умолчанию класса Ray.

Teigha.DatabaseServices.Ray.BasePoint
Свойство BasePoint представляет базовую точку, от которой исходит луч (начало луча).
Свойство BasePoint представляет базовую точку, от которой исходит луч (начало луча).
Returns: Возвращает трехмерную точку. Тип Point3d.

Teigha.DatabaseServices.Ray.SecondPoint
Свойство SecondPoint представляет вторую точку, которая в совокупности с базовой точкой определяет направление данного луча.
Свойство SecondPoint представляет вторую точку, которая в совокупности с базовой точкой определяет направление данного луча.
Returns: Возвращает трехмерную точку. Тип Point3d.

Teigha.DatabaseServices.Ray.UnitDir
Свойство UnitDir представляет 3D-вектор, определяющий направление данного луча.
Свойство UnitDir представляет 3D-вектор, определяющий направление данного луча.
Returns: Возвращает 3D-вектор для направления луча. Тип Vector3d.