Teigha.DatabaseServices.OpenCloseTransaction.Commit
Метод фиксирует изменения в объектах, открытых в рамках транзакции OpenCloseTransaction, а затем закрывает эти объекты.
Метод фиксирует в базе данных изменения в объектах, открытых в рамках транзакции OpenCloseTransaction, а затем закрывает эти объекты.