Teigha.DatabaseServices.DwgFiler.ReadSoftOwnershipId
Метод предназначен для получения идентификатора мягкой ссылки владения объектом (SoftOwnershipId) из текущего элемента данного объекта Filer.
Метод предназначен для получения идентификатора мягкой ссылки владения объектом (SoftOwnershipId) из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатор мягкой ссылки владения объектом. Тип ObjectId.