Teigha.DatabaseServices.ObjectContextCollectionEnumerator.MoveNext
Метод обеспечивает переход перечислителя к следующему объекту ObjectContext в данной коллекции.
Метод обеспечивает переход перечислителя к следующему объекту ObjectContext в данной коллекции.
Returns: Возвращает true, если переход к следующему объекту ObjectContext выполнен успешно.
Если достигнут конец коллекции, возвращает false.