HostMgd.ApplicationServices.InplaceTextEditor.FindAndReplaceDialog
Метод вызывает диалог поиска и замены текста.
В текущей версии не реализован.
Метод вызывает диалог поиска и замены текста.
В текущей версии не реализован.