Teigha.DatabaseServices.TextStyleTable
Класс представляет таблицу текстовых стилей в базе данных чертежа.
Этот класс является таблицей символов для
TextStyleTableRecords, который представляет текстовые стили.