Teigha.GraphicsInterface.DiagnosticMode.Photon
Значение: 2.
Режим отрисовки псевдоцветного изображения, которое иллюстрирует плотность фотонов или освещённость фотонами всех поверхностей сцены.
Конкретный режим задается значением из перечисления DiagnosticPhotonMode.
Более высокая плотность или освещённость отображается красным цветом, а более низкие значения — синим.