HostMgd.ApplicationServices.LongTransactionManager.CheckingIn
Событие CheckingIn возникает перед завершением (возвратом) длительной транзакции (операция CheckIn).
В текущей версии не реализовано.
Событие CheckingIn возникает перед завершением (возвратом) длительной транзакции (операция CheckIn).
Может использоваться для проверки состояния объектов перед их сохранением в основной базе данных.
В текущей версии не реализовано.