Teigha.DatabaseServices.IndexCreation
Перечисление IndexCreation определяет константы для настройки переменной заголовка INDEXCTL.
Перечисление IndexCreation представляет константы для настройки переменной заголовка INDEXCTL.
Переменная INDEXCTL определяет варианты индексирования в базе данных (слоевое или пространственное индексирование).
Константы могут комбинироваться с использованием побитового OR.