Teigha.DatabaseServices.SweepOptionsAlignOption.AlignSweepEntityToPath
Значение: 1. Вытягиваемый объект в каждой точке траектории ориентируется перпендикулярно направлению касательной к траектории в этой точке.