Teigha.Geometry.KnotParameterizationEnum
Данное перечисление определяет метод узловой параметризации сплайна, который строится по определяющим точкам.
Данное перечисление определяет метод узловой параметризации сплайна, который строится по определяющим точкам.
Выбор метода параметризации определяет способ создания узлов.