HostMgd.ApplicationServices.DocumentLockModeChangedEventArgs
Класс, обеспечивающий данными событие DocumentLockModeChanged
класса DocumentCollection.

HostMgd.ApplicationServices.DocumentLockModeChangedEventArgs.CurrentMode
Возвращает текущий режим блокировки документа.

HostMgd.ApplicationServices.DocumentLockModeChangedEventArgs.Document
Соответствует функции HostApDocManager::document() nanoCAD API.
Ссылка на заблокированный документ, принадлежащий входной
базе данных.

HostMgd.ApplicationServices.DocumentLockModeChangedEventArgs.GlobalCommandName
Возвращает имя команды, которая требует произведения
изменений.

HostMgd.ApplicationServices.DocumentLockModeChangedEventArgs.MyCurrentMode
Возвращает режим блокировки документа, который был установлен
текущим слоем.

HostMgd.ApplicationServices.DocumentLockModeChangedEventArgs.MyPreviousMode
Возвращает предыдущую блокировку документа, выполненую данным
слоем.