Teigha.GraphicsSystem.LayoutHelperDevice
Класс LayoutHelperDevice представляет вспомогательное устройство для отрисовки листа.
Класс LayoutHelperDevice представляет вспомогательное устройство для отрисовки листа.

Teigha.GraphicsSystem.LayoutHelperDevice.ActivateViewport(Teigha.DatabaseServices.ObjectId)
Метод позволяет сделать активным видовой экран с указанным ObjectId.
Метод делает активным видовой экран с указанным идентификатором объекта ObjectId.
id: Постоянный идентификатор объекта видового экрана, который нужно сделать активным. Тип ObjectId.
Returns: Возвращает true, если активация видового экрана завершилась успешно.
В противном случае возвращает false.

Teigha.GraphicsSystem.LayoutHelperDevice.ActivateViewport(Teigha.Geometry.Point2d)
Метод позволяет сделать активным видовой экран, указанный точкой в координатах устройства.
Метод делает активным видовой экран, указанный точкой в координатах устройства.
screenPt: Входная точка в координатах устройства. Тип Point2d.
Returns: Возвращает true, если активация видового экрана завершилась успешно.
В противном случае возвращает false.

Teigha.GraphicsSystem.LayoutHelperDevice.MakeViewActive(Teigha.GraphicsSystem.View)
Метод делает активным указанный вид на листе, который связан с данным устройством.
Метод делает активным указанный объект View на листе, связанном с данным устройством.
pView: Вид, который нужно сделать активным. Тип View.

Teigha.GraphicsSystem.LayoutHelperDevice.SetupActiveLayoutViews(Teigha.GraphicsSystem.Device,GraphicsInterface.ContextForDbDatabase)
Метод задает виды на указанном устройстве в соответствии с данными активного листа в базе данных.
Метод позволяет задать виды на указанном устройстве в соответствии с данными активного листа в базе данных.
pDevice: Входное устройство. Тип Device.
pGiCtx: Входной объект контекста с данными активного листа. Тип GraphicsInterface.ContextForDbDatabase.
Returns: Возвращает объект вспомогательного устройства отрисовки листа.
Тип LayoutHelperDevice.

Teigha.GraphicsSystem.LayoutHelperDevice.SetupLayoutViews(Teigha.DatabaseServices.ObjectId,Teigha.GraphicsSystem.Device,GraphicsInterface.ContextForDbDatabase)
Метод определяет виды на указанном устройстве в соответствии с данными указанного листа в базе данных.
Метод позволяет задать виды на указанном устройстве в соответствии с данными указанного листа в базе данных.
layoutId: Постоянный идентификатор объекта листа. Тип ObjectId.
pDevice: Входное устройство. Тип Device.
pGiCtx: Входной объект контекста с данными активного листа. Тип GraphicsInterface.ContextForDbDatabase.
Returns: Возвращает объект вспомогательного устройства отрисовки листа.
Тип LayoutHelperDevice.

Teigha.GraphicsSystem.LayoutHelperDevice.ActiveView
Свойство ActiveView возвращает активный вид на листе, который связан с данным объектом.
Свойство ActiveView возвращает активный объект View на листе, который связан с данным объектом.
Returns: Возвращает активный вид. Тип View.

Teigha.GraphicsSystem.LayoutHelperDevice.LayoutId
Свойство LayoutId возвращает постоянный ObjectId связанного с данным объектом листа.
Свойство LayoutId возвращает постоянный ObjectId листа, связанного с данным объектом.
Returns: Возвращает постоянный идентификатор объекта листа.
Тип ObjectId.

Teigha.GraphicsSystem.LayoutHelperDevice.Model
Свойство Model возвращает модель, связанную с данным объектом.
Свойство Model возвращает модель, связанную с данным объектом.
Returns: Возвращает связанную модель.
Тип GraphicsSystem.Model.

Teigha.GraphicsSystem.LayoutHelperDevice.UnderlyingDevice
Свойство UnderlyingDevice возвращает объект базового устройства, связанного с данным объектом.
Свойство UnderlyingDevice возвращает объект базового устройства Device, связанного с данным объектом.
Returns: Возвращает объект базового устройства. Тип Device.