Teigha.DatabaseServices.AbstractViewPE
Класс AbstractViewPE определяет интерфейс классов расширения протокола
для объектов View, ViewTableRecord, Viewport и ViewportTableRecord.
Класс AbstractViewPE определяет интерфейс классов расширения протокола
для объектов View, ViewTableRecord, Viewport и ViewportTableRecord.

Teigha.DatabaseServices.AbstractViewPE.#ctor(Teigha.Runtime.RXObject)
Конструктор класса AbstractViewPE.
Создает экземпляр класса на основе указанного видового экрана.
Конструктор класса AbstractViewPE.
Создает экземпляр класса на основе указанного видового экрана.
pViewport: Исходный видовой экран для создания расширения протокола. Тип RXObject.

Teigha.DatabaseServices.AbstractViewPE.GetPlotExtents(Teigha.Geometry.BoundBlock3d)
Метод предоставляет границы печати в системе координат камеры связанного видового экрана.
Метод предоставляет границы печати в системе координат камеры связанного видового экрана.
Компоненты границ обрезаются до диапазона [-10e100..10e100].
extents: Выходные границы печати. Тип BoundBlock3d.
Returns: Возвращает true в случае успешного завершения метода.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.GetViewExtents(Teigha.Geometry.BoundBlock3d)
Метод предоставляет границы в системе координат глаза связанного видового экрана.
Метод предоставляет границы в системе координат глаза связанного видового экрана.
extents: Выходные границы. Тип BoundBlock3d.
Returns: Возвращает true в случае успешного завершения метода.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.SetUcsFromView(Teigha.Runtime.RXObject)
Метод определяет UCS для соответствующего видового экрана.
Метод определяет пользовательскую систему координат (ПСК, UCS) для связанного видового экрана.
pSourceView: Идентификатор объекта ПСК. Тип RXObject.

Teigha.DatabaseServices.AbstractViewPE.SetView(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Boolean,Teigha.Geometry.Vector2d)
Метод переопределяет параметры связанного видового экрана согласно переданным аргументам.
Метод переопределяет параметры связанного видового экрана согласно переданным аргументам.
target: Точка цели камеры вида в мировой системе координат (WCS). Тип Point3d.
direction: Направление взгляда в мировой системе координат (WCS). Тип Vector3d.
upVector: Направление вверх камеры вида в мировой системе координат (WCS). Тип Vector3d.
fieldWidth: Ширина поля камеры вида в системе координат дисплея (DCS). Тип double.
fieldHeight: Высота поля камеры вида в системе координат дисплея (DCS). Тип double.
isPerspective: Флаг, указывающий, используется ли режим перспективного проецирования. Тип bool. Если false, то используется параллельное проецирование.
viewOffset: Вектор смещения вида.  Тип Vector2d.

Teigha.DatabaseServices.AbstractViewPE.SetView(Teigha.Runtime.RXObject)
Метод переопределяет параметры связанного видового экрана, используя параметры указанного вида.
Метод переопределяет параметры связанного видового экрана, используя параметры указанного вида.
pSourceView: Входной вид, который служит источником значений параметров. Тип RXObject.

Teigha.DatabaseServices.AbstractViewPE.SetViewport(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод переопределяет координаты левого нижнего и правого верхнего углов связанного видового экрана.
Метод переопределяет координаты левого нижнего и правого верхнего углов связанного видового экрана.
Notes
* Точка (0.0, 0.0) соответствует левому нижнему углу графической области.
* Точка (1.0, 1.0) соответствует правому верхнему углу графической области.
lowerLeft: Координаты левого  нижнего угла.  Тип Point2d.
upperRight: Координаты правого верхнего угла. Тип Point2d.

Teigha.DatabaseServices.AbstractViewPE.ZoomExtents(Teigha.Geometry.BoundBlock3d)
Метод зуммирует связанный видовой экран так, чтобы привести его к указанным границам в системе координат глаза.
Метод зуммирует связанный видовой экран так, чтобы привести его к указанным границам в системе координат глаза.
pExtents: Входные границы для видового экрана. Тип BoundBlock3d.
Returns: Возвращает true в случае успешного завершения метода.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.ZoomExtents(Teigha.Geometry.BoundBlock3d,System.Double)
Метод зуммирует связанный видовой экран так, чтобы привести его к указанным границам в системе координат глаза с учетом заданного множителя.
Метод зуммирует связанный видовой экран так, чтобы привести его к указанным границам в системе координат глаза с учетом заданного множителя.
pExtents: Входные границы для видового экрана. Тип BoundBlock3d.
extentsCoef: Опциональный множитель для границ.   Тип double.
Returns: Возвращает true в случае успешного завершения метода.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.BackClipDistance
Свойство BackClipDistance представляет положение задней плоскости отсечения.
Свойство BackClipDistance представляет положение задней плоскости отсечения.
Returns: Возвращает положение задней плоскости отсечения.
Тип double.

Teigha.DatabaseServices.AbstractViewPE.Direction
Свойство Direction представляет направление камеры для связанного видового экрана.
Свойство Direction представляет направление камеры для связанного видового экрана.
Returns: Возвращает направление видового экрана.
Тип Vector3d.

Teigha.DatabaseServices.AbstractViewPE.Elevation
Свойство Elevation представляет возвышение плоскости ПСК (UCS) для связанного видового экрана.
Свойство Elevation представляет возвышение плоскости ПСК (UCS) для связанного видового экрана.
Returns: Возвращает возвышение для видового экрана.
Тип double.

Teigha.DatabaseServices.AbstractViewPE.EyeToWorld
Свойство EyeToWorld представляет геометрическое преобразование из системы координат камеры в мировую систему координат.
Свойство EyeToWorld представляет геометрическое преобразование из системы координат камеры в мировую систему координат (WCS).
Returns: Возвращает матрицу трехмерного геометрического преобразования.
Тип Matrix3d.

Teigha.DatabaseServices.AbstractViewPE.FieldHeight
Свойство FieldHeight представляет высоту поля камеры вида.
Свойство FieldHeight представляет высоту поля камеры вида.
Определяется в системе координат дисплея (DCS).
Returns: Возвращает высоту поля камеры вида в системе координат дисплея (DCS).
Тип double.

Teigha.DatabaseServices.AbstractViewPE.FieldWidth
Свойство FieldWidth представляет ширину поля камеры вида.
Свойство FieldWidth представляет ширину поля камеры вида.
Определяется в системе координат дисплея (DCS).
Returns: Возвращает ширину поля камеры вида в системе координат дисплея (DCS).
Тип double.

Teigha.DatabaseServices.AbstractViewPE.FrontClipDistance
Свойство FrontClipDistance представляет положение передней плоскости отсечения вида.
Свойство FrontClipDistance представляет положение передней плоскости отсечения вида.
Returns: Возвращает положение передней плоскости отсечения вида. Тип double.

Teigha.DatabaseServices.AbstractViewPE.FrozenLayers
Свойство FrozenLayers предоставляет доступ к коллекции замороженных слоёв.
Свойство FrozenLayers предоставляет доступ к коллекции замороженных слоёв.
Returns: Возвращает коллекцию замороженных слоёв.
Тип ObjectIdCollection.

Teigha.DatabaseServices.AbstractViewPE.HasUcs
Свойство HasUcs позволяет проверить, определена ли пользовательская система координат для связанного видового экрана.
Свойство HasUcs позволяет проверить, определена ли пользовательская система координат (ПСК, UCS) для связанного видового экрана.
Returns: Возвращает true, если ПСК определена.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.HasViewOffset
Свойство HasViewOffset позволяет проверить, задано ли смещение вида для связанного видового экрана.
Свойство HasViewOffset позволяет проверить, задано ли смещение вида для связанного видового экрана.
Returns: Возвращает true, если смещение вида задано.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.HasViewport
Свойство HasViewport позволяет проверить, определён ли связанный видовой экран.
Свойство HasViewport позволяет проверить, определён ли связанный видовой экран.
Returns: Возвращает true, если связанный видовой экран определён.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.IsBackClipOn
Свойство IsBackClipOn позволяет определить, включен ли режим заднего отсечения.
Свойство IsBackClipOn позволяет определить, включен ли режим заднего отсечения.
Returns: Возвращает true, если отсечение по задней плоскости включено.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.IsFrontClipAtEyeOn
Свойство IsFrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
Свойство IsFrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
Returns: Возвращает true, если передняя плоскость отсечения проходит через камеру.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.IsFrontClipOn
Свойство IsFrontClipOn позволяет определить, включен ли режим переднего отсечения.
Свойство IsFrontClipOn позволяет определить, включен ли режим переднего отсечения.
Returns: Возвращает true, если передняя плоскость отсечения включена.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.IsPerspective
Свойство IsPerspective позволяет проверить, используется ли перспективное проецирование.
Свойство IsPerspective позволяет проверить, используется ли перспективное проецирование.
Returns: Возвращает true, если используется перспективное проецирование.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.IsPlotting
Свойство IsPlotting позволяет проверить, находится ли связанный видовой экран в состоянии печати.
Свойство IsPlotting позволяет проверить, находится ли связанный видовой экран в состоянии печати.
Returns: Возвращает true, если видовой экран находится в состоянии печати.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewPE.LensLength
Свойство LensLength представляет фокусное расстояние в режиме перспективного проецирования.
Свойство LensLength представляет фокусное расстояние в режиме перспективного проецирования.
Returns: Возвращает значение фокусного расстояния (в мм).
Тип double.

Teigha.DatabaseServices.AbstractViewPE.LowerLeftCorner
Свойство LowerLeftCorner представляет координаты левого нижнего угла связанного видового экрана.
Свойство LowerLeftCorner представляет координаты левого нижнего угла связанного видового экрана.
Returns: Возвращает координаты левого нижнего угла видового экрана.
Тип Point2d.

Teigha.DatabaseServices.AbstractViewPE.OrthoUcs
Свойство OrthoUcs позволяет определить используемый вариант ортогонального вида относительно пользовательской системы координат.
Свойство OrthoUcs позволяет определить используемый вариант ортогонального вида относительно пользовательской системы координат.
Returns: Возвращает тип ортогонального вида относительно ПСК. Значение из перечисления OrthographicView.

Teigha.DatabaseServices.AbstractViewPE.RenderMode
Свойство RenderMode представляет назначенный режим рендеринга.
Свойство RenderMode представляет назначенный режим рендеринга (каркасное представление, скрытые линии, режим тонирования и т.п.).
Returns: Возвращает режим рендеринга.  Значение из перечисления DatabaseServices.RenderMode.

Teigha.DatabaseServices.AbstractViewPE.Target
Свойство Target представляет положение точки цели вида.
Свойство Target представляет положение точки цели вида.
Returns: Возвращает положение точки цели вида.
Тип Point3d.

Teigha.DatabaseServices.AbstractViewPE.Ucs
Свойство Ucs представляет используемую пользовательскую систему координат.
Свойство Ucs представляет используемую пользовательскую систему координат (ПСК, UCS).
Returns: Возвращает пользовательскую систему координат.
Тип CoordinateSystem3d.

Teigha.DatabaseServices.AbstractViewPE.UcsName
Свойство UcsName представляет идентификатор объекта пользовательской системы координат.
Свойство UcsName представляет идентификатор объекта пользовательской системы координат.
Returns: Возвращает идентификатор объекта пользовательской системы координат.
Тип ObjectId.

Teigha.DatabaseServices.AbstractViewPE.UpperRightCorner
Свойство UpperRightCorner представляет координаты правого верхнего угла связанного видового экрана.
Свойство UpperRightCorner представляет координаты правого верхнего угла связанного видового экрана.
Returns: Возвращает координаты правого верхнего угла видового экрана.
Тип Point2d.

Teigha.DatabaseServices.AbstractViewPE.UpVector
Свойство UpVector представляет направление вверх камеры вида.
Свойство UpVector представляет направление вверх камеры вида.
Returns: Возвращает вектор, определяющий направление вверх для вида.
Тип Vector3d.

Teigha.DatabaseServices.AbstractViewPE.ViewOffset
Свойство ViewOffset представляет вектор смещения для вида.
Свойство ViewOffset представляет вектор смещения для вида.
Returns: Возвращает вектор смещения для вида.
Тип Vector2d.

Teigha.DatabaseServices.AbstractViewPE.ViewTwist
Свойство ViewTwist представляет угол поворота вида.
Свойство ViewTwist представляет угол поворота вида.
Returns: Возвращает угол поворота вида.
Тип double.

Teigha.DatabaseServices.AbstractViewPE.VisualStyle
Свойство VisualStyle представляет используемый визуальный стиль.
Свойство VisualStyle представляет используемый визуальный стиль.
Returns: Возвращает идентификатор объекта визуального стиля.
Тип ObjectId.

Teigha.DatabaseServices.AbstractViewPE.WorldToEye
Свойство WorldToEye представляет геометрическое преобразование из мировой системы координат в систему координат камеры вида.
Свойство WorldToEye представляет геометрическое преобразование из мировой системы координат в систему координат камеры вида.
Returns: Возвращает матрицу трехмерного геометрического преобразования.
Тип Matrix3d.