Teigha.Geometry.PointEntity2d
Класс PointEntity2d является базовым классом для всех классов двумерных точечных объектов.
Класс PointEntity2d является базовым классом для всех классов двумерных точечных объектов.

Teigha.Geometry.PointEntity2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип PointEntity2d.

Teigha.Geometry.PointEntity2d.Point
Свойство Point представляет двумерные координаты данного объекта.
Свойство Point представляет двумерные координаты данного объекта.
Returns: Возвращает двумерные координаты точки.
Тип Point2d.