HostMgd.EditorInput.PromptIntegerOptions
Класс предоставляет параметры для настройки интерактивного ввода целого числа в nanoCAD,
такие как сообщение, диапазон значений и значение по умолчанию.
Класс используется при вызове метода GetInteger() или других команд,
требующих ввода целого числа, для настройки поведения интерактивной операции.
С его помощью можно задать:
* текст приглашения (Message),
* значение по умолчанию (DefaultValue),
* допустимый диапазон (LowerLimit, UpperLimit),
* режимы ввода (AllowNone, AllowNegative, AllowZero и др.).
Этот класс позволяет гибко управлять пользовательским интерфейсом при вводе целых чисел,
обеспечивая контроль над допустимыми значениями и улучшая взаимодействие с пользователем.
Example
C#

HostMgd.EditorInput.PromptIntegerOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса
с заданным приглашающим сообщением для ввода целого числа.
Конструктор создаёт объект класса PromptIntegerOptions,
используемый при вызове метода GetInteger() или аналогичных команд
ввода целого числа в nanoCAD. Он устанавливает текст приглашения,
отображаемый пользователю в командной строке, а все остальные параметры
(такие как DefaultValue, LowerLimit, AllowNone) инициализируются
значениями по умолчанию.
Этот конструктор является основным способом задания начального сообщения,
которое подсказывает пользователю, какое значение требуется ввести — например,
"Введите количество копий:" или "Укажите номер слоя:".
После создания объекта его параметры можно дополнительно настроить
перед передачей в команду ввода.
message: Текст приглашения, отображаемый в командной строке при запросе ввода целого числа.
Пример: "Введите количество экземпляров

HostMgd.EditorInput.PromptIntegerOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением,
включающим локальные и глобальные ключевые слова для ввода целого числа.
Конструктор создаёт объект класса PromptIntegerOptions,
используемый при вызове метода GetInteger() в nanoCAD.
Он позволяет одновременно задать:
* приглашающее сообщение с локальными ключевыми словами ,
заключёнными в квадратные скобки (например: "Выберите режим [Один/Много]:"),
* глобальные ключевые слова , доступные на протяжении всей команды
(например: "Cancel Default").
Этот конструктор особенно полезен при разработке интерактивных команд,
где пользователь может выбирать между режимами ввода, прерывать операцию
или выполнять системные действия, не выходя из процесса ввода.
messageAndKeywords: Текст приглашения, который может содержать локальные ключевые слова в формате [Ключ1/Ключ2].
Пример: "Укажите количество [Один/Все]
globalKeywords: Строка, содержащая глобальные ключевые слова, разделённые пробелом,
Пример: "Cancel Exit".

HostMgd.EditorInput.PromptIntegerOptions.#ctor(String,String,System.Int32,System.Int32)
Конструктор инициализирует новый экземпляр класса с сообщением,
ключевыми словами и заданным диапазоном допустимых значений для ввода целого числа.
Конструктор создаёт объект класса PromptIntegerOptions, используемый при вызове метода
GetInteger() в nanoCAD. Он позволяет одновременно задать:
* текст приглашения с локальными ключевыми словами (в формате [Ключ1/Ключ2]),
* глобальные ключевые слова , доступные на протяжении всей команды,
* нижнюю и верхнюю границы допустимого значения ввода.
Этот конструктор предоставляет полную настройку параметров ввода целого числа в одном вызове,
что особенно полезно при реализации команд, требующих строгого контроля над диапазоном значений
— например, ввод номера слоя, количества копий, параметров массива и т.д.
messageAndKeywords: Текст приглашения, который может содержать локальные ключевые слова в квадратных скобках.
Пример: "Выберите режим [Один/Много]
globalKeywords: Строка с глобальными ключевыми словами, разделёнными пробелом,
lowerLimit: Минимальное допустимое значение для ввода.
upperLimit: Максимальное допустимое значение для ввода.

HostMgd.EditorInput.PromptIntegerOptions.DefaultValue
Свойство возвращает или устанавливает значение,
которое будет использовано при нажатии Enter без ввода другого значения.
Свойство используется в классе PromptIntegerOptions для задания целочисленного значения
по умолчанию при интерактивном вводе — например, через метод GetInteger().
Если пользователь нажимает Enter , не вводя число, и при этом AllowNone = true,
то применяется это значение.
Это позволяет ускорить выполнение команд, предоставляя разумное значение по умолчанию,
соответствующее типичному сценарию использования.
Свойство доступно как для чтения, так и для записи, что даёт возможность динамически изменять
его в зависимости от контекста — например, на основе предыдущих действий или настроек чертежа.
Returns: Возвращает значение типа int, представляющее собой число,
используемое по умолчанию. Если значение не задано, возвращается 0.
Example
C#

HostMgd.EditorInput.PromptIntegerOptions.LowerLimit
Свойство возвращает или устанавливает минимально допустимое значение,
которое пользователь может ввести при интерактивной команде.
Свойство используется для задания нижней границы допустимого диапазона значений
при вводе целого числа — например, через метод GetInteger().
Если пользователь введёт число меньше этого значения, система отклонит ввод
и может выдать сообщение об ошибке или запросить ввод повторно.
Это свойство позволяет обеспечить корректность ввода, ограничивая возможные значения снизу —
например, при вводе количества копий, номера слоя или параметра,
который не может быть меньше определённого значения.
ВАЖНО! Свойство LowerLimit работает совместно с UpperLimit.
Если LowerLimit больше UpperLimit, поведение команды может быть некорректным.
Returns: Возвращает значение типа int, представляющее минимально допустимое значение для ввода.
Example
C#

HostMgd.EditorInput.PromptIntegerOptions.UpperLimit
Свойство возвращает или устанавливает максимально допустимое значение,
которое пользователь может ввести при интерактивной команде.
Свойство используется для задания верхней границы допустимого диапазона значений
при вводе целого числа — например, через метод GetInteger().
Если пользователь введёт число больше этого значения, система отклонит ввод
и может запросить повторное введение корректного значения.
Это свойство позволяет контролировать верхний предел ввода,
предотвращая некорректные или чрезмерные значения — например,
при вводе количества копий, номера слоя, размера массива и других параметров,
ограниченных по верхней границе.
ВАЖНО! Свойство UpperLimit должно быть больше или равно LowerLimit.
В противном случае ввод может вести себя некорректно.
Returns: Возвращает значение типа int, представляющее максимально допустимое значение для ввода.
Example
C#