HostMgd.EditorInput.Keyword
Класс определяет ключ в запросе при вводе значений
пользователем

HostMgd.EditorInput.Keyword.DisplayName
Свойство возвращает или устанавливает отображаемое имя
ключевого слова. это именно то имя, которое отображается в
командной строке. Обычно это тоже имя, что и локальное имя.

HostMgd.EditorInput.Keyword.Enabled
Свойство возвращает или устанавливает, может ли в текущее
время использоваться ключевое слово. Если ключевое слово не
может использоваться, пользователь не может выбрать его.
Значение true означает, что ключевое слово может быть выбрано
пользователем.

HostMgd.EditorInput.Keyword.GlobalName
Свойство возвращает или устанавливает глобальное имя
ключевого слова. Оно никогда не показывается на экране, а
применяется для того, чтобы доступ к ключевому слову
производился независимо от локализации (используемого языка).

HostMgd.EditorInput.Keyword.IsReadOnly
Свойство возвращает или устанавливает, может ли ключевое
слово использоваться в режиме "только для чтения".
Свойство имеет значение true, если ключевое слово может
использоваться в режиме "только для чтения". По умолчанию
свойство имеет значение false.

HostMgd.EditorInput.Keyword.LocalName
Свойство возвращает или устанавливает локальное имя ключевого
слова (которое обычно изображается на экране).

HostMgd.EditorInput.Keyword.Visible
Свойство возвращает или устанавливает, отображается ли
ключевое слово пользователю.
Свойство имеет значение true, если ключевое слово
отображается на экране.