Teigha.DatabaseServices.AssocAction.EvaluationPriority
Метод оценивает приоритеты вычисления ассоциативных действий.
Данный метод обеспечивает реализацию по умолчанию, подходящую в большинстве случаев.
Действия могут его переопределять для настройки своего особого поведения.
Метод вызывается при вычислении сети AssocNetwork, в ходе которого последовательно оцениваются все входящие в сеть действия, нуждающиеся в перевычислении.  Алгоритм оценки приоритетов сначала отбирает все действия, которые необходимо вычислить, а затем оценивает приоритеты их вычисления через запросы к действиям.
Действие должно возвращать положительное значение приоритета, если его вычисление возможно, и отрицательное значение в противном случае.  Более высокие положительные значения приоритета означают, что действие следует вычислить раньше, чем действия с более низким положительным приоритетом.  Отрицательные числа обозначают степень «невозможности» вычисления действия.  Чем меньше число, тем ниже приоритет вычисления действия. Например, когда ни одно из действий не может быть вычислено, предпринимается попытка вычислить действия с наименьшими отрицательными приоритетами, чтобы разорвать цикл в надежде сделать возможным вычисление других действий.  Приоритет 0 означает, что в данный момент приоритет не может быть определен.
Реализация по умолчанию возвращает значение CanBeEvaluatedAssocEvaluationPriority из перечисления AssocEvaluationPriority, если действие можно вычислить, потому что оно зависит только от объектов, которые являются результатами уже вычисленных действий (на самом деле правила несколько сложнее), и значение CannotBeEvaluatedAssocEvaluationPriority, если действие не может быть вычислено, поскольку оно зависит от неких объектов, которые являются результатом каких-то ещё не вычисленных действий.
Если ассоциативному действию принадлежит объект AssocActionBody с переопределенным методом AssessmentPriorityOverride(), вызывается именно этот переопределенный метод, заменяя тем самым реализацию по умолчанию.
Returns: Возвращает оценку приоритета вычисления данного действия. Член перечисления AssocEvaluationPriority.
Notes
Приоритет больше 0 означает, что действие вычислимо, приоритет меньше 0 означает, что действие вычислить невозможно.
Приоритет 0 означает, что в данный момент приоритет определить невозможно.