Teigha.DatabaseServices.WblockNoticeEventArgs
Класс WblockNoticeEventArgs представляет данные для события WblockNotice базы данных.
Класс WblockNoticeEventArgs представляет данные для события WblockNotice базы данных.

Teigha.DatabaseServices.WblockNoticeEventArgs.To
Свойство To представляет базу данных, в которую записываются данные.
Свойство To представляет базу данных, в которую записываются данные.
Returns: Возвращает целевую базу данных. Тип Database.