Teigha.Geometry.EllipticalCylinder
Класс EllipticalCylinder представляет эллиптические цилиндры.
Класс EllipticalCylinder представляет эллиптические цилиндры (цилиндры с эллиптическим поперечным сечением).
Эллиптический цилиндр определяется:
* большим и малым радиусами,
* началом координат (располагается на оси симметрии),
* осью симметрии,
* большой осью,
* высотой,
* масштабом параметра U.
Notes
Направляющей эллиптического цилиндра является эллипс.
Образующими эллиптического цилиндра являются прямые, проходящие через каждую точку этого эллипса параллельно оси симметрии цилиндра.
Интервал высот эллиптического цилиндра определяется относительно его начала.
Высота увеличивается в направлении оси симметрии.
Интервал высот может быть неограниченным.
Параметр V определяет угол вращения вокруг оси симметрии цилиндра, измеряемый от большой оси.
Для замкнутого эллиптического цилиндра параметр V определен на интервале [-PI, +PI).
Положительное направление изменения параметра V определяется правилом правой руки при вращательном движении вдоль оси симметрии цилиндра.
Параметр U изменяется вдоль образующей цилиндра.
U является безразмерным, измеряется в масштабе параметра U (который по умолчанию равен большому радиусу).
Значение параметра U увеличивается в направлении оси симметрии, если масштаб положительный.
Однако, если масштаб параметра U отрицателен, U уменьшается в направлении оси симметрии.
Нулевое значение U соответствует основанию эллиптического цилиндра.
Боковая поверхность цилиндра периодична по V с периодом 2PI.
Параметрическая область [umin, umax] x [vmin, vmax] определяет четырехсторонний участок цилиндрической поверхности, ограниченный двумя прямыми линиями (соответствуют параметрам vmin и vmax) и двумя дугами (соответствуют параметрам umin и umax).
Определение эллиптического цилиндра предполагает соблюдение следующих ограничений:
* umin ;
* |vmax - vmin| ;
* majorRadius > 0.0;
* minorRadius > 0.0.
Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, лежащую в той же плоскости, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса.
Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.

Teigha.Geometry.EllipticalCylinder.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса EllipticalCylinder.
Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами и направляющим вектором оси симметрии цилиндра.
Конструктор класса EllipticalCylinder.
Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами и направляющим вектором оси симметрии цилиндра.
minorRadius: Малый радиус эллиптического цилиндра. Тип double.
majorRadius: Большой радиус эллиптического цилиндра. Тип double.
origin: Начало координат эллиптического цилиндра. Тип Point3d.
axisOfSymmetry: Направляющий вектор оси симметрии цилиндра. Тип Vector3d.

Teigha.Geometry.EllipticalCylinder.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Конструктор класса EllipticalCylinder.
Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами, направляющими векторами оси симметрии цилиндра и его большой оси, интервалом высоты, а также начальным и конечным углами.
Конструктор класса EllipticalCylinder.
Создает экземпляр класса с указанными точкой начала координат, малым и большим радиусами, направляющими векторами оси симметрии цилиндра и его большой оси, интервалом высоты, а также начальным и конечным углами.
minorRadius: Малый радиус эллиптического цилиндра. Тип double.
majorRadius: Большой радиус эллиптического цилиндра. Тип double.
origin: Начало координат эллиптического цилиндра. Тип Point3d.
axisOfSymmetry: Направляющий вектор оси симметрии цилиндра. Тип Vector3d.
referenceAxis: Направляющий вектор большой оси эллиптического цилиндра. Тип Vector3d.
height: Интервал высоты эллиптического цилиндра. Тип Interval.
startAngle: Начальный угол цилиндра.  Тип double.
endAngle: Конечный угол цилиндра.  Тип double.

Teigha.Geometry.EllipticalCylinder.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип EllipticalCylinder.

Teigha.Geometry.EllipticalCylinder.GetHeightAt(System.Double)
Метод предоставляет высоту данного эллиптического цилиндра, соответствующую указанному значению параметра U.
Метод предоставляет высоту данного эллиптического цилиндра, соответствующую указанному значению параметра U (указанному положению на параметрической оси U цилиндра).
parameter: Входное значение параметра U эллиптического цилиндра. Тип double.
Returns: Возвращает высоту эллиптического цилиндра для переданного в метод значения параметра U.
Тип double.

Teigha.Geometry.EllipticalCylinder.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точки пересечения данного эллиптического цилиндра с указанным линейным объектом.
Метод вычисляет точки пересечения данного эллиптического цилиндра с указанным линейным объектом.
Найденные точки пересечения возвращаются в виде массива из двух элементов.
Если точки пересечения отсутствуют или их вычислить не удалось, метод возвращает null.
Notes
Используется вызов метода EllipticalCylinder.IntersectWith(LinearEntity3d, Tolerance) с точностью, равной Tolerance.Global.
linearEntity: Линейный объект, с которым вычисляются пересечения. Тип LinearEntity3d.
Returns: Возвращает двухэлементный массив. Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует).
Тип Point3d[].

Teigha.Geometry.EllipticalCylinder.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет с заданной точностью точки пересечения данного эллиптического цилиндра с указанным линейным объектом.
Метод вычисляет с заданной точностью точки пересечения данного эллиптического цилиндра с указанным линейным объектом.
Найденные точки пересечения возвращаются в виде массива из двух элементов.
Если точки пересечения отсутствуют или их вычислить не удалось, метод возвращает null.
linearEntity: Линейный объект, с которым вычисляются пересечения. Тип LinearEntity3d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает двухэлементный массив. Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует).
Тип Point3d[].

Teigha.Geometry.EllipticalCylinder.IsClosed(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом в пределах указанной точности.
Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом в пределах указанной точности.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance основание эллиптического цилиндра представляет собой полный эллипс.
В противном случае возвращает false.

Teigha.Geometry.EllipticalCylinder.Set(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы и направляющий вектор оси симметрии эллиптического цилиндра.
Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы и направляющий вектор оси симметрии эллиптического цилиндра.
minorRadius: Малый радиус эллиптического цилиндра. Тип double.
majorRadius: Большой радиус эллиптического цилиндра. Тип double.
origin: Начало координат эллиптического цилиндра. Тип Point3d.
axisOfSymmetry: Направляющий вектор оси симметрии цилиндра. Тип Vector3d.

Teigha.Geometry.EllipticalCylinder.Set(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии цилиндра и его большой оси, интервал высоты, а также начальный и конечный углы.
Метод позволяет переопределить у данного объекта точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии цилиндра и его большой оси, интервал высоты, а также начальный и конечный углы.
minorRadius: Малый радиус эллиптического цилиндра. Тип double.
majorRadius: Большой радиус эллиптического цилиндра. Тип double.
origin: Начало координат эллиптического цилиндра. Тип Point3d.
axisOfSymmetry: Направляющий вектор оси симметрии цилиндра. Тип Vector3d.
referenceAxis: Направляющий вектор большой оси эллиптического цилиндра. Тип Vector3d.
height: Интервал высоты эллиптического цилиндра. Тип Interval.
startAngle: Начальный угол цилиндра.  Тип double.
endAngle: Конечный угол цилиндра.  Тип double.

Teigha.Geometry.EllipticalCylinder.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы данного эллиптического цилиндра.
Метод позволяет переопределить начальный и конечный углы данного эллиптического цилиндра.
startAngle: Новое значение начального угла. Тип double.
endAngle: Новое значение конечного угла.  Тип double.

Teigha.Geometry.EllipticalCylinder.Height
Свойство Height представляет интервал значений высоты данного цилиндра.
Свойство Height представляет интервал значений высоты данного цилиндра.
Returns: Возвращает интервал высоты данного цилиндра.
Тип Interval.

Teigha.Geometry.EllipticalCylinder.IsOuterNormal
Свойство IsOuterNormal позволяет определить, направлена ли нормаль цилиндрической поверхности данного объекта наружу от тела цилиндра.
Свойство IsOuterNormal позволяет определить, направлена ли нормаль цилиндрической поверхности данного объекта наружу от тела цилиндра.
Returns: Возвращает true, если нормаль направлена наружу от тела цилиндра.
В противном случае возвращает false.

Teigha.Geometry.EllipticalCylinder.MajorAxis
Свойство MajorAxis представляет направление большой оси эллиптического цилиндра.
Свойство MajorAxis представляет направление большой оси эллиптического цилиндра.
Returns: Возвращает направляющий вектор большой оси эллиптического цилиндра.
Тип Vector3d.

Teigha.Geometry.EllipticalCylinder.MajorRadius
Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического цилиндра.
Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического цилиндра.
Returns: Возвращает текущее значение большого радиуса эллиптического цилиндра.
Тип double.

Teigha.Geometry.EllipticalCylinder.MinorAxis
Свойство MinorAxis представляет направление малой оси эллиптического цилиндра.
Свойство MinorAxis представляет направление малой оси эллиптического цилиндра.
Returns: Возвращает направляющий вектор малой оси эллиптического цилиндра.
Тип Vector3d.

Teigha.Geometry.EllipticalCylinder.MinorRadius
Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического цилиндра.
Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического цилиндра.
Returns: Возвращает текущее значение малого радиуса эллиптического цилиндра.
Тип double.

Teigha.Geometry.EllipticalCylinder.Origin
Свойство Origin представляет положение начала координат данного эллиптического цилиндра.
Свойство Origin представляет точку начала координат данного эллиптического цилиндра.
Returns: Возвращает точку начала координат эллиптического цилиндра.
Тип Point3d.

Teigha.Geometry.EllipticalCylinder.RadiusRatio
Свойство RadiusRatio представляет соотношение длин полуосей эллипса в основании данного эллиптического цилиндра.
Свойство RadiusRatio представляет отношение длин полуосей эллипса в основании данного эллиптического цилиндра.
Чем это отношение ближе к единице, тем ближе к окружности эллиптическое основание цилиндра.
Returns: Возвращает отношение длин полуосей эллипса в основании эллиптического цилиндра.
Тип double.