Teigha.GraphicsInterface.EdgeModifiers.Opacity
Значение: 128.
Этот модификатор включает режим управления непрозрачностью отображаемых рёбер.
Если флаг не выставлен, ребра отображаются как непрозрачные.
Если флаг установлен, ребра отображаются с указанной степенью непрозрачности в диапазоне от полной непрозрачности до полной прозрачности.