Teigha.Geometry.SurfaceCurve2dTo3d
Класс SurfaceCurve2dTo3d обеспечивает трехмерное представление кривых, определенных в двумерном параметрическом пространстве поверхности.
Объект SurfaceCurve2dTo3d представляет собой трехмерную кривую, и всякая точка этой кривой может быть вычислена из точки UV-кривой при соответствующем значении параметра.

Teigha.Geometry.SurfaceCurve2dTo3d.Create(IntPtr,System.Boolean)
Метод создает управляемый объект SurfaceCurve2dTo3d на основе переданного неуправляемого указателя.
Метод создает управляемый объект SurfaceCurve2dTo3d на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип SurfaceCurve2dTo3d.

Teigha.Geometry.SurfaceCurve2dTo3d.GeometricExtents
Свойство GeometricExtents возвращает трехмерную граничную рамку для данной кривой.
Свойство GeometricExtents возвращает трехмерную граничную рамку для данной кривой.
Ориентация этой рамки определяется осями системы координат объекта.
Returns: Возвращает 3D граничную рамку для данного объекта.
Тип DatabaseServices.Extents3d.