Teigha.DatabaseServices.Filters.Index
Этот класс является базовым классом для всех индексов.
Его наследниками являются классы SpatialIndex и LayerIndex.
Этот класс является базовым классом для всех индексов.
Его наследниками являются классы SpatialIndex и LayerIndex.

Teigha.DatabaseServices.Filters.Index.GetIterator(Teigha.GraphicsInterface.Filter)
Метод предназначен для создания нового объекта FilteredBlockIterator, который обеспечивает доступ к объектам чертежа в этом объекте Index.
Метод предназначен для создания нового объекта FilteredBlockIterator, который обеспечивает доступ к объектам чертежа в этом объекте Index.
Классы индекса и фильтра должны быть совместимыми.
Возвращаемый итератор индекса по существу будет методом для обхода результатов запроса, отправленного в объект индекса.
Обязанность проверять актуальность и действительность индекса возлагается на реализацию конкретного класса.
filter: Входной фильтр (запрос), который будет применен к индексу для обхода с использованием итератора.
Returns: Возвращает объект итератора. Тип FilteredBlockIterator.
В случае ошибки возвращает null.

Teigha.DatabaseServices.Filters.Index.RebuildFull(Teigha.DatabaseServices.Filters.IndexUpdateData)
Метод позволяет полностью перестроить данный объект Index с использованием объектов чертежа из записи таблицы блоков.
Метод позволяет полностью перестроить данный объект Index с использованием объектов чертежа из записи таблицы блоков.
indexData: Входной объект IndexUpdateData, который будет использоваться при перестроении индекса.

Teigha.DatabaseServices.Filters.Index.IsUptoDate
Свойство IsUptoDate проверяет актуальность данного индекса.
Свойство IsUptoDate проверяет актуальность данного индекса.
Его возможно использовать для проверки достоверности в пределах сеанса.
Returns: Возвращает true, только если данный индекс актуален.
В противном случае возвращает false.

Teigha.DatabaseServices.Filters.Index.LastUpdatedAt
Свойство LastUpdatedAt предоставляет доступ к временной метке по юлианскому календарю для данного объекта Index.
Свойство LastUpdatedAt предоставляет доступ к временной метке по юлианскому календарю для данного объекта Index.
Использует значение системной переменной TDUPDATE базы данных при последнем обновлении индекса.
Полезно для проверки актуальности индексов в сохраненных чертежах. Так, если значение переменной TDUPDATE не совпадает с временной меткой LastUpdatedAt, индекс следует считать устаревшим.
Returns: Возвращает временную метку для данного индекса по юлианскому календарю. Тип DateTime.

Teigha.DatabaseServices.Filters.Index.LastUpdatedAtU
Свойство LastUpdatedAtU предоставляет доступ к временной метке последнего обновления данного индекса по шкале всемирного времени (UT).
Свойство LastUpdatedAtU предоставляет доступ к временной метке последнего обновления данного индекса по шкале всемирного времени (UT).
Returns: Возвращает временную метку последнего обновления индекса по шкале всемирного времени (UT).
Тип DateTime.

Teigha.DatabaseServices.Filters.Index.ObjectBeingIndexedId
Свойство возвращает идентификатор родительской записи таблицы блоков, с которой связан (и которой неявно принадлежит) данный индекс.
Свойство возвращает идентификатор родительской записи таблицы блоков, с которой связан (и которой неявно принадлежит) данный индекс.
Returns: Возвращает идентификатор объекта записи таблицы блоков. Тип DatabaseServices.ObjectId.