Teigha.Geometry.Sphere.GetAnglesInV
Метод предоставляет текущий диапазон изменения параметра v.
Метод предоставляет текущий диапазон изменения параметра v.
Returns: Возвращает двухэлементный массив. Тип double[].
Элемент с индексом 0 соответствует начальному углу, а элемент с индексом 1 - конечному углу для параметра v.