HostMgd.Windows.ToolPalette.CustomToolBase.GetStockTool
Метод позволяет получить ссылку на стандартный инструмент, связанный с данным пользовательским инструментом.
Не реализован.
Метод позволяет получить ссылку на стандартный инструмент (stock tool), связанный с данным пользовательским инструментом.
При отсутствии такой связи метод возвращает null.
В текущей версии не реализован.
Returns: Возвращает экземпляр стандартного инструмента nanoCAD или null.
Тип System.Object.