Teigha.DatabaseServices.Transaction.Abort
Этот метод прерывает текущую открытую транзакцию.
Этот метод прерывает текущую открытую транзакцию.
Он инициирует откат всех изменений в объектах с момента начала транзакции.