Teigha.Geometry.ExternalCurve2d
Класс ExternalCurve2d представляет 2D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
Класс ExternalCurve2d представляет 2D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
С экземплярами ExternalCurve2d можно работать как с любыми объектами Curve2d.
Доступ к ExternalCurve2d можно получить так же, как к кривой Curve2d, если она существует.
Кроме того, возможно получить доступ к внешним данным в их нативной форме (что может оказаться более эффективным).
Одним из примеров использования ExternalCurve2d является доступ к кривым ACIS.
Следует, однако, иметь ввиду, что определения внешних кривых отличаются от соответствующих определений в геометрической библиотеке nanoCAD.
Например, могут отличаться способы параметризации кривых.

Teigha.Geometry.ExternalCurve2d.#ctor
Конструктор по умолчанию класса ExternalCurve2d.
Конструктор по умолчанию класса ExternalCurve2d.
Создает пустой экземпляр по умолчанию с нулевым указателем на определение кривой, неопределенным типом кривой (другими словами, нет информации о системе, в которой была создана внешняя кривая) и опцией предотвращения копирования внешней кривой.

Teigha.Geometry.ExternalCurve2d.#ctor(IntPtr,Teigha.Geometry.ExternalEntityKind)
Конструктор класса ExternalCurve2d.
Создает объект на основе указателя на определение внешней кривой и сведений о системе, в которой было создано ее определение.
Конструктор класса ExternalCurve2d.
Создает объект на основе указателя на определение внешней кривой и сведений о системе, в которой было создано ее определение.
curveDef: Входное определение внешней кривой. Тип IntPtr.
curveKind: Информация о системе, в которой было создано определение внешнего объекта. Перечисление ExternalEntityKind.

Teigha.Geometry.ExternalCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип ExternalCurve2d.

Teigha.Geometry.ExternalCurve2d.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Если текущий экземпляр определен и является владельцем данных своего определения, то существующее определение будет удалено.
curveDef: Указатель на определение внешней кривой. Тип IntPtr.
curveKind: Информация о системе, в которой было создано определение внешнего объекта. Тип ExternalEntityKind.

Teigha.Geometry.ExternalCurve2d.ExternalCurve
Свойство ExternalCurve представляет внешнюю кривую в ее исходном виде.
Свойство ExternalCurve представляет внешнюю кривую в ее исходном виде.
Знание точного определения внешнего объекта потенциально обеспечивает эффективный доступ к объекту в его исходном виде.
Вызывающая сторона несет ответственность за высвобождение использованной при этом памяти.
Returns: Возвращает указатель на внешнюю кривую. Тип IntPtr.

Teigha.Geometry.ExternalCurve2d.ExternalCurveKind
Свойство ExternalCurveKind представляет информацию о нативной системе, в которой было создано определение внешней кривой.
Свойство ExternalCurveKind представляет информацию о нативной системе, в которой было создано определение внешней кривой.
Returns: Возвращает информацию о системе, в которой было создано определение внешнего объекта.
Тип Geometry.ExternalEntityKind.

Teigha.Geometry.ExternalCurve2d.IsDefined
Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
Returns: Возвращает true, если данный объект имеет определение кривой.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve2d.IsNurbCurve
Свойство IsNurbCurve позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
Свойство IsNurbCurve позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
Returns: Возвращает true, если внешняя кривая имеет точное нативное представление в графической системе платформы.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve2d.IsOwnerOfCurve
Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
Returns: Возвращает true, если данный объект является владельцем данных своего определения.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve2d.NurbCurve
Свойство NurbCurve представляет внешнюю кривую в нативном представлении графической системы платформы.
Свойство NurbCurve представляет внешнюю кривую в нативном представлении графической системы платформы.
Returns: Возвращает нативное представление кривой в графической системе платформы.
Тип NurbCurve2d.