Teigha.DatabaseServices.BooleanOperationType
Данное перечисление определяет типы логических операций с геометрическими объектами.
Данное перечисление определяет типы логических операций с геометрическими объектами.