Teigha.GraphicsInterface.OrientationType
Перечисление OrientationType определяет ориентацию грани, которая используется при расчете различных параметров.
Перечисление OrientationType определяет ориентацию грани, которая используется при расчете различных параметров.