Teigha.DatabaseServices.MLeader.getContextDataManager
Метод возвращает указатель на менеджер данных контекста этой мультивыноски.
Метод возвращает указатель на менеджер данных контекста этой мультивыноски.
Returns: Возвращает указатель на объект менеджера данных контекста мультивыноски.  Тип IntPtr.