Teigha.GraphicsInterface.DiagnosticMode
Перечисление DiagnosticMode определяет доступные режимы диагностической визуализации.
Перечисление DiagnosticMode определяет доступные режимы диагностической визуализации.