Teigha.Geometry.NurbCurve2d.GetParametersOfG1Discontinuity
Метод предоставляет значения параметра всех точек сплайна с нарушенной G1 непрерывностью (неколлинеарность касательных векторов слева и справа от точки).
Returns: Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью.
Тип DoubleCollection.