Teigha.GraphicsSystem.ClientViewInfo
Структура ClientViewInfo представляет идентификатор видового экрана, идентификатор окна nanoCAD, идентификатор объекта видового экрана и объект контекстных цветов для видового экрана.
Структура ClientViewInfo представляет идентификатор видового экрана, идентификатор окна nanoCAD, идентификатор объекта видового экрана и объект контекстных цветов для видового экрана.

Teigha.GraphicsSystem.ClientViewInfo.AcadWindowId
Свойство AcadWindowId представляет идентификатор окна nanoCAD.
Свойство AcadWindowId представляет идентификатор окна nanoCAD.
Returns: Возвращает идентификатор окна nanoCAD.
Тип long.

Teigha.GraphicsSystem.ClientViewInfo.ViewportFlags
Свойство ViewportFlags представляет флаги видового экрана.
Свойство ViewportFlags представляет флаги видового экрана.
Returns: Возвращает флаги видового экрана.
Тип unsigned int.

Teigha.GraphicsSystem.ClientViewInfo.ViewportId
Свойство ViewportId представляет идентификатор видового экрана.
Свойство ViewportId представляет идентификатор видового экрана.
Returns: Возвращает идентификатор видового экрана.
Тип int.

Teigha.GraphicsSystem.ClientViewInfo.ViewportObjectId
Свойство ViewportObjectId представляет идентификатор объекта видового экрана.
Свойство ViewportObjectId представляет идентификатор объекта видового экрана.
Returns: Возвращает идентификатор объекта видового экрана.
Тип long long.