Teigha.DatabaseServices.Filters.LayerFilter
Класс реализует объекты LayerFilter в экземпляре базы данных Database.
Класс предназначен для реализации объектов LayerFilter в экземпляре базы данных Database.
LayerFilter представляет собой список слоев, объекты которых просматриваются во время обхода фильтруемого блока.
Объекты LayerFilter могут дополнительно сохраняться в базе данных чертежа для эффективной загрузки по требованию внешних ссылок.

Teigha.DatabaseServices.Filters.LayerFilter.#ctor
Конструктор класса LayerFilter по умолчанию.
Конструктор класса LayerFilter по умолчанию.

Teigha.DatabaseServices.Filters.LayerFilter.Add(String)
Метод добавляет к данному фильтру слой с указанным именем.
Метод добавляет к данному фильтру слой с указанным именем.
Все объекты на добавленном слое будут приняты к обработке.
layer: Имя добавляемого слоя.  Тип String.

Teigha.DatabaseServices.Filters.LayerFilter.GetAt(System.Int32,String%)
Метод позволяет получить имя слоя по индексу слоя в данном объекте LayerFilter.
Метод позволяет получить имя слоя name по индексу слоя в данном объекте LayerFilter.
index: Индекс искомого слоя. Тип int.
name: Имя слоя, который в данном фильтре имеет индекс index.  Тип String.

Teigha.DatabaseServices.Filters.LayerFilter.Remove(String)
Метод предназначен для удаления указанного слоя из данного объекта LayerFilter.
Метод предназначен для удаления указанного слоя из данного объекта LayerFilter.
layer: Имя удаляемого из фильтра слоя.  Тип String.

Teigha.DatabaseServices.Filters.LayerFilter.IsValid
Свойство IsValid позволяет проверить, все ли добавленные в данный фильтр слои существуют в базе данных, с которой связан данный фильтр.
Свойство IsValid позволяет проверить, все ли добавленные в данный фильтр слои существуют в базе данных, с которой связан данный фильтр.
Returns: Возвращает true, только если все зарегистрированные в фильтре слои присутствуют в базе данных чертежа.
В противном случае возвращает false.

Teigha.DatabaseServices.Filters.LayerFilter.LayerCount
Свойство LayerCount возвращает количество слоев, зарегистрированных в данном фильтре.
Свойство LayerCount возвращает количество слоев, зарегистрированных в данном фильтре.
Returns: Возвращает количество слоев в данном фильтре. Тип int.