HostMgd.EditorInput.SelectionTextInputEventHandler
Делегат используется для обработки пользовательских событий, возникающих в процессе ввода ключевых слов в редакторе nanoCAD.
Делегат SelectionTextInputEventHandler используется для обработки пользовательских событий, связанных с вводом ключевых слов в редакторе nanoCAD. Параметры события передаются через аргументы sender и e, где
sender представляет объект-инициатор события, а аргумент e определяет контекст события в виде экземпляра класса
HostMgd.EditorInput.SelectionTextInputEventArgs. Этот контекст обеспечивает доступ к введенному пользователем тексту, сообщениям об ошибках.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип SelectionTextInputEventArgs.