HostMgd.PlottingServices.DeviceType
Данное перечисление определяет типы выходных устройств, поддерживаемые в пространстве имен HostMgd.PlottingServices.
Перечисление DeviceType определяет типы выходных устройств, поддерживаемые в пространстве имен HostMgd.PlottingServices.