Teigha.DatabaseServices.DBObject.DowngradeOpen
Метод уровень доступа к этому объекту с ForWrite до ForRead.
Переводит объект, открытый в режиме OpenMode.ForWrite, в
режим OpenMode.ForRead. Все изменения, сделанные с момента
открытия на запись, записываются в базу данных и возникают все
соответствующие события.
Note
Эта функция не требует, чтобы она предшествовала вызову
upgradeOpen() — она только требует, чтобы при ее вызове
объект был открыт на запись.