Teigha.DatabaseServices.Entity.Draw
Метод предназначен для постановки в очередь перерисовки графики объекта.
Этот метод ставит в очередь перерисовку графики объекта,
требуя осуществить перерисовку данного графического объекта и
всего того, что есть в очереди для рисования и перерисования
на экране.