Teigha.DatabaseServices.OpenModeAttribute
Класс представляет атрибут, который сообщает об режиме открытия объекта.
Класс представляет атрибут, который сообщает об режиме открытия объекта.
См. также OpenMode.

Teigha.DatabaseServices.OpenModeAttribute.#ctor(DatabaseServices.OpenMode)
Конструктор класса OpenModeAttribute.
Конструктор класса OpenModeAttribute.
Создает новый экземпляр данного класса с указанным режимом доступа к объекту.
mode: Режим открытия объекта. Значение из перечисления DatabaseServices.OpenMode.

Teigha.DatabaseServices.OpenModeAttribute.OpenMode
Свойство представляет режим открытия объекта.
Свойство представляет режим открытия объекта.
Returns: Возвращает режим открытия объекта. Значение из перечисления DatabaseServices.OpenMode.