Teigha.DatabaseServices.DynamicBlockReferenceProperty
Класс DynamicBlockReferenceProperty является служебным классом, который обеспечивает доступ к свойствам вхождений динамических блоков.
Класс DynamicBlockReferenceProperty является служебным классом, который обеспечивает доступ к свойствам вхождений динамических блоков.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.BlockId
Свойство BlockId представляет идентификатор объекта вхождения динамического блока.
Свойство BlockId представляет идентификатор объекта вхождения динамического блока.
Returns: Возвращает идентификатор объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.Description
Свойство Description возвращает описание данного свойства динамического блока.
Свойство Description возвращает описание данного свойства динамического блока.
Returns: Возвращает описание свойства динамического блока. Тип String.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.PropertyName
Свойство PropertyName представляет имя данного свойства динамического блока.
Свойство PropertyName представляет имя данного свойства динамического блока.
Имена всех свойств в конкретном вхождении блока уникальны.
Returns: Возвращает имя свойства динамического блока. Тип String.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.PropertyTypeCode
Свойство PropertyTypeCode представляет тип значения свойства динамического блока.
Свойство PropertyTypeCode представляет тип значения свойства динамического блока.
Returns: Возвращает тип значения свойства динамического блока. Тип short.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.ReadOnly
Свойство ReadOnly определяет, доступно ли данное свойство динамического блока только для чтения.
Свойство ReadOnly определяет, доступно ли данное свойство динамического блока только для чтения.
Returns: Возвращает true, если данное свойство динамического блока доступно только для чтения.
В противном случае возвращает false.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.Show
Свойство Show позволяет определить, отображается ли данное свойство динамического блока на палитре свойств.
Свойство Show позволяет определить, отображается ли данное свойство динамического блока на палитре свойств.
Returns: Возвращает true, если данное свойство отображается на палитре свойств.
В противном случае возвращает false.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.UnitsType
Свойство UnitsType представляет типы единиц измерения данного свойства динамического блока.
Свойство UnitsType представляет типы единиц измерения данного свойства динамического блока (длины, площади, углы).
Доступные типы определяются перечислением DynamicBlockReferencePropertyUnitsType.
Returns: Возвращает тип единиц измерения из перечисления DynamicBlockReferencePropertyUnitsType.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.Value
Свойство Value представляет текущее значение данного свойства у вхождения динамического блока.
Свойство Value представляет текущее значение данного свойства у вхождения динамического блока.
Returns: Возвращает текущее значение данного свойства. Тип Object.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.VisibleInCurrentVisibilityState
Свойство VisibleInCurrentVisibilityState определяет, является ли данное свойство видимым в текущем представлении динамического блока.
Свойство VisibleInCurrentVisibilityState определяет, является ли данное свойство видимым в текущем представлении динамического блока.
Returns: Возвращает true, если свойство является видимым.
В противном случае возвращает false.