Teigha.DatabaseServices.DwfDefinition
Этот класс представляет определения подложек DWF на чертеже.
Этот класс представляет определения подложек DWF на чертеже.
Подложки аналогичны растровым изображениям, за исключением того, что их контент допускает объектные привязки.

Teigha.DatabaseServices.DwfDefinition.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DwfDefinition.isDWFx
Свойство предоставляет возможность проверить, является ли объект файлом формата DWFx.
Свойство предоставляет возможность проверить, является ли объект файлом формата DWFx.
Returns: Возвращает true, если объект является файлом формата DWFx.
В противном случае возвращает false.