Teigha.DatabaseServices.BlockReference
Класс предназначен для создания вставки блока в чертеже.
Вставка блока является графической частью блока и ссылкой
на его неграфическую часть - определение блока BlockTableRecord,
в котором указаны все параметры самого блока.
Ссылка на блок используется для определения места,
размера, и отображения экземпляра коллекции геометрических
объектов, в BlockTableRecord, на которую он ссылается.
Дополнительно, ссылка на блок может быть владельцем атрибутов
геометрических объектов (список которых автоматически
ограничивается геометрическим объектом SequenceEnd).
Note
Когда геометрические объекты BlockTableRecord, на которые
ссылается ссылка блока, разрешены для отображения, WCS
координаты для геометрического объекта из записи таблицы
блоков преобразуются в координатную систему, по существу
являющуюся OCS ссылки на блок. Исходные значения
преобразуются в относительные позиции точки блока, а оси X и
Y поворачиваются вокруг оси Z для получения относительной
величины поворота блока. Величина поворота в радианах
является положительной при повороте против часовой стрелки
при просмотре вниз по оси Z по направлению к исходной точке.
Любые масштабы по X, Y и Z применяются к геометрическим
объектам относительно к их WCS координатам осей. Это делает
возможным ориентировать желаемую версию масштаба для
геометрического объекта.
Свойство BlockTransform вернет матрицу, которая представляет
преобразование системы координат (включая масштабирование),
описанное выше.
В классы, производные от BlockReference, не могут добавляться
атрибуты.

Teigha.DatabaseServices.BlockReference.#ctor(Teigha.Geometry.Point3d,DatabaseServices.ObjectId)
Этот конструктор инициализирует ссылку на блок с
использованием значением параметра position (в WCS) как
позицию точки, blockTableRecord как ID записи таблицы блоков,
масштабы по X, Y и Z равными 1.0, угол поворота, равным 0.0 и
вектор нормали, равный (0,0,1).
position: Позиция точки
blockTableRecord: Id BlockTableRecord для ссылки

Teigha.DatabaseServices.BlockReference.ConvertToStaticBlock(String)
Преобразует экземпляр динамического блока в наследуемый (не
динамический) блок.
Note
При успехе, ссылка на блок фиксирует свойства динамического
блока их текущими значениями и он прекращает быть
динамическим блоком. Новый блок определяется с именем
newBlockName, которое не должно уже существовать в чертеже и
должно удовлетворять всем ограничениям именования нормальных
ссылок на блоки.
newBlockName: Имя для нового определения блока

Teigha.DatabaseServices.BlockReference.GeometryExtentsBestFit(Teigha.Geometry.Matrix3d)
Получает копию всех геометрических объектов в записи таблицы
блоков, на которую указывает ссылка, применяет к ним
преобразование parentTransform, и затем вычисляет пределы
размещения результирующего множества геометрических объектов.
Note
Этот метод выполняется рекурсивно для вложенных ссылок на
блоки. Когда этот метод вызывается в самой удаленной (самой
внешней) ссылке (обычная ситуация для приложения), parentTransform
представляет собой некоторую матрицу. Для вызовов для
вложенных ссылок на блоки, parentTransform должен
представлять совокупное преобразование от самой внешней
ссылки на блок до ссылки на блок, которая находится в записи
таблице блоков, которая является владельцем ссылки, для
которой метод вызывается.
parentTransform: Преобразование, которое применяется к

Teigha.DatabaseServices.BlockReference.AnonymousBlockTableRecord
Возвращает определение анонимного блока, используя
динамический блок чертежа.

Teigha.DatabaseServices.BlockReference.AttributeCollection
Возвращает значение свойства AttributeCollection.

Teigha.DatabaseServices.BlockReference.BlockTableRecord
Возвращает или устанавливает Id объекта BlockTableRecord, на
который ссылается ссылка на блок.

Teigha.DatabaseServices.BlockReference.BlockTransform
Возвращает или устанавливает позицию ссылки на блок (точку
вставки), вектор нормали, масштаб, угол поворота, так
что результирующее преобразование чертежа из MSC в WCS будет
таким же, как и по матрице преобразования. MSC — это WCS в
микропространстве записи таблицы блоков.

Teigha.DatabaseServices.BlockReference.BlockUnit
Возвращает или устанавливает единицы, связанные с блоком.

Teigha.DatabaseServices.BlockReference.DynamicBlockReferencePropertyCollection
Возвращает коллекцию динамического блока (BlockTableRecord),
описывающую, из чего состоит динамический блок, если блок, на
который указывает ссылка, является динамическим блоком.

Teigha.DatabaseServices.BlockReference.DynamicBlockTableRecord
Возвращает Id определения динамического блока
(BlockTableRecord), если блок, на который указывает ссылка,
является динамическим блоком.

Teigha.DatabaseServices.BlockReference.IsDynamicBlock
Определяет, содержит ли BlockReference , переданный в
конструктор класса, информацию о динамическом блоке.

Teigha.DatabaseServices.BlockReference.Name
Возвращает имя связанного BlockTableRecord.

Teigha.DatabaseServices.BlockReference.TreatAsBlockRefForExplode
Вызывается командой nanoCAD EXPLODE, чтобы определить, как
объект будет разорван.

Teigha.DatabaseServices.BlockReference.UnitFactor
Возвращает значение используемых единиц.

Teigha.DatabaseServices.BlockReference.Normal
Возвращает вектор нормали (в миировых координатах) к
плоскости, содержащей ссылку на блок.

Teigha.DatabaseServices.BlockReference.Position
Обеспечивает доступ к значению расположения (часто называемую
точкой вставки), в мировых координатах.
Note
Значение расположения — это эквивалент (в мировых
координатах) DXF группового кода 10.