Teigha.DatabaseServices.DxfFiler.ReadByte
Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
Returns: Возвращает 8-разрядное целое число без знака. Тип byte.