HostMgd.PlottingServices.CustomSizeResults.DeviceLoadFailed
Значение: 8192 (0x2000).
Не удалось загрузить устройство, указанное в параметрах листа (layout), или переопределение устройства, чтобы определить, поддерживает ли оно пользовательские размеры бумаги.