Teigha.DatabaseServices.MaintenanceReleaseVersion
Данное перечисление определяет версии технических релизов.
Данное перечисление определяет версии технических релизов, основной задачей которых является доработка существующего функционала и устранение выявленных ошибок.