Teigha.Geometry.PlanarEntity
Класс PlanarEntity является абстрактным базовым классом для всех типов плоских поверхностей в трехмерном пространстве.
Класс PlanarEntity является абстрактным базовым классом для всех типов плоских поверхностей в трехмерном пространстве.
Всякая плоская поверхность S параметризуется следующим образом.
Параметризация плоской поверхности S реализуется так, что всякая параметрическая точка с координатами u,v отображается в точку S(u,v) пространства моделирования по формуле
S(u,v) = originOfPlanarEntity + (u * uAxis) + (v * vAxis)
В принципе, векторы uAxis и vAxis не обязательно должны быть нормированными или взаимно перпендикулярными, но они обязаны быть неколлинеарными.
На любой плоской поверхности определена каноническая ортонормированная система координат, связанная с плоскостью следующим образом:
Параметр            Описание                                        Вычисляется как
---------           -----------------------------------------       ----------------------------------
origin       Точка начала на плоскости.                      origin
axis1        Единичный вектор в плоскости.                   uAxis.normal()
axis2        Единичный вектор, перпендикулярный плоскости.   uAxis.crossProduct(vAxis).normal()
Общее уравнение плоскости имеет вид:
a * X + b * Y + c * Z + d = 0
где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (т.е., они не могут равняться нулю одновременно).
Величины a, b, c служат компонентами вектора нормали этой плоскости.

Teigha.Geometry.PlanarEntity.ClosestPointToLinearEntity(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах точности по умолчанию.
Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности.
Используется вызов метода PlanarEntity.ClosestPointToLinearEntity(LinearEntity3d line, Tolerance tolerance)
с точностью по умолчанию, равной Tolerance.Global.
line: Входная линия. Тип LinearEntity3d.
Returns: Возвращает массив из двух точек. Тип Point3d[].
Первый элемент массива соответствует ближайшей точке на линии line, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.ClosestPointToLinearEntity(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах явно заданной точности.
Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах явно заданной точности.
line: Входная линия. Тип LinearEntity3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив из двух точек. Тип Point3d[].
Первый элемент массива соответствует ближайшей точке на линии line, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Teigha.Geometry.PlanarEntity)
Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту.
Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту.
Используется вызов метода PlanarEntity.ClosestPointToPlanarEntity(PlanarEntity otherPlane, Tolerance tolerance)
с точностью по умолчанию, равной Tolerance.Global.
otherPlane: Входная плоская поверхность, для которой требуется найти ближайшие точки. Тип PlanarEntity.
Returns: Возвращает массив из двух точек. Тип Point3d[].
Первый элемент массива соответствует ближайшей точке на плоскости otherPlane, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту. Вычисление координат точек выполняется в пределах явно заданной точности.
Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту. Вычисление координат точек выполняется в пределах явно заданной точности.
otherPlane: Входная плоская поверхность, для которой требуется найти ближайшие точки.  Тип PlanarEntity.
tolerance: Заданная геометрическая точность.  Тип Tolerance.
Returns: Возвращает массив из двух точек. Тип Point3d[].
Первый элемент массива соответствует ближайшей точке на плоскости otherPlane, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип PlanarEntity.

Teigha.Geometry.PlanarEntity.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точку пересечения данной плоской поверхности с указанной линией с использованием точности по умолчанию.
Метод вычисляет точку пересечения данной плоской поверхности с линейным объектом linearEntity.
Используется метод PlanarEntity.Point3d[] IntersectWith(ref LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
linearEntity: Входной линейный объект. Тип LinearEntity3d.
Returns: Возвращает массив, в котором содержится единственная точка пересечения (если она существует).
Тип Point3d[].

Teigha.Geometry.PlanarEntity.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точку пересечения данной плоской поверхности с указанной линией, используя предписанную точность.
Метод вычисляет точку пересечения данной плоской поверхности с линейным объектом linearEntity, используя точность tolerance.
linearEntity: Входной линейный объект. Тип LinearEntity3d.
tolerance: Заданная точность для вычисления точки пересечения. Тип Tolerance.
Returns: Возвращает массив, в котором содержится единственная точка пересечения (если она существует).
Тип Point3d[].

Teigha.Geometry.PlanarEntity.IsCoplanarTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить, является ли данный объект компланарным указанной плоской поверхности.
Метод позволяет проверить, является ли данный объект компланарным плоской поверхности otherPlanarEntity.
Используется вызов метода PlanarEntity.IsCoplanarTo(PlanarEntity otherPlaneEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
otherPlanarEntity: Проверяемый входной плоский объект.  Тип PlanarEntity.
Returns: Возвращает true, если в пределах точности по умолчанию проверяемые плоские объекты можно считать компланарными.
В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsCoplanarTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли данный объект и указанная плоская поверхность компланарными в пределах заданной точности.
Метод позволяет проверить, являются ли данный объект и плоская поверхность otherPlanarEntity компланарными в пределах точности tolerance.
otherPlanarEntity: Проверяемый входной плоский объект.  Тип PlanarEntity.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance проверяемые плоские объекты можно считать компланарными.
В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить параллельность указанной линии и данной плоской поверхности в пределах точности по умолчанию.
Метод позволяет проверить параллельность линейного объекта linearEntity и данной плоской поверхности.
Используется метод  PlanarEntity.IsParallelTo(ref LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
linearEntity: Проверяемый линейный объект. Тип LinearEntity3d.
Returns: Возвращает true, если в пределах точности по умолчанию линейный объект linearEntity можно считать параллельным данной плоской поверхности.  В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить параллельность указанной линии и данной плоской поверхности в пределах предписанной точности.
Метод позволяет проверить параллельность указанного линейного объекта linearEntity и данной плоской поверхности в пределах точности tolerance.
linearEntity: Проверяемый линейный объект. Тип LinearEntity3d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance линейный объект linearEntity можно считать параллельным данной плоской поверхности.  В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах точности по умолчанию.
Метод позволяет проверить параллельность данного объекта и плоской поверхности otherPlanarEntity в пределах точности по умолчанию.
Используется вызов PlanarEntity.IsParallelTo(ref PlanarEntity otherPlanarEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
otherPlanarEntity: Проверяемая на параллельность плоская поверхность. Тип PlanarEntity.
Returns: Возвращает true, если в пределах точности по умолчанию сравниваемые плоские объекты можно считать параллельными.
В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах предписанной точности.
Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах точности tolerance.
otherPlanarEntity: Проверяемая на параллельность плоская поверхность. Тип PlanarEntity.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности сравниваемые плоские объекты можно считать параллельными.
В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта (в пределах точности по умолчанию).
Метод позволяет проверить перпендикулярность данного объекта и линейного объекта linearEntity.
Используется вызов метода PlanarEntity.IsPerpendicularTo(ref LinearEntity3d linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
linearEntity: Входной линейный объект. Тип LinearEntity3d.
Returns: Возвращает true, если в пределах точности по умолчанию линейный объект linearEntity можно считать перпендикулярным данной плоской поверхности.  В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта в пределах предписанной точности.
Метод позволяет проверить перпендикулярность данного объекта и линейного объекта linearEntity в пределах точности tolerance.
linearEntity: Входной линейный объект. Тип LinearEntity3d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance линейный объект linearEntity можно считать перпендикулярным данной плоской поверхности.  В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности (в пределах точности по умолчанию).
Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности.
Используется вызов метода PlanarEntity.IsPerpendicularTo(ref PlanarEntity linearEntity, Tolerance tolerance) с точностью, равной Tolerance.Global.
linearEntity: Проверяемая плоская поверхность. Тип PlanarEntity.
Returns: Возвращает true, если в пределах точности по умолчанию плоскую поверхность linearEntity можно считать перпендикулярной данной плоской поверхности.  В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности в пределах заданной точности.
Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности linearEntity в пределах точности tolerance.
linearEntity: Проверяемый плоский объект. Тип PlanarEntity.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance плоский объект linearEntity можно считать перпендикулярной данной плоской поверхности.  В противном случае возвращает false.

Teigha.Geometry.PlanarEntity.Coefficients
Свойство Coefficients представляет коэффициенты общего уравнения плоскости данного объекта.
Свойство Coefficients представляет коэффициенты общего уравнения плоскости данного объекта.
Это уравнение имеет вид:
a * X + b * Y + c * Z + d = 0
где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (другими словами, они не могут равняться нулю одновременно).
Величины a, b, c служат компонентами вектора нормали этой плоскости.
Returns: Возвращает коэффициенты общего уравнения плоскости.
Тип PlanarEquationCoefficients.

Teigha.Geometry.PlanarEntity.Normal
Свойство Normal представляет единичный вектор нормали плоскости данного объекта.
Свойство Normal представляет единичный вектор нормали плоскости данного объекта.
Notes
Следует иметь ввиду, что направление вектора нормали плоскости может быть инвертировано средствами базового класса Surface.
См. свойства Surface.IsNormalReversed и Surface.ReverseNormal.
Returns: Возвращает вектор нормали плоскости данного объекта. Тип Vector3d.

Teigha.Geometry.PlanarEntity.PointOnPlane
Свойство PointOnPlane представляет некоторую точку, гарантированно располагающуюся на плоскости данного объекта.
Свойство PointOnPlane представляет некоторую точку, гарантированно располагающуюся на плоскости данного объекта.
Returns: Возвращает некоторую точку, гарантированно лежащую в плоскости данного объекта.
Тип Point3d.