Teigha.Geometry.SurfaceSurfaceIntersectorConfiguration
Перечисление SurfaceSurfaceIntersectorConfiguration определяет конфигурации окрестности поверхности, расположенной слева или справа от кривой пересечения двух поверхностей, по отношению к второй поверхности.
Перечисление SurfaceSurfaceIntersectorConfiguration определяет конфигурации окрестности поверхности, расположенной слева или справа от кривой пересечения двух поверхностей, по отношению к второй поверхности.
Положение "внутри" или "снаружи" означает, что окрестность находится с внутренней или с наружной стороны второй поверхности, что определяется ориентацией вектора нормали второй поверхности.
Положение окрестности поверхности слева и справа от кривой на поверхности определяется с учетом ориентации вектора нормали поверхности и направления параметризации кривой.