Teigha.BoundaryRepresentation.Mesh2dElement2dEnumerator
Класс Mesh2dElement2dEnumerator представляет перечислитель объектов Element2d двумерной сети Mesh2d.
Класс Mesh2dElement2dEnumerator представляет перечислитель объектов Element2d двумерной сети Mesh2d.

Teigha.BoundaryRepresentation.Mesh2dElement2dEnumerator.Current
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип Element2d.