Teigha.Geometry.NurbSurface
Класс NurbSurface представляет параметрические NURBS поверхности.
Класс NurbSurface представляет параметрические NURBS поверхности.

Teigha.Geometry.NurbSurface.#ctor
Конструктор по умолчанию класса NurbSurface.
Создает пустой объект без каких-либо фактических данных.
Конструктор по умолчанию класса NurbSurface.
Создает пустой объект без каких-либо фактических данных, который пригоден для использования только в качестве заглушки.

Teigha.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Конструктор класса NurbSurface.
Создает экземпляр класса с указанными параметрами, используя геометрическую точность по умолчанию.
Конструктор класса NurbSurface.
Создает экземпляр NURBS поверхности с указанными параметрами.
Используется вызов NurbSurface.NurbSurface(int degreeU, int degreeV, int propsInU, int propertiesInV, int numberControlPointsInU, int numberControlPointsInV, ref Point3dCollection controlPoints, ref DoubleCollection weights, ref KnotCollection knotsInU, ref KnotCollection knotsInV, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
degreeU: Степень сплайна в направлении U. Тип int.
degreeV: Степень сплайна в направлении V. Тип int.
propsInU: Свойства поверхности в направлении U (используются значения NurbSurfaceProperties). Тип int.
propertiesInV: Свойства поверхности в направлении V (используются значения NurbSurfaceProperties). Тип int.
numberControlPointsInU: Количество управляющих вершин в направлении U. Тип int.
numberControlPointsInV: Количество управляющих вершин в направлении V. Тип int.
controlPoints: Массив управляющих вершин. Тип Point3dCollection.
weights: Массив весов. Тип DoubleCollection.
knotsInU: Узловой вектор в направлении U. Тип KnotCollection.
knotsInV: Узловой вектор в направлении V. Тип KnotCollection.

Teigha.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.Tolerance)
Конструктор класса NurbSurface.
Создает экземпляр класса с указанными параметрами, используя заданную геометрическую точность.
Конструктор класса NurbSurface.
Создает экземпляр NURBS поверхности с указанными параметрами, используя заданную геометрическую точность.
degreeU: Степень сплайна в направлении U. Тип int.
degreeV: Степень сплайна в направлении V. Тип int.
propsInU: Свойства поверхности в направлении U (используются значения NurbSurfaceProperties). Тип int.
propertiesInV: Свойства поверхности в направлении V (используются значения NurbSurfaceProperties). Тип int.
numberControlPointsInU: Количество управляющих вершин в направлении U. Тип int.
numberControlPointsInV: Количество управляющих вершин в направлении V. Тип int.
controlPoints: Массив управляющих вершин. Тип Point3dCollection.
weights: Массив весов. Тип DoubleCollection.
knotsInU: Узловой вектор в направлении U. Тип KnotCollection.
knotsInV: Узловой вектор в направлении V. Тип KnotCollection.
tolerance: Заданная геометрическая точность. Тип Tolerance.

Teigha.Geometry.NurbSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип NurbSurface.

Teigha.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Метод позволяет переопределить указанные параметры данной NURBS поверхности, используя геометрическую точность по умолчанию.
Метод позволяет переопределить указанные параметры данной NURBS поверхности.
Используется вызов метода
Set(int degreeU, int degreeV, int propsInU, int propsInV, int numControlPointsInU, int numControlPointsInV, ref Point3dCollection controlPoints, ref DoubleCollection weights, ref KnotCollection knotsInU, ref KnotCollection knotsInV, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
degreeU: Степень сплайна в направлении U. Тип int.
degreeV: Степень сплайна в направлении V. Тип int.
propsInU: Свойства поверхности в направлении U (используются значения NurbSurfaceProperties). Тип int.
propsInV: Свойства поверхности в направлении V (используются значения NurbSurfaceProperties). Тип int.
numControlPointsInU: Количество управляющих вершин в направлении U. Тип int.
numControlPointsInV: Количество управляющих вершин в направлении V. Тип int.
controlPoints: Массив управляющих вершин. Тип Point3dCollection.
weights: Массив весов. Тип DoubleCollection.
knotsInU: Узловой вектор в направлении U. Тип KnotCollection.
knotsInV: Узловой вектор в направлении V. Тип KnotCollection.

Teigha.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.Tolerance)
Метод позволяет переопределить указанные параметры данной NURBS поверхности, используя заданную геометрическую точность.
Метод позволяет переопределить указанные параметры данной NURBS поверхности, используя заданную геометрическую точность.
degreeU: Степень сплайна в направлении U. Тип int.
degreeV: Степень сплайна в направлении V. Тип int.
propsInU: Свойства поверхности в направлении U (используются значения NurbSurfaceProperties). Тип int.
propsInV: Свойства поверхности в направлении V (используются значения NurbSurfaceProperties). Тип int.
numControlPointsInU: Количество управляющих вершин в направлении U. Тип int.
numControlPointsInV: Количество управляющих вершин в направлении V. Тип int.
controlPoints: Массив управляющих вершин. Тип Point3dCollection.
weights: Массив весов. Тип DoubleCollection.
knotsInU: Узловой вектор в направлении U. Тип KnotCollection.
knotsInV: Узловой вектор в направлении V. Тип KnotCollection.
tolerance: Заданная геометрическая точность. Тип Tolerance.

Teigha.Geometry.NurbSurface.ControlPoints
Свойство ControlPoints представляет массив управляющих вершин данной NURBS поверхности.
Свойство ControlPoints представляет массив управляющих вершин данной NURBS поверхности.
Returns: Возвращает массив управляющих вершин сплайна.
Тип Point3dCollection.

Teigha.Geometry.NurbSurface.DegreeInU
Свойство DegreeInU представляет степень сплайна в направлении U.
Свойство DegreeInU представляет степень сплайна в направлении U.
Returns: Возвращает степень сплайна в направлении U.
Тип int.

Teigha.Geometry.NurbSurface.DegreeInV
Свойство DegreeInV представляет степень сплайна в направлении V.
Свойство DegreeInV представляет степень сплайна в направлении V.
Returns: Возвращает степень сплайна в направлении V.
Тип int.

Teigha.Geometry.NurbSurface.IsPeriodicInU
Свойство IsPeriodicInU позволяет проверить, является ли данная поверхность периодической в направлении U.
Свойство IsPeriodicInU позволяет проверить, является ли данная поверхность периодической в направлении U.
Returns: Возвращает true, если поверхность является периодической в направлении U.
В противном случае возвращает false.

Teigha.Geometry.NurbSurface.IsPeriodicInV
Свойство IsPeriodicInV позволяет проверить, является ли данная поверхность периодической в направлении V.
Свойство IsPeriodicInV позволяет проверить, является ли данная поверхность периодической в направлении V.
Returns: Возвращает true, если поверхность является периодической в направлении V.
В противном случае возвращает false.

Teigha.Geometry.NurbSurface.IsRationalInU
Свойство IsRationalInU позволяет проверить, является ли данная поверхность рациональной в направлении U.
Свойство IsRationalInU позволяет проверить, является ли данная поверхность рациональной в направлении U.
Returns: Возвращает true, если поверхность является рациональной в направлении U.
В противном случае возвращает false.

Teigha.Geometry.NurbSurface.IsRationalInV
Свойство IsRationalInV позволяет проверить, является ли данная поверхность рациональной в направлении V.
Свойство IsRationalInV позволяет проверить, является ли данная поверхность рациональной в направлении V.
Returns: Возвращает true, если поверхность является рациональной в направлении V.
В противном случае возвращает false.

Teigha.Geometry.NurbSurface.NumControlPointsInU
Свойство NumControlPointsInU представляет количество управляющих вершин в направлении U.
Свойство NumControlPointsInU представляет количество управляющих вершин в направлении U.
Returns: Возвращает количество управляющих вершин в направлении U.
Тип int.

Teigha.Geometry.NurbSurface.NumControlPointsInV
Свойство NumControlPointsInV представляет количество управляющих вершин в направлении V.
Свойство NumControlPointsInV представляет количество управляющих вершин в направлении V.
Returns: Возвращает количество управляющих вершин в направлении V.
Тип int.

Teigha.Geometry.NurbSurface.NumKnotsInU
Свойство NumKnotsInU представляет количество управляющих вершин в направлении U.
Свойство NumKnotsInU представляет количество управляющих вершин в направлении U.
Returns: Возвращает количество управляющих вершин в направлении U.
Тип int.

Teigha.Geometry.NurbSurface.NumKnotsInV
Свойство NumKnotsInV представляет количество управляющих вершин в направлении V.
Свойство NumKnotsInV представляет количество управляющих вершин в направлении V.
Returns: Возвращает количество управляющих вершин в направлении V.
Тип int.

Teigha.Geometry.NurbSurface.PeriodicInU
Свойство PeriodicInU представляет период в направлении U, если данная NURBS поверхность является периодической в направлении U.
Свойство PeriodicInU представляет период в направлении U, если данная NURBS поверхность является периодической в направлении U.
Returns: Возвращает период в направлении U.
Тип double.

Teigha.Geometry.NurbSurface.PeriodicInV
Свойство PeriodicInV представляет период в направлении V, если данная NURBS поверхность является периодической в направлении V.
Свойство PeriodicInV представляет период в направлении V, если данная NURBS поверхность является периодической в направлении V.
Returns: Возвращает период в направлении V.
Тип double.

Teigha.Geometry.NurbSurface.SingularityInU
Свойство SingularityInU представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении U.
Свойство SingularityInU представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении U.
Returns: Возвращает значение NurbSurfaceProperties, являющееся характеристикой сингулярности поверхности в направлении U.
Тип int.

Teigha.Geometry.NurbSurface.SingularityInV
Свойство SingularityInV представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении V.
Свойство SingularityInV представляет одно из значений NurbSurfaceProperties, которое является характеристикой сингулярности поверхности в направлении V.
Returns: Возвращает значение NurbSurfaceProperties, являющееся характеристикой сингулярности поверхности в направлении V.
Тип int.

Teigha.Geometry.NurbSurface.UKnots
Свойство UKnots представляет узловой вектор в направлении U для данной поверхности.
Свойство UKnots представляет узловой вектор в направлении U для данной поверхности.
Returns: Возвращает узловой вектор в направлении U.
Тип KnotCollection.

Teigha.Geometry.NurbSurface.VKnots
Свойство VKnots представляет узловой вектор в направлении V для данной поверхности.
Свойство VKnots представляет узловой вектор в направлении V для данной поверхности.
Returns: Возвращает узловой вектор в направлении V.
Тип KnotCollection.

Teigha.Geometry.NurbSurface.Weights
Свойство Weights представляет массив весов.
Свойство Weights представляет массив весов.
Returns: Возвращает массив весов.
Тип DoubleCollection.