Teigha.DatabaseServices.ObjectEventArgs
Класс представляет данные для различных событий в базе данных, связанных с объектами.
Класс представляет данные для различных событий в базе данных, связанных с объектами.

Teigha.DatabaseServices.ObjectEventArgs.DBObject
Свойство представляет измененный объект, с которым связано событие.
Свойство представляет измененный объект, с которым связано событие.
Returns: Возвращает объект в базе данных. Тип DBObject.