HostMgd.EditorInput.Editor.PauseToken
Поле представляет строковый маркер, используемый для приостановки
выполнения команды в методе RunCommand() с целью ожидания
пользовательского ввода.
PauseToken — это константа типа string, которая по умолчанию определена как обратный слеш ("\\).
Она может быть передана в метод RunCommand() для вставки паузы в выполнение команды,
что позволяет приостановить выполнение и ожидать интерактивного ввода пользователя.