Teigha.DatabaseServices.ObjectContextCollection.GetEnumerator
Метод предоставляет перечислитель ObjectContextCollectionEnumerator  для данной коллекции.
Метод предоставляет перечислитель ObjectContextCollectionEnumerator для данной коллекции.
Returns: Возвращает перечислитель данной коллекции.  Тип ObjectContextCollectionEnumerator.