Teigha.DatabaseServices.GraphNode
Класс GraphNode реализует базовый объект узла ориентированного графа.
Класс GraphNode реализует базовый объект узла ориентированного графа.
Такой граф представляет собой множество узлов (вершин), двунаправленно связанных между собой ориентированными ребрами.
Связанное с узлом ребро представлено ссылкой (указателем) на узел на противоположном конце ребра.
Ссылки в узле (ребра графа) делятся на входящие и исходящие. Каждой входящей ссылке соответствует исходящая ссылка, и наоборот.
Всякий узел GraphNode может иметь неограниченное количество связанных с ним ссылок (ребер), что позволяет реализовать граф произвольной структуры.

Teigha.DatabaseServices.GraphNode.#ctor
Конструктор по умолчанию класса GraphNode.
Конструктор по умолчанию класса GraphNode..

Teigha.DatabaseServices.GraphNode.AddRefTo(Teigha.DatabaseServices.GraphNode)
Метод создаёт в данном объекте GraphNode исходящее ребро (исходящую ссылку) на указанный узел GraphNode.
Метод позволяет создать в данном объекте GraphNode исходящее ребро (исходящую ссылку) на указанный узел outGoingNode. Кроме того, метод создает в узле outGoingNode  входящую ссылку на данный объект GraphNode,
Оба узла должны принадлежать одному объекту Graph, в противном случае генерируется ошибка eInvalidOwnerObject.
Значение outGoingNode не должно равняться null.
outGoingNode: Конечный узел нового ребра.  Тип GraphNode.

Teigha.DatabaseServices.GraphNode.Clear(unsigned char)
Метод предназначен для очистки в данном объекте GraphNode указанных битовых флагов.
Метод предназначен для очистки в данном объекте GraphNode указанных битовых флагов.
Аргумент flags должен представлять собой комбинацию следующих битовых флагов:
Имя бита        Значение    Описание
-------------   ---------   ----------------------------------------------------
kNone           0x00        Значение не задано.
kVisited        0x01        Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
kOutsideRefed   0x02        Используется в процессе отключения внешних ссылок Xref.
kSelected       0x04        Выделение пользователем. Устанавливается в методе GetOutgoing().
kInList         0x08        Присутствует в списке. Устанавливается в методе GetOutgoing().
kListAll        0x0E        Используется для очистки флагов kSelected, kInList, kOutsideRefed.
kFirstLevel     0x10        Узел первого уровня, связан с корневым узлом графа. Только для чтения.
kUnresTree      0x20        Дерево не разрешимо.
kAll            0x2F        Используется для очистки всех флагов, кроме kFirstLevel.
flags: Комбинация битовых флагов для очистки.  Тип unsigned char.

Teigha.DatabaseServices.GraphNode.CycleIn(System.Int32)
Метод возвращает указанную по индексу входящую циклическую ссылку этого объекта GraphNode.
Метод возвращает указанную по индексу входящую циклическую ссылку этого объекта GraphNode.
Результат будет действительным только при условии, что с момента последнего вызова метода Graph.FindCycles(), используемого для обнаружения циклов, граф не претерпевал каких-либо промежуточных изменений.
index: Входной индекс циклической ссылки. Тип int.
Returns: Возвращает  входящую циклическую ссылку. Тип GraphNode.
Если указанный индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.CycleOut(System.Int32)
Метод возвращает указанную по индексу исходящую циклическую ссылку этого объекта GraphNode.
Метод возвращает указанную по индексу исходящую циклическую ссылку этого объекта GraphNode.
Результат будет действительным только при условии, что с момента последнего вызова метода Graph.FindCycles(), используемого для обнаружения циклов, граф не претерпевал каких-либо промежуточных изменений.
index: Индекс циклической ссылки. Тип int.
Returns: Возвращает исходящую циклическую ссылку. Тип GraphNode.
Если указанный индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.In(System.Int32)
Метод позволяет получить указанную по индексу входящую ссылку данного узла GraphNode.
Метод позволяет получить указанную по индексу входящую ссылку данного узла GraphNode.
index: Индекс искомой ссылки. Тип int.
Returns: Возвращает входящую ссылку данного узла. Тип GraphNode.
Если индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.IsMarkedAs(System.Int32)
Метод позволяет проверить, что все указанные битовые флаги в этом объекте GraphNode установлены.
Метод позволяет проверить, что все указанные битовые флаги в этом объекте GraphNode установлены.
Аргумент flag должен представлять собой комбинацию следующих битовых флагов:
Имя бита        Значение    Описание
-------------   ---------   ----------------------------------------------------
kNone           0x00        Значение не задано.
kVisited        0x01        Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
kOutsideRefed   0x02        Используется в процессе отключения внешних ссылок Xref.
kSelected       0x04        Выделение пользователем. Устанавливается в методе GetOutgoing().
kInList         0x08        Присутствует в списке. Устанавливается в методе GetOutgoing().
kListAll        0x0E        Используется для очистки флагов kSelected, kInList, kOutsideRefed.
kFirstLevel     0x10        Узел первого уровня, связан с корневым узлом графа. Только для чтения.
kUnresTree      0x20        Дерево не разрешимо.
kAll            0x2F        Используется для очистки всех флагов, кроме kFirstLevel.
flag: Битовые флаги. Тип int.
Returns: Возвращает true, только если  в этом объекте GraphNode установлены все указанные битовые флаги.
В противном случае возвращает false.

Teigha.DatabaseServices.GraphNode.MarkAs(unsigned char)
Метод позволяет установить набор указанных битовых флагов в данном объекте GraphNode.
Метод позволяет установить набор указанных битовых флагов в данном объекте GraphNode.
Аргумент flags должен представлять собой комбинацию следующих битовых флагов:
Имя бита        Значение    Описание
-------------   ---------   ----------------------------------------------------
kNone           0x00        Значение не задано.
kVisited        0x01        Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
kOutsideRefed   0x02        Используется в процессе отключения внешних ссылок Xref.
kSelected       0x04        Выделение пользователем. Устанавливается в методе GetOutgoing().
kInList         0x08        Присутствует в списке. Устанавливается в методе GetOutgoing().
kListAll        0x0E        Используется для очистки флагов kSelected, kInList, kOutsideRefed.
kFirstLevel     0x10        Узел первого уровня, связан с корневым узлом графа. Только для чтения.
kUnresTree      0x20        Дерево не разрешимо.
kAll            0x2F        Используется для очистки всех флагов, кроме kFirstLevel.
flags: Битовые флаги. Тип unsigned char.

Teigha.DatabaseServices.GraphNode.MarkTree(unsigned char,Teigha.DatabaseServices.GraphNodeCollection)
Метод позволяет установить указанные флаги в данном узле GraphNode и во всех его вложенных исходящих узлах GraphNode.
Метод позволяет установить указанные флаги в данном узле GraphNode и во всех его вложенных исходящих узлах GraphNode.
Если задан ненулевой аргумент appendedTo, в эту коллекцию добавляется сам данный узел и все его вложенные исходящие узлы.
Если при прохождении ветви узлов метод обнаруживает, что в некотором узле указанные флаги уже установлены, обход данной ветви узлов на этом прекращается.
Ответственность за сброс флагов лежит на пользователе. Для этого после завершения работы с флагами он должен вызвать метод Graph.ClearAll() или метод GraphNode.Clear().
Аргумент flags должен представлять собой комбинацию следующих битовых флагов:
Имя бита        Значение    Описание
-------------   ---------   ----------------------------------------------------
kNone           0x00        Значение не задано.
kVisited        0x01        Используется внутренним механизмом метода FindCycles() и в процессе обхода циклического графа.
kOutsideRefed   0x02        Используется в процессе отключения внешних ссылок Xref.
kSelected       0x04        Выделение пользователем. Устанавливается в методе GetOutgoing().
kInList         0x08        Присутствует в списке. Устанавливается в методе GetOutgoing().
kListAll        0x0E        Используется для очистки флагов kSelected, kInList, kOutsideRefed.
kFirstLevel     0x10        Узел первого уровня, связан с корневым узлом графа. Только для чтения.
kUnresTree      0x20        Дерево не разрешимо.
kAll            0x2F        Используется для очистки всех флагов, кроме kFirstLevel.
flags: Входные значения битовых флагов, которые должны быть установлены. Тип unsigned char.
appendedTo: Входная коллекция, в которую опционально должны быть добавлены данный узел и все его вложенные исходящие узлы.

Teigha.DatabaseServices.GraphNode.Out(System.Int32)
Метод позволяет получить указанную по индексу исходящую ссылку данного узла GraphNode.
Метод позволяет получить указанную по индексу исходящую ссылку данного узла GraphNode.
index: Индекс искомой ссылки. Тип int.
Returns: Возвращает исходящую ссылку данного узла. Тип GraphNode.
Если индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.RemoveRefTo(Teigha.DatabaseServices.GraphNode)
Метод предназначен для удаления в данном узле исходящей ссылки на указанный объект GraphNode.
Метод предназначен для удаления в данном узле исходящей ссылки на указанный узел nodeToRemoveReference.
Метод также удаляет в узле nodeToRemoveReference входящую ссылку на данный узел.
Узел nodeToRemoveReference должен быть частью того же графа, что и данный объект GraphNode, в противном случае генерируется ошибка eInvalidOwnerObject.
nodeToRemoveReference: Удаляемая исходящая ссылка. Тип GraphNode.

Teigha.DatabaseServices.GraphNode.SetEdgeGrowthRate(System.Int32,System.Int32)
Метод позволяет задать количество исходящих и входящих ребер, под которые одновременно резервируется память на узле графа.
Метод позволяет задать количество исходящих и входящих ребер, под которые одновременно резервируется память на узле графа.
Значения по умолчанию равны 4 и 2, соответственно.
При большом количестве рёбер имеет смысл увеличить эти значения, что повышает производительность ценой выделения дополнительной памяти.
outEdgeRate: Количество исходящих ребер, под которые одновременно выделяется память.
inEdgeRate: Количество входящих ребер, под которые одновременно выделяется память.

Teigha.DatabaseServices.GraphNode.Data
Свойство предоставляет доступ к данным, которые связаны с данным узлом графа.
Свойство предоставляет доступ к данным, которые связаны с данным узлом графа.
Returns: Возвращает указатель на данные. Тип IntPtr.

Teigha.DatabaseServices.GraphNode.IsCycleNode
Свойство позволяет определить, является ли данный узел графа частью циклической ссылки, т.е. узлом цикла.
Свойство позволяет определить, является ли данный узел графа частью циклической ссылки, т.е. узлом цикла.
Returns: Возвращает true, если данный узел является частью цикла.
В противном случае возвращает false.

Teigha.DatabaseServices.GraphNode.NextCycleNode
Свойство возвращает следующую исходящую циклическую ссылку данного узла.
Свойство возвращает следующую исходящую циклическую ссылку данного узла.
Тот же результат дает вызов CycleOut(0).
Returns: Возвращает следующую исходящую циклическую ссылку данного узла. Тип GraphNode.

Teigha.DatabaseServices.GraphNode.NumCycleIn
Свойство возвращает количество входящих циклических ссылок в данном узле графа.
Свойство возвращает количество входящих циклических ссылок в данном узле графа.
Returns: Возвращает количество входящих циклических ссылок. Тип int.

Teigha.DatabaseServices.GraphNode.NumCycleOut
Свойство возвращает количество исходящих циклических ссылок в данном узле графа.
Свойство возвращает количество исходящих циклических ссылок в данном узле графа.
Returns: Возвращает количество исходящих циклических ссылок. Тип int.

Teigha.DatabaseServices.GraphNode.NumIn
Свойство возвращает количество входящих ссылок в данном узле.
Свойство возвращает количество входящих ссылок в данном узле.
Returns: Возвращает количество входящих ссылок. Тип int.

Teigha.DatabaseServices.GraphNode.NumOut
Свойство возвращает количество исходящих ссылок в данном узле.
Свойство возвращает количество исходящих ссылок в данном узле.
Returns: Возвращает количество исходящих ссылок. Тип int.

Teigha.DatabaseServices.GraphNode.Owner
Свойство возвращает объект Graph, которому принадлежит данный узел.
Свойство возвращает объект Graph, которому принадлежит данный узел.
Returns: Возвращает владельца данного узла.  Тип Graph.