Teigha.Geometry.Point2d
Данный класс представляет геометрические точки в 2D-пространстве.
Данный класс представляет геометрические точки в 2D-пространстве.

Teigha.Geometry.Point2d.#ctor(System.Double,System.Double)
Конструктор.  Создает новый объект Point2d с указанными координатами x и y.
Конструктор.  Создает новый объект Point2d с указанными координатами x и y.
x: X-координата новой точки. Тип double.
y: Y-координата новой точки. Тип double.

Teigha.Geometry.Point2d.#ctor(array)
Конструктор. Создает новый объект Point2d с координатами из двух первых элементов входного массива.
Конструктор. Создает новый объект Point2d с координатами из двух первых элементов входного массива.
xy: Массив координат. Тип double[].

Teigha.Geometry.Point2d.Add(Teigha.Geometry.Vector2d)
Метод формирует новую точку, которая получена трансляцией данной точки на заданный 2D-вектор.
Метод формирует новую точку, которая получена трансляцией данной 2D-точки на заданный 2D-вектор value.
value: Входной вектор. Тип Vector2d.
Returns: Возвращает точку Point2d.

Teigha.Geometry.Point2d.DivideBy(System.Double)
Метод создает новую точку, координаты которой получены делением координат данной точки на указанное значение.
Метод создает новую точку, координаты которой получены делением координат данной точки на заданное значение value.
value: Значение, используемое для вычисления новых координат. Тип double.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d.Equals(Object)
Метод выполняет проверку на равенство данной точки и указанного объекта.
Метод выполняет проверку на равенство данной точки и указанного объекта.
В случае равенства возвращает true.
obj: Входной объект для сравнения.  Тип Object.
Returns: Возвращает true, если obj не равен нулю и имеет те же координаты, что и данная точка.

Teigha.Geometry.Point2d.GetDistanceTo(Teigha.Geometry.Point2d)
Метод вычисляет расстояние между этой и указанной точками.
Метод вычисляет расстояние от этой точки до точки point.
point: Входная 2D-точка, до которой измеряется расстояние. Тип Point2d.
Returns: Возвращает расстояние между точками. Тип double.

Teigha.Geometry.Point2d.GetVectorTo(Teigha.Geometry.Point2d)
Метод строит вектор от данной точки до указанной.
Метод создает вектор, началом которого служит данная точка, а концом - входная точка point.
point: 2D-точка, до которой требуется построить вектор. Тип Point2d.
Returns: Возвращает двумерный вектор, соединяющий данную точку с точкой point.  Тип Vector2d.

Teigha.Geometry.Point2d.IsEqualTo(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод проверяет совпадение точек в пределах указанного допуска.
a: Точка, с которой проверяется совпадение. Тип Point2d.
tolerance: Допуск. Тип Tolerance.
Returns: Возвращает true, если расстояние между точками не превышает величину Tolerance.EqualPoint(). В противном случае возвращает false.

Teigha.Geometry.Point2d.IsEqualTo(Teigha.Geometry.Point2d)
Метод проверяет совпадение 2D-точек.
Метод позволяет проверить, что указанная точка a совпадает с данной точкой.
Реализация метода использует вызов Point2d.IsEqualTo(Point2d a, Tolerance tolerance) с допуском, равным Tolerance.Global.
a: Точка, с которой проверяется совпадение. Тип Point2d.
Returns: Возвращает true, если точки совпадают; в противном случае возвращает false.

Teigha.Geometry.Point2d.Mirror(Teigha.Geometry.Line2d)
Метод создает новую 2D-точку как зеркальное отражение данной точки относительно указанной оси, располагающейся в той же плоскости.
Метод возвращает 2D-точку, которая является результатом зеркального отражения данной точки относительно линии line, располагающейся в той же плоскости.
line: Входная ось симметрии. Тип Line2d.
Returns: Возвращает 2D-точку, которая является результатом зеркального отражения этой точки относительно линии line. Тип Point2d.

Teigha.Geometry.Point2d.MultiplyBy(System.Double)
Метод умножает координаты данной точки на заданное значение.
Метод возвращает 2D-точку, координаты которой получены умножением координат этой точки на значение value.
value: Входной множитель. Тип double.
Returns: Возвращает 2D-точку, координаты которой получены умножением координат этой точки на значение value.  Тип Point2d.

Teigha.Geometry.Point2d.RotateBy(System.Double,Teigha.Geometry.Point2d)
Метод выполняет вращение этой точки вокруг заданного центра на заданный угол.
Метод строит 2D-точку, которая является результатом вращения этой точки вокруг центра вращения origin.
Угол поворота задается аргументом angle. Положительным направлением вращения считается поворот от оси X к оси Y.
angle: Угол поворота в радианах. Тип double.
origin: Входная точка, которая служит центром вращения. Тип Point2d.
Returns: Возвращает 2D-точку, являющуюся результатом указанного вращения. Тип Point2d.

Teigha.Geometry.Point2d.ScaleBy(System.Double,Teigha.Geometry.Point2d)
Метод позволяет получить двумерную точку, которая является результатом масштабирования данной точки относительно заданного центра с заданным масштабным коэффициентом.
Метод позволяет получить двумерную точку, которая является результатом масштабирования данной точки относительно заданного центра с заданным масштабным коэффициентом.
scaleFactor: Входной масштабный множитель. Тип double.
origin: Центр масштабирования. Тип Point2d.
Returns: Возвращает 2D-точку, являющуюся результатом операции масштабирования.  Тип Point2d.

Teigha.Geometry.Point2d.Subtract(Teigha.Geometry.Vector2d)
Метод позволяет получить точку, координаты которой определяются разностью координат данной точки и соответствующих компонент заданного вектора.
Метод позволяет получить точку, координаты которой определяются разностью координат данной точки и соответствующих компонент вектора value.
value: Вычитаемое значение.  Тип Vector2d.
Returns: Возвращает точку Point2d, которая является результатом вычитания.

Teigha.Geometry.Point2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Geometry.Point2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате format и с учетом языковых и региональных настроек, заданных провайдером provider.
format: Формат строки. Тип String.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде форматированной строки. Тип String.

Teigha.Geometry.Point2d.TransformBy(Teigha.Geometry.Matrix2d)
Метод применяет к данной точке указанное геометрическое преобразование и возвращает точку в новых координатах.
Метод применяет к данной точке геометрическое преобразование, представленное матрицей leftSide, и возвращает точку в новых координатах.
leftSide: Матрица геометрического преобразования. Тип Matrix2d.
Returns: Возвращает 2D-точку как результат геометрического преобразования leftSide текущих координат данной точки. Тип Point2d.

Teigha.Geometry.Point2d.!=(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Оператор неравенства класса Point2d. Возвращает true в случае несовпадения координат сравниваемых точек.
Оператор неравенства класса Point2d. Возвращает true в случае несовпадения координат сравниваемых точек.
a: Левый операнд.  Тип Point2d.
b: Правый операнд. Тип Point2d.
Returns: Возвращает true в случае несовпадения координат сравниваемых точек, иначе - false.

Teigha.Geometry.Point2d.==(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Оператор равенства класса Point2d.
Оператор равенства класса Point2d. Возвращает true в случае совпадения координат сравниваемых точек.
a: Левый операнд.  Тип Point2d.
b: Правый операнд. Тип Point2d.
Returns: Возвращает true в случае совпадения координат сравниваемых точек, иначе - false.

Teigha.Geometry.Point2d.+(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Оператор сложения класса Point2d.  Реализует сложение координат заданной точки с соответствующими компонентами заданного 2D-вектора.
Оператор сложения класса Point2d.  Реализует сложение координат точки a с соответствующими компонентами 2D-вектора vector, что эквивалентно перемещению точки a на заданный вектор.
a: Левый операнд.  Тип Point2d.
vector: Правый операнд. Тип Vector2d.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d.-(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Оператор вычитания класса Point2d. Реализует вычитание координат точки b из координат точки a.
Оператор вычитания класса Point2d. Реализует вычитание координат точки b из координат точки a.
Результатом является 2D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b.
a: Левый операнд.  Тип Point2d.
b: Правый операнд. Тип Point2d.
Returns: Возвращает 2D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b. Тип Vector2d.

Teigha.Geometry.Point2d.-(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Оператор вычитания класса Point2d. Реализует вычитание компонент 2D-вектора b из координат точки a.
Оператор вычитания класса Point2d. Реализует вычитание компонент 2D-вектора b из координат точки a, что означает перемещение точки на вектор, обратный вектору b.
a: Левый операнд.  Тип Point2d.
b: Правый операнд. Тип Vector2d.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d.*(Teigha.Geometry.Matrix2d,Teigha.Geometry.Point2d)
Оператор умножения класса Point2d. Реализует преобразование координат этой точки матрицей mat.
Оператор умножения класса Point2d. Реализует преобразование координат точки a матрицей mat.
mat: Левый операнд.  Тип Matrix2d.
a: Правый операнд. Тип Point2d.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d.*(Teigha.Geometry.Point2d,System.Double)
Оператор умножения класса Point2d. Реализует умножение координат точки на вещественный множитель.
Оператор умножения класса Point2d. Реализует умножение координат точки a на вещественный множитель value.
a: Левый операнд.  Тип Point2d.
value: Правый операнд. Тип double.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d.*(System.Double,Teigha.Geometry.Point2d)
Оператор умножения класса Point2d. Реализует умножение координат точки на вещественный множитель.
Оператор умножения класса Point2d. Реализует умножение координат точки a на вещественный множитель value.
value: Левый операнд.  Тип double.
a: Правый операнд. Тип Point2d.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d./(Teigha.Geometry.Point2d,System.Double)
Оператор деления класса Point2d. Реализует деление координат заданной точки на вещественный множитель.
Оператор деления класса Point2d. Реализует деление координат точки a на вещественный множитель value.
a: Левый операнд.  Тип Point2d.
value: Правый операнд. Тип double.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d.Coordinate
Свойство предоставляет доступ к координатам точки.
Свойство предоставляет доступ к координатам точки.
index: Индекс координаты; тип int. 0 – координата X, 1 – координата Y.
Returns: Возвращает значение координаты. Тип double

Teigha.Geometry.Point2d.Origin
Свойство возвращает начало координат 2D-пространства данной точки.
Свойство возвращает начало координат 2D-пространства данной точки.
Returns: Возвращает точку начала координат. Тип Point2d.

Teigha.Geometry.Point2d.X
Свойство, представляющее координату X данной точки.
Свойство, представляющее координату X данной точки.
Returns: Возвращает координату X данной точки.Тип double.

Teigha.Geometry.Point2d.Y
Свойство, представляющее координату Y данной точки.
Свойство, представляющее координату Y данной точки.
Returns: Возвращает координату Y данной точки.Тип double.