Teigha.Runtime.ProgressMeter
Класс ProgressMeter является базовым классом для измерителей прогресса, специфичных для платформы nanoCAD.
Класс ProgressMeter является базовым классом для измерителей прогресса, специфичных для платформы nanoCAD.
Notes
Этот класс получает уведомления о прогрессе во время выполнения различных операций с базой данных, таких как загрузка или сохранение файла.  Порядок вызова методов экземпляра этого класса всегда имеет следующий вид:
1. SetLimit (вызывается один раз).
2. Start (вызывается один раз).
3. MeterProgress (вызывается многократно).
4. Stop (вызывается один раз).

Teigha.Runtime.ProgressMeter.#ctor
Конструктор по умолчанию класса ProgressMeter.
Конструктор по умолчанию класса ProgressMeter.

Teigha.Runtime.ProgressMeter.SetLimit(System.Int32)
Метод позволяет задать максимальное количество вызовов для метода MeterProgress().
Метод позволяет задать максимальное количество вызовов для метода MeterProgress().
max: Верхний предел для количества вызовов MeterProgress().  Тип int.

Teigha.Runtime.ProgressMeter.Start(String)
Метод инициализирует индикатор прогресса начальным значением и делает его видимым.
Дополнительно можно передать строку текста для отображения на индикаторе.
Метод инициализирует индикатор прогресса начальным значением и делает его видимым.
Переданная в метод строка будет отображена на индикаторе.
Notes
Не следует изменять переданную строку displayString после передачи ее в метод Start().
displayString: Входная строка для отображения на индикаторе прогресса.