Teigha.DatabaseServices.ResultBufferEnumerator
Класс ResultBufferEnumerator представляет перечислитель для класса ResultBuffer.
Класс ResultBufferEnumerator представляет перечислитель для класса ResultBuffer.

Teigha.DatabaseServices.ResultBufferEnumerator.Current
Свойство Current представляет текущее типизированное значение данного перечислителя.
Свойство Current представляет текущее типизированное значение данного перечислителя.
Returns: Возвращает текущее типизированное значение. Тип TypedValue.