Teigha.Geometry.Point2dCollection
Класс Point2dCollection представляет коллекцию двумерных точек.
Класс Point2dCollection представляет коллекцию двумерных точек.

Teigha.Geometry.Point2dCollection.#ctor
Конструктор по умолчанию класса Point2dCollection.
Конструктор по умолчанию класса Point2dCollection.
Создает пустую коллекцию с ёмкостью по умолчанию, которая определяется константой Point2dCollection.DefaultSize.

Teigha.Geometry.Point2dCollection.#ctor(System.Int32)
Конструктор класса Point2dCollection.
Создает новую коллекцию с заданной ёмкостью.
Конструктор класса Point2dCollection.
Создает новую коллекцию с заданной ёмкостью capacity.
capacity: Входное значение емкости создаваемой коллекции.

Teigha.Geometry.Point2dCollection.#ctor(array)
Конструктор класса Point2dCollection.
Создает новую коллекцию, заполненную объектами Point2d из указанного массива.
Конструктор класса Point2dCollection.
Создает новую коллекцию, заполненную объектами Point2d из указанного массива values.
values: Входной массив.

Teigha.Geometry.Point2dCollection.Add(Teigha.Geometry.Point2d)
Метод добавляет в коллекцию указанный объект Point2d.
Метод добавляет в коллекцию новый элемент, используя указанный объект Point2d.
p: Входной объект для добавления в коллекцию. Тип Point2d.
Returns: Возвращает количество элементов в коллекции после добавления объекта p.
Тип int.

Teigha.Geometry.Point2dCollection.AddRange(array)
Метод добавляет в коллекцию массив объектов Point2d.
Метод добавляет в коллекцию массив объектов Point2d.
range: Входной массив объектов, которые добавляются в данную коллекцию.

Teigha.Geometry.Point2dCollection.Contains(Teigha.Geometry.Point2d)
Метод позволяет определить, является ли указанный объект Point2d членом данной коллекции.
Метод позволяет определить, является ли указанный объект Point2d членом данной коллекции.
p: Входной проверяемый объект. Тип Point2d.
Returns: Возвращает true, если объект p присутствует в коллекции.
В противном случае возвращает false.

Teigha.Geometry.Point2dCollection.CopyTo(array,System.Int32)
Метод копирует все элементы данной коллекции в указанный одномерный массив.
Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
a: Целевой массив, в который копируются элементы коллекции. Тип Point2d[].
index: Входной индекс в массиве a, начиная с которого в массив копируются элементы коллекции. Тип int.

Teigha.Geometry.Point2dCollection.IndexOf(Teigha.Geometry.Point2d)
Метод определяет индекс конкретного элемента в коллекции, в котором хранится указанный объект Point2d.
Метод определяет индекс конкретного элемента коллекции, в котором хранится указанный объект Point2d.
p: Входной объект.
Returns: Возвращает индекс объекта p в данной коллекции. Тип int. Если объект в коллекции отсутствует, возвращается значение -1.

Teigha.Geometry.Point2dCollection.Insert(System.Int32,Teigha.Geometry.Point2d)
Метод вставляет в коллекцию заданный объект Point2d по указанному индексу.
Метод вставляет в коллекцию заданный объект Point2d по указанному индексу.
Индекс должен иметь допустимое значение.
index: Входной индекс вставленного в коллекцию элемента. Тип int.
p: Входной объект, вставляемый в коллекцию. Тип Point2d.

Teigha.Geometry.Point2dCollection.Remove(Teigha.Geometry.Point2d)
Метод удаляет из коллекции первое вхождение указанного объекта Point2d.
Метод удаляет из коллекции первое вхождение указанного объекта Point2d.
value: Удаляемый из коллекции объект. Тип Point2d.

Teigha.Geometry.Point2dCollection.RemoveAt(System.Int32)
Метод удаляет из данной коллекции элемент с указанным индексом.
Метод удаляет из данной коллекции элемент с указанным индексом.
index: Индекс удаляемого из коллекции элемента. Тип int.

Teigha.Geometry.Point2dCollection.Capacity
Свойство Capacity представляет ёмкость данной коллекции.
Свойство Capacity управляет ёмкостью коллекции, т.е. количеством элементов, которые может содержать данная коллекция.
Returns: Возвращает текущее значение ёмкости данной коллекции.
Тип int.

Teigha.Geometry.Point2dCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет количество элементов, фактически содержащихся в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип Int32.

Teigha.Geometry.Point2dCollection.IsFixedSize
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Returns: Возвращает true, если размер данной коллекции является фиксированным.
В противном случае возвращает false.

Teigha.Geometry.Point2dCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Returns: Возвращает true, если данная коллекция доступна только на чтение.
В противном случае возвращает false.

Teigha.Geometry.Point2dCollection.IsSynchronized
Свойство IsSynchronized позволяет проверить, является ли доступ к коллекции синхронизированным (потокобезопасным).
Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции синхронизированным (потокобезопасным).
Returns: Возвращает true, если доступ к данной коллекции является синхронизированным.
В противном случае возвращает false.

Teigha.Geometry.Point2dCollection.Item
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
index: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип Point2d.

Teigha.Geometry.Point2dCollection.SyncRoot
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Returns: Возвращает объект для синхронизации доступа к коллекции.
Тип Object.