Teigha.Geometry.Matrix2d.ToString
Метод позволяет получить эквивалентное строковое представление данной матрицы.
Метод позволяет получить эквивалентное строковое представление данной матрицы.
Returns: Возвращает эквивалентное строковое представление данной матрицы.
Тип String.