Teigha.DatabaseServices.AttributeReference
Класс AttributeReference представляет объекты атрибутов в базе данных.
Класс AttributeReference представляет объекты атрибутов в базе данных.
Атрибуты используются вхождениями блоков (объекты BlockReference).

Teigha.DatabaseServices.AttributeReference.#ctor
Конструктор класса по умолчанию.
Конструктор класса по умолчанию.
Инициализирует длину поля равной 0, флаги равны 0 (т.е. атрибут является непостоянным, видимым, неустановленным и не контролируемым), длина тега равна 0. Кроме того, выполняются все инициализации по умолчанию нового объекта DBText.

Teigha.DatabaseServices.AttributeReference.#ctor(Teigha.Geometry.Point3d,String,String,DatabaseServices.ObjectId)
Конструктор класса. Создает новый экземпляр класса с заданными параметрами.
Конструктор класса. Создает новый экземпляр класса с заданными параметрами (положение, значение, тег и стиль).
position: Относительное положение атрибута в экземпляре блока. Тип Point3d.
value: Значение атрибута в экземпляре блока. Тип String.
tag: Тег атрибута в экземпляре блока. Тип String.
style: Стиль атрибута в экземпляре блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AttributeReference.SetAttributeFromBlock(Teigha.DatabaseServices.AttributeDefinition,Teigha.Geometry.Matrix3d)
Метод позволяет сформировать свойства атрибута, используя указанный объект определения атрибута, и применить входное геометрическое преобразование для обеспечения требуемого положения, размера и наклона.
Метод позволяет сначала сформировать свойства атрибута, используя указанный объект определения атрибута, а затем применить входное геометрическое преобразование для обеспечения требуемого положения, размера и наклона (как это было бы сделано с помощью команды INSERT).
definition: Входное определения атрибута, используемое в качестве шаблона. Тип AttributeDefinition.
blockTransform: Входная матрица геометрического преобразования блока. Тип Matrix3d.

Teigha.DatabaseServices.AttributeReference.SetAttributeFromBlock(Teigha.Geometry.Matrix3d)
Метод применяет указанное геометрическое преобразование к геометрическим данным атрибута для получения требуемого положения, размера и наклона, как это было бы сделано с помощью команды INSERT.
Метод применяет указанное геометрическое преобразование blockTransform к геометрическим данным этого атрибута для получения требуемого положения, размера и наклона, как это было бы сделано с помощью команды INSERT. Остальные свойства атрибута не затрагиваются.
blockTransform: Входная матрица геометрического преобразования блока. Тип Matrix3d.

Teigha.DatabaseServices.AttributeReference.FieldLength
Свойство позволяет получить или задать длину поля данного объекта AttributeReference.
Свойство позволяет получить или задать длину поля данного объекта AttributeReference.
Returns: Возвращает длину поля атрибута. Тип int.

Teigha.DatabaseServices.AttributeReference.Invisible
Свойство позволяет получить или установить флаг видимости объекта AttributeReference.
Свойство позволяет получить или установить флаг видимости объекта AttributeReference.
Returns: Возвращает true, если  атрибут является видимым.  В противном случае возвращает false.

Teigha.DatabaseServices.AttributeReference.IsConstant
Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference постоянным.
Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference постоянным.
Returns: Возвращает true, если данный объект AttributeReference является постоянным.
В противном случае возвращает false.

Teigha.DatabaseServices.AttributeReference.IsMTextAttribute
Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference многострочным атрибутом.
Свойство предоставляет доступ к флагу, который определяет, является ли данный объект AttributeReference многострочным атрибутом.
Returns: Возвращает true, если объект AttributeReference является многострочным. В противном случае возвращает false.

Teigha.DatabaseServices.AttributeReference.IsPreset
Свойство предоставляет доступ к флагу, который определяет статус "Установленный" данного объекта AttributeReference.
Свойство предоставляет доступ к флагу, который определяет статус "Установленный" данного объекта AttributeReference.
Returns: Возвращает true, если задан статус "Установленный" (Preset).
В противном случае возвращает false.

Teigha.DatabaseServices.AttributeReference.IsVerifiable
Свойство предоставляет доступ к флагу, который определяет статус "Контролируемый" данного объекта AttributeReference.
Свойство предоставляет доступ к флагу, который определяет статус "Контролируемый" данного объекта AttributeReference.
Returns: Возвращает true, если объекту AttributeReference задан статус "Контролируемый".
В противном случае возвращает false.

Teigha.DatabaseServices.AttributeReference.LockPositionInBlock
Свойство предоставляет доступ к флагу, который определяет фиксированность относительного положения в блоке  объекта AttributeReference.
Свойство предоставляет доступ к флагу, который определяет фиксированность относительного положения в блоке  объекта AttributeReference.
Returns: Возвращает true, если объект AttributeReference не может смещаться относительно геометрии. В противном случае возвращает false.

Teigha.DatabaseServices.AttributeReference.MTextAttribute
Свойство позволяет получить или задать значение объекта MText, который представляет многострочный атрибут.
Свойство позволяет получить или задать значение объекта MText, который представляет многострочный атрибут.
Returns: Возвращает объект MText многострочного атрибута.

Teigha.DatabaseServices.AttributeReference.Tag
Свойство позволяет получить или задать строковое значение тега данного объекта AttributeReference.
Свойство позволяет получить или задать строковое значение тега данного объекта AttributeReference.
Returns: Возвращает строку тега. Тип String.