Teigha.Geometry.Point3d
Этот класс представляет точки (позиции) в трехмерном пространстве.
Этот класс представляет точки (позиции) в трехмерном пространстве.

Teigha.Geometry.Point3d.#ctor(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Point2d)
Конструктор класса Point3d.  Создает 3D-точку в указанной 2D-точке в системе координат заданной плоскости.
Конструктор класса Point3d.
Создает 3D-точку в указанной 2D-точке point в системе координат заданной плоскости plane.
Искомая позиция определяется выражением p + uAxis * pnt2d.x + vAxis * pnt2d.y, где начало координат p и координатные оси uAxis и vAxis возвращает метод plane.GetCoordinateSystem().
plane: Входная плоскость. Тип PlanarEntity.
point: Входная 2D-точка. Тип Point2d.

Teigha.Geometry.Point3d.#ctor(array)
Конструктор класса Point3d.  Создает трехмерную точку с координатами, полученными из первых трех элементов заданного массива.
Конструктор класса Point3d.  Создает трехмерную точку с координатами, полученными из первых трех элементов заданного массива xyz.
xyz: Массив значений типа double, определяющих координаты этой точки. Из переданного массива используются только первые три значения.

Teigha.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Конструктор класса Point3d. Создает трехмерную точку в заданных координатах.
Конструктор класса Point3d. Создает трехмерную точку с координатами x, y и z.
x: X-координата данной точки. Тип double.
y: Y-координата данной точки. Тип double.
z: Z-координата данной точки. Тип double.

Teigha.Geometry.Point3d.Add(Teigha.Geometry.Vector3d)
Метод создает новую точку как результат перемещения данной точки на заданный 3D-вектор.
Метод создает новую точку как результат перемещения данной точки на заданный 3D-вектор value.
value: Входной 3D-вектор. Тип Vector3d.
Returns: Возвращает результирующую точку Point3d.

Teigha.Geometry.Point3d.Convert2d(Teigha.Geometry.PlanarEntity)
Метод преобразует данную 3D-точку в 2D-точку в двумерной системе координат заданного плоского объекта.
Метод преобразует данную 3D-точку в 2D-точку в двумерной системе координат заданного плоского объекта plane.
Если объект plane имеет систему координат с началом p и осями uAxis и vAxis (см. метод PlanarEntity.GetCoordinateSystem()), то искомая 2D-точка определяется вектором (*this - p) в базисе uAxis, vAxis.
Предполагается, что данная 3D-точка принадлежит плоскости объекта plane.
plane: Плоскость, в которой располагается данная 3D-точка. Тип PlanarEntity.
Returns: Возвращает точку Point2d.

Teigha.Geometry.Point3d.DistanceTo(Teigha.Geometry.Point3d)
Метод определяет расстояние между этой и заданной точками.
Метод определяет расстояние от данной точки до заданной 3D-точки point.
point: Входная 3D-точка, до которой измеряется расстояние. Тип Point3d.
Returns: Возвращает расстояние между точками. Тип double.

Teigha.Geometry.Point3d.DivideBy(System.Double)
Метод создает новую точку, координаты которой получены делением координат данной точки на указанное значение.
Метод создает новую точку, координаты которой получены делением координат данной точки на значение value.
value: Значение, используемое в качестве делителя.  Тип double.
Returns: Возвращает точку, полученную в результате операции деления.  Тип Point3d.

Teigha.Geometry.Point3d.Equals(Object)
Метод выполняет проверку на равенство данной точки и указанного объекта.
Метод выполняет проверку на равенство данной точки и указанного объекта.
В случае равенства возвращает true.
obj: Входной объект для сравнения.  Тип Object.
Returns: Возвращает true, если obj не равен нулю и имеет те же координаты, что и данная точка.

Teigha.Geometry.Point3d.GetVectorTo(Teigha.Geometry.Point3d)
Метод строит вектор от данной точки до указанной.
Метод создает вектор, началом которого служит данная точка, а концом - входная точка point.
point: 3D-точка, до которой требуется построить вектор. Тип Point3d.
Returns: Возвращает вектор, соединяющий данную точку с входной точкой point.  Тип Vector3d.

Teigha.Geometry.Point3d.IsEqualTo(Teigha.Geometry.Point3d)
Метод проверяет совпадение 3D-точек.
Метод позволяет проверить, что данная точка совпадает с указанной точкой point.
Реализация метода использует вызов Point3d.IsEqualTo(Point3d point, Tolerance tolerance) с допуском, равным Tolerance.Global.
point: Точка, с которой проверяется совпадение. Тип Point3d.
Returns: Возвращает true, если точки совпадают; в противном случае возвращает false.

Teigha.Geometry.Point3d.IsEqualTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод проверяет совпадение точек в пределах указанного допуска.
Метод позволяет установить, что расстояние между данной точкой и точкой point не превышает значение Tolerance.EqualPoint().
Возвращает true, если условие выполнено. В противном случае возвращает false.
point: Точка, с которой проверяется совпадение. Тип Point3d.
tolerance: Допуск. Тип Tolerance.
Returns: Возвращает true, если расстояние между точками не превышает значение Tolerance.EqualPoint(). В противном случае возвращает false.

Teigha.Geometry.Point3d.Mirror(Teigha.Geometry.Plane)
Метод позволяет получить 3D-точку, которая является зеркальным отражением данной точки относительно заданной плоскости.
Метод позволяет получить 3D-точку, которая является зеркальным отражением данной точки относительно заданной плоскости plane.
plane: Плоскость зеркального отражения. Тип Plane.
Returns: Возвращает 3D-точку, которая является результатом зеркального отражения данной точки относительно заданной плоскости. Тип Point3d.

Teigha.Geometry.Point3d.MultiplyBy(System.Double)
Метод возвращает 3D-точку, координаты которой получены умножением координат данной точки на переданное в метод значение.
Метод возвращает 3D-точку, координаты которой получены умножением координат данной точки на переданное в метод значение value.
value: Множитель для координат точки. Тип double.
Returns: Возвращает 3D-точку в новых координатах.  Тип Point3d.

Teigha.Geometry.Point3d.OrthoProject(Teigha.Geometry.Plane)
Метод создает точку, которая является ортогональной проекцией данной точки на указанную плоскость.
Метод создает точку, которая является ортогональной проекцией данной точки на указанную плоскость plane.
Направление проецирования определяется нормалью к этой плоскости.
plane: Плоскость проецирования. Тип Plane.
Returns: Возвращает точку Point3d, которая является ортогональной проекцией данной точки на плоскость plane.

Teigha.Geometry.Point3d.Project(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d)
Метод создает проекцию данной точки на указанную плоскость вдоль заданного направления.
Метод создает точку, являющуюся проекцией данной точки на плоскость plane в направлении vector.
plane: Плоскость проецирования. Тип Plane.
vector: Вектор, определяющий направление проецирования. Тип Vector3d.
Returns: Возвращает точку Point3d, которая является проекцией данной точки на плоскость plane вдоль заданного направления.

Teigha.Geometry.Point3d.RotateBy(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d)
Метод создает новую точку, которая получается поворотом этой точки вокруг заданной оси на заданный угол.
Метод создает новую точку, которая получается поворотом этой точки вокруг заданной оси на угол angle.
Ось вращения определяется входной точкой и вектором.
angle: Входной угол поворота в радианах. Тип double.
vector: Входной вектор, определяющий направление оси вращения. Тип Vector3d.
centerPoint: Входная точка, через которую проходит ось вращения. Тип Point3d.
Returns: Возвращает точку, являющуюся результатом поворота. Тип Point3d.

Teigha.Geometry.Point3d.ScaleBy(System.Double,Teigha.Geometry.Point3d)
Метод позволяет получить трехмерную точку, которая является результатом масштабирования этой точки с заданным коэффициентом относительно заданного центра.
Метод позволяет получить трехмерную точку, которая является результатом масштабирования этой точки с коэффициентом scaleFactor относительно центра centerPoint.
scaleFactor: Входной масштабный множитель. Тип double.
centerPoint: Центр масштабирования. Тип Point3d.
Returns: Возвращает 3D-точку, являющуюся результатом операции масштабирования.  Тип Point3d.

Teigha.Geometry.Point3d.Subtract(Teigha.Geometry.Vector3d)
Метод позволяет получить точку, координаты которой определяются разностью координат этой точки и соответствующих компонент заданного вектора.
Метод позволяет получить точку, координаты которой определяются разностью координат этой точки и соответствующих компонент вектора value.
value: Вычитаемое значение. Тип Vector3d.
Returns: Возвращает точку Point3d, которая является результатом операции вычитания.

Teigha.Geometry.Point3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Geometry.Point3d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате format и с учетом языковых и региональных настроек, заданных провайдером provider.
format: Формат строки. Тип String.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде форматированной строки. Тип String.

Teigha.Geometry.Point3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод применяет к данной точке указанное геометрическое преобразование и возвращает точку в новых координатах.
Метод применяет к данной точке геометрическое преобразование, представленное матрицей leftSide, и возвращает точку в новых координатах.
leftSide: Матрица геометрического преобразования. Тип Matrix3d.
Returns: Возвращает 3D-точку как результат геометрического преобразования текущих координат данной точки. Тип Point3d.

Teigha.Geometry.Point3d.!=(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Оператор неравенства класса Point3d. Возвращает true в случае несовпадения координат сравниваемых точек.
Оператор неравенства класса Point3d. Возвращает true в случае несовпадения координат сравниваемых точек.
a: Левый операнд.  Тип Point3d.
b: Правый операнд. Тип Point3d.
Returns: Возвращает true в случае несовпадения координат сравниваемых точек, иначе - false.

Teigha.Geometry.Point3d.*(Teigha.Geometry.Matrix3d,Teigha.Geometry.Point3d)
Оператор умножения класса Point3d. Реализует преобразование координат этой точки матрицей mat.
Оператор умножения класса Point3d. Реализует преобразование координат точки a матрицей mat.
mat: Левый операнд.  Тип Matrix3d.
a: Правый операнд. Тип Point3d.
Returns: Возвращает точку Point3d в новых координатах.

Teigha.Geometry.Point3d.*(Teigha.Geometry.Point3d,System.Double)
Оператор умножения класса Point3d. Реализует умножение координат точки на вещественный множитель.
Оператор умножения класса Point3d. Реализует умножение координат точки a на вещественный множитель value.
a: Левый операнд.  Тип Point3d.
value: Правый операнд. Тип double.
Returns: Возвращает точку Point3d в новых координатах.

Teigha.Geometry.Point3d.*(System.Double,Teigha.Geometry.Point3d)
Оператор умножения класса Point3d. Реализует умножение координат точки на вещественный множитель.
Оператор умножения класса Point3d. Реализует умножение координат точки a на вещественный множитель value.
value: Левый операнд.  Тип double.
a: Правый операнд. Тип Point3d.
Returns: Возвращает точку Point3d в новых координатах.

Teigha.Geometry.Point3d.+(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Оператор сложения класса Point3d.  Реализует сложение координат заданной точки с соответствующими компонентами заданного 3D-вектора.
Оператор сложения класса Point3d.  Реализует сложение координат точки a с соответствующими компонентами 3D-вектора vector, что эквивалентно перемещению точки a на заданный вектор.
a: Левый операнд.  Тип Point3d.
vector: Правый операнд. Тип Vector3d.
Returns: Возвращает точку Point3d в новых координатах.

Teigha.Geometry.Point3d.-(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Оператор вычитания класса Point3d. Реализует вычитание из координат точки a координат точки b.
Оператор вычитания класса Point3d. Реализует вычитание из координат точки a координат точки b.
Результатом является 3D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b.
a: Левый операнд.  Тип Point3d.
b: Правый операнд. Тип Point3d.
Returns: Возвращает 3D-вектор, компоненты которого определяются разностями соответствующих координат точек a и b. Тип Vector3d.

Teigha.Geometry.Point3d.-(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Оператор вычитания класса Point3d. Реализует вычитание компонент 3D-вектора b из координат точки a.
Оператор вычитания класса Point3d. Реализует вычитание компонент 3D-вектора b из координат точки a, что эквивалентно перемещению точки на вектор, обратный вектору b.
a: Левый операнд.  Тип Point3d.
b: Правый операнд. Тип Vector3d.
Returns: Возвращает точку Point3d в новых координатах.

Teigha.Geometry.Point3d./(Teigha.Geometry.Point3d,System.Double)
Оператор деления класса Point3d. Реализует деление координат заданной точки на вещественный множитель.
Оператор деления класса Point3d. Реализует деление координат точки a на вещественный множитель value.
a: Левый операнд.  Тип Point3d.
value: Правый операнд. Тип double.
Returns: Возвращает точку Point3d в новых координатах.

Teigha.Geometry.Point3d.==(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Оператор равенства класса Point3d.
Оператор равенства класса Point3d. Возвращает true в случае совпадения координат сравниваемых точек.
a: Левый операнд.  Тип Point3d.
b: Правый операнд. Тип Point3d.
Returns: Возвращает true в случае совпадения координат сравниваемых точек, иначе - false.

Teigha.Geometry.Point3d.Coordinate
Свойство предоставляет доступ к координатам точки.
Свойство предоставляет доступ к координатам точки.
index: Индекс координаты; тип int.  0 – координата X, 1 – координата Y, 2 – координата Z.
Returns: Возвращает значение координаты. Тип double.

Teigha.Geometry.Point3d.Origin
Свойство возвращает начало координат 3D-пространства данной точки.
Свойство возвращает начало координат 3D-пространства данной точки.
Returns: Возвращает точку начала координат. Тип Point3d.

Teigha.Geometry.Point3d.X
Свойство, представляющее координату X данной точки.
Свойство, представляющее координату X данной точки.
Returns: Возвращает координату X данной точки.Тип double.

Teigha.Geometry.Point3d.Y
Свойство, представляющее координату Y данной точки.
Свойство, представляющее координату Y данной точки.
Returns: Возвращает координату Y данной точки.Тип double.

Teigha.Geometry.Point3d.Z
Свойство, представляющее координату Z данной точки.
Свойство, представляющее координату Z данной точки.
Returns: Возвращает координату Z данной точки.Тип double.