HostMgd.EditorInput.PromptPointResult.ToString
Метод возвращает строковое представление точки,
введённой пользователем в ходе интерактивной операции.
Метод переопределяет стандартный метод PromptResult.ToString()
и предоставляет строковое значение точки (Point3d),
введённой пользователем через такие команды, как GetPoint(), GetCorner() и другие.
Он используется для удобного отображения или логгирования координат точки —
например, при выводе результата в командную строку или вспомогательные подсказки.
Метод возвращает точку в формате, соответствующем текущим настройкам локализации
и параметрам ввода.
Returns: Возвращает значение типа string, представляющее собой текстовое отображение точки
в формате (X, Y, Z) — например: (100.50, 200.25, 0.00).
Если точка не была введена (операция отменена или завершена с ошибкой),
может вернуть пустую строку или сообщение об отмене.
Notes
Формат строки может зависеть от настроек единиц чертежа
и используемой культуры (локализации).
Для контролируемого форматирования можно использовать
перегруженную версию с IFormatProvider.
Example
C#