HostMgd.EditorInput.Editor.PromptingForSelection
Событие возникает при начале операции выбора объектов
и позволяет настроить параметры команды выборки до её запуска.
Событие не реализовано.
Событие инициируется перед началом интерактивного выбора одного
или нескольких объектов — например, при вызове метода GetSelection()
или при активации команды, требующей выделения. Оно предоставляет доступ
к объекту PromptSelectionOptionsEventArgs, содержащему параметры операции выбора, такие как:
* сообщение приглашения,
* режим выбора,
* ключевые слова,
* ограничения выборки .
Это событие позволяет разработчику динамически изменять поведение команды выбора
в зависимости от контекста — например, задать типы допустимых объектов, изменить
сообщение или добавить пользовательские ключевые слова.
Событие реализуется через делегат PromptSelectionOptionsEventHandler
и вызывается до начала взаимодействия с пользователем, что делает его
идеальным для предварительной настройки выборки.
Example
C#