Teigha.DatabaseServices.BlockTableRecord.GetErasedBlockReferenceIds
Метод предназначен для получения коллекции ObjectId
всех вставок данного определения блока, которые были удалены
из чертежа.
Метод вовзращает коллекцию ObjectId вставок данного
определения блока, которые были удалены из чертежа.
Returns: Метод возвращает коллекцию ObjectId в формате ObjectIdCollection.