Teigha.GraphicsSystem.SelectionMode.WPoly
Значение: 3.
Область выделения представляет собой многоугольник, граница которого задается по трем или более точкам.
Выделяются лишь те объекты, которые целиком оказались в пределах области выделения.