HostMgd.EditorInput.PromptForEntityEndingEventHandler
Делегат предназначен для обработки события, возникающего при завершении операции
выбора геометрического объекта в редакторе nanoCAD.
Делегат используется как тип метода-обработчика для события PromptForEntityEnding,
которое происходит после того, как пользователь выбрал объект, но до окончательной фиксации выбора.
Это позволяет разработчику получить доступ к результату выборки и выполнить дополнительные действия
— например, проверить допустимость выбранного объекта, изменить его параметры или отменить выбор.
Делегат предоставляет доступ к событию через объект PromptForEntityEndingEventArgs,
содержащий информацию о выбранном объекте и статусе операции.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий данные о завершающейся операции выбора