Teigha.Geometry.Vector3dCollection
Класс Vector3dCollection представляет коллекцию трехмерных векторов.
Класс Vector3dCollection представляет коллекцию трехмерных векторов Vector3d.

Teigha.Geometry.Vector3dCollection.#ctor
Конструктор по умолчанию класса Vector3dCollection.
Конструктор по умолчанию класса Vector3dCollection.
Создает пустую коллекцию с ёмкостью по умолчанию, которая определяется константой Vector3dCollection.DefaultSize.

Teigha.Geometry.Vector3dCollection.#ctor(System.Int32)
Конструктор класса Vector3dCollection.
Создает новую коллекцию с заданной ёмкостью.
Конструктор класса Vector3dCollection.
Создает новую коллекцию с заданной ёмкостью capacity.
capacity: Входное значение емкости создаваемой коллекции.

Teigha.Geometry.Vector3dCollection.#ctor(array)
Конструктор класса Vector3dCollection.
Создает новую коллекцию, заполненную объектами Vector3d из указанного массива.
Конструктор класса Vector3dCollection.
Создает новую коллекцию, заполненную объектами Vector3d из указанного массива values.
values: Входной массив трехмерных векторов. Тип Vector3d[].

Teigha.Geometry.Vector3dCollection.Add(Teigha.Geometry.Vector3d)
Метод добавляет в коллекцию указанный объект Vector3d.
Метод добавляет в коллекцию новый элемент, используя указанный объект Vector3d.
value: Входной объект для добавления в коллекцию. Тип Vector3d.
Returns: Возвращает количество элементов в коллекции после добавления объекта value.
Тип int.

Teigha.Geometry.Vector3dCollection.AddRange(array)
Метод добавляет в коллекцию массив объектов Vector3d.
Метод добавляет в коллекцию массив объектов Vector3d.
range: Входной массив объектов, которые добавляются в данную коллекцию. Тип Vector3d[].

Teigha.Geometry.Vector3dCollection.Contains(Teigha.Geometry.Vector3d)
Метод позволяет определить, является ли указанный объект Vector3d членом данной коллекции.
Метод позволяет определить, является ли указанный объект Vector3d членом данной коллекции.
value: Входной проверяемый объект. Тип Vector3d.
Returns: Возвращает true, если объект value присутствует в коллекции.
В противном случае возвращает false.

Teigha.Geometry.Vector3dCollection.CopyTo(array,System.Int32)
Метод копирует все элементы данной коллекции в указанный одномерный массив.
Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
array: Целевой массив, в который копируются элементы коллекции. Тип Vector3d[].
index: Входной индекс в целевом массиве, начиная с которого в массив копируются элементы коллекции. Тип int.

Teigha.Geometry.Vector3dCollection.IndexOf(Teigha.Geometry.Vector3d)
Метод определяет индекс конкретного элемента в коллекции, в котором хранится указанный объект Vector3d.
Метод определяет индекс конкретного элемента коллекции, в котором хранится указанный объект Vector3d.
value: Входной объект. Тип Vector3d.
Returns: Возвращает индекс объекта value в данной коллекции. Тип int.
Если объект в коллекции отсутствует, возвращается значение -1.

Teigha.Geometry.Vector3dCollection.Insert(System.Int32,Teigha.Geometry.Vector3d)
Метод вставляет в коллекцию заданный объект Vector3d по указанному индексу.
Метод вставляет в коллекцию заданный объект Vector3d по указанному индексу.
Индекс должен иметь допустимое значение.
index: Входной индекс вставленного в коллекцию элемента. Тип int.
value: Входной объект, вставляемый в коллекцию. Тип Vector3d.

Teigha.Geometry.Vector3dCollection.Remove(Teigha.Geometry.Vector3d)
Метод удаляет из коллекции первое вхождение указанного объекта Vector3d.
Метод удаляет из коллекции первое вхождение указанного объекта Vector3d.
value: Удаляемый из коллекции объект. Тип Vector3d.

Teigha.Geometry.Vector3dCollection.RemoveAt(System.Int32)
Метод удаляет из данной коллекции элемент с указанным индексом.
Метод удаляет из данной коллекции элемент с указанным индексом.
index: Индекс удаляемого из коллекции элемента. Тип int.

Teigha.Geometry.Vector3dCollection.Capacity
Свойство Capacity представляет текущую ёмкость данной коллекции.
Свойство Capacity управляет ёмкостью коллекции, т.е. количеством элементов, которые может содержать данная коллекция.
Returns: Возвращает текущее значение ёмкости данной коллекции.
Тип int.

Teigha.Geometry.Vector3dCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет количество элементов, фактически содержащихся в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.Geometry.Vector3dCollection.IsFixedSize
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Returns: Возвращает true, если размер данной коллекции является фиксированным.
В противном случае возвращает false.

Teigha.Geometry.Vector3dCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Returns: Возвращает true, если данная коллекция доступна только на чтение.
В противном случае возвращает false.

Teigha.Geometry.Vector3dCollection.IsSynchronized
Свойство IsSynchronized позволяет проверить, является ли доступ к коллекции синхронизированным (потокобезопасным).
Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции синхронизированным (потокобезопасным).
Returns: Возвращает true, если доступ к данной коллекции является синхронизированным.
В противном случае возвращает false.

Teigha.Geometry.Vector3dCollection.Item
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
index: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип Vector3d.

Teigha.Geometry.Vector3dCollection.SyncRoot
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Returns: Возвращает объект для синхронизации доступа к коллекции.
Тип Object.