Teigha.Geometry.Vector3d.IsUnitLength
Метод проверяет, является ли данный вектор единичным.
Метод проверяет, является ли данный вектор единичным.
Реализация использует вызов метода Vector3d.IsUnitLength(Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global.
Метод возвращает true, если это условие выполнено, и false в противном случае.
Returns: Возвращает true, если данный вектор можно считать единичным.
В противном случае возвращает false.