Teigha.Runtime.IMenuItem
Интерфейс IMenuItem представляет интерфейс элемента меню.
Интерфейс IMenuItem представляет интерфейс элемента меню.

Teigha.Runtime.IMenuItem.OnClicked(EventArgs)
Метод позволяет назначить обработчик события щелчка мышью на данном элементе меню.
Метод позволяет назначить обработчик события щелчка мышью на данном элементе меню.
eventArgs: Данные для события. Тип EventArgs.

Teigha.Runtime.IMenuItem.Checked
Свойство Checked позволяет определить, отображается ли флажок на данном элементе меню.
Свойство Checked позволяет определить, отображается ли флажок на данном элементе меню.
Returns: Возвращает true, если флажок отображается.
В противном случае возвращает false.

Teigha.Runtime.IMenuItem.Enabled
Свойство Enabled позволяет определить, включен ли данный элемент меню.
Свойство Enabled позволяет определить, включен ли данный элемент меню.
Returns: Возвращает true, если данный элемент меню включен (активен).
В противном случае возвращает false.

Teigha.Runtime.IMenuItem.Icon
Свойство Icon представляет объект иконки, связанный с данным элементом меню.
Свойство Icon представляет объект иконки, связанный с данным элементом меню.
Returns: Возвращает объект иконки.
Тип System.Drawing.Icon.

Teigha.Runtime.IMenuItem.Items
Свойство Items представляет коллекцию объектов IMenuItem, связанных с данным элементом меню.
Свойство Items представляет коллекцию объектов IMenuItem, связанных с данным элементом меню.
Returns: Возвращает коллекцию объектов IMenuItem.
Тип Collections.Generic.IEnumerable.

Teigha.Runtime.IMenuItem.Text
Свойство Text представляет текст на данном элементе меню.
Свойство Text представляет текст на данном элементе меню.
Returns: Возвращает текст для данного элемента меню.
Тип String.

Teigha.Runtime.IMenuItem.Visible
Свойство Visible позволяет определить, является ли видимым данный элемент меню.
Свойство Visible позволяет определить, является ли видимым данный элемент меню.
Returns: Возвращает true, если данный элемент меню является видимым.
В противном случае возвращает false.