Teigha.DatabaseServices.LinkedTableData.GetEnumerator
Метод позволяет получить перечислитель для данного объекта.
Метод позволяет получить перечислитель для данного объекта.
Returns: Возвращает перечислитель для таблицы. Тип TableEnumerator.