Teigha.BoundaryRepresentation.ShellFaceCollection
Класс ShellFaceCollection представляет набор граней, соответствующих оболочке Shell.
Класс ShellFaceCollection представляет набор граней, соответствующих оболочке Shell.