HostMgd.ApplicationServices.SystemVariableChangingEventArgs
Содержит параметры, относящиеся к событиям, связанными с
системными переменными.

HostMgd.ApplicationServices.SystemVariableChangingEventArgs.Name
Имя системной переменной, которая должна быть изменена.