Teigha.Runtime.CommandFlags.Redraw
Значение: 4.
При извлечении набора объектов, выбранных перед запуском команды (набор pickfirst), или набора ручек они не очищаются в nanoCAD.
Команда может извлечь эти наборы с помощью функции NRX ncedSSSetFirst().
Команда может извлечь набор pickfirst с помощью ncedSSGet("I.").
Команда может задавать как набор pickfirst, так и набор ручек с помощью функции NRX ncedSSSetFirst().
Объекты в этих наборах перерисовываются с соответствующими маркерами ручек и выделением после завершения команды.