Teigha.DatabaseServices.AuditPass
Перечисление AuditPass определяет этапы аудита объектов базы данных.
Перечисление AuditPass определяет этапы аудита объектов базы данных.
Аудит каждого объекта выполняется в два прохода Pass1 и Pass2.