Teigha.GraphicsInterface.FaceData.GetMaterials
Метод предоставляет массив идентификаторов материалов, которые назначены граням сети или оболочки в данном объекте FaceData.
Метод предоставляет массив идентификаторов материалов, которые назначены граням сети или оболочки в данном объекте FaceData.
См. также метод FaceData.SetMaterials().
Returns: Возвращает массив идентификаторов материалов.
Тип ObjectId[].