Teigha.DatabaseServices.Group.Clear
Метод позволяет очистить эту группу от элементов, делая ее пустой.
Этот метод очищает содержимое группы, делая ее пустой.
При этом все остальные настройки группы остаются неизменными (имя, описание, colorIndex и т.д.).