Teigha.Runtime.RXClass.QueryX
Метод позволяет найти объект расширения протокола для указанного класса расширения протокола.
В случае необходимости выполняется рекурсивный поиск по дереву наследования в родительских классах.
Метод позволяет найти объект расширения протокола для указанного класса расширения протокола.
В случае необходимости выполняется рекурсивный поиск по дереву наследования в родительских классах.
Если класс расширения протокола runtimeClass не будет найден, то метод вернет NULL.
runtimeClass: Входной класс расширения протокола. Тип RXClass.
Returns: Возвращает интеллектуальный указатель на найденный объект расширения протокола либо NULL, если поиск успехом не увенчался.