HostMgd.EditorInput.PromptKeywordOptions
Класс предоставляет параметры для настройки интерактивного ввода
ключевого слова в nanoCAD, включая список допустимых вариантов и текст приглашения.
Класс используется при вызове команд, требующих ввода ключевого слова — например,
через метод GetString() с активированным режимом ключевых слов.
Этот класс позволяет задать:
* сообщение приглашения,
* список локальных ключевых слов,
* глобальные ключевые слова,
* разрешение на пропуск ввода (AllowNone).
Эти параметры позволяют реализовать диалог с пользователем, в котором он выбирает
действие из заданного набора — например: "Да/Нет", "Включить/Отключить", "Создать/Открыть".
Example
C#

HostMgd.EditorInput.PromptKeywordOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса с заданным
приглашающим сообщением для ввода ключевого слова.
Конструктор создаёт объект класса PromptKeywordOptions, используемый при настройке
операции ввода ключевого слова в nanoCAD. Он устанавливает текст приглашения,
который отображается пользователю в командной строке перед выбором из списка
доступных ключевых слов. После создания объекта можно добавить ключевые слова
через коллекцию Keywords, задать глобальные команды и настроить поведение ввода.
Этот конструктор является основным способом инициализации параметров
при реализации диалоговых команд, где требуется выбор действия — например,
"Да/Нет", "Включить/Отключить", "Создать/Открыть".
message: Текст приглашения, отображаемый пользователю перед вводом ключевого слова.
например: "Продолжить операцию?".

HostMgd.EditorInput.PromptKeywordOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса, задавая сообщение
с локальными ключевыми словами и список глобальных ключевых слов.
Конструктор создаёт объект класса PromptKeywordOptions, используемый для настройки
диалога ввода ключевого слова. Он позволяет одновременно задать:
* текст приглашения и список локальных ключевых слов , объединённые в одной строке,
* глобальные ключевые слова , доступные независимо от контекста.
Формат параметра messageAndKeywords предполагает, что ключевые слова передаются в квадратных скобках:
"Выберите действие [Да/Нет/Отмена]". Эти слова автоматически добавляются в коллекцию Keywords.
Параметр globalKeywords содержит строку с глобальными командами, разделёнными пробелом,
такими как "Выход Отмена Повтор", которые остаются доступными в любой момент ввода.
Этот конструктор удобен при создании диалогов с заранее известными вариантами выбора и системными командами.
messageAndKeywords: Строка, содержащая сообщение и список локальных ключевых слов в формате
Пример: "Продолжить? [Да/Нет]".
globalKeywords: Строка, содержащая глобальные ключевые слова, разделённые пробелом.
Пример: "Отмена Выход Повтор".

HostMgd.EditorInput.PromptKeywordOptions.AllowArbitraryInput
Свойство определяет, разрешён ли ввод пользователем произвольной строки,
не входящей в список ключевых слов.
Свойство позволяет указать, может ли пользователь ввести текст,
не совпадающий ни с одним из ключевых слов, указанных в коллекции Keywords.
Если свойство установлено в true, пользователь может ввести любую строку
— она будет доступна через StringResult при завершении ввода.
Если false — ввод разрешается только из числа предопределённых ключевых
или глобальных слов.
Returns: Возвращает значение типа bool:
* true — произвольный ввод строки разрешён.
* false — пользователь обязан выбрать значение из списка
или ввести глобальную команду.

HostMgd.EditorInput.PromptKeywordOptions.AllowNone
Свойство определяет, разрешён ли ввод без указания значения — только нажатием клавиши Enter.
Свойство позволяет указать, может ли пользователь завершить операцию ввода ключевого слова
простым нажатием Enter , не выбирая ни одного из предложенных вариантов.
Если свойство установлено в true, такая возможность разрешена, и статус результата будет PromptStatus.None.
Если false — пользователь обязан выбрать ключевое слово или ввести допустимое значение.
Returns: Возвращает значение типа bool:
* true — завершение ввода нажатием Enter разрешено.
* false — требуется обязательный выбор или ввод.