HostMgd.ApplicationServices.InplaceTextEditor.Cut
Метод вырезает текущий выделенный текст и сохраняет его в буфере обмена.
В текущей версии не реализован.
Метод вырезает текущий выделенный текст и сохраняет его в буфере обмена.
В текущей версии метод не реализован.
Notes
Следует иметь ввиду, что текущее выделение удаляется, и после завершения метода это выделение как объект более не существует.