Teigha.DatabaseServices.TableEnumerator.MoveNext
Метод обеспечивает переход перечислителя к следующему элементу таблицы.
Метод обеспечивает переход перечислителя к следующему элементу таблицы.
Returns: Возвращает true, если текущий элемент перечислителя находится в таблице (его индекс не превышает максимальный индекс таблицы).
Если он вышел за пределы таблицы, возвращает false.