HostMgd.EditorInput.Editor.PromptingForDouble
Событие возникает при начале интерактивной операции ввода вещественного числа, позволяя настроить параметры команды до её запуска.
Событие не реализовано.
Событие инициируется в момент начала операции ввода вещественного числа — например, перед вызовом метода `GetDouble()` или других команд,
требующих ввода значения типа `double`.
Оно предоставляет доступ к параметрам ввода через объект `PromptDoubleOptionsEventArgs`,
что позволяет динамически изменять:
* сообщение приглашения (`Message`),
* значение по умолчанию (`DefaultValue`),
* режимы ввода (`AllowNone`, `AllowNegative`, `AllowZero` и др.).
Это событие особенно полезно при разработке интерактивных команд,
где требуется гибкая настройка параметров ввода числа в зависимости от контекста,
например, при задании коэффициентов масштабирования, размеров или параметров объектов.
Example
C#