Teigha.DatabaseServices.Extents2d
Этот класс представляет двумерные ограничивающие боксы для различных графических объектов.
Этот класс представляет двумерные ограничивающие боксы для различных графических объектов.
2D-бокс представляет собой описанный вокруг объекта прямоугольник, определяемый двумя вершинами главной диагонали (минимальной и максимальной точками).

Teigha.DatabaseServices.Extents2d.#ctor(System.Double,System.Double,System.Double,System.Double)
Конструктор класса Extents2d.
Создает 2D ограничивающий бокс с указанными координатами минимальной и максимальной точек.
Конструктор класса Extents2d.
Создает 2D ограничивающий бокс с указанными координатами минимальной и максимальной точек.
minX: X-координата минимальной точки. Тип double.
minY: Y-координата минимальной точки. Тип double.
maxX: X-координата максимальной точки. Тип double.
maxY: Y-координата максимальной точки. Тип double.

Teigha.DatabaseServices.Extents2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса Extents2d. Создает двумерный ограничивающий бокс, заданный парой двумерных точек Point2d в качестве вершин главной диагонали.
Конструктор класса Extents2d.
Создает двумерный ограничивающий бокс, заданный парой двумерных точек Point2d в качестве вершин главной диагонали.
minimum: Минимальная точка. Тип Point2d.
maximum: Максимальная точка. Тип Point2d.

Teigha.DatabaseServices.Extents2d.Equals(Object)
Метод предназначен для проверки данного объекта на равенство другому объекту Extents2d.
Метод предназначен для проверки данного объекта на равенство другому объекту Extents2d.
obj: Объект, проверяемый на равенство. Тип Object.
Returns: Возвращает true, если объект obj не является нулевым, и совпадают соответствующие координаты вершин сравниваемых объектов. В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать Extents2d.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.Extents2d.IsEqualTo(Teigha.DatabaseServices.Extents2d)
Метод проверяет совпадение данного объекта с указанным объектом Extents2d.
Метод проверяет совпадение данного объекта с указанным объектом Extents2d.
a: Проверяемый объект. Тип Extents2d.
Returns: Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают.
В противном случае возвращает false.

Teigha.DatabaseServices.Extents2d.IsEqualTo(Teigha.DatabaseServices.Extents2d,Teigha.Geometry.Tolerance)
Метод проверяет совпадение данного объекта с указанным объектом Extents2d в пределах заданного допуска.
Метод проверяет совпадение данного объекта с указанным объектом Extents2d в пределах заданного допуска.
a: Проверяемый объект. Тип Extents2d.
tolerance: Геометрический допуск. Тип Tolerance.
Returns: Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают в пределах допуска tolerance. В противном случае возвращает false.

Teigha.DatabaseServices.Extents2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.DatabaseServices.Extents2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Предписанный формат строки. Тип String.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде форматированной строки, содержащей координаты его минимальной и максимальной точек.  Тип String.

Teigha.DatabaseServices.Extents2d.!=(Teigha.DatabaseServices.Extents2d,Teigha.DatabaseServices.Extents2d)
Оператор неравенства класса Extents2d.
Оператор неравенства класса Extents2d.
a: Левый операнд.  Тип Extents2d.
b: Правый операнд. Тип Extents2d.
Returns: Возвращает true, если у операндов не совпадают минимальные и/или максимальные точки.
В противном случае возвращает false.

Teigha.DatabaseServices.Extents2d.==(Teigha.DatabaseServices.Extents2d,Teigha.DatabaseServices.Extents2d)
Оператор равенства класса Extents2d.
Оператор равенства класса Extents2d.
a: Левый операнд.  Тип Extents2d.
b: Правый операнд. Тип Extents2d.
Returns: Возвращает true, если у операндов совпадают как минимальные, так и максимальные точки.
В противном случае возвращает false.

Teigha.DatabaseServices.Extents2d.MaxPoint
Свойство обеспечивает доступ к максимальной точке данного объекта.
Свойство обеспечивает доступ к максимальной точке данного объекта.
Returns: Возвращает максимальную точку данного объекта. Тип Point2d.

Teigha.DatabaseServices.Extents2d.MinPoint
Свойство обеспечивает доступ к минимальной точке данного объекта.
Свойство обеспечивает доступ к минимальной точке данного объекта.
Returns: Возвращает минимальную точку данного объекта. Тип Point2d.