Teigha.GraphicsInterface.DiagnosticBSPMode.Size
Значение: 1.
Диагностический режим с контролем размера узлов BSP-дерева.  Размеры узлов могут, например, отражать размеры соответствующих областей пространства.