Teigha.DatabaseServices.FieldFilingOptions
Данное перечисление определяет вариант сохранения, задаваемый вычислителями полей.
Данное перечисление определяет вариант сохранения, задаваемый вычислителями полей.