HostMgd.ApplicationServices.WhoHasInfo
Структура, содержащую информацию, возвращаемую методом класса
Application GetWhoHasInfo().

HostMgd.ApplicationServices.WhoHasInfo.ComputerName
Имя компьютера, используемое при редактировании чертежа, если
файл открыт на редактирование.

HostMgd.ApplicationServices.WhoHasInfo.IsFileLocked
Признак того, что файл заблокирован на редактирование другой
сессией nanoCAD.

HostMgd.ApplicationServices.WhoHasInfo.OpenTime
Возвращает строку, содержащую детальное время и дату, когда
файл чертежа был открыт в случае, если файл был открыт на
редактирование.

HostMgd.ApplicationServices.WhoHasInfo.UserName
Возвращает имя пользователя (логин), редактирующего файл,
если файл был открыт на редактирование.