Teigha.DatabaseServices.Polyline.MinimizeMemory
Этот метод оптимизирует использование памяти полилинией. Этот
процесс может занимать некоторое время и не должен быть
применен до того, как все изменения полилинии в сессии будут
сделаны.