HostMgd.PlottingServices.PreviewEndPlotStatus.Previous
Значение: 4.
Пользователь вышел из режима предварительного просмотра, нажав на панели инструментов
кнопку "Предыдущая страница" для предварительного просмотра предыдущего листа.