Teigha.GraphicsInterface.MapChannel.MapChannels
Значение: 1.
Количество каналов карт, к которым могут применяться координаты наложения карты.
Это значение предназначено только для внутреннего использования.