Teigha.DbConstraints.ErrorStatus
Данное перечисление определяет статусы ошибок, которые используются всеми методами B-Rep.
Данное перечисление определяет статусы ошибок, которые используются всеми методами B-Rep.