HostMgd.EditorInput.Editor.Regen
Метод выполняет принудительную регенерацию (перерисовку) чертежа в активном документе.
Метод используется для обновления графического представления чертежа,
применяя все изменения, внесённые в объекты чертежа, и пересчитывая их отображение на экране.
Это может быть полезно после выполнения операций, изменяющих геометрию или параметры отображения объектов,
чтобы обеспечить корректное визуальное представление чертежа в текущем виде.
Example
C#