Teigha.Geometry.Curve2d.GetInterval
Метод позволяет получить параметрический интервал данной кривой.
Метод позволяет получить параметрический интервал данной кривой.
Returns: Возвращает параметрический интервал данной кривой.
Тип Interval.