Teigha.DatabaseServices.AssocAction.EvaluateDependencies
Метод реализует перевычисление всех зависимостей данного действия, для которых IsEvaluationRequest() == true.
Метод предназначен для вызова из метода AssessmentOverride() клиентского кода, обычно после того, как клиентский код в процессе проверки зависимостей обнаруживает, какие из них изменились, какие были связаны с удаленными объектами и т.п.
Метод получает все зависимости данного действия и заново вычисляет те из них, для которых это необходимо, т.е. зависимости, для которых IsEvaluationRequest() == true.