Teigha.GraphicsSystem.View.Hide
Метод позволяет скрыть данный вид, сделав его невидимым.
Метод позволяет скрыть данный вид, сделав его невидимым.
Никакое содержимое скрытого вида не отображается на устройстве.