Teigha.BoundaryRepresentation.Element2d
Класс Element2d — это интерфейсный класс для линейных двумерных элементов первого порядка в сети.
Реализован только в среде пространственного моделирования.
Класс Element2d — это интерфейсный класс для линейных двумерных элементов первого порядка в сети.
Элемент представляет плоскую аппроксимацию участка ограниченной поверхности и не имеет напрямую связанной геометрии.
Элемент содержит множество вершин многоугольника (т.е. замкнутого контура), состоящее как минимум из трех копланарных узлов сети (заметим, что координаты этих узлов могут использоваться для создания экземпляра Plane).
Обратное соответствие с исходной топологией BREP обеспечивается обратным указателем на грань, на основе которой был сгенерирован данный элемент (см. также свойство MeshEntity.EntityAssociated).
Этот класс определяет функционал, который относится к уровню 2D-элементов сети, и непосредственно использоваться не может, поскольку процедуры инициализации скрыты от пользователя и выполняются во время генерации объекта Mesh2d.
Пользователь обычно получает доступ к этому классу через перечислитель элементов сети.
Единственным способом удалить из кэша данных сети элемент, на который ссылается этот класс, является удаление объекта сети, которому элемент принадлежит.  Альтернатива - регенерация сети заново.
Notes
Класс реализован только в среде пространственного моделирования.

Teigha.BoundaryRepresentation.Element2d.#ctor
Конструктор по умолчанию класса Element2d.
Конструктор по умолчанию класса Element2d.

Teigha.BoundaryRepresentation.Element2d.GetNodesStartingFrom(Teigha.BoundaryRepresentation.Node)
Метод предоставляет коллекцию узлов элемента, начиная с указанной начальной точки.
Метод предоставляет коллекцию узлов элемента, начиная с указанной начальной точки.
startFrom: Входной узел, с которого начинается требуемая коллекция.
Returns: Возвращает коллекцию узлов 2D-элемента.
Тип Element2dNodeCollection.

Teigha.BoundaryRepresentation.Element2d.Nodes
Свойство Nodes предоставляет доступ к множеству всех узлов данного элемента.
Свойство Nodes предоставляет доступ к множеству всех узлов данного элемента.
Returns: Возвращает коллекцию узлов элемента.
Тип Element2dNodeCollection.

Teigha.BoundaryRepresentation.Element2d.Normal
Свойство Normal представляет вектор нормали данного элемента.
Свойство Normal представляет вектор нормали данного элемента.
Направление вектора определяется правилом правой руки при обходе контура узлов элемента по часовой стрелке.
Returns: Возвращает вектор нормали.
Тип Vector3d.