Teigha.Geometry.BoundBlock2d
Класс BoundBlock2d реализует двумерную граничную рамку геометрического объекта.
Класс BoundBlock2d представляет реализацию двумерной граничной рамки геометрического объекта.
Геометрически граничные рамки могут принимать форму как обычного прямоугольника, ориентированного по осям системы координат, так и параллелограмма.

Teigha.Geometry.BoundBlock2d.#ctor
Конструктор по умолчанию класса BoundBlock2d.
Создает граничную рамку с минимальной и максимальной точками в начале системы координат.
Конструктор по умолчанию класса BoundBlock2d.
Создает граничную рамку с минимальной и максимальной точками в начале системы координат.

Teigha.Geometry.BoundBlock2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса BoundBlock2d.
Создает прямоугольную граничную рамку, ориентированную по осям системы координат, с указанными минимальной и максимальной точками.
Конструктор класса BoundBlock2d.
Создает прямоугольную граничную рамку, ориентированную по осям системы координат, с указанными минимальной и максимальной точками.
point1: Входная минимальная  точка прямоугольной рамки.  Тип Point2d.
point2: Входная максимальная точка прямоугольной рамки.  Тип Point2d.

Teigha.Geometry.BoundBlock2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Конструктор класса BoundBlock2d.
Создает граничную рамку в виде параллелограмма с заданными базовой точкой и сторонами.
Конструктор класса BoundBlock2d.
Создает граничную рамку в виде параллелограмма с заданными базовой точкой и сторонами.
basePoint: Базовая точка параллелограмма.  Тип Point2d.
direction1: Вектор, определяющий направление и длину первой стороны параллелограмма.  Тип Vector2d.
direction2: Вектор, определяющий направление и длину второй стороны параллелограмма.  Тип Vector2d.

Teigha.Geometry.BoundBlock2d.Contains(Teigha.Geometry.Point2d)
Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
point: Входная 2D-точка.
Returns: Возвращает true, если  и только если указанная точка находится в пределах граничной рамки.
В противном случае возвращает false.

Teigha.Geometry.BoundBlock2d.Create(IntPtr,System.Boolean)
Метод создает объект BoundBlock2d на основе переданного указателя.
Метод создает объект BoundBlock2d на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект, на основе которого создается новый объект.  Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый объект типа BoundBlock2d.

Teigha.Geometry.BoundBlock2d.Extend(Teigha.Geometry.Point2d)
Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
point: Входная точка, которая должна находиться в пределах граничной рамки.  Тип Point2d.

Teigha.Geometry.BoundBlock2d.IsDisjoint(Teigha.Geometry.BoundBlock2d)
Метод позволяет проверить, пересекается ли данная граничная рамка с указанной граничной рамкой.
Метод позволяет проверить, пересекается ли данная граничная рамка с указанной граничной рамкой.
block: Входная граничная рамка, пересечение с которой требуется проверить.
Returns: Возвращает true тогда и только тогда, когда указанная граничная рамка не пересекается с данной.
В противном случае возвращает false.

Teigha.Geometry.BoundBlock2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод позволяет задать минимальную и максимальную точки данной граничной рамки.
Метод позволяет задать минимальную и максимальную точки данной граничной рамки.
firstPoint: Новая минимальная  точка граничной рамки.  Тип Point2d.
secondPoint: Новая максимальная точка граничной рамки.  Тип Point2d.

Teigha.Geometry.BoundBlock2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелограмма.
Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелограмма.
basePoint: Входная базовая точка граничной рамки. Тип Point2d.
direction1: Первая сторона параллелограмма. Тип Vector2d.
direction2: Вторая сторона параллелограмма. Тип Vector2d.

Teigha.Geometry.BoundBlock2d.Swell(System.Double)
Метод раздвигает стороны данной граничной рамки на указанное расстояние.
Метод раздвигает стороны данной граничной рамки на указанное расстояние.
distance: Величина смещения сторон граничной рамки.  Тип double.

Teigha.Geometry.BoundBlock2d.BasePoint
Свойство BasePoint представляет базовую вершину данной граничной рамки.
Свойство BasePoint представляет базовую вершину данной граничной рамки.
Returns: Возвращает базовую точку данной граничной рамки.
Тип Point2d.

Teigha.Geometry.BoundBlock2d.Direction1
Свойство Direction1 представляет направление и длину первой стороны данной граничной рамки.
Свойство Direction1 представляет направление и длину первой стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий первую сторону граничной рамки.
Тип Vector2d.

Teigha.Geometry.BoundBlock2d.Direction2
Свойство Direction2 представляет направление и длину второй стороны данной граничной рамки.
Свойство Direction2 представляет направление и длину второй стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий вторую сторону граничной рамки.
Тип Vector2d.

Teigha.Geometry.BoundBlock2d.IsBox
Свойство IsBox позволяет проверить, представлена ли граничная рамка прямоугольником, который ориентирован вдоль осей системы координат.
Свойство IsBox позволяет проверить, представлена ли граничная рамка прямоугольником, который ориентирован вдоль осей системы координат.
Returns: Возвращает true, если граничная рамка представлена прямоугольником, который ориентирован по осям системы координат.
В противном случае возвращает false.