Teigha.Runtime.DictionaryIterator.MoveNext
Метод реализует переход к следующей позиции итератора.
Метод реализует переход к следующей позиции итератора.
Returns: Возвращает true, если текущая позиция итератора вышла за пределы словаря.
В противном случае возвращает false.