HostMgd.GraphicsSystem.Manager.GetDBModel
Метод предоставляет модель графической системы, связанную с базой данных чертежа.
Метод предоставляет модель графической системы (GS), связанную с базой данных Database чертежа.
Returns: Возвращает модель GS.
Тип Teigha.GraphicsSystem.Model.