Teigha.DatabaseServices.UnderlayItemCollection
Класс UnderlayItemCollection представляет коллекцию для объектов UnderlayItem.
Класс UnderlayItemCollection представляет коллекцию для объектов UnderlayItem.

Teigha.DatabaseServices.UnderlayItemCollection.CopyTo(array,System.Int32)
Метод предназначен для копирования коллекции элементов подложки в указанный массив, начиная с указанного индекса.
Метод предназначен для копирования коллекции элементов подложки в указанный массив, начиная с указанного индекса.
arr: Целевой массив, в который копируются элементы подложки. Тип UnderlayItem[].
index: Начальный индекс массива, начиная с которого в массиве располагаются копируемые элементы. Тип int.

Teigha.DatabaseServices.UnderlayItemCollection.Count
Свойство Count представляет количество элементов в данной коллекции.
Свойство Count представляет количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.
Тип int.

Teigha.DatabaseServices.UnderlayItemCollection.Item
Свойство Item представляет элемент коллекции с указанным индексом.
Свойство Item представляет элемент коллекции с указанным индексом index.
index: Входной индекс искомого элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции под указанным индексом.
Тип UnderlayItem.