HostMgd.EditorInput.PromptStringOptionsEventHandler
Делегат предназначен для обработки события, возникающего
перед началом ввода строки, и позволяет настроить
параметры приглашения.
Делегат используется как сигнатура метода-обработчика
для события PromptingForString, которое генерируется
перед началом интерактивного ввода текстовой строки
в редакторе nanoCAD. Он позволяет разработчику изменить
параметры команды ввода — такие как сообщение, ключевые слова,
режимы ввода и разрешения — до того, как пользователь начнёт ввод.
Этот делегат применяется при реализации команд, требующих
ввода текста или выбора из списка ключевых слов — например,
при задании имён стилей, слоёв, режимов работы и других параметров.
Он обеспечивает гибкость и контроль над поведением ввода в зависимости от контекста.
sender: Источник события — обычно экземпляр редактора (Editor), в котором происходит ввод строки.
e: Объект, содержащий параметры ввода строки