Teigha.Geometry.Matrix3d
Класс Matrix3d представляет аффинное преобразование трехмерного пространства, включая вращения и трансляцию.
Класс Matrix3d представляет аффинное преобразование трехмерного пространства, включая вращения и трансляцию.
Всякая матрица M типа Matrix3d имеет вид:
a00 a01 a02 t0
a10 a11 a12 t1
a20 a21 a22 t2
0   0   0   1
где матрица A:
a00 a01 a02
a10 a11 a12
a20 a21 a22
получила название линейной части матрицы M.
Столбец T:
t0
t1
t2
называется трансляционной частью матрицы M.
Преобразование точки Point3d определяется произведением M x P, где M - матрица преобразования, P - столбец координат точки P = (pnt.x, pnt.y, pnt.z, 1.0)^T.
Преобразование вектора Vector3d определяется произведением M x V, где M - матрица преобразования, V - вектор-столбец V = (vec.x, vec.y, vec.z, 0.0)^T.
Всякую матрицу M можно связать с системой координат (СК).
Такая система координат имеет начало в точке (t0, t1, t2), а направления координатных осей определяются векторами (a00, a10, a20), (a01, a11, a21) и (a02, a12, a22).
Матрица M описывает преобразование в эту СК из базовой системы координат с началом в точке (0, 0, 0) и координатными осями (1, 0, 0), (0, 1, 0) и (0, 0, 1).

Teigha.Geometry.Matrix3d.#ctor(array)
Конструктор создает 3D-матрицу на основе значений в переданном массиве.
Конструктор создает 3D-матрицу на основе значений в переданном массиве.
Матрице присваиваются первые 16 элементов исходного массива.
Элементы матрицы задаются построчно (data11, data12 ... data44).
data: Массив элементов матрицы. Тип double[].

Teigha.Geometry.Matrix3d.AlignCoordinateSystem(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод формирует матрицу для преобразования из одной системы координат в другую.
Метод формирует матрицу, которая обеспечивает преобразование из исходной системы координат с началом в точке fromOrigin и координатными осями fromXAxis, fromYAxis и fromZAxis в целевую систему координат с началом в точке toOrigin и координатными осями toXAxis, toYAxis и toZAxis.
fromOrigin: Точка начала исходной системы координат. Тип Point3d.
fromXAxis: Вектор, задающий направление оси X исходной СК. Тип Vector3d.
fromYAxis: Вектор, задающий направление оси Y исходной СК. Тип Vector3d.
fromZAxis: Вектор, задающий направление оси Z исходной СК. Тип Vector3d.
toOrigin: Точка начала целевой системы координат. Тип Point3d.
toXAxis: Вектор, задающий направление оси X целевой СК. Тип Vector3d.
toYAxis: Вектор, задающий направление оси Y целевой СК. Тип Vector3d.
toZAxis: Вектор, задающий направление оси Z целевой СК. Тип Vector3d.
Returns: Возвращает матрицу преобразования из исходной СК в целевую СК. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Displacement(Teigha.Geometry.Vector3d)
Метод формирует матрицу трансляции  на заданный вектор.
Метод формирует матрицу трансляции, которая описывает перемещение на заданный вектор (параллельный перенос).
vector: Вектор трансляции. Тип Vector3d.
Returns: Возвращает матрицу перемещения на заданный вектор.

Teigha.Geometry.Matrix3d.Equals(Object)
Метод реализует проверку объектов на равенство.
Метод реализует проверку объектов на равенство.
obj: Объект, с которым сравнивается данная матрица.  Тип Object.
Returns: Возвращает true, если obj не равен нулю и представляет эквивалентную матрицу.
Notes

Teigha.Geometry.Matrix3d.IsEqualTo(Teigha.Geometry.Matrix3d,Teigha.Geometry.Tolerance)
Метод позволяет выяснить, совпадает ли данная матрица с указанной матрицей в пределах заданного допуска.
Метод позволяет выяснить, совпадает ли данная матрица с матрицей mat в пределах допуска tolerance.
Возвращает true, если каждый столбец данной матрицы как вектор равен соответствующему столбцу матрицы mat.
mat: Входная матрица для сравнения. Тип Matrix3d.
tolerance: Допуск, используемый для сравнеия. Тип Tolerance.
Returns: Возвращает true в случае совпадения матриц и false в противном случае.

Teigha.Geometry.Matrix3d.IsEqualTo(Teigha.Geometry.Matrix3d)
Метод позволяет выяснить, совпадает ли данная матрица с указанной матрицей.
Метод позволяет выяснить, совпадает ли данная матрица с матрицей mat.
Реализация метода использует вызов Matrix3d.IsEqualTo(Matrix3d mat, Tolerance tolerance) с допуском, равным Tolerance.Global.
mat: Входная матрица для сравнения. Тип Matrix3d.
Returns: Возвращает true в случае совпадения матриц и false в противном случае.

Teigha.Geometry.Matrix3d.IsInverse(Teigha.Geometry.Matrix3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанная матрица обратной по отношению к данной матрице в пределах заданного допуска.
Метод позволяет проверить, является ли матрица inv обратной по отношению к данной матрице в пределах заданного допуска tolerance.
inv: Матрица, с которой выполняется сравнение. Тип Matrix3d.
tolerance: Допуск, используемый для сравнеия. Тип Tolerance.
Returns: Возвращает true, если матрица inv является обратной по отношению к данной, иначе - false.

Teigha.Geometry.Matrix3d.IsInverse(Teigha.Geometry.Matrix3d)
Метод позволяет проверить, является ли указанная матрица обратной по отношению к данной матрице.
Метод позволяет проверить, является ли матрица inv обратной по отношению к данной матрице.
Реализация метода использует вызов Matrix3d.IsInverse(Matrix3d inv, Tolerance tolerance) с допуском, равным Tolerance.Global.
inv: Матрица, с которой выполняется сравнение. Тип Matrix3d.
Returns: Возвращает true, если матрица inv является обратной по отношению к данной, иначе - false.

Teigha.Geometry.Matrix3d.IsScaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы в пределах заданного допуска.
Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы.  Проверка выполняется с учетом заданного допуска tolerance.
tolerance: Допуск, определяющий точность сравнения. Тип Tolerance.
Returns: Возвращает true, если трехмерные векторы, которые представлены столбцами линейной части этой матрицы, перпендикулярны друг другу в пределах заданного допуска. В противном случае возвращает false.

Teigha.Geometry.Matrix3d.IsSingular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности tolerance.
tolerance: Используемый допуск. Тип Tolerance.
Returns: Возвращает true, если данная матрица является сингулярной, иначе - false.
Notes
* Матрица сингулярна тогда и только тогда, когда ее определитель равен нулю. Такое возможно, например, если какие-либо векторы-столбцы линейной части данной матрицы имеют нулевую длину или оказываются параллельными.
* Сингулярная матрица не может быть инвертирована.

Teigha.Geometry.Matrix3d.IsUniscaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу (в пределах заданной точности).
Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу.
Проверка выполняется с учетом заданной точности tolerance.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true, если векторы-столбцы линейной части данной матрицы перпендикулярны друг другу и одинаковы по длине. В противном случае возвращает false.

Teigha.Geometry.Matrix3d.Mirroring(Teigha.Geometry.Line3d)
Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной оси.
Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной оси.
line: Ось симметрии. Тип Line3d.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Mirroring(Teigha.Geometry.Plane)
Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной плоскости.
Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной плоскости.
plane: Плоскость симметрии. Тип Plane.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Mirroring(Teigha.Geometry.Point3d)
Возвращает матрицу преобразования, которое описывает отражение относительно заданной точки в пространстве.
Возвращает матрицу преобразования, которое описывает отражение относительно заданной точки в пространстве.
pointValue: Точка, относительно которой строится отражение. Тип Point3d.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PlaneToWorld(Teigha.Geometry.Plane)
Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS).
Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS).
plane: Входная плоскость. Тип Plane.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PlaneToWorld(Teigha.Geometry.Vector3d)
Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS). Плоскость задается вектором нормали.
Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS). Плоскость задается вектором нормали normal.
normal: Вектор нормали к плоскости. Тип Vector3d.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PostMultiplyBy(Teigha.Geometry.Matrix3d)
Метод выполняет матричное умножение данной матрицы на заданную матрицу.
Метод выполняет матричное умножение данной матрицы на заданную матрицу rightSide и возвращает результирующую матрицу.
rightSide: Матрица, которая выступает в матричном произведении правым сомножителем. Тип Matrix3d.
Returns: Возвращает результирующую матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PreMultiplyBy(Teigha.Geometry.Matrix3d)
Метод выполняет матричное умножение заданной матрицы на данную матрицу.
Метод выполняет матричное умножение заданной матрицы leftSide на данную матрицу и возвращает результирующую матрицу.
leftSide: Матрица, которая выступает в матричном произведении левым сомножителем. Тип Matrix3d.
Returns: Возвращает результирующую матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Projection(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d)
Метод формирует матрицу, которая представляет параллельное проецирование на плоскость в указанном направлении.
Метод формирует матрицу, которая представляет параллельное проецирование на плоскость projectPlane.
Направление проецирования задается вектором projectDir.
projectionPlane: Плоскость, на которую выполняется проецирование. Тип Plane.
projectDir: Направление проецирования. Тип Vector3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное проецирование.

Teigha.Geometry.Matrix3d.Rotation(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d)
Возвращает матрицу поворота на заданный угол вокруг заданной оси.
Возвращает матрицу поворота на угол angle вокруг оси axis, заданной вектором и проходящей через указанную точку center.
Направление вращения определяется правилом правой руки.
angle: Угол поворота (рад). Тип double.
axis: Ось вращения. Тип Vector3d.
center: Центр вращения. Тип Point3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное вращение.

Teigha.Geometry.Matrix3d.Scaling(System.Double,Teigha.Geometry.Point3d)
Метод формирует матрицу равномерного масштабирования относительно заданной точки с заданным коэффициентом.
Метод формирует матрицу равномерного масштабирования относительно точки center с коэффициентом масштабирования scaleAll.
scaleAll: Коэффициент масштабирования. Тип double.
center: Центр масштабирования. Тип Point3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное масштабирование.

Teigha.Geometry.Matrix3d.ToString(IFormatProvider)
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки с учетом региональных и языковых настроек.
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки с учетом региональных и языковых настроек, определяемых указанным провайдером provider.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данной матрицы. Тип String.

Teigha.Geometry.Matrix3d.ToString(String,IFormatProvider)
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки в заданном формате и с учетом региональных и языковых настроек.
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки, формат которой задается аргументом format, а региональные и языковые настройки определяются указанным провайдером provider.
format: Входной формат строки. Тип String.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данной матрицы. Тип String.

Teigha.Geometry.Matrix3d.WorldToPlane(Teigha.Geometry.Plane)
Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на заданной плоскости.
Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на заданной плоскости.
plane: Целевая плоскость. Тип Plane.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное преобразование координат.

Teigha.Geometry.Matrix3d.WorldToPlane(Teigha.Geometry.Vector3d)
Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на плоскости, заданной вектором нормали.
Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в систему координат плоскости, заданной вектором нормали.
normal: Входной вектор нормали целевой плоскости. Тип Vector3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное преобразование координат.

Teigha.Geometry.Matrix3d.!=(Teigha.Geometry.Matrix3d,Teigha.Geometry.Matrix3d)
Оператор неравенства для класса Matrix3d.
Оператор позволяет проверить несовпадение двух указанных матриц на основе их поэлементного сравнения.
Возвращает true в случае несовпадения матриц.
a: Левый операнд. Тип Matrix3d.
b: Правый операнд. Тип Matrix3d.
Returns: Возвращает true, если не совпадают значения у по крайней мере одной пары соответствующих элементов двух матриц, иначе - false.

Teigha.Geometry.Matrix3d.==(Teigha.Geometry.Matrix3d,Teigha.Geometry.Matrix3d)
Оператор равенства для класса Matrix3d.
Оператор == позволяет проверить совпадение двух указанных матриц на основе их поэлементного сравнения.
Возвращает true в случае совпадения матриц.
a: Левый операнд. Тип Matrix3d.
b: Правый операнд. Тип Matrix3d.
Returns: Возвращает true, если совпадают значения у каждой пары соответствующих элементов двух матриц, иначе - false.

Teigha.Geometry.Matrix3d.*(Teigha.Geometry.Matrix3d,Teigha.Geometry.Matrix3d)
Оператор реализует умножение матриц (a*b).
Оператор реализует умножение матриц (a*b).
a: Левый операнд. Тип Matrix3d.
b: Правый операнд. Тип Matrix3d.
Returns: Возвращает матрицу Matrix3d, которая является результатом матричного умножения матрицы a на матрицу b.

Teigha.Geometry.Matrix3d.CoordinateSystem3d
Свойство выполняет приведение данной матрицы к типу Geometry.CoordinateSystem3d, который представляет систему координат.
Свойство выполняет приведение данной матрицы к типу Geometry.CoordinateSystem3d, который представляет систему координат с началом и осями xAxis, yAxis и zAxis.
Returns: Возвращает систему координат как объект Geometry.CoordinateSystem3d.

Teigha.Geometry.Matrix3d.ElementAt
Свойство предоставляет доступ к элементу матрицы с указанными индексами строки и столбца.
Свойство предоставляет доступ к элементу матрицы с указанными индексами строки и столбца.
i: Номер строки матрицы, тип int.
j: Номер столбца матрицы, тип int.
Returns: Возвращает значение элемента матрицы с указанными индексами строки и столбца. Тип double.

Teigha.Geometry.Matrix3d.Identity
Свойство возвращает единичную матрицу.
Свойство возвращает единичную матрицу.
Returns: Возвращает возвращает единичную матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Normal
Свойство возвращает абсолютное значение наибольшего элемента в линейной части данной матрицы
Свойство возвращает абсолютное значение наибольшего элемента в линейной части данной матрицы (верхняя матрица 3x3).
Returns: Возвращает абсолютное значение наибольшего элемента. Тип double.

Teigha.Geometry.Matrix3d.Translation
Свойство возвращает трансляционную часть данной матрицы в виде вектора.
Свойство возвращает трансляционную часть данной матрицы как вектор Vector3d.
Returns: Возвращает объект Vector3d.