Teigha.GraphicsInterface.DrawableType.DistantLight
Значение: 1. Удаленный источник света. Такие источники света испускают параллельные световые лучи без ослабления интенсивности света (без затухания).