Teigha.DatabaseServices.DBObject.ModifyUndone
Событие происходит каждый раз, когда объект
в данный момент выполняет операцию отмены изменений объекта.
Событие происходит каждый раз, когда объект
в данный момент выполняет операцию отмены изменений объекта.
Returns: Тип данных EventHandler, представляющий обработчик события.