HostMgd.PlottingServices.StdConfiguration
Данное перечисление определяет стандартные конфигурационные файлы PC3 устройств вывода, которые устанавливаются по умолчанию вместе с nanoCAD.
Перечисление StdConfiguration определяет стандартные конфигурационные файлы PC3 устройств вывода, которые устанавливаются по умолчанию вместе с nanoCAD.