HostMgd.EditorInput.Editor.PromptedForPoint
Событие возникает после завершения операции ввода точки пользователем в редакторе nanoCAD.
Событие генерируется, когда пользователь успешно или с ошибкой завершает ввод точки
— например, с помощью мыши или через командную строку.
Оно применяется после вызова методов ввода точки, таких как GetPoint(),
и предоставляет информацию о координатах выбранной точки,
статусе выполнения (OK, Cancel, Error) и параметрах приглашения.
Это событие позволяет разработчикам надстроек nanoCAD обрабатывать результат выбора или ввода точки,
выполнять построения, модификации объектов или проверять допустимость значения.
Событие реализуется через делегат PromptPointResultEventHandler, который передаёт:
* объект PromptPointResultEventArgs , содержащий точку в мировой системе координат (WCS),
* статус операции ,
* строковое представление ввода ,
* параметры приглашения.
Example
C#