Teigha.GraphicsInterface.AttributesFlags.DrawableIsAnEntity
Значение: 1.
Этот флаг должен выставляться классами, производными от класса Entity, как это делает реализация по умолчанию метода Entity.SubSetAttributes().