HostMgd.EditorInput.UserInputControls.NullResponseAccepted
Значение: 2 (0x2).
Маска определяет режим "Допускается пустой ввод (null)" в пакете запроса пользовательского ввода.
По умолчанию этот бит сброшен, и пустой ввод недопустим.