Teigha.DatabaseServices.FaceRef
Класс FaceRef представляет ссылку на грань.
Класс FaceRef представляет ссылку на грань.

Teigha.DatabaseServices.FaceRef.#ctor
Конструктор по умолчанию класса FaceRef.
Конструктор по умолчанию класса FaceRef.

Teigha.DatabaseServices.FaceRef.#ctor(Teigha.DatabaseServices.CompoundObjectId)
Конструктор класса FaceRef. Создает экземпляр класса на базе указанного составного объекта.
Конструктор класса FaceRef. Создает экземпляр класса на базе указанного составного объекта.
compoundObjectId: Идентификатор составного объекта, на основе которого создается новый экземпляр класса FaceRef. Тип CompoundObjectId.

Teigha.DatabaseServices.FaceRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId)
Конструктор класса FaceRef. Создает экземпляр класса на базе указанного подобъекта составного объекта.
Конструктор класса FaceRef.
Создает экземпляр класса на базе указанного подобъекта составного объекта.
compoundObjectId: Идентификатор составного объекта. Тип CompoundObjectId.
subentId: Идентификатор подобъекта составного объекта compoundObjectId, на основе которого создается новый экземпляр класса FaceRef.  Тип SubentityId.