Teigha.BoundaryRepresentation.Hit.GetHashCode
Метод предоставляет хеш-код данного объекта.
Метод предоставляет хеш-код данного объекта.
Подробности см. в документации Microsoft .NET API.
Returns: Возвращает хеш-код данного объекта.
Тип int.