Teigha.BoundaryRepresentation.Face.GetArea
Метод вычисляет площадь грани.  Точность вычислений определяется глобальными установками.
Метод вычисляет площадь грани.  Точность вычислений определяется глобальными установками.
Returns: Возвращает площадь грани.
Тип double.