Teigha.DatabaseServices.LoftOptions
Класс представляет параметры лофта - операции вытягивания поверхности по сечениям, используемые для создания как поверхностных, так и твердых тел.  Параметры лофта используются для управления геометрией получаемой поверхности.
Класс представляет параметры лофта - операции вытягивания поверхности по сечениям, используемые для создания как поверхностных, так и твердых тел.  Параметры лофта используются для управления геометрией получаемой поверхности.

Teigha.DatabaseServices.LoftOptions.#ctor
Конструктор по умолчанию класса LoftOptions.
Конструктор по умолчанию класса LoftOptions.

Teigha.DatabaseServices.LoftOptions.#ctor(Teigha.DatabaseServices.LoftOptions)
Конструктор класса LoftOptions. Создает новый объект LoftOptions, воспроизводя заданные параметры операции.
Конструктор класса LoftOptions. Создает новый объект LoftOptions, воспроизводя заданные параметры операции.
opts: Входной объект с параметрами операции лофта. Тип LoftOptions.

Teigha.DatabaseServices.LoftOptions.CheckCrossSectionCurves(array,System.Boolean)
Метод позволяет проверить, допустимы ли кривые поперечных сечений для выполнения операции лофта.
Метод позволяет проверить, допустимы ли кривые поперечных сечений для выполнения операции лофта.
Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
crossSectionCurves: Массив кривых поперечных сечений. Тип Entity[].
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.
Returns: Возвращает объект типа LoftOptionsCheckCurvesOut, свойства которого предоставляют следующие данные:
* Если свойство AllOpen   равно true, то все поперечные сечения являются разомкнутыми.
* Если свойство AllClosed равно true, то все поперечные сечения являются замкнутыми.
* Если свойство AllPlanar равно true, то все поперечные сечения являются плоскими.

Teigha.DatabaseServices.LoftOptions.CheckGuideCurves(array,System.Boolean)
Метод позволяет проверить, допустимы ли указанные направляющие для операции лофта.
Метод позволяет проверить, допустимы ли указанные направляющие для операции лофта.
Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
guideCurves: Массив кривых, используемых в качестве направляющих в операции лофта. Тип Entity[].
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.

Teigha.DatabaseServices.LoftOptions.CheckLoftCurves(array,array,Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет проверить, допустимо ли сочетание указанных поперечных сечений с траекторией вытягивания, либо массивом направляющих, для успешного выполнения операции лофта.
Метод позволяет проверить, допустимо ли сочетание указанных поперечных сечений с траекторией вытягивания, либо массивом направляющих, для успешного выполнения операции лофта.
Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
crossSectionCurves: Массив кривых поперечных сечений. Тип Entity[].
guideCurves: Массив направляющих.  Тип Entity[].
pPathCurve: Траектория вытягивания. Тип Entity.
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.
Returns: Возвращает объект типа LoftOptionsCheckCurvesOut, свойства которого предоставляют следующие данные:
* Если свойство AllOpen   равно true, то все поперечные сечения являются разомкнутыми.
* Если свойство AllClosed равно true, то все поперечные сечения являются замкнутыми.
* Если свойство AllPlanar равно true, то все поперечные сечения являются плоскими.

Teigha.DatabaseServices.LoftOptions.CheckPathCurve(Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет проверить, допустима ли указанная траектория для успешного выполнения данной операции лофта.
Метод позволяет проверить, допустима ли указанная траектория для успешного выполнения данной операции лофта.
Метод выбрасывает исключение eInvalidInput, если кривые недопустимы.
pathCurve: Кривая траектории для вытягивания по сечениям. Тип Entity.
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип bool. Значение по умолчанию - false.

Teigha.DatabaseServices.LoftOptions.AlignDirection
Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации нормалей заданных поперечных сечений.
Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации заданных поперечных сечений. Они должны быть ориентированы так, чтобы вектор нормали каждого сечения указывал на следующее сечение. Нарушение этого правила может приводить к нежелательным искривлениям или самопересечениям получаемой поверхности.
Returns: Возвращает true, если взаимная ориентация поперечных сечений является корректной.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptions.ArcLengthParam
Свойство позволяет проверить, применяется ли параметризация по длине дуги.
Свойство позволяет проверить, применяется ли параметризация по длине дуги.
Returns: Возвращает true, если параметризация применяется.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptions.Closed
Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
Если для этого флага установлено значение true, созданная лофтом поверхность начинается и заканчивается в первом поперечном сечении (таким образом, получается замкнутой). В этом случае поперечных сечений должно быть задано не менее трех.
Если все контуры поперечных сечений являются замкнутыми кривыми, результирующая поверхность имеет топологию тора.
Если для флага замкнутости установлено значение false, получаемая поверхность начинается и заканчивается плоскими поверхностями, образованными первым и последним сечениями.
Значение по умолчанию - false.
Returns: Возвращает true, если результирующая поверхность является замкнутой.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptions.DraftEnd
Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение).
Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение).
Значение по умолчанию — 0, что означает, что конкретное значение угла не задано, и система автоматически вычислит оптимальный угол для последнего поперечного сечения.
Returns: Возвращает угол сопряжения поверхности с последним поперечным сечением (в радианах). Тип double.

Teigha.DatabaseServices.LoftOptions.DraftEndMag
Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
Параметр управляет модулем вектора касательной к поверхности в последнем поперечном сечении.
Значение по умолчанию — 0, т.е. на последнем поперечном сечении рассчитывается оптимальная величина.
Returns: Возвращает величину вытягивания. Тип double.

Teigha.DatabaseServices.LoftOptions.DraftStart
Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения).
Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения).
Значение по умолчанию — 0, что означает, что конкретное значение угла не задано, и система автоматически вычислит оптимальный угол для первого поперечного сечения.
Returns: Возвращает угол сопряжения поверхности с первым поперечным сечением (в радианах). Тип double.

Teigha.DatabaseServices.LoftOptions.DraftStartMag
Свойство возвращает величину вытягивания поверхности из первого поперечного сечения (start draft magnitude).
Свойство возвращает величину вытягивания поверхности из первого поперечного сечения (start draft magnitude).
Она управляет модулем вектора касательной к поверхности в первом поперечном сечении.
Значение по умолчанию — 0, т.е. система автоматически вычислит оптимальную величину для первого поперечного сечения.
Returns: Возвращает величину вытягивания поверхности из первого поперечного сечения. Тип double.

Teigha.DatabaseServices.LoftOptions.NormalOption
Свойство возвращает настройку для нормали к плоскости в данном объекте.
Свойство возвращает настройку для нормали к плоскости в данном объекте из перечисления LoftOptionsNormalOption.
Значение по умолчанию — NoNormal.
Returns: Возвращает значение из перечисления LoftOptionsNormalOption.

Teigha.DatabaseServices.LoftOptions.NoTwist
Свойство возвращает значение опции noTwist (нет кручения).
Свойство возвращает значение опции noTwist (нет кручения).
Эту опцию можно использовать для минимизации скручивания поверхности, когда все поперечные сечения являются замкнутыми.
Значение по умолчанию — true. В этом случае начальная точка каждого замкнутого сечения выравнивается по другим сечениям для минимизации скручивания всей поверхности.
Returns: Возвращает true, если установлена опция "нет кручения".
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptions.Ruled
Свойство возвращает состояние флага ruled (кусочно-линейная поверхность).
Свойство возвращает состояние флага ruled (кусочно-линейная поверхность).
Если флаг установлен в значение true, то между каждой парой поперечных сечений создается кусочно-линейная поверхность, что порождает более грубую угловатую форму.
Если флаг установлен в значение false, создается общая гладкая поверхность.
Значение по умолчанию false.
Returns: Возвращает true, если строится кусочно-линейная поверхность.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptions.Simplify
Свойство возвращает состояние флага simplify (упрощение), который определяет возможность использования простых типов поверхностей вместо общего там, где это возможно.
Свойство возвращает состояние флага simplify (упрощение).
Если для флага simplify установлено значение true, простые типы поверхностей (плоскость, цилиндр, конус, сфера и тор) создаются всякий раз, когда поперечные сечения допускают такую возможность.
Если для флага simplify установлено значение false, создается общий тип поверхности.
Значение по умолчанию - true.
Returns: Возвращает true, если предписывается использовать простые типы поверхностей.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptions.VirtualGuide
Свойство позволяет определить, используется ли при создании лофт-поверхностей опция virtual guide (виртуальная направляющая).
Свойство позволяет определить, используется ли при создании лофт-поверхностей опция virtual guide (виртуальная направляющая).
Returns: Возвращает true, если опция virtual guide используется.
В противном случае возвращает false.