Teigha.DatabaseServices.DataLinkGetSourceContext
Перечисление DataLinkGetSourceContext определяет типы исходного контекста источника связанных данных.
Перечисление DataLinkGetSourceContext определяет типы исходного контекста источника связанных данных.