Teigha.DatabaseServices.GraphNodeCollection.GetEnumerator
Метод предоставляет объект перечислителя для данной коллекции.
Метод предоставляет объект перечислителя для данной коллекции.
Returns: Возвращает перечислитель. Тип Collections.IEnumerator.