Teigha.Colors.TransparencyCollectionEnumerator.MoveNext
Метод перемещает указатель перечислителя на следующий элемент коллекции.
Метод перемещает указатель перечислителя на следующий элемент коллекции.
Returns: Возвращает true, если операция перемещения указателя выполнена успешно.
В противном случае возвращает false.