Teigha.DatabaseServices.ProxyEntity.GetReferences
Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
Returns: Возвращает коллекцию идентификаторов объектов. Тип DBObjectReferenceCollection.