Teigha.DatabaseServices.XrefFullSubentityPath
Класс XrefFullSubentityPath уникальным образом определяет в базе данных подобъекты внешних ссылок.
Класс XrefFullSubentityPath уникальным образом определяет в базе данных подобъекты внешних ссылок.
Notes
Каждый экземпляр этого класса состоит из объекта SubentId, упорядоченного массива идентификаторов объектов и упорядоченного массива дескрипторов объектов чертежа.
Идентификатор подобъекта SubentId состоит из индекса и типа SubentType объекта.
Массив идентификаторов объектов и массив дескрипторов определяют путь к подобъекту от объекта самого верхнего уровня (в пространстве листа или пространстве модели) до объекта чертежа, содержащего подобъект.

Teigha.DatabaseServices.XrefFullSubentityPath.AppendObjectId(Teigha.DatabaseServices.ObjectId)
Метод добавляет идентификатор объекта в массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
Метод добавляет идентификатор объекта в массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
objId: Идентификатор добавляемого в массив объекта.  Тип ObjectId.

Teigha.DatabaseServices.XrefFullSubentityPath.DwgIn(DatabaseServices.DwgFiler)
Метод считывает данные для этого объекта в формате .dwg из указанного файлера.
Метод считывает данные для этого объекта в формате .dwg из указанного файлера.
inputFiler: Файлер, из которого считываются данные. Тип DatabaseServices.DwgFiler.

Teigha.DatabaseServices.XrefFullSubentityPath.DwgOut(DatabaseServices.DwgFiler)
Метод записывает данные этого объекта в указанный файлер в формате .dwg.
Метод записывает данные этого объекта XrefFullSubentityPath в указанный файлер в формате .dwg.
outputFiler: Файлер, в который выполняется запись данных. Тип DatabaseServices.DwgFiler.

Teigha.DatabaseServices.XrefFullSubentityPath.DxfOut(DatabaseServices.DxfFiler)
Метод записывает данные DXF этого объекта XrefFullSubentityPath в указанный DXF-файлер.
Метод записывает данные DXF этого объекта XrefFullSubentityPath в указанный DXF-файлер.
outputFiler: Файлер, в который выполняется запись данных. Тип DatabaseServices.DxfFiler.

Teigha.DatabaseServices.XrefFullSubentityPath.DxfOut(DatabaseServices.DxfFiler,System.Int32)
Метод записывает в указанный файлер данные DXF этого объекта с указанным смещением группового DXF.
Метод записывает в указанный DXF-файлер данные DXF этого объекта с указанным смещением группового DXF.
outputFiler: Файлер, в который выполняется запись данных. Тип DatabaseServices.DxfFiler.
groupCodeOffset: Смещение группового кода DXF. Тип int.

Teigha.DatabaseServices.XrefFullSubentityPath.SubentId
Свойство SubentId представляет доступ к идентификатору подобъекта SubentId в данном XrefFullSubentityPath.
Свойство SubentId представляет доступ к идентификатору подобъекта SubentId в данном XrefFullSubentityPath.
Returns: Возвращает идентификатор подобъекта.
Тип SubentityId.