Teigha.DatabaseServices.AssocDependency.UpdateDependentOnObject
Метод позволяет обновить объект, от которого зависит ассоциативная зависимость, на основе информации, полученной зависимостью от родительского действия.
Метод позволяет обновить объект, от которого зависит ассоциативная зависимость, на основе информации, которую зависимость получает от действия-владельца.
Если зависимость владеет объектом AssocDependencyBody, вызывается его метод UpdateDependentOnObject(), в противном случае реализация этого метода по умолчанию ничего не делает.
Объект зависимости должен быть открыт по крайней мере для чтения.