Teigha.DatabaseServices.MLeader.GetLeaderIndexes
Метод предоставляет массив индексов линий выносок данного объекта MLeader.
Метод предоставляет массив индексов линий выносок данного объекта MLeader.
Returns: Возвращает массив индексов линий выносок. Тип System.Collections.ArrayList.