HostMgd.GraphicsSystem.ViewEventArgs
Класс ViewEventArgs представляет данные пользовательских событий, связанных с изменением вида.
Не реализован.
Класс ViewEventArgs представляет данные пользовательских событий, связанных с изменением вида.
В текущей версии не реализован.

HostMgd.GraphicsSystem.ViewEventArgs.#ctor
Конструктор по умолчанию класса ViewEventArgs.
Конструктор по умолчанию класса ViewEventArgs.

HostMgd.GraphicsSystem.ViewEventArgs.View
Свойство View возвращает ссылку на вид.
Не реализовано.
Свойство View возвращает ссылку на вид графической системы.
В текущей версии не реализовано.
Returns: Возвращает объект вида.
Тип Teigha.GraphicsSystem.View.