Teigha.Geometry.Position2d
Класс Position2d представляет точки как позиции в двумерном пространстве.
Класс Position2d представляет точки как позиции в двумерном пространстве.

Teigha.Geometry.Position2d.#ctor
Конструктор по умолчанию класса Position2d.
Создает объект позиции с координатами (0,0).
Конструктор по умолчанию класса Position2d.
Создает объект позиции с координатами (0,0).

Teigha.Geometry.Position2d.#ctor(System.Double,System.Double)
Конструктор класса Position2d.
Создает объект позиции в точке c указанными координатами (x,y).
Конструктор класса Position2d.
Создает объект позиции в точке c указанными координатами (x,y).
x: Координата позиции по оси X. Тип double.
y: Координата позиции по оси Y. Тип double.

Teigha.Geometry.Position2d.#ctor(Teigha.Geometry.Point2d)
Конструктор класса Position2d.
Создает объект позиции в указанной 2D-точке.
Конструктор класса Position2d.
Создает объект позиции в указанной 2D-точке.
point: Входная точка, в которой создается объект позиции. Тип Point2d.

Teigha.Geometry.Position2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Position2d.

Teigha.Geometry.Position2d.Set(System.Double,System.Double)
Метод переопределяет координаты данного объекта позиции, используя указанные значения (x,y).
Метод переопределяет координаты данного объекта позиции, используя указанные значения (x,y).
x: Входная координата по оси X. Тип double.
y: Входная координата по оси Y. Тип double.

Teigha.Geometry.Position2d.Set(Teigha.Geometry.Point2d)
Метод переопределяет координаты данного объекта позиции на основе указанной точки.
Метод переопределяет координаты данного объекта позиции на основе указанной точки.
point: Входная 2D-точка, определяющая новое положение данного объекта позиции. Тип Point2d.