Teigha.DatabaseServices.LoftOptionsCheckCurvesOut
Этот класс представляет группу флагов, которые отражают состояние кривых поперечных сечений при их использовании в операциях вытягивания поверхностей по сечениям (лофт).
Этот класс представляет группу флагов, которые отражают состояние кривых поперечных сечений при их использовании в операциях вытягивания поверхностей по сечениям (лофт).
Выделены следующие состояния:
* Все кривые поперечных сечений незамкнуты.
* Все кривые поперечных сечений замкнуты.
* Все кривые поперечных сечений являются плоскими.

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.#ctor
Конструктор ро умолчанию класса LoftOptionsCheckCurvesOut.
Конструктор ро умолчанию класса LoftOptionsCheckCurvesOut.

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllClosed
Свойство позволяет проверить, все ли поперечные сечения являются замкнутыми.
Свойство позволяет проверить, все ли поперечные сечения являются замкнутыми.
Returns: Возвращает true, если все поперечные сечения являются замкнутыми.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllOpen
Свойство позволяет проверить, все ли поперечные сечения являются незамкнутыми.
Свойство позволяет проверить, все ли поперечные сечения являются незамкнутыми.
Returns: Возвращает true, если все поперечные сечения являются незамкнутыми.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllPlanar
Свойство позволяет проверить, все ли поперечные сечения являются плоскими.
Свойство позволяет проверить, все ли поперечные сечения являются плоскими.
Returns: Возвращает true, если все поперечные сечения являются плоскими.
В противном случае возвращает false.