Teigha.DatabaseServices.Table
Таблица является планарным объектом, который может быть размещен в произвольной плоскости трехмерного пространства.
Как правило, таблица представляет собой прямоугольный массив ячеек размером n x m, содержимое которого состоит из аннотативных объектов, чаще всего текстовых.
Таблицы обычно включают строку наименования таблицы, строку с заголовками столбцов и некоторое количество строк данных.
Таблица является планарным объектом, который можно создать и разместить в трехмерном пространстве в произвольной плоскости.
Таблицу обычно представляют в виде прямоугольного массива ячеек размером n x m, содержимое которого состоит из аннотативных объектов, чаще всего текстовых.
Таблицы часто содержат строку с наименованием таблицы, строку с наименованиями столбцов и некоторое количество строк данных.
После создания нового объекта Table приложениям обычно необходимо задать стиль таблицы, количество строк и столбцов, ширину столбца, высоту строки, точку вставки, ориентацию таблицы по ширине и вектор нормали.
Используя методы объекта Table, приложения могут заполнять ячейки таблицы текстом или содержимым блоков.

Teigha.DatabaseServices.Table.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.Table.#ctor(IntPtr,System.Boolean)
Конструктор.
Конструктор.
unmanagedPointer: Указатель на объект, тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.Table.Alignment(Teigha.DatabaseServices.RowType)
Данный метод позволяет определить выравнивание в ячейках строк указанного типа (строка наименования таблицы, строка с заголовками столбцов, строка данных).
Данный метод позволяет определить выравнивание в ячейках строк указанного типа (строка наименования таблицы, строка с заголовками столбцов, строка данных).  Если тип строки не указан, то по умолчанию используется тип DataRow - строка данных.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает значение для выравнивания из перечисления Teigha.DatabaseServices.CellAlignment.
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.Alignment(System.Int32,System.Int32)
Данный метод позволяет определить выравнивание текста или блока в указанной ячейке таблицы.
Данный метод позволяет определить выравнивание текста или блока в указанной ячейке таблицы.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает значение для выравнивания из перечисления Teigha.DatabaseServices.CellAlignment.
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.AttachmentPoint(System.Int32,System.Int32)
Метод предназначен для получения точки присоединения заданной ячейки.
Метод предназначен для получения точки присоединения ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает точку присоединения, тип Point3d.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].AttachmentPoint.

Teigha.DatabaseServices.Table.BackgroundColor(Teigha.DatabaseServices.RowType)
Метод определяет цвет фона ячеек в строках указанного типа.
Метод определяет цвет фона ячеек в строках указанного типа (строка наименования таблицы, строка с заголовками столбцов, строка данных).
Если тип строки не указан, то по умолчанию используется тип DataRow - строка данных.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает цвет фона ячейки в виде экземпляра класса .
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.BackgroundColor(System.Int32,System.Int32)
Метод определяет цвет фона указанной ячейки таблицы.
Метод определяет цвет фона ячейки таблицы, заданной индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает цвет фона ячейки в виде экземпляра класса .
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.BlockRotation(System.Int32,System.Int32)
Данный метод предназначен для определения угла поворота вхождения блока в указанной ячейке таблицы.
Данный метод предназначен для определения угла поворота вхождения блока в ячейке, заданной индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает значение угла поворота вхождения блока в радианах, тип double.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Rotation.

Teigha.DatabaseServices.Table.BlockScale(System.Int32,System.Int32)
Данный метод предназначен для определения масштабного коэффициента вхождения блока в указанной ячейке таблицы.
Данный метод предназначен для определения масштабного коэффициента вхождения блока в ячейке, заданной индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает масштабный коэффициент вхождения блока, тип double.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Scale.

Teigha.DatabaseServices.Table.BlockTableRecordId(System.Int32,System.Int32)
Данный метод предназначен для определения идентификатора ObjectId записи в таблице блоков для указанной ячейки таблицы.
Данный метод предназначен для определения идентификатора ObjectId записи в таблице блоков для ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает ObjectId записи в таблице блоков. Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].BlockTableRecordId.

Teigha.DatabaseServices.Table.CanDeleteColumns(System.Int32,System.Int32)
Данный метод проверяет, можно ли удалить столбец, заданный индексом.
Данный метод проверяет, можно ли удалить столбец, заданный индексом.
index: Индекс предполагаемого к удалению столбца. Тип int.
nCount: Количество предполагаемых к удалению столбцов. Тип int.
Returns: Возвращает true, если удаление возможно, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать CellRange.CanDeleteColumns.

Teigha.DatabaseServices.Table.CanDeleteRows(System.Int32,System.Int32)
Данный метод проверяет, можно ли удалить строку, заданную ее индексом.
Данный метод проверяет, можно ли удалить строку, заданную ее индексом.
index: Индекс предполагаемой к удалению строки. Тип int.
nCount: Количество предполагаемых к удалению строк. Тип int.
Returns: Возвращает true, если удаление возможно, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать CellRange.CanDeleteRows.

Teigha.DatabaseServices.Table.CanInsertColumn(System.Int32)
Данный метод проверяет, возможно ли вставить новый столбец по указанному индексу.
Данный метод проверяет, возможно ли вставить новый столбец по указанному индексу.
index: Значение индекса, для которого проверяется возможность вставки нового столбца. Тип int.
Returns: Возвращает true, если вставка возможна, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать Table.Columns[column].CanInsertColumn.

Teigha.DatabaseServices.Table.CanInsertRow(System.Int32)
Данный метод проверяет, возможно ли вставить новую строку по указанному индексу.
Данный метод проверяет, возможно ли вставить новую строку по указанному индексу.
index: Значение индекса, для которого проверяется возможность вставки строки. Тип int.
Returns: Возвращает true, если вставка возможна, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать Table.Rows[row].CanInsertRow.

Teigha.DatabaseServices.Table.CellStyleOverrides(System.Int32,System.Int32)
Данный метод позволяет получить массив переопределений для указанной ячейки.
Данный метод позволяет получить массив переопределений для указанной ячейки.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает массив переопределений. Тип TableStyleOverride[].
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].StyleOverrides .

Teigha.DatabaseServices.Table.CellType(System.Int32,System.Int32)
Метод предназначен для определения типа ячейки из перечисления TableCellType.
Метод предназначен для определения типа ячейки из перечисления TableCellType.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает тип ячейки из перечисления TableCellType.

Teigha.DatabaseServices.Table.ClearTableStyleOverrides(System.Int32)
Метод предназначен для удаления переопределений стилей, используемых в таблице и ее ячейках.
Метод предназначен для удаления переопределений стилей, используемых в таблице и ее ячейках.
options: Опции операции удаления, тип int.

Teigha.DatabaseServices.Table.ColumnWidth(System.Int32)
Метод предназначен для получения ширины указанного столбца.
Метод предназначен для получения ширины столбца, указанного индексом столбца в таблице.
col: Индекс столбца, тип int.
Returns: Возвращает ширину указанного столбца, тип double.
Notes
Для получения того же результата предпочтительнее использовать Table.Columns[col].Width.

Teigha.DatabaseServices.Table.ContentColor(Teigha.DatabaseServices.RowType)
Метод предназначен для получения цвета содержимого в строках заданного типа.
Метод предназначен для получения цвета содержимого в строках заданного типа.
Возможные значения типа строки: DataRow, TitleRow и HeaderRow.
Если тип строки не указан, будет использоваться значение по умолчанию DataRow.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает цвет содержимого ячеек в строке указанного типа.  Тип .
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.ContentColor(System.Int32,System.Int32)
Метод предназначен для получения цвета содержимого ячейки, заданной индексами строки и столбца.
Метод предназначен для получения цвета содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.
col: Индекс столбца, тип int.
Returns: Возвращает цвет содержимого указанной ячейки.  Тип .
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].ContentColor.

Teigha.DatabaseServices.Table.CopyFrom(Teigha.DatabaseServices.LinkedTableData,Teigha.DatabaseServices.TableCopyOptions)
Метод предназначен для копирования данных и формата из заданной таблицы.
Параметры копирования задаются объектом TableCopyOptions.
Метод предназначен для копирования данных и формата из заданной таблицы.
Параметры копирования задаются объектом TableCopyOptions.
source: Исходная таблица. Тип LinkedTableData.
options: Параметры копирования. Тип TableCopyOptions.

Teigha.DatabaseServices.Table.CopyFrom(Teigha.DatabaseServices.LinkedTableData,Teigha.DatabaseServices.TableCopyOptions,Teigha.DatabaseServices.CellRange,Teigha.DatabaseServices.CellRange)
Метод предназначен для копирования данных и формата из заданной таблицы.
Аргументы метода позволяют дополнительно задать параметры копирования, исходный и целевой диапазоны копируемых ячеек.
Метод предназначен для копирования данных и формата из заданной таблицы.
Параметры копирования задаются объектом TableCopyOptions.
Метод позволяет задать исходный и целевой диапазоны копируемых ячеек.
Если эти диапазоны не совпадают, данные копируются в новый диапазон с учетом заданных параметров копирования.
source: Исходная таблица. Тип LinkedTableData.
options: Параметры копирования. Тип TableCopyOptions.
sourceRange: Исходный диапазон ячеек. Тип CellRange.
targetRange: Целевой диапазон ячеек. Тип CellRange.
Returns: Возвращает диапазон скопированных ячеек, тип CellRange.

Teigha.DatabaseServices.Table.CopyFrom(Teigha.DatabaseServices.Table,Teigha.DatabaseServices.TableCopyOptions,Teigha.DatabaseServices.CellRange,Teigha.DatabaseServices.CellRange)
Метод предназначен для копирования данных и формата из заданной таблицы.
Аргументы метода позволяют дополнительно задать параметры копирования, исходный и целевой диапазоны копируемых ячеек.
Метод предназначен для копирования данных и формата из заданной таблицы.
Параметры копирования задаются объектом TableCopyOptions.
Метод позволяет задать исходный и целевой диапазоны копируемых ячеек.
Если эти диапазоны не совпадают, данные копируются в новый диапазон с учетом заданных параметров копирования.
source: Исходная таблица. Тип Table.
options: Параметры копирования. Тип TableCopyOptions.
sourceRange: Исходный диапазон ячеек. Тип CellRange.
targetRange: Целевой диапазон ячеек. Тип CellRange.
Returns: Возвращает диапазон скопированных ячеек, тип CellRange.

Teigha.DatabaseServices.Table.CreateContent(System.Int32,System.Int32,System.Int32)
Метод предназначен для создания в ячейке дополнительного содержимого.
Метод предназначен для создания в ячейке дополнительного содержимого; один элемент создается по умолчанию.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс содержимого ячейки.  Значение должно быть больше или равно нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает индекс созданного элемента содержимого. Тип int.
Notes
Для получения того же результата предпочтительнее использовать методы Table.Cells[row,column].Contents.Add или InsertAt.

Teigha.DatabaseServices.Table.DataType(Teigha.DatabaseServices.RowType)
Метод предназначен для получения типа данных, хранящихся в строках заданного в аргументе типа.
Метод предназначен для получения типа данных, хранящихся в строках заданного в аргументе типа.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает тип данных из перечисления Teigha.DatabaseServices.DataType.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType

Teigha.DatabaseServices.Table.DataType(System.Int32,System.Int32)
Метод предназначен для получения типа данных в первом элементе содержимого ячейки, заданной индексами строки и столбца.
Метод предназначен для получения типа данных в первом элементе содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает тип данных из перечисления Teigha.DatabaseServices.DataType.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType.

Teigha.DatabaseServices.Table.DeleteCellContent(System.Int32,System.Int32)
Метод предназначен для удаления содержимого из ячейки, заданной индексами строки и столбца.
Метод предназначен для удаления содержимого из ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице

Teigha.DatabaseServices.Table.DeleteColumns(System.Int32,System.Int32)
Метод предназначен для удаления из таблицы указанного количества столбцов, начиная со столбца с указанным индексом.
Метод предназначен для удаления из таблицы указанного количества столбцов, начиная со столбца с указанным индексом.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
columns: Количество удаляемых столбцов, тип int.

Teigha.DatabaseServices.Table.DeleteContent(Teigha.DatabaseServices.CellRange)
Метод предназначен для удаления всего содержимого из всех ячеек в указанном диапазоне.
Метод предназначен для удаления всего содержимого из всех ячеек в указанном диапазоне.
range: Диапазон ячеек, в которых удаляется все содержимое. Тип CellRange.

Teigha.DatabaseServices.Table.DeleteContent(System.Int32,System.Int32)
Метод предназначен для удаления всего содержимого из ячейки, заданной индексами строки и столбца.
Метод предназначен для удаления всего содержимого из ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице

Teigha.DatabaseServices.Table.DeleteContent(System.Int32,System.Int32,System.Int32)
Метод предназначен для удаления из заданной ячейки элемента содержимого с указанным индексом.
Метод предназначен для удаления из заданной ячейки элемента содержимого с указанным индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого ячейки.

Teigha.DatabaseServices.Table.DeleteRows(System.Int32,System.Int32)
Метод предназначен для удаления из таблицы заданного количества строк, начиная со строки с указанным индексом.
Метод предназначен для удаления из таблицы заданного количества строк, начиная со строки с указанным индексом.
row: Индекс первой удаляемой строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
rows: Количество удаляемых строк, тип int.

Teigha.DatabaseServices.Table.FieldId(System.Int32,System.Int32)
Метод предназначен для получения идентификатора ObjectId поля в указанной ячейке.
Метод предназначен для получения идентификатора ObjectId поля в ячейке, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает идентификатор ObjectId поля.  Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].FieldId.

Teigha.DatabaseServices.Table.Fill(Teigha.DatabaseServices.CellRange,Teigha.DatabaseServices.CellRange,Teigha.DatabaseServices.TableFillOptions)
Метод предназначен для заполнения или удаления содержимого ячеек в заданном диапазоне путем копирования или генерации ряда.
Метод предназначен для заполнения или удаления содержимого ячеек в заданном диапазоне путем копирования или генерации ряда.
Аргументы метода позволяют задавать опции заполнения ячеек.
fillRange: Диапазон заполняемых ячеек. Не должен перекрываться с диапазоном sourceRange, за исключением случаев, когда в этом диапазоне выполняется удаление содержимого ячеек. В этом случае диапазон fillRange должен полностью содержаться в диапазоне sourceRange. Тип CellRange.
sourceRange: Диапазон-источник для копирования данных или использования в качества шаблона. В случае очистки ячеек не обязан быть действительным. Тип CellRange.
options: Опции копирования из перечисления Teigha.DatabaseServices.TableFillOptions.

Teigha.DatabaseServices.Table.Format(Teigha.DatabaseServices.RowType)
Метод предназначен для получения формата ячеек в строке указанного типа.
Метод предназначен для получения формата ячеек в строке указанного типа.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает строку, тип String.
Notes
Метод не реализован.
Используйте метод  Table.Cells[row,column].DataFormat.

Teigha.DatabaseServices.Table.Format(System.Int32,System.Int32)
Метод предназначен для получения формата ячейки, заданной индексами строки и столбца.
Метод предназначен для получения формата ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает формат ячейки. Тип String.
Notes
Метод не реализован.
Используйте метод Table.Cells[row,column].DataFormat.

Teigha.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод предназначен для получения значения атрибута блока, используя в качестве ключа идентификатор объекта ObjectId.
Метод предназначен для получения значения атрибута блока в ячейке, используя в качестве ключа идентификатор объекта ObjectId.
Если значение атрибута не было переопределено, метод возвращает значение атрибута по умолчанию, определенное в исходном объекте AttributeDefinition.  Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
attributeDefinitionId: Идентификатор определения атрибута. Тип DatabaseServices.ObjectId.
Returns: Возвращает значение атрибута блока как объект String.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].GetBlockAttributeValue.

Teigha.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод предназначен для получения значения атрибута блока, если элемент по указанному индексу содержимого ячейки является блоком с атрибутами.
Метод предназначен для получения значения атрибута блока, если элемент по указанному индексу содержимого ячейки является блоком с атрибутами. Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
attributeDefinitionId: Идентификатор определения атрибута. Тип DatabaseServices.ObjectId.
Returns: Возвращает значение атрибута блока как объект String.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].Contents[i].GetBlockAttributeValue.

Teigha.DatabaseServices.Table.GetBlockTableRecordId(System.Int32,System.Int32,System.Int32)
Метод предназначен для получения идентификатора записи в таблице блоков для элемента содержимого ячейки по указанному индексу этого элемента.
Метод предназначен для получения идентификатора записи в таблице блоков для элемента содержимого ячейки по указанному индексу этого элемента.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает идентификатор записи в таблице блоков. Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].Contents[i].BlockTableRecordId.

Teigha.DatabaseServices.Table.GetBreakHeight(System.Int32)
Метод предназначен для получения высоты разрыва данной таблицы при включенном режиме разбиения таблицы.
Метод предназначен для получения высоты разрыва данной таблицы при включенном режиме разбиения таблицы.
index: Индекс фрагмента таблицы. Индекс должен быть больше или равен нулю и меньше количества табличных фрагментов, на которые разбита таблица.
Returns: Возвращает высоту разрыва таблицы, тип double.

Teigha.DatabaseServices.Table.GetBreakOffset(System.Int32)
Метод предназначен для получения смещения разрыва таблицы.
Метод предназначен для получения смещения разрыва таблицы.
index: Индекс фрагмента таблицы, тип int. Индекс должен быть больше или равен нулю и меньше количества табличных фрагментов, на которые разбита таблица.
Returns: Возвращает смещение разрыва таблицы. Тип Vector3d.

Teigha.DatabaseServices.Table.GetCellExtents(System.Int32,System.Int32,System.Boolean,Teigha.Geometry.Point3dCollection)
Метод предназначен для определения габаритов указанной ячейки.
Метод предназначен для определения габаритов ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
isOuterCell: Флаг, указывающий, является ли указанная ячейка внешней ячейкой. Тип bool.
pts: Коллекция 3D-точек вершин ячейки, дает представление о габаритах ячейки. Тип Point3dCollection.

Teigha.DatabaseServices.Table.GetCellState(System.Int32,System.Int32)
Метод предназначен для выяснения текущего состояния указанной ячейки данной таблицы.
Метод предназначен для выяснения текущего состояния ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает текущее состояние ячейки из перечисления Teigha.DatabaseServices.CellStates.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].State.

Teigha.DatabaseServices.Table.GetCellStyle(System.Int32,System.Int32)
Метод позволяет выяснить стиль ячейки, заданной индексами строки или столбца.
Метод позволяет выяснить стиль ячейки, заданной индексами строки или столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает наименование стиля ячейки, тип String.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].Style.

Teigha.DatabaseServices.Table.GetColumnName(System.Int32)
Метод предназначен для получения имени столбца, заданного его индексом.
Метод предназначен для получения имени столбца, заданного его индексом.
Имя столбца является опциональным, поэтому метод может вернуть пустую строку.
index: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает имя столбца, тип String.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Columns[i].Name.

Teigha.DatabaseServices.Table.GetContentColor(System.Int32,System.Int32,System.Int32)
Метод позволяет получить цвет указанного по индексу элемента содержимого заданной ячейки.
Метод позволяет получить цвет указанного по индексу элемента содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает цвет элемента содержимого ячейки. Тип .
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].ContentColor.

Teigha.DatabaseServices.Table.GetContentLayout(System.Int32,System.Int32)
Метод предназначен для получения макета первого элемента содержимого заданной ячейки.
Метод предназначен для получения макета для первого элемента содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает макет для элемента содержимого из перечисления Teigha.DatabaseServices.CellContentLayout.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].ContentLayout.

Teigha.DatabaseServices.Table.GetContentTypes(System.Int32,System.Int32)
Метод предназначен для получения типа первого элемента содержимого заданной ячейки таблицы.
Метод предназначен для получения типа первого элемента содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает тип элемента содержимого ячейки из перечисления Teigha.DatabaseServices.CellContentTypes.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].ContentTypes.

Teigha.DatabaseServices.Table.GetContentTypes(System.Int32,System.Int32,System.Int32)
Метод предназначен для получения типа указанного по индексу элемента содержимого заданной ячейки.
Метод предназначен для получения типа указанного по индексу элемента содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает тип элемента содержимого ячейки из перечисления Teigha.DatabaseServices.CellContentTypes.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].Content[i].ContentTypes.

Teigha.DatabaseServices.Table.GetCustomData(System.Int32,System.Int32)
Метод позволяет получить пользовательские данные, заданные в ячейке, строке или столбце.
Метод позволяет получить пользовательские данные, заданные в ячейке, строке или столбце.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
Returns: Возвращает значение типа int.
Notes
Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].GetCustomData.

Teigha.DatabaseServices.Table.GetCustomData(System.Int32,System.Int32,String)
Метод предназначен для получения пользовательских данных, заданных в ячейке, строке или столбце в виде пар "ключ-значение".
Метод предназначен для получения пользовательских данных, заданных в ячейке, строке или столбце в виде пар "ключ-значение".
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
key: Ключ сохраненных пользовательских данных.	Тип String.
Returns: Возвращает тип Object.
Notes
Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].GetCustomData.

Teigha.DatabaseServices.Table.GetDataFormat(System.Int32,System.Int32)
Метод позволяет получить формат данных первого элемента содержимого заданной ячейки.
Метод позволяет получить формат данных первого элемента содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает формат данных в виде строки, тип String.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].DataFormat.

Teigha.DatabaseServices.Table.GetDataFormat(System.Int32,System.Int32,System.Int32)
Метод позволяет получить формат данных указанного по индексу элемента содержимого заданной ячейки.
Метод позволяет получить формат данных указанного по индексу элемента ячейки, заданной индексами строки и столбца.
_________
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает формат данных в виде строки, тип String.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].DataFormat.

Teigha.DatabaseServices.Table.GetDataLink(Teigha.DatabaseServices.CellRange)
Метод позволяет получить коллекцию ссылок на данные, связанные по ссылкам с указанным диапазоном ячеек.
Метод позволяет получить коллекцию ссылок на данные, связанные по ссылкам с указанным диапазоном ячеек.
range: Диапазон ячеек. Тип CellRange. Если передать NULL, метод вернет все ссылки в данной таблице.
Returns: Возвращает коллекцию типа ObjectIdCollection.

Teigha.DatabaseServices.Table.GetDataLink(System.Int32,System.Int32)
Метод предназначен для получения идентификатора ссылки на данные, если указанная ячейка связана с источником данных по ссылке.
Метод предназначен для получения идентификатора ссылки на данные, если указанная ячейка связана с источником данных по ссылке.
Вернет null, если ячейка не имеет ссылки на данные.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает идентификатор ссылки на данные. Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].DataLink.

Teigha.DatabaseServices.Table.GetDataLinkRange(System.Int32,System.Int32)
Метод позволяет получить связанный диапазон ячеек, если указанная ячейка входит в этот диапазон.
Метод позволяет получить связанный диапазон ячеек, если указанная ячейка является частью этого диапазона.
Ячейка задается индексами строки и столбца.  Указанная ячейка может быть любой ячейкой в связанном диапазоне.
Метод возвратит недопустимый диапазон, если указанная ячейка не принадлежит связанному диапазону.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает диапазон ячеек. Тип CellRange.
Notes
Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].GetDataLinkRange.

Teigha.DatabaseServices.Table.GetDataType(System.Int32,System.Int32,System.Int32)
Метод предназначен для получения типа данных и типа единиц для указанного индексом элемента содержимого в ячейке.
Метод предназначен для получения типа данных и типа единиц для указанного индексом элемента содержимого в ячейке.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает тип данных в элементе в виде объекта DataTypeParameter.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].Contents[i].DataType.

Teigha.DatabaseServices.Table.GetFieldId(System.Int32,System.Int32,System.Int32)
Метод предназначен для получения ObjectId поля в указанном индексом элементе содержимого ячейки.
Метод предназначен для получения ObjectId поля в указанном индексом элементе содержимого ячейки.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает ObjectId поля. Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].Contents[i].FieldId.

Teigha.DatabaseServices.Table.GetFormula(System.Int32,System.Int32,System.Int32)
Метод позволяет получить формулу, если она имеется в указанном элементе содержимого ячейки.
Метод позволяет получить формулу, если она имеется в указанном индексом элементе содержимого ячейки.
В случае отсутствия формулы метод возвращает пустую строку.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает формулу в виде экземпляра класса String.
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].Contents[i].Formula.

Teigha.DatabaseServices.Table.GetGridColor(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для получения цвета сетки ячейки, строки или столбца.
Метод предназначен для получения цвета сетки ячейки, строки или столбца.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает цвет в виде объекта .
Notes
Для получения того же результата предпочтительнее использовать  Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color.

Teigha.DatabaseServices.Table.GetGridDoubleLineSpacing(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить величину просвета между двойными линиями сетки ячейки, строки или столбца.
Метод позволяет получить величину просвета между двойными линиями сетки ячейки, строки или столбца.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает значение просвета между двойными линиями сетки, тип double.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.DoubleLineSpacing.

Teigha.DatabaseServices.Table.GetGridLineStyle(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для получения стиля линии сетки в ячейке, строке или столбце.
Метод предназначен для получения стиля линии сетки в ячейке, строке или столбце.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает стиль линии сетки из перечисления Teigha.DatabaseServices.GridLineStyle.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineStyle.

Teigha.DatabaseServices.Table.GetGridLinetype(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для получения типа линий сетки в ячейке, строке или столбце.
Метод предназначен для получения типа линий сетки в ячейке, строке или столбце.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Linetype.

Teigha.DatabaseServices.Table.GetGridLineWeight(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для получения толщины линий сетки в ячейке, строке или столбце.
Метод предназначен для получения толщины линий сетки в ячейке, строке или столбце.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает толщину линии из перечисления Teigha.DatabaseServices.LineWeight.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight.

Teigha.DatabaseServices.Table.GetGridProperty(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для получения свойств сетки ячейки, строки или столбца.
Метод предназначен для получения свойств сетки ячейки, строки или столбца.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает свойств линий сетки в виде объекта GridPropertyParameter.

Teigha.DatabaseServices.Table.GetGridVisibility(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для определения видимости сетки ячейки, строки или столбца.
Метод предназначен для определения видимости сетки ячейки, строки или столбца.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
Можно передать в метод комбинацию типов линий, объединив их с помощью оператора OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает значение видимости сетки из перечисления Teigha.DatabaseServices.Visibility.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.IsVisible

Teigha.DatabaseServices.Table.GetIsAutoScale(System.Int32,System.Int32,System.Int32)
Метод позволяет проверить, включено ли автомасштабирование в указанной ячейке таблицы.
Метод позволяет проверить, включено ли автомасштабирование в указанной ячейке таблицы.
Если оно включено, то при размещении блока в ячейке объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает true, если блок в элементе с указанным индексом масштабируется автоматически, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].IsAutoScale.

Teigha.DatabaseServices.Table.GetMargin(System.Int32,System.Int32,Teigha.DatabaseServices.CellMargins)
Метод предназначен для получения полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
Метод предназначен для получения полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
margin: Тип поля (Top, Left, Bottom, Right) из перечисления Teigha.DatabaseServices.CellMargins.
Returns: Возвращает величину поля, тип double.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Margin

Teigha.DatabaseServices.Table.GetMergeAllEnabled(System.Int32,System.Int32)
Метод позволяет определить состояние флага слияния всех ячеек в заданной строке или столбце таблицы.
Метод позволяет определить состояние флага слияния всех ячеек в заданной строке или столбце таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает true, если в строке или столбце включен флаг слияния всех ячеек, иначе false.
Notes
Метод не реализован.
Используйте Table.Cells[row,column].IsMergeAllEnabled.

Teigha.DatabaseServices.Table.GetMergeRange(System.Int32,System.Int32)
Метод позволяет определить диапазон слияния для указанной ячейки.
Метод позволяет определить диапазон слияния для указанной ячейки.
Диапазон слияния будет недействительным, если ячейка не входит в этот диапазон.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает диапазон слияния. Тип CellRange.

Teigha.DatabaseServices.Table.GetNumberOfContents(System.Int32,System.Int32)
Метод позволяет определить количество элементов содержимого в указанной ячейке.
Метод позволяет определить количество элементов содержимого в указанной ячейке.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает количество элементов содержимого в ячейке. Тип int.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents.Count.

Teigha.DatabaseServices.Table.GetOverrides(System.Int32,System.Int32,System.Int32)
Метод позволяет получить переопределение ячейки, строки, столбца или содержимого ячейки.
Метод позволяет получить переопределение ячейки, строки, столбца или содержимого ячейки.
Чтобы указать элемент содержимого ячейки, следует задать допустимые индексы строки, столбца и элемента содержимого ячейки.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца, а также -1 в качестве индекса элемента содержимого ячейки.
Чтобы указать строку, следует задать допустимый индекс строки и -1 для индексов столбца и элемента содержимого ячейки.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 для индексов строки и элемента содержимого ячейки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс может равняться -1.
Returns: Возвращает значение из перечисления Teigha.DatabaseServices.CellProperties.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].Overrides

Teigha.DatabaseServices.Table.GetOverrides(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить переопределение для указанного типа линий сетки в ячейке, строке или столбце.
Метод позволяет получить переопределение для указанного типа линий сетки в ячейке, строке или столбце.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridLineType: Тип линий сетки из перечисления GridLineType.
Returns: Возвращает значение из перечисления Teigha.DatabaseServices.CellProperties.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Overrides.

Teigha.DatabaseServices.Table.GetRotation(System.Int32,System.Int32,System.Int32)
Метод позволяет определить угол поворота указанного элемента содержимого ячейки.
Метод позволяет определить угол поворота указанного элемента содержимого ячейки.
Элемент задается индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает угол поворота в радианах, тип double.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].Rotation.

Teigha.DatabaseServices.Table.GetScale(System.Int32,System.Int32,System.Int32)
Метод позволяет определить масштаб указанного элемента содержимого ячейки.
Метод позволяет определить масштаб указанного элемента содержимого ячейки.
Элемент задается его индексом в коллекции содержимого ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает масштаб, тип double.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].Scale.

Teigha.DatabaseServices.Table.GetTextHeight(System.Int32,System.Int32,System.Int32)
Метод предназначен для получения высоты текста элемента содержимого, заданного его индексом.
Метод предназначен для получения высоты текста элемента содержимого, заданного его индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает высоту текста, тип double.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].TextHeight.

Teigha.DatabaseServices.Table.GetTextString(System.Int32,System.Int32,System.Int32)
Метод предназначен для получения текстовой строки из первого элемента содержимого, заданного по индексу.
Метод предназначен для получения текстовой строки из первого элемента содержимого, заданного по индексу.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает строку String.
Notes
Для получения того же результата предпочтительнее использовать свойство Table.Cells[row,column].Contents[i].TextString.

Teigha.DatabaseServices.Table.GetTextString(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.FormatOption)
Метод предназначен для получения текстовой строки из первого элемента содержимого, заданного по индексу.
Метод предназначен для получения текстовой строки из первого элемента содержимого, заданного по индексу.
Опции форматирования передаются с помощью параметра formatOption.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
formatOption: Опции формирования строки из перечисления FormatOption.
Returns: Возвращает строку String.
Notes
Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents[i].GetTextString.

Teigha.DatabaseServices.Table.GetTextStyleId(System.Int32,System.Int32,System.Int32)
Метод предназначен для получения ObjectId текстового стиля элемента содержимого по указанному индексу.
Метод предназначен для получения ObjectId текстового стиля элемента содержимого по указанному индексу.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].TextStyleId.

Teigha.DatabaseServices.Table.GetToolTip(System.Int32,System.Int32)
Метод предназначен для формирования строки всплывающей подсказки для ячейки, строки или столбца.
Метод предназначен для формирования строки всплывающей подсказки для ячейки, строки или столбца.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
Returns: Возвращает строку подсказки, тип String.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].ToolTip.

Teigha.DatabaseServices.Table.GetValue(System.Int32,System.Int32,System.Int32)
Метод позволяет определить значение элемента содержимого ячейки, заданного по его индексу.
Метод позволяет определить значение элемента содержимого ячейки, заданного по его индексу.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает значение элемента содержимого ячейки. Тип Object.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Content[i].Value.

Teigha.DatabaseServices.Table.GetValue(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.FormatOption)
Метод позволяет определить значение элемента содержимого ячейки, заданного по его индексу.
При формировании строки учитываются опции, заданные в параметре formatOption.
Метод позволяет определить значение элемента содержимого ячейки, заданного по его индексу.
При формировании значения учитываются опции, заданные в параметре formatOption.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
formatOption: Опции формирования значения из перечисления FormatOption.
Returns: Возвращает значение элемента содержимого ячейки. Тип Object.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Content[i].GetValue.

Teigha.DatabaseServices.Table.GridColor(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод предназначен для получения цвета сетки для заданного типа линий сетки и типа строки объекта таблицы.
Метод предназначен для получения цвета сетки для заданного типа линий сетки и типа строки объекта таблицы.
Тип линий и тип строки задаются значениями из перечислений GridLineType и , соответственно.
gridlineType: Тип линии сетки, для которой следует получить цвет. Значение из перечисления GridLineType.
type: Тип строки, для которой следует получить цвет. Значение из перечисления <link Teigha
Returns: Возвращает цвет сетки. Тип .
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.GridColor(System.Int32,System.Int32,Teigha.DatabaseServices.CellEdgeMasks)
Метод позволяет получить цвет сетки с указанной стороны ячейки.
Метод позволяет получить цвет сетки с указанной стороны ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
edge: Сторона ячейки, заданная значением из перечисления CellEdgeMasks.
Returns: Возвращает цвет сетки. Тип .
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color.

Teigha.DatabaseServices.Table.GridLineWeight(System.Int32,System.Int32,Teigha.DatabaseServices.CellEdgeMasks)
Метод позволяет получить толщину линии сетки с указанной стороны ячейки.
Метод позволяет получить толщину линии сетки с указанной стороны ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
edge: Сторона ячейки, заданная значением из перечисления CellEdgeMasks.
Returns: Возвращает толщину линии сетки. Значение из перечисления DatabaseServices.LineWeight.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight.

Teigha.DatabaseServices.Table.GridLineWeight(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет получить толщину линии для заданного типа линии сетки и типа строки объекта Table.
Метод позволяет получить толщину линии для заданного типа линии сетки и типа строки объекта Table.
gridlineType: Тип линии сетки из перечисления GridLineType.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает толщину линии сетки как значение из перечисления DatabaseServices.LineWeight.
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.GridVisibility(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет определить видимость сетки для заданного типа линий сетки и для конкретного типа строки объекта таблицы.
Метод позволяет определить видимость сетки для заданного типа линий сетки и для конкретного типа строки объекта таблицы.
Допустимые типы линий сетки и типы строк задаются перечислениями GridLineType и , соответственно.
gridlineType: Тип линии сетки из перечисления GridLineType.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает true, если видимость включена, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.GridVisibility(System.Int32,System.Int32,Teigha.DatabaseServices.CellEdgeMasks)
Метод позволяет определить видимость сетки с указанной стороны ячейки.
Метод позволяет определить видимость сетки с указанной стороны ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
edge: Сторона ячейки из перечисления CellEdgeMasks.
Returns: Возвращает true, если видимость включена, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Visibility.

Teigha.DatabaseServices.Table.HasFormula(System.Int32,System.Int32,System.Int32)
Метод позволяет определить, является ли формулой заданный по индексу элемент содержимого ячейки.
Метод позволяет определить, является ли формулой заданный по индексу элемент содержимого ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
Returns: Возвращает true, если искомый элемент содержимого является формулой, и false в противном случае.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].HasFormula.

Teigha.DatabaseServices.Table.HitTest(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод позволяет проверить попадание в таблицу для указанной точки и заданного направления взгляда.
Метод позволяет проверить попадание в таблицу для указанной точки и заданного направления взгляда.
point: Проверяемая точка, тип Point3d.
viewVector: Направление взгляда, тип Vector3d.
Returns: Возвращает результат проверки в виде экземпляра класса TableHitTestInfo.

Teigha.DatabaseServices.Table.InsertColumns(System.Int32,System.Double,System.Int32)
Метод вставляет в таблицу по указанному индексу один или несколько столбцов.
Метод вставляет в таблицу по указанному индексу один или несколько столбцов.
col: Индекс столбца в месте вставки, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
width: Ширина вставляемых столбцов, тип double.
columns: Количество вставляемых столбцов, тип int.

Teigha.DatabaseServices.Table.InsertColumnsAndInherit(System.Int32,System.Int32,System.Int32)
Метод предназначен для вставки в таблицу заданного количества новых столбцов, начиная с указанного индекса.
Метод предназначен для вставки в таблицу заданного количества новых столбцов, начиная с указанного индекса.
Метод позволяет на выбор использовать для новых столбцов формат по умолчанию или наследовать формат у существующего столбца.
col: Индекс, начиная с которого выполняется вставка новых столбцов, тип int.
inheritFrom: Индекс столбца, у которого вставляемые столбцы наследуют формат, тип int.  Может принимать значение -1.  В этом случае новые столбцы создаются с форматом по умолчанию.
numCols: Количество вставляемых столбцов, тип int.

Teigha.DatabaseServices.Table.InsertRows(System.Int32,System.Double,System.Int32)
Метод позволяет вставить одну или несколько строк по указанному индексу.
Метод позволяет вставить одну или несколько строк по указанному индексу.
row: Индекс строки, задающий место вставки, тип int. Должен быть больше или равен нулю и меньше количества строк в таблице.
height: Высота вставляемых строк, тип double.
rows: Количество вставляемых строк, тип int.

Teigha.DatabaseServices.Table.InsertRowsAndInherit(System.Int32,System.Int32,System.Int32)
Метод позволяет вставить в таблицу заданное количество новых строк по указанному индексу строки.
Метод позволяет вставить в таблицу заданное количество новых строк по указанному индексу строки.
Метод позволяет на выбор использовать для новых строк формат по умолчанию или наследовать формат у существующей строки.
index: Индекс, начиная с которого выполняется вставка новых строк, тип int.
inheritFrom: Индекс строки, у которой новые строки наследуют формат, тип int.  Может принимать значение -1.  В этом случае новые строки создаются с форматом по умолчанию.
numRows: Количество вставляемых строк, тип int.

Teigha.DatabaseServices.Table.IsAutoScale(System.Int32,System.Int32)
Метод позволяет определить, установлен ли флаг автоматического вычисления масштаба и точки вставки содержимого блока при помещении его в указанную ячейку.
Метод позволяет определить, установлен ли флаг автоматического вычисления масштаба и точки вставки содержимого блока при помещении его в указанную ячейку.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает true в случае, если в указанной ячейке выставлен флаг автоматического вычисления масштаба и точки вставки.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents[i].IsAutoScale.

Teigha.DatabaseServices.Table.IsBackgroundColorNone(Teigha.DatabaseServices.RowType)
Метод позволяет определить, задан ли цвет фона для заданного типа строки объекта Table.
Метод позволяет определить, задан ли цвет фона для заданного типа строки объекта Table.
Если тип строки не указан, используется значение DataRow по умолчанию.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает true, если для заданного типа строки цвет фона не задан (None); в противном случае возвращает false.
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.IsBackgroundColorNone(System.Int32,System.Int32)
Метод позволяет определить, задан ли цвет фона в указанной ячейке.
Метод позволяет определить, задан ли цвет фона в указанной ячейке.
Ячейке задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает true, если для заданного типа строки цвет фона не определен (None); в противном случае возвращает false.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsBackgroundColorNone.

Teigha.DatabaseServices.Table.IsContentEditable(System.Int32,System.Int32)
Метод позволяет определить, возможно ли изменение содержимого ячейки.
Метод позволяет определить, возможно ли изменение содержимого ячейки.
Например, содержимое заблокированных и доступных только для чтения ячеек изменить нельзя.
Учитывая, что семантика редактируемой ячейки может измениться по мере добавления новых состояний, для проверки состояния ячеек рекомендуется метод IsContentEditable вместо прямого обращения к cellState.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает true, если содержимое ячейки изменить можно, и false, если нет.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsContentEditable.

Teigha.DatabaseServices.Table.IsEmpty(System.Int32,System.Int32)
Метод позволяет определить, является ли содержимое указанной ячейки пустым.
Метод позволяет определить, является ли содержимое указанной ячейки пустым.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает true, если ячейка пуста, и false, если нет.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsEmpty.

Teigha.DatabaseServices.Table.IsFormatEditable(System.Int32,System.Int32)
Метод позволяет определить, разрешено ли изменение формата ячейки.
Метод позволяет определить, разрешено ли изменение формата ячейки.
Учитывая, что семантика редактируемой ячейки может измениться по мере добавления новых состояний, для проверки редактируемости ячеек рекомендуется использовать данный метод вместо прямого обращения к cellState.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает true, если формат можно изменить, и false, если нет.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsFormatEditable.

Teigha.DatabaseServices.Table.IsLinked(System.Int32,System.Int32)
Метод позволяет определить, связана ли ячейка с источником данных.
Метод позволяет определить, связана ли ячейка с источником данных.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает true, если ячейка связана, и false, если нет.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsLinked.

Teigha.DatabaseServices.Table.IsMergedCell(System.Int32,System.Int32,[Out]CellRange%)
Метод позволяет определить, принадлежит ли данная ячейка области объединенных ячеек.
Метод позволяет определить, принадлежит ли данная ячейка области объединенных ячеек.
Область объединенных ячеек всегда является прямоугольной.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
range: Диапазон объединенных ячеек. Тип CellRange.
Returns: Возвращает true, если ячейка входит в указанный диапазон, и false, если нет.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].IsMerged.

Teigha.DatabaseServices.Table.MergeCells(Teigha.DatabaseServices.CellRange)
Метод предназначен для объединения ячеек в указанном диапазоне.
Метод предназначен для объединения ячеек в указанном диапазоне.
range: Диапазон объединяемых ячеек. Тип CellRange.

Teigha.DatabaseServices.Table.MinimumColumnWidth(System.Int32)
Метод позволяет получить для данной таблицы минимальную ширину столбца с заданным индексом.
Метод позволяет получить для данной таблицы минимальную ширину столбца с заданным индексом.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает минимальную ширину столбца, тип double.
Notes
Для получения того же результата предпочтительнее использовать Table.Columns[col].MinimumWidth.

Teigha.DatabaseServices.Table.MinimumRowHeight(System.Int32)
Метод позволяет получить минимальную высоту для указанной строки в данной таблице.
Метод позволяет получить минимальную высоту для указанной строки в данной таблице.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
Returns: Возвращает минимальную высоту строки, тип double.
Notes
Для получения того же результата предпочтительнее использовать Table.Rows[col].MinimumHeight.

Teigha.DatabaseServices.Table.MoveContent(System.Int32,System.Int32,System.Int32,System.Int32)
Данный метод перемещает элемент содержимого ячейки из одной позиции в коллекции элементов в другую позицию.
Данный метод перемещает элемент содержимого ячейки из одной позиции в коллекции элементов в другую позицию.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
fromIndex: Исходный индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
toIndex: Целевой индекс элемента содержимого ячейки, тип int.

Teigha.DatabaseServices.Table.RecomputeTableBlock(System.Boolean)
Данный метод обновляет запись блока таблицы, на которую ссылается объект Table, чтобы отразить любые изменения, внесенные в объект Table с момента последнего обновления этой записи в базе данных документа.
Данный метод обновляет запись блока таблицы, на которую ссылается объект Table, чтобы отразить любые изменения, внесенные в объект Table с момента последнего обновления этой записи в базе данных документа.
Если аргумент forceUpdate принимает значение true, то запись блока таблицы будет обновлена независимо от того, произошли ли какие-либо изменения в объекте Table с момента последнего обновления этой записи.
Если же forceUpdate имеет значение false, то запись блока таблицы будет обновлена только в том случае, если объект Table был изменён с момента его открытия, в настоящее время не стёрт и не находится в процессе операции отмены изменений.
forceUpdate: Флаг принудительного обновления записи блока таблицы в базе данных документа.

Teigha.DatabaseServices.Table.RemoveAllOverrides(System.Int32,System.Int32)
Метод предназначен для удаления всех переопределений в ячейке, строке или столбце.
Метод удаляет все переопределения в ячейке, строке или столбце.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки ячейки, тип int.  Индекс может равняться -1, если интересует весь столбец.
col: Индекс столбца ячейки, тип int. Индекс может равняться -1, если интересует вся строка.

Teigha.DatabaseServices.Table.RemoveDataLink(System.Int32,System.Int32)
Метод предназначен для удаления из указанной ячейки ссылки на данные.
Метод удаляет ссылку на данные из ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс может равняться -1, если требуется удалить ссылки во всем столбце.
col: Индекс столбца, тип int. Индекс может равняться -1, если требуется удалить ссылки во всей строке.

Teigha.DatabaseServices.Table.ReselectSubRegion(array)
Метод предназначен для получения подобъектов ячеек текущей подвыборки.
Метод предназначен для получения подобъектов ячеек текущей подвыборки.
Пути могут быть пустыми, если в подвыборке нет ячеек.
paths: Массив путей подобъектов. Тип FullSubentityPath[].

Teigha.DatabaseServices.Table.ResetValue(System.Int32,System.Int32)
Сбрасывает значение в заданной ячейке.
Сбрасывает значение в заданной ячейке.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице

Teigha.DatabaseServices.Table.RowHeight(System.Int32)
Метод предназначен для получения высоты конкретной строки таблицы.
Метод предназначен для получения высоты строки, указанной её индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
Returns: Возвращает высоту строки таблицы, тип double.
Notes
Для получения того же результата предпочтительнее использовать Table.Rows[col].Height.

Teigha.DatabaseServices.Table.RowType(System.Int32)
Метод позволяет получить тип указанной строки данной таблицы (наименование таблицы, заголовки столбцов, строки данных).
Метод позволяет получить тип указанной строки данной таблицы (наименование таблицы, заголовки столбцов, строки данных).
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
Returns: Возвращает тип строки из перечисления .
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Row.

Teigha.DatabaseServices.Table.Select(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean,array)
Метод позволяет выделить в таблице ячейку, используя заданные точку, направление взгляда и ориентацию, а также вернуть подобъекты ячейки.
Метод позволяет выделить в таблице ячейку, используя заданные точку, направление взгляда и ориентацию.
Если аргумент paths не равен нулю, в нём будут возвращены подобъекты ячейки, включая обрамляющие линии сетки, MText и вхождения блоков.
pickingPoint: 3D-точка указания. Тип Point3d. Задается в мировой системе координат (WCS).
hitTestViewDirection: 3D-вектор, определяющий направление взгляда. Тип Vector3d. Задается в WCS.
hitTestViewOrientation: 3D-вектор, определяющий ориентацию вида. Тип Vector3d. Задается в WCS.
allowOutside: Флаг, определяющий, будет ли выбирать ячейку точка указания за пределами таблицы. Тип bool.
inPickFirst: Флаг, который определяет, находится ли объект уже в наборе pickfirst (значение true) или логика pick first должна попытаться выделить объект напрямую (значение false). Тип bool.
paths: Выходной массив путей подобъектов.  Тип FullSubentityPath[].
Returns: Возвращает результат проверки выделения в виде экземпляра класса TableHitTestInfo.
Notes
Метод не реализован.

Teigha.DatabaseServices.Table.SelectSubRegion(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.SelectType,System.Boolean,System.Boolean,array)
Метод позволяет выделить набор ячеек таблицы, используя заданное окно, направление взгляда и ориентацию, а также вернуть подобъекты ячейки.
Метод позволяет выделить набор ячеек таблицы, используя заданное окно, направление взгляда и ориентацию.
Если массив paths не равен нулю, в нём будут возвращены подобъекты ячейки, включая обрамляющие линии сетки, MText и вхождения блоков.
anglePoint1: 3D-точка, задающая первый угол окна выделения. Тип Point3d. Задается в мировой системе координат (WCS).
anglePoint2: 3D-точка, задающая второй угол окна выделения. Тип Point3d. Задается в WCS.
selectionViewDirection: 3D-вектор в WCS, задающий направление взгляда при выделении. Тип Vector3d.
Vector3d hitTestViewDirection: 3D-вектор в WCS, задающий ориентацию вида при выделении. Тип Vector3d.
selectionType: Аргумент из перечисления SelectType, задающий тип выделения окном (Crossing или Window).
includeCurrentSelection: Флаг System.Boolean, определяющий, должен ли возвращаемый набор выделенных ячеек включать предварительно выделенные ячейки или только вновь выделенные ячейки.
inPickFirst: Флаг System.Boolean, который определяет, находится ли объект уже в наборе pickfirst (значение true) или логика pick first должна попытаться выделить объект напрямую (значение false).
paths: Выходной массив путей подобъектов.  Тип FullSubentityPath[].
Returns: Возвращает диапазон выделенных ячеек. Тип CellRange.
Notes
Метод не реализован.

Teigha.DatabaseServices.Table.SetAlignment(Teigha.DatabaseServices.CellAlignment,System.Int32)
Метод задает выравнивание ячеек в строках указанных типов.
Метод задает выравнивание ячеек в строках указанных типов.  Различные типы строк можно комбинировать, используя операторы OR.
Если тип строки не указан, этот метод обрабатывает все возможные типы строк.
align: Тип выравнивания из перечисления CellAlignment.
rowTypes: Типы строк.  Тип int.

Teigha.DatabaseServices.Table.SetAlignment(System.Int32,System.Int32,Teigha.DatabaseServices.CellAlignment)
Метод позволяет задать выравнивание текста или вхождения блока в указанной ячейке таблицы.
Метод позволяет задать выравнивание текста или вхождения блока в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
align: Тип выравнивания из перечисления CellAlignment.

Teigha.DatabaseServices.Table.SetAutoScale(System.Int32,System.Int32,System.Boolean)
Метод задает значение флага автомасштабирования, который определяет, следует ли автоматически подгонять вхождение блока под размер указанной ячейки.
Метод задает значение флага автомасштабирования, который определяет, следует ли автоматически подгонять вхождение блока под размер указанной ячейки.  Если аргумент autoFit принимает значение true, объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока, чтобы вписать его в указанную ячейку.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
autoFit: Флаг автомасштабирования вставляемого контента, тип bool. Если аргумент autoFit принимает значение true, объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока, чтобы вписать его в указанную ячейку.

Teigha.DatabaseServices.Table.SetBackgroundColor(Colors.Color,System.Int32)
Данный метод задает цвет фона для указанных типов строк.
Данный метод задает цвет фона для указанных типов строк.
Различные типы строк можно комбинировать с использованием оператора OR.
Если тип строки не указан, метод применяется ко всем возможным типам строк.
color: Цвет фона.  Тип <link Teigha
rowTypes: Типы строк, int.  Возможные значения типа строки

Teigha.DatabaseServices.Table.SetBackgroundColor(System.Int32,System.Int32,Colors.Color)
Метод задает цвет фона в указанной ячейке таблицы.
Метод задает цвет фона в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
color: Цвет фона.  Тип <link Teigha

Teigha.DatabaseServices.Table.SetBackgroundColorNone(System.Boolean,System.Int32)
Метод позволяет включить или отключить цвет фона в строке указанного типа.
Метод позволяет включить или отключить цвет фона в строке указанного типа.
Допустимые типы строк: DataRow, TitleRow и HeaderRow (cм. перечисление ). Можно комбинировать разные типы строк.
Если тип строки не указан, этот метод распространяет свое действие на все возможные типы строк.
value: Флаг, указывающий, следует ли включить цвет фона для строки указанного типа.
rowTypes: Тип строки, int.  См. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetBackgroundColorNone(System.Int32,System.Int32,System.Boolean)
Метод позволяет включить или отключить цвет фона в указанной ячейке.
Метод позволяет включить или отключить цвет фона в указанной ячейке.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
value: Флаг включения цвета фона для ячейки, тип bool.

Teigha.DatabaseServices.Table.SetBlockAttributeValue(System.Int32,System.Int32,DatabaseServices.ObjectId,String)
Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки является вхождение блока с атрибутами.
Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки является вхождение блока с атрибутами.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
attributeDefinitionId: Идентификатор определения атрибута AttributeDefinition. Тип DatabaseServices.ObjectId.
value: Новое значение атрибута блока, тип String.

Teigha.DatabaseServices.Table.SetBlockAttributeValue(System.Int32,System.Int32,System.Int32,DatabaseServices.ObjectId,String)
Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки по указанному индексу является вхождение блока с атрибутами.
Метод позволяет присвоить значение атрибуту блока, если элементом содержимого ячейки по индексу contentIndex является вхождение блока с атрибутами.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
attributeDefinitionId: Идентификатор определения атрибута AttributeDefinition. Тип DatabaseServices.ObjectId.
value: Новое значение атрибута блока, тип String.

Teigha.DatabaseServices.Table.SetBlockRotation(System.Int32,System.Int32,System.Double)
Метод позволяет задать угол поворота вхождения блока в указанной ячейке таблицы.
Метод позволяет задать угол поворота вхождения блока в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
rotationalAngle: Угол поворота вхождения блока в радианах, тип double.

Teigha.DatabaseServices.Table.SetBlockScale(System.Int32,System.Int32,System.Double)
Метод позволяет задать коэффициент масштабирования вхождения блока в указанной ячейке таблицы.
Метод позволяет задать коэффициент масштабирования вхождения блока в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
scale: Коэффициент масштабирования вхождения блока. Тип double.

Teigha.DatabaseServices.Table.SetBlockTableRecordId(System.Int32,System.Int32,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать ObjectId записи табличного блока в указанной ячейке таблицы.
Метод позволяет задать ObjectId записи табличного блока в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
blockId: ObjectId записи табличного блока. Тип DatabaseServices.ObjectId.
autoFit: Флаг, указывающий, следует ли автоматически масштабировать вхождение блока в ячейке. Тип bool.

Teigha.DatabaseServices.Table.SetBlockTableRecordId(System.Int32,System.Int32,System.Int32,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать ObjectId записи табличного блока элементу содержимого с указанным индексом в заданной ячейке.
Метод позволяет задать ObjectId записи табличного блока элементу содержимого с указанным индексом в заданной ячейке.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
blockId: ObjectId записи табличного блока. Тип DatabaseServices.ObjectId.
autoFit: Флаг, указывающий, следует ли автоматически масштабировать вхождение блока в ячейке. Тип bool.

Teigha.DatabaseServices.Table.SetBreakHeight(System.Int32,System.Double)
Метод позволяет установить высоту разрыва указанной таблицы, когда разбиение таблицы разрешено.
Метод позволяет установить высоту разрыва указанной таблицы, когда разбиение таблицы разрешено.
index: Индекс фрагмента таблицы, тип int. Индекс должен быть больше или равен нулю и меньше количества фрагментов, на которые разбита данная таблица.
height: Новая высота разрыва, тип double.

Teigha.DatabaseServices.Table.SetBreakOffset(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет задать вектор смещения разрыва таблицы.
Метод позволяет задать вектор смещения разрыва таблицы.
index: Индекс фрагмента таблицы, тип int. Индекс должен быть больше или равен нулю и меньше количества фрагментов, на которые разбита данная таблица.
offset: Вектор смещения. Тип Vector3d.

Teigha.DatabaseServices.Table.SetBreakSpacing(System.Double)
Метод позволяет задать интервал между фрагментами разбитой таблицы.
Метод позволяет задать интервал между фрагментами разбитой таблицы.
spacing: Интервал между фрагментами разбитой таблицы. Тип double.

Teigha.DatabaseServices.Table.SetCellState(System.Int32,System.Int32,Teigha.DatabaseServices.CellStates)
Метод позволяет установить состояние ячейки.
Метод позволяет установить состояние ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
cellState: Новое состояние ячейки из перечисления Teigha.DatabaseServices.CellStates.

Teigha.DatabaseServices.Table.SetCellStyle(System.Int32,System.Int32,String)
Метод позволяет задать стиль ячейки для конкретной ячейки, целой строки или всего столбца.
Метод позволяет задать стиль ячейки для конкретной ячейки, целой строки или всего столбца.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
styleName: Имя стиля ячейки, тип String. Этот стиль должен существовать в наборе табличных стилей таблицы.

Teigha.DatabaseServices.Table.SetCellType(System.Int32,System.Int32,Teigha.DatabaseServices.TableCellType)
Метод позволяет задать тип ячейки, который будет применён к ячейке в указанной позиции.
Метод позволяет задать тип ячейки, который будет применён к ячейке в указанной позиции.
Допустимые значения для типа ячейки: TextCell и BlockCell из перечисления TableCellType.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
type: Новый тип ячейки из перечисления TableCellType.  Допустимые значения для типа ячейки

Teigha.DatabaseServices.Table.SetColumnName(System.Int32,String)
Метод задаёт имя столбца.
Метод позволяет задать имя столбца; может быть оставлено пустым.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
name: Имя, которое должно быть присвоено столбцу, тип String.  Может быть пустой строкой.

Teigha.DatabaseServices.Table.SetColumnWidth(System.Double)
Метод позволяет задать единую ширину для всех столбцов данной таблицы.
Метод позволяет задать единую ширину для всех столбцов данной таблицы.
width: Новое значение ширины для всех столбцов таблицы. Тип double.

Teigha.DatabaseServices.Table.SetColumnWidth(System.Int32,System.Double)
Метод позволяет задать новое значение ширины столбцу с заданным индексом.
Метод позволяет задать новое значение ширины столбцу с заданным индексом.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
width: Новое значение ширины указанного столбца. Тип double.

Teigha.DatabaseServices.Table.SetContentColor(Colors.Color,System.Int32)
Метод позволяет задать цвет содержимого в ячейках указанных типов строк.
Метод позволяет задать цвет содержимого в ячейках указанных типов строк.
Возможными значениями типа строки являются DataRow, TitleRow и HeaderRow (см. перечисление ).
Различные типы строк можно комбинировать с использованием оператора OR.
Если тип строки не указан, действие метода распространяется на все возможные типы строк.
color: Новый цвет содержимого ячейки. Тип <link Teigha
rowType: Тип строки, int.

Teigha.DatabaseServices.Table.SetContentColor(System.Int32,System.Int32,Colors.Color)
Метод позволяет задать цвет содержимого в указанной ячейке таблицы.
Метод позволяет задать цвет содержимого в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
color: Новый цвет содержимого ячейки. Тип <link Teigha

Teigha.DatabaseServices.Table.SetContentColor(System.Int32,System.Int32,System.Int32,Colors.Color)
Метод позволяет задать цвет элемента содержимого, заданного по его индексу в указанной ячейке таблицы.
Метод позволяет задать цвет элемента содержимого, заданного по его индексу в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
color: Новый цвет элемента содержимого ячейки. Тип <link Teigha

Teigha.DatabaseServices.Table.SetContentLayout(System.Int32,System.Int32,Teigha.DatabaseServices.CellContentLayout)
Метод позволяет задать новый макет для первого элемента содержимого заданной ячейки.
Метод позволяет задать новый макет для первого элемента содержимого заданной ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
layout: Новый макет для элемента содержимого ячейки. Значение из перечисления Teigha.DatabaseServices.CellContentLayout.

Teigha.DatabaseServices.Table.SetCustomData(System.Int32,System.Int32,String,Object)
Метод позволяет задать пользовательские данные в ячейке, строке или столбце.
Метод позволяет задать пользовательские данные в ячейке, строке или столбце.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
key: Ключ для использования с пользовательскими данными. Тип String.
value: Новые пользовательские данные для ячейки, тип Object. В случае значения NULL пользовательские данные удаляются.

Teigha.DatabaseServices.Table.SetCustomData(System.Int32,System.Int32,System.Int32)
Метод позволяет задать пользовательские данные в ячейке, строке или столбце.
Метод позволяет задать пользовательские данные в ячейке, строке или столбце.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
data: Новые пользовательские данные для ячейки, тип int. В случае значения NULL пользовательские данные удаляются.

Teigha.DatabaseServices.Table.SetDataFormat(System.Int32,System.Int32,System.Int32,String)
Метод позволяет задать формат данных для первого элемента содержимого ячейки.
Метод позволяет задать формат данных для первого элемента содержимого ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
format: Новый формат элемента содержимого ячейки, тип String.

Teigha.DatabaseServices.Table.SetDataFormat(System.Int32,System.Int32,String)
Метод позволяет задать формат данных для первого элемента содержимого ячейки.
Метод позволяет задать формат данных для первого элемента содержимого ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
format: Новый формат элемента содержимого ячейки, тип String.

Teigha.DatabaseServices.Table.SetDataLink(Teigha.DatabaseServices.CellRange,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет установить ссылку на данные для диапазона ячеек.
Метод позволяет установить ссылку на данные для диапазона ячеек.
Вся информация, содержащаяся в ячейках диапазона до установки ссылки на данные, будет удалена.
Если верхняя левая ячейка диапазона range – это верхняя левая ячейка существующего диапазона, связанного с данными, этот метод заменит старую ссылку на новую.
Если диапазон range перекрывается с ячейками любого другого диапазона, связанного с данными, метод завершит работу с ошибкой.
Этот метод не обновляет данные автоматически. Для обновления данных следует вызвать метод UpdateDataLink().
range: Диапазон, для которого задаётся ссылка на данные. Если принимает значение NULL, метод получает все ссылки на данные в таблице. Тип CellRange.
dataLinkId: Идентификатор ссылки на данные. Тип DatabaseServices.ObjectId.
bUpdate: Флаг обновления ссылки на данные после установки (значение true) или значение false, если такое обновление не требуется.

Teigha.DatabaseServices.Table.SetDataLink(System.Int32,System.Int32,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет установить в ячейке ссылку на данные.
Метод позволяет установить в ячейке ссылку на данные.
Если указанная ячейка является верхней левой ячейкой существующего диапазона, связанного с данными, метод заменит старую ссылку на новую. Если это любая другая ячейка в существующем диапазоне, который связан с данными, работа метода завершится ошибкой.
Этот метод не обновляет данные автоматически. Для обновления данных следует вызвать метод UpdateDataLink().
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
dataLinkId: Объект ссылки на внешние данные. Тип DatabaseServices.ObjectId.
bUpdate: Флаг обновления внешней ссылки после установки (значение true) или значение false, если такое обновление не требуется.

Teigha.DatabaseServices.Table.SetDataType(DatabaseServices.DataType,Teigha.DatabaseServices.UnitType,System.Int32)
Метод позволяет задать тип данных, тип единицы измерения и тип строки объекта Table.
Метод позволяет задать тип данных, тип единицы измерения и тип строки объекта Table.
nDataType: Тип данных.  Тип DatabaseServices.DataType.
nUnitType: Тип единицы измерения данных.  Тип UnitType.
rowTypes: Тип строки объекта Table, int.  См. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetDataType(System.Int32,System.Int32,DatabaseServices.DataType,Teigha.DatabaseServices.UnitType)
Метод позволяет задать в ячейке тип данных и тип единицы измерения.
Метод позволяет задать в ячейке тип данных и тип единицы измерения.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
nDataType: Тип данных.  Тип DatabaseServices.DataType.
nUnitType: Тип единицы измерения данных.  Тип UnitType.

Teigha.DatabaseServices.Table.SetDataType(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.DataTypeParameter)
Метод позволяет задать в ячейке тип данных элемента содержимого с указанным индексом.
Метод позволяет задать в ячейке тип данных элемента содержимого с указанным индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
dataType: Тип данных, которые следует установить в ячейке.  Тип DataTypeParameter.

Teigha.DatabaseServices.Table.SetFieldId(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать идентификатор ObjectId поля для указанной ячейки.
Метод позволяет задать идентификатор ObjectId поля для указанной ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
fieldId: Идентификатор ObjectId поля.  Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Table.SetFieldId(System.Int32,System.Int32,System.Int32,DatabaseServices.ObjectId,Teigha.DatabaseServices.CellOption)
Метод позволяет задать идентификатор ObjectId поля в элементе содержимого ячейки с указанным индексом.
Метод позволяет задать идентификатор ObjectId поля в элементе содержимого ячейки с указанным индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
fieldId: Идентификатор объекта поля. Тип DatabaseServices.ObjectId.
option: Значение из перечисления Teigha.DatabaseServices.CellOption. Если оно равно InheritCellFormat, то поле унаследует формат у ячейки.

Teigha.DatabaseServices.Table.SetFormat(String,System.Int32)
Метод позволяет задать формат в ячейках строки указанного типа.
Метод позволяет задать формат в ячейках строки указанного типа.
pFormat: Имя формата. Тип String.
rowTypes: Тип строки объекта Table, int.  См. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetFormat(System.Int32,System.Int32,String)
Метод позволяет задать формат в заданной ячейке.
Метод позволяет задать формат в заданной ячейке.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
pFormat: Имя формата. Тип String.

Teigha.DatabaseServices.Table.SetFormula(System.Int32,System.Int32,System.Int32,String)
Метод позволяет задать формулу в элементе содержимого ячейки, который задан индексом.
Метод позволяет задать формулу в элементе содержимого ячейки, который задан индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
formula: Строка с формулой, тип String.

Teigha.DatabaseServices.Table.SetGridColor(Colors.Color,System.Int32,System.Int32)
Метод позволяет задать цвет для данного типа линий сетки и типа строки объекта Table.
Метод позволяет задать цвет для данного типа линий сетки и типа строки объекта Table.
Можно комбинировать различные типы линий и типы строк.
color: Новый цвет линий. Тип <link Teigha
borders: Тип линий сетки, int.  См. перечисление Teigha.DatabaseServices.GridLineType.
rows: Тип строки, для которой меняется цвет сетки, int.  См. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetGridColor(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Colors.Color)
Метод позволяет задать цвет сетки ячейки, целой строки или всего столбца.
Метод позволяет задать цвет сетки ячейки, целой строки или всего столбца.
Чтобы задать одинаковый цвет сразу для нескольких типов линий сетки, можно объединить требуемые типы линий с помощью оператора OR.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линий сетки из перечисления GridLineType.
color: Новый цвет линий. Тип <link Teigha

Teigha.DatabaseServices.Table.SetGridColor(System.Int32,System.Int32,short,Colors.Color)
Метод позволяет задать цвет сетки с указанной стороны ячейки.
Метод позволяет задать цвет сетки с указанной стороны ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
edges: Индекс стороны ячейки, тип short.  См.перечисление CellEdgeMasks.
color: Новый цвет линий. Тип <link Teigha

Teigha.DatabaseServices.Table.SetGridDoubleLineSpacing(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,System.Double)
Метод позволяет установить величину просвета между двойными линиями сетки для ячеек, строк и столбцов.
Метод позволяет установить величину просвета между двойными линиями сетки для ячеек, строк и столбцов.
Чтобы задать одинаковое значение сразу для нескольких типов линий сетки, можно объединить несколько типов линий сетки с помощью оператора OR.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линии сетки из перечисления GridLineType.
spacing: Значение просвета у двойной линии сетки. Тип double.

Teigha.DatabaseServices.Table.SetGridLineStyle(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.GridLineStyle)
Метод позволяет задать стиль линий сетки для ячеек, строк и столбцов.
Метод позволяет задать стиль линий сетки для ячеек, строк и столбцов.
Чтобы задать одинаковый стиль сразу для нескольких типов линий сетки, типы линий можно объединять с помощью оператора OR.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линии сетки из перечисления GridLineType.
lineStyle: Новый стиль линий сетки из перечисления GridLineStyle.

Teigha.DatabaseServices.Table.SetGridLinetype(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,DatabaseServices.ObjectId)
Метод позволяет задать тип линий сетки для ячеек, строк и столбцов.
Метод позволяет задать тип линий сетки для ячеек, строк и столбцов.
Чтобы задать одинаковое значение сразу для нескольких типов линий сетки, эти типы можно объединять с помощью оператора OR.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линии сетки из перечисления GridLineType. Допускаются комбинации типов с использованием оператора OR.
linetype: Идентификатор типа линии. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Table.SetGridLineWeight(DatabaseServices.LineWeight,System.Int32,System.Int32)
Метод позволяет задать толщину линии для заданного типа линии сетки и типа строки объекта Table.
Метод позволяет задать толщину линии для заданного типа линии сетки и типа строки объекта Table.
Можно комбинировать различные типы линий и типы строк таблицы.
lineWeight: Толщина линии из перечисления DatabaseServices.LineWeight.
borders: Типы линий сетки, для которых нужно изменить толщины линий.
rows: Тип строки, для которой изменяется толщина линии, int.  См. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetGridLineWeight(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,DatabaseServices.LineWeight)
Метод позволяет задать толщину линии для ячейки, строки или столбца объекта Table.
Метод позволяет задать толщину линии для ячейки, строки или столбца объекта Table.
Чтобы задать одинаковое значение сразу для нескольких типов линий сетки, можно комбинировать типы линий, используя оператор OR.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линий сетки из перечисления GridLineType.
lineWeight: Толщина линии из перечисления DatabaseServices.LineWeight.

Teigha.DatabaseServices.Table.SetGridLineWeight(System.Int32,System.Int32,short,DatabaseServices.LineWeight)
Метод позволяет задать толщину линии сетки с указанной стороны ячейки.
Метод позволяет задать толщину линии сетки с указанной стороны ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
edges: Индекс стороны ячейки, тип short.  См.перечисление CellEdgeMasks.
lineWeight: Толщина линии из перечисления DatabaseServices.LineWeight.

Teigha.DatabaseServices.Table.SetGridProperty(Teigha.DatabaseServices.CellRange,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.GridPropertyParameter)
Метод позволяет задать свойства линий сетки для ячеек, строк или столбцов в диапазоне ячеек.
Метод позволяет задать свойства линий сетки для ячеек, строк или столбцов в диапазоне ячеек.
Диапазон может быть диапазоном ячеек, диапазоном строк или диапазоном столбцов.
rangeIn: Входной диапазон ячеек, диапазон строк или диапазон столбцов таблицы. Тип CellRange.
gridLineTypes: Типы линий сетки из перечисления GridLineType. Допускаются комбинации этих типов с использованием оператора OR.
gridProp: Свойства линий сетки, которые требуется задать. Тип GridPropertyParameter.

Teigha.DatabaseServices.Table.SetGridProperty(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.GridPropertyParameter)
Метод позволяет задать свойства линий сетки в ячейке, строке или столбце.
Метод позволяет задать свойства линий сетки в ячейке, строке или столбце.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
Чтобы задать одно и то же значение сразу для нескольких типов линий сетки, следует объединить эти типы с помощью оператора OR.
Перед вызовом этого метода свойство PropertyMask класса Teigha.DatabaseServices.GridPropertyParameter должно быть инициализировано значением, указывающим, какие именно свойства должны быть изменены.  Если в метод передается нуль, будут установлены все свойства.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линии сетки из перечисления GridLineType. Допускаются комбинации типов линий с использованием оператора OR.
gridProperty: Свойства линий сетки, которые требуется задать. Тип GridPropertyParameter.

Teigha.DatabaseServices.Table.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
Метод позволяет установить видимость сетки для данного типа линий сетки и типа строки объекта Table.
Метод позволяет установить видимость сетки для данного типа линий сетки и типа строки объекта Table.
Допускаются комбинации различных типов линий и типов строк.
visible: Флаг видимости сетки, bool. Задать true, чтобы сетка была видимой, и false в противном случае.
borders: Типы линий сетки, для которых задаётся видимость, int.  См. перечисление GridLineType.
rows: Тип строки объекта Table, для которого задаётся видимость, int.  См. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetGridVisibility(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.Visibility)
Метод позволяет задать видимость сетки у ячеек, строк или столбцов.
Метод позволяет задать видимость сетки у ячеек, строк или столбцов.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
Чтобы установить одно и то же значение сразу для нескольких типов линий сетки, можно объединить эти типы, используя оператор OR.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линии сетки из перечисления GridLineType.
visibility: Видимость линий из перечисления Teigha.DatabaseServices.Visibility.

Teigha.DatabaseServices.Table.SetGridVisibility(System.Int32,System.Int32,short,System.Boolean)
Метод позволяет задать видимость сетки с указанной стороны ячейки.
Метод позволяет задать видимость сетки с указанной стороны ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
edges: Индекс стороны ячейки, тип short.  См.перечисление CellEdgeMasks.
value: Флаг видимости сетки у ячейки, строки или столбца, bool.

Teigha.DatabaseServices.Table.SetIsAutoScale(System.Int32,System.Int32,System.Int32,System.Boolean)
Метод позволяет задать состояние флага автомасштабирования контента в указанной ячейке таблицы.
Метод позволяет задать состояние флага автомасштабирования контента в указанной ячейке таблицы.
Если этот флаг установлен, то при вставке блока в ячейку объект Table автоматически вычисляет масштаб и точку вставки вхождения блока.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
autoFit: Состояние флага автомасштабирования, тип bool.

Teigha.DatabaseServices.Table.SetMargin(System.Int32,System.Int32,Teigha.DatabaseServices.CellMargins,System.Double)
Метод позволяет задать поля (расстояния между границами и содержимым) для ячеек, строк или столбцов.
Метод позволяет задать поля (расстояния между границами и содержимым) для ячеек, строк или столбцов.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
margin: Тип поля (Top, Left, Bottom, Right) из перечисления Teigha.DatabaseServices.CellMargins.
value: Размер поля, double.

Teigha.DatabaseServices.Table.SetMergeAllEnabled(System.Int32,System.Int32,System.Boolean)
Метод позволяет задать слияние ячеек в строке или столбце таблицы от первой ячейки до ячейки с указанными индексами строки и столбца .
Метод позволяет задать слияние ячеек в строке или столбце таблицы от первой ячейки до ячейки с указанными индексами строки и столбца .
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
enable: Флаг слияния всех ячеек, bool.

Teigha.DatabaseServices.Table.SetOverrides(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.CellProperties)
Метод позволяет задать переопределение в ячейке, строке или столбце.
Метод позволяет задать переопределение в ячейке, строке или столбце.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
gridlineType: Тип линии сетки из перечисления GridLineType.
overrd: Свойства переопределения из перечисления CellProperties.

Teigha.DatabaseServices.Table.SetOverrides(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.CellProperties)
Метод позволяет задать переопределение в ячейке, строке, столбце или в элементе содержимого ячейки.
Метод позволяет задать переопределение в ячейке, строке, столбце или в элементе содержимого ячейки.
Чтобы указать элемент содержимого, передайте допустимые индексы строки, столбца и элемента содержимого ячейки.
Чтобы указать ячейку, передайте допустимые индексы строки и столбца и передайте -1 в качестве индекса элемента содержимого.
Чтобы указать строку, передайте допустимый индекс строки и передайте -1 в качестве индексов столбца и элемента содержимого.
Чтобы указать столбец, передайте допустимый индекс столбца и передайте -1 в качестве индексов строки и элемента содержимого.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс может равняться -1.
overrd: Задаваемое переопределение из перечисления CellProperties.

Teigha.DatabaseServices.Table.SetRotation(System.Int32,System.Int32,System.Int32,System.Double)
Метод позволяет задать угол поворота элемента содержимого ячейки, который задан его индексом.
Метод позволяет задать угол поворота элемента содержимого ячейки, который задан его индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
angle: Угол поворота элемента содержимого в радианах, тип double.

Teigha.DatabaseServices.Table.SetRowHeight(System.Double)
Метод позволяет установить одинаковую высоту строки для всех строк в данном объекте Table.
Метод позволяет установить одинаковую высоту строки для всех строк в данном объекте Table.
height: Новая высота строки, double.

Teigha.DatabaseServices.Table.SetRowHeight(System.Int32,System.Double)
Метод позволяет задать высоту строки с указанным индексом.
Метод позволяет задать высоту строки с указанным индексом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
height: Новая высота строки, double.

Teigha.DatabaseServices.Table.SetScale(System.Int32,System.Int32,System.Int32,System.Double)
Метод позволяет задать масштаб для элемента содержимого ячейки, который указан по индексу.
Метод позволяет задать масштаб для элемента содержимого ячейки, который указан по индексу.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
scale: Масштаб элемента содержимого ячейки, double.

Teigha.DatabaseServices.Table.SetSize(System.Int32,System.Int32)
Метод позволяет изменить размер данной таблицы.
Метод позволяет изменить размер данной таблицы.
numRows: Количество строк, тип int.
numCols: Количество столбцов, тип int.

Teigha.DatabaseServices.Table.SetTextHeight(System.Double,System.Int32)
Метод задает высоту текста в строках указанного типа.
Метод задает высоту текста в строках указанного типа.
Различные типы строк можно комбинировать с помощью оператора OR.
Если тип строки не указан, действие метода распространяется на все возможные типы строк.
height: Высота текста, тип double.
rowTypes: Тип строки объекта Table, int.  См. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetTextHeight(System.Int32,System.Int32,System.Double)
Метод позволяет задать высоту текста в указанной ячейке данной таблицы.
Метод позволяет задать высоту текста в указанной ячейке данной таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
height: Высота текста, тип double.

Teigha.DatabaseServices.Table.SetTextHeight(System.Int32,System.Int32,System.Int32,System.Double)
Метод задает высоту текста для элемента содержимого ячейки, который задан указанным индексом в коллекции содержимого.
Метод задает высоту текста для элемента содержимого ячейки, который задан указанным индексом в коллекции содержимого.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
height: Высота строки, тип double.

Teigha.DatabaseServices.Table.SetTextRotation(System.Int32,System.Int32,Teigha.DatabaseServices.RotationAngle)
Метод задает угол поворота текста в указанной ячейке. Допустимые углы кратны углу 90 градусов.
Метод задает угол поворота текста в указанной ячейке.
Метод принимает следующие значения угла поворота из перечисления RotationAngle: Degrees000, Degrees090, Degrees180, and Degrees270.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
rot: Угол поворота текста из перечисления RotationAngle.

Teigha.DatabaseServices.Table.SetTextString(System.Int32,System.Int32,System.Int32,String)
Метод позволяет задать текстовое значение для элемента содержимого ячейки, который указывается по индексу.
Метод позволяет задать текстовое значение для элемента содержимого ячейки, который указывается по индексу.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
text: Нуль-терминированная текстовая строка, тип String.

Teigha.DatabaseServices.Table.SetTextString(System.Int32,System.Int32,String)
Метод позволяет задать текст как значение в указанной ячейке.
Метод позволяет задать текст как значение в ячейке, указанной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
text: Нуль-терминированная текстовая строка, тип String.

Teigha.DatabaseServices.Table.SetTextStyle(DatabaseServices.ObjectId,System.Int32)
Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанных типов строк.
Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанных типов строк.
Возможные значения типа строки: DataRow, TitleRow и HeaderRow. См. перечисление .
Различные типы строк можно комбинировать с использованием оператора OR.
Если тип строки не указан, этот метод распространяет свое действие на все возможные типы строк.
id: Идентификатор записи TextStyleTableRecord, представляющей текстовый стиль. Тип DatabaseServices.ObjectId.
rowTypes: Тип строки объекта Table, int.  Возможными значениями типа строки являются DataRow, TitleRow и HeaderRow (см. перечисление <link Teigha

Teigha.DatabaseServices.Table.SetTextStyle(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанной ячейки.
Метод обеспечивает использование объектом Table заданной записи TextStyleTableRecord для указанной ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
id: Идентификатор записи TextStyleTableRecord, представляющей текстовый стиль. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Table.SetTextStyleId(System.Int32,System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод задает текстовый стиль указанному элементу содержимого ячейки.
Метод задает текстовый стиль элементу содержимого ячейки.
Элемент, которому нужно изменить стиль текста, указывается его порядковым номером (индексом) в коллекции содержимого ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
id: Идентификатор текстового стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Table.SetToolTip(System.Int32,System.Int32,String)
Метод позволяет задать строку всплывающей подсказки для ячейки, строки или столбца.
Метод позволяет задать строку всплывающей подсказки для ячейки, строки или столбца.
Чтобы задать ячейку, следует указать допустимые индексы строки и столбца.
Чтобы задать строку, следует указать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы задать столбец, следует указать допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки, тип int.  Индекс может равняться -1.
col: Индекс столбца, тип int. Индекс может равняться -1.
toolTip: Текст всплывающей подсказки, тип String.

Teigha.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Int32,Object)
Метод позволяет задать значение у первого элемента содержимого ячейки.
Метод позволяет задать значение у первого элемента содержимого ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
value: Задаваемое значение, тип Object.

Teigha.DatabaseServices.Table.SetValue(System.Int32,System.Int32,Object)
Метод позволяет задать значение у первого элемента содержимого ячейки.
Метод позволяет задать значение у первого элемента содержимого ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
value: Задаваемое значение, тип Object.

Teigha.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Int32,Object,Teigha.DatabaseServices.ParseOption)
Метод позволяет задать значение у первого элемента содержимого ячейки с учетом указанных опций.
Метод позволяет задать значение у первого элемента содержимого ячейки с учетом указанных опций.
Данный метод принимает только следующие значения перечисления ParseOption (все иные игнорируются):
* ParseOptionNone: нет опций.
* PreserveMtextFormat: сохранять текущее форматирование MText, если текущее и новое значения оба являются текстом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
value: Задаваемое значение, тип Object.
parseOption: Опции форматирования из перечисления ParseOption. Метод принимает лишь два значения

Teigha.DatabaseServices.Table.SetValue(System.Int32,System.Int32,String,Teigha.DatabaseServices.ParseOption)
Данный метод анализирует переданный текст и преобразует его в значение подходящего типа данных, которое затем помещает в ячейку.
Данный метод анализирует переданный текст и преобразует его в значение подходящего типа данных, которое затем помещает в ячейку.
* Если для nOption установлено значение ParseOptionNone, метод выполняет синтаксический анализ по умолчанию.
* Если это SetDefaultFormat, метод устанавливает для значения формат по умолчанию, соответствующий типу данных.
* Если это PreserveMtextFormat, для переданного текста используется форматирование MText, если это MText.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
pText: Исходный текст для преобразования в сохраняемое в ячейке значение, тип String.
nOption: Опции форматирования из перечисления ParseOption.

Teigha.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Int32,String,Teigha.DatabaseServices.ParseOption)
Метод позволяет задать значение у первого элемента содержимого ячейки с учетом указанных опций.
Метод позволяет задать значение у первого элемента содержимого ячейки.
Данный метод принимает только следующие значения перечисления ParseOption (все иные игнорируются):
* ParseOptionNone: нет опций.
* PreserveMtextFormat: сохранять текущее форматирование MText, если текущее и новое значения оба являются текстом.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
contentIndex: Индекс элемента содержимого ячейки, тип int. Индекс должен быть больше или равен нулю и меньше количества элементов содержимого в ячейке.
value: Исходный текст для преобразования в сохраняемое в ячейке значение, тип String.
parseOption: Опции форматирования из перечисления ParseOption. Метод принимает лишь два значения

Teigha.DatabaseServices.Table.SuppressRegenerateTable(System.Boolean)
Этот метод позволяет приложению временно отключить регенерацию объекта Table на время изменения одного или нескольких его свойств.
Этот метод позволяет приложению временно отключить регенерацию объекта Table на время изменения одного или нескольких его свойств.
suppress: Флаг подавления или включения регенерации объекта Table, bool.

Teigha.DatabaseServices.Table.TextHeight(DatabaseServices.RowType)
Метод предназначен для получения высоты текста в строках заданного типа.
Метод предназначен для получения высоты текста в строках заданного типа.
Возможные значения типа строки задаются перечислением  (DataRow, TitleRow и HeaderRow).
Если тип строки не указан, используется значение по умолчанию DataRow.
type: Тип строки из перечисления <link Teigha
Returns: Возвращает высоту текста, double.
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.TextHeight(System.Int32,System.Int32)
Метод позволяет получить высоту текста в указанной ячейке таблицы.
Метод позволяет получить высоту текста в указанной ячейке таблицы.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает высоту текста, double.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextHeight.

Teigha.DatabaseServices.Table.TextRotation(System.Int32,System.Int32)
Метод позволяет получить угол поворота текста в заданной ячейке.
Метод позволяет получить угол поворота текста в заданной ячейке.
Возможные значения угла поворота: Degrees000, Degrees090, Degrees180 и Degrees270.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает угол поворота из перечисления RotationAngle.
Notes
Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].Contents[i].Rotation.

Teigha.DatabaseServices.Table.TextString(System.Int32,System.Int32)
Метод предназначен для получения копии нуль-терминированной текстовой строки из указанной ячейки.
Метод предназначен для получения копии нуль-терминированной текстовой строки из указанной ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает строку, String.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextString.

Teigha.DatabaseServices.Table.TextString(System.Int32,System.Int32,Teigha.DatabaseServices.FormatOption)
Метод позволяет получить форматированную текстовую строку содержимого ячейки.
Данный метод позволяет получить форматированную текстовую строку содержимого ячейки.
Метод получает значение объекта в виде строки в определенном формате.
Для форматирования строки он использует строку формата, хранящуюся в самом объекте.
Аргумент nOption передает в метод опциональные флаги для управления форматированием.
Используются следующие флаги.
* FormatOptionNone: Выполняется форматирование по умолчанию. Отформатированную строку можно использовать для отображения на экране.
* ForEditing: Метод форматирует значения таким образом, чтобы его возможно было использовать для редактирования. Он форматирует значение с максимальной точностью, даже если в формате, установленном в значении, явно установлена конкретная точность.
* ForExpression: Метод форматирует значение таким образом, чтобы его можно было использовать в выражениях.  Он форматирует значение с максимальной точностью, даже если в формате, установленном в значении, явно установлена конкретная точность.
* UseMaximumPrecision: Для значения используется максимальная точность.
* IgnoreMtextFormat: Код форматирования многострочного текста (Mtext) не включается в отформатированный текст.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
nOption: Опции форматирования из перечисления Teigha.DatabaseServices.FormatOption.
Returns: Возвращает форматированную строку, тип String.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextString.

Teigha.DatabaseServices.Table.TextStringConst(System.Int32,System.Int32)
Метод позволяет получить копию нуль-терминированной текстовой строки, хранящейся в указанной ячейке.
Метод позволяет получить копию нуль-терминированной текстовой строки, хранящейся в указанной ячейке.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает нуль-терминированную строку, тип String.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].TextString.

Teigha.DatabaseServices.Table.TextStyle(DatabaseServices.RowType)
Метод позволяет для строки указанного типа получить ObjectId текстового стиля, на который в данный момент ссылается объект Table.
Метод позволяет для строки указанного типа получить ObjectId текстового стиля, на который в данный момент ссылается объект Table.
Возможные значения типа строки: DataRow, TitleRow и HeaderRow из перечисления .
Если тип строки не указан, используется значение по умолчанию DataRow.
type: Тип строки в таблице из перечисления <link Teigha
Returns: Возвращает идентификатор текстового стиля.  Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать функционал объекта Cell.

Teigha.DatabaseServices.Table.TextStyle(System.Int32,System.Int32)
Метод позволяет получить ObjectId текстового стиля указанной ячейки.
Метод позволяет получить ObjectId текстового стиля указанной ячейки.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает идентификатор текстового стиля.  Тип DatabaseServices.ObjectId.
Notes
Для получения того же результата предпочтительнее использовать метод Table.Cells[row,column].TextStyleId.

Teigha.DatabaseServices.Table.UnitType(DatabaseServices.RowType)
Метод предназначен для получения типа единиц измерения (длины, площади, объема и т.п.) содержимого в строке указанного типа.
Метод предназначен для получения типа единиц измерения для содержимого в строке указанного типа.
Типы единиц определяются перечислением DatabaseServices.UnitType (безразмерная величина,  длина, площадь, объем, углы и т.п.).
Тип строки объекта Table определяется значением из перечисления .
type: Тип строки из перечисления <link Teigha
Returns: Возвращает тип единиц измерения как значение из перечисления DatabaseServices.UnitType.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType.

Teigha.DatabaseServices.Table.UnitType(System.Int32,System.Int32)
Метод предназначен для получения типа единиц измерения (длины, площади, объема и т.п.) содержимого в указанной ячейке.
Метод предназначен для получения типа единиц измерения содержимого в указанной ячейке.
Типы единиц определяются перечислением DatabaseServices.UnitType (безразмерная величина,  длина, площадь, объем, углы и т.п.).
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает тип единиц измерения как значение из перечисления DatabaseServices.UnitType.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].DataType.

Teigha.DatabaseServices.Table.UnmergeCells(Teigha.DatabaseServices.CellRange)
Метод предназначен для отмены объединения ячеек в указанном диапазоне.
Метод предназначен для отмены объединения ячеек в указанном диапазоне.
range: Заданный диапазон ячеек таблицы. Тип CellRange.

Teigha.DatabaseServices.Table.UpdateDataLink(Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод предназначен для обновления в таблице всех внешних ссылок.
Метод позволяет обновить в таблице все ссылки на внешние данные.
dir: Направление обновления. Значение из перечисления Teigha.DatabaseServices.UpdateDirection.
option: Опции обновления. Значение из перечисления Teigha.DatabaseServices.UpdateOption.

Teigha.DatabaseServices.Table.UpdateDataLink(System.Int32,System.Int32,Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод предназначен для обновления ссылки на внешние данные в указанной ячейке.
Метод позволяет обновить в указанной ячейке ссылку на внешние данные.
Ячейка задается индексами строки и столбца. Метод поддерживает настройку направления и опций обновления.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
dir: Направление обновления. Значение из перечисления Teigha.DatabaseServices.UpdateDirection.
option: Опции обновления. Значение из перечисления Teigha.DatabaseServices.UpdateOption.

Teigha.DatabaseServices.Table.Value(System.Int32,System.Int32)
Метод позволяет получить тип содержимого указанной ячейки.
Метод позволяет получить тип содержимого указанной ячейки.
Ячейка задается индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
col: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает тип содержимого указанной ячейки. Тип Object.
Notes
Для получения того же результата предпочтительнее использовать Table.Cells[row,column].Contents(i).Value.

Teigha.DatabaseServices.Table.BreakEnabled
Данное свойство хранит информацию о режиме разбиения.
Данное свойство хранит информацию о режиме разбиения.
Returns: Возвращает true, если в таблице включен режим разбиения. В противном случае возвращает false.

Teigha.DatabaseServices.Table.BreakFlowDirection
Данное свойство предоставляет доступ к направлению разбиения таблицы.
Данное свойство предоставляет доступ к направлению разбиения таблицы.
Оно определяет относительное расположение фрагментов, на которые разбивается исходная таблица, в случае активации режима разбиения.
Returns: Возвращает направление разбиения таблицы как значение из перечисления Teigha.DatabaseServices.TableBreakFlowDirection.

Teigha.DatabaseServices.Table.BreakOptions
Данное свойство представляет опции разбиения таблицы.
Данное свойство представляет опции разбиения таблицы.
Returns: Позволяет задать или возвращает значение из перечисления Teigha.DatabaseServices.TableBreakOptions.

Teigha.DatabaseServices.Table.Cells
Данное свойство предоставляет доступ к ячейкам объекта Table.
Данное свойство предоставляет доступ к ячейкам объекта Table.
Returns: Возвращает диапазон ячеек, тип CellRange.

Teigha.DatabaseServices.Table.Columns
Данное свойство предоставляет доступ к коллекции столбцов объекта Table.
Данное свойство предоставляет доступ к коллекции столбцов объекта Table.
Returns: Возвращает коллекцию столбцов объекта Table.  Тип ColumnsCollection.

Teigha.DatabaseServices.Table.Direction
Данное свойство предоставляет доступ к единичному вектору горизонтального направления данной таблицы
Данное свойство предоставляет доступ к единичному вектору горизонтального направления данной таблицы.
Направление задается вектором Vector3d в мировой системе координат (WCS).
Returns: Возвращает единичный вектор горизонтального направления таблицы. Тип Vector3d.
Possible values for FlowDirection are TopToBottom  (top to bottom) and BottomToTop  (bottom to top).

Teigha.DatabaseServices.Table.FlowDirection
Данное свойство представляет направление следования таблицы от своей первой строки к последней.
Данное свойство представляет направление следования таблицы от своей первой строки к последней.
Направление задается значениями из перечисления DatabaseServices.FlowDirection.
Returns: Возвращает направление следования таблицы из перечисления DatabaseServices.FlowDirection.
Возможными значениями для направления являются TopToBottom (сверху вниз) и BottomToTop (снизу вверх).

Teigha.DatabaseServices.Table.HasSubSelection
Данное свойство позволяет определить, имеется ли в данной таблице подвыборка.
Данное свойство возвращает true, если в таблице есть подвыборка. В противном случае возвращает false.
Returns: Возвращает true, если в таблице есть подвыборка. В противном случае возвращает false.

Teigha.DatabaseServices.Table.Height
Данное свойство представляет полную высоту данной таблицы.
Данное свойство представляет полную высоту данной таблицы.
Returns: Возвращает или задает полную высоту данной таблицы, тип double.

Teigha.DatabaseServices.Table.HorizontalCellMargin
Данное свойство представляет размер горизонтальных полей ячейки объекта Table.
Свойство предоставляет доступ к ширине горизонтальных полей ячейки данного объекта Table.
Returns: Возвращает ширину горизонтальных полей ячейки, тип double.

Teigha.DatabaseServices.Table.IsHeaderSuppressed
Устарело. Используйте функционал объекта Cell.
Свойство позволяет подавлять или отменять подавление строки заголовков столбцов объекта Table.
Данное свойство предоставляет доступ на изменение к флагу подавления строки заголовков столбцов объекта Table.
Returns: Возвращает true в случае подавления строки заголовков столбцов таблицы, в противном случае - false.

Teigha.DatabaseServices.Table.IsTitleSuppressed
Устарело. Используйте функционал объекта Cell.
Свойство позволяет подавлять или отменять подавление строки наименования объекта Table.
Данное свойство предоставляет доступ на изменение к флагу подавления строки наименования объекта Table.
Returns: Возвращает true, если строка наименования таблицы подавлена, или false в противном случае.

Teigha.DatabaseServices.Table.MinimumTableHeight
Данное свойство представляет доступ к минимальной общей высоте таблицы.
Данное свойство представляет доступ к минимальной общей высоте таблицы.
Returns: Возвращает минимальную общую высоту таблицы, тип double.

Teigha.DatabaseServices.Table.MinimumTableWidth
Данное свойство представляет доступ к минимальной общей ширине таблицы.
Данное свойство представляет доступ к минимальной общей ширине таблицы.
Returns: Возвращает минимальную общую ширину таблицы, тип double.

Teigha.DatabaseServices.Table.NumColumns
Данное свойство представляет количество столбцов в таблице.
Устарело. Используйте Table.Columns.Count или Table.SetSize(int numRows, int numCols).
Данное свойство представляет количество столбцов в данной таблице.
Returns: Возвращает количество столбцов в таблице, int.

Teigha.DatabaseServices.Table.NumRows
Данное свойство представляет количество строк в таблице.
Устарело. Используйте свойство Table.Rows.Count или Table.SetSize(int numRows, int numCols).
Данное свойство представляет количество строк в таблице.
Returns: Возвращает количество строк в таблице, int.

Teigha.DatabaseServices.Table.Rows
Данное свойство предоставляет доступ к коллекции строк объекта Table.
Данное свойство предоставляет доступ к коллекции строк объекта Table.
Returns: Возвращает коллекцию строк объекта Table. Тип RowsCollection.

Teigha.DatabaseServices.Table.SubSelection
Данное свойство предоставляет доступ к диапазону ячеек в подвыборке.
Данное свойство предоставляет доступ к диапазону ячеек в подвыборке.
Returns: Возвращает диапазон ячеек в подвыборке.
В отсутствие подвыборки возвращает недопустимый диапазон.

Teigha.DatabaseServices.Table.TableStyle
Данное свойство предоставляет доступ к идентификатору ObjectId объекта TableStyle, на который ссылается объект Table.
Данное свойство предоставляет доступ к идентификатору ObjectId объекта TableStyle, на который ссылается объект Table.
Returns: Возвращает ObjectId текущего табличного стиля данной таблицы.

Teigha.DatabaseServices.Table.VerticalCellMargin
Данное свойство представляет вертикальные поля ячеек объекта Table.
Данное свойство представляет вертикальные поля ячеек объекта Table.
Returns: Возвращает текущие размеры вертикальных полей ячеек, double.

Teigha.DatabaseServices.Table.Width
Свойство предоставляет доступ к общей ширине данной таблицы.
Свойство предоставляет доступ к общей ширине данной таблицы
Returns: Возвращает общую ширину таблицы, double.