Teigha.Runtime.DictionaryIterator
Класс DictionaryIterator реализует итератор, выполняющий проход по записям словаря.
Класс DictionaryIterator реализует итератор, выполняющий проход по записям словаря.

Teigha.Runtime.DictionaryIterator.Current
Свойство Current представляет объект в словаре в текущей позиции итератора.
Свойство Current представляет объект в словаре в текущей позиции итератора.
Returns: Возвращает объект в текущей позиции итератора. Тип Object.

Teigha.Runtime.DictionaryIterator.Entry
Свойство Entry представляет запись словаря в текущей позиции итератора.
Свойство Entry представляет запись словаря в текущей позиции итератора.
Returns: Возвращает текущую запись словаря. Тип DictionaryEntry.

Teigha.Runtime.DictionaryIterator.Key
Свойство Key представляет ключ для текущей записи словаря.
Свойство Key представляет ключ для текущей записи словаря.
Returns: Возвращает ключ записи словаря.
Тип Object.

Teigha.Runtime.DictionaryIterator.Value
Свойство Value представляет значение, хранящееся в текущей записи словаря.
Свойство Value представляет значение, хранящееся в текущей записи словаря.
Returns: Возвращает значение, хранящееся в текущей записи словаря. Тип Object.