Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps
Метод позволяет получить коллекцию исходных точек сети GeoMesh и коллекцию точек назначения в виде объекта MeshPointMaps.
Метод позволяет получить коллекцию исходных точек сети GeoMesh и коллекцию точек назначения в виде объекта MeshPointMaps.
Returns: Возвращает коллекции исходных точек и точек назначения в виде объекта MeshPointMaps.