Teigha.DatabaseServices.Circle
Класс Circle представляет геометрический объект «окружность»
в nanoCAD.
Класс Circle представляет геометрический объект «окружность»
в nanoCAD.

Teigha.DatabaseServices.Circle.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Circle.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Создает конкретную окружность.
center: Точка центра окружности
normal: Вектор нормали
radius: Значение радиуса

Teigha.DatabaseServices.Circle.Center
Возвращает или устанавливает точку центра.

Teigha.DatabaseServices.Circle.Circumference
Возвращает или устанавливает значение длины окружности.

Teigha.DatabaseServices.Circle.Diameter
Задает или возвращает диаметр окружности.

Teigha.DatabaseServices.Circle.Normal
Возвращает или устанавливает вектор нормали к окружности из
центра.

Teigha.DatabaseServices.Circle.Radius
Возвращает или задает радиус окружности.

Teigha.DatabaseServices.Circle.Thickness
Задает или возвращает толщину линии окружности.