Teigha.DatabaseServices.TextVerticalMode.TextBase
Значение: 0.
По точке вставки вертикально выравнивается базовая линия текста.
Базовая линия (англ. baseline) — воображаемая прямая линия, проходящая по нижнему краю прямых знаков (напр., 'n', 'x') без учёта свисаний и нижних выносных элементов (напр., в буквах 'p', 'у', 'ф').