Teigha.DatabaseServices.ObjectOverrule
Этот класс переопределяет подмножество операций для объекта базы данных.  Он является базовым для классов, производных от OdDbObject, и используется для настройки их поведения.
Этот класс переопределяет подмножество операций для объекта базы данных.  Он является базовым для классов, производных от OdDbObject, и используется для настройки их поведения.  Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.

Teigha.DatabaseServices.ObjectOverrule.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.ObjectOverrule.Cancel(Teigha.DatabaseServices.DBObject)
Метод отменяет переопределение.А
Метод отменяет переопределение.
dbObject: Объект DBObject.

Teigha.DatabaseServices.ObjectOverrule.Close(Teigha.DatabaseServices.DBObject)
Метод вызывает соответствующий метод OdDbObjectOverrule.Сlose().
Метод вызывает соответствующий метод OdDbObjectOverrule.Close().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.

Teigha.DatabaseServices.ObjectOverrule.DeepClone(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.IdMapping,System.Boolean)
Метод вызывает соответствующий метод OdDbObjectOverrule.DeepClone().
Метод вызывает соответствующий метод OdDbObjectOverrule.DeepClone().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
ownerObject: Объект DBObject базы данных, к которому следует добавить клоны.
idMap: Текущий идентификатор мэппинга IdMapping.
isPrimary: Флаг, указывающий, является ли данный объект первичным или дочерним. Тип bool.
Returns: Возвращает склонированный объект базы данных, тип DBObject.

Teigha.DatabaseServices.ObjectOverrule.Erase(Teigha.DatabaseServices.DBObject,System.Boolean)
Метод вызывает соответствующий метод OdDbObjectOverrule.Erase().
Метод вызывает соответствующий метод OdDbObjectOverrule.Erase().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
erasing: Логический флаг, определяющий состояние удаления.  Тип bool.

Teigha.DatabaseServices.ObjectOverrule.Open(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.OpenMode)
Метод вызывает соответствующий метод OdDbObjectOverrule.Open().
Метод вызывает соответствующий метод OdDbObjectOverrule.Open().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
mode: Режим открытия объекта из перечисления OpenMode.

Teigha.DatabaseServices.ObjectOverrule.SetExtensionDictionaryEntryFilter(String)
Метод реализует предварительную фильтрацию объектов в словаре расширений прежде чем применять переопределения.
Метод реализует предварительную фильтрацию объектов в словаре расширений прежде чем применять переопределения.
При этом nanoCAD выполняет поиск в словаре расширений записи с именем entryName  перед вызовом любого из ваших переопределений для соответствующего объекта.  Если entryName отсутствует в словаре расширений, переопределения вызываться не будут.
entryName: Имя искомой записи в словаре расширений, тип String.

Teigha.DatabaseServices.ObjectOverrule.SetIdFilter(array)
Метод включает предварительную фильтрацию объектов по списку ObjectId прежде чем применять переопределения.
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять переопределения.
Переопределения будут применяться только к тем объектам, чьи ObjectId присутствуют в заданном массиве идентификаторов.
ids: Массив идентификаторов ObjectId.

Teigha.DatabaseServices.ObjectOverrule.SetXDataFilter(String)
Метод включает предварительную фильтрацию переопределяемых объектов по расширенным данным (xdata).
Метод используется в тех случаях, когда nanoCAD должен выполнять поиск xdata с RegisteredApplicationName для переопределяемого объекта перед вызовом любого из ваших переопределений.
Метод включает предварительную фильтрацию переопределяемых объектов по расширенным данным (xdata).
Метод используется в тех случаях, когда nanoCAD должен выполнять поиск xdata с RegisteredApplicationName для переопределяемого объекта перед вызовом любого из ваших переопределений.
registeredApplicationName: Имя зарегистрированного приложения, тип String.

Teigha.DatabaseServices.ObjectOverrule.WblockClone(Teigha.DatabaseServices.DBObject,Teigha.Runtime.RXObject,Teigha.DatabaseServices.IdMapping,System.Boolean)
Данный метод вызывает соответствующий метод OdDbObjectOverrule.WblockClone().
Данный метод вызывает соответствующий метод OdDbObjectOverrule.WblockClone().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
ownerObject: Объект RXObject базы данных, для которого клоны станут дочерними объектами.
idMap: Текущий идентификатор мэппинга IdMapping.
isPrimary: Флаг, определяющий, является ли данный объект первичным или дочерним. Тип bool.