Teigha.DatabaseServices.AbstractViewTableRecord
Класс AbstractViewTableRecord является базовым классом для классов ViewTableRecord и ViewportTableRecord.
Класс AbstractViewTableRecord является базовым классом для классов ViewTableRecord и ViewportTableRecord.

Teigha.DatabaseServices.AbstractViewTableRecord.SetSun(DatabaseServices.DBObject)
Метод задаёт объект солнца для данного видового экрана.
Метод задаёт объект солнца для данного видового экрана.
sun: Входной идентификатор DatabaseServices.DBObject объекта солнца.
Returns: Возвращает идентификатор объекта солнца, связанного с видовым экраном.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AbstractViewTableRecord.SetUcs(DatabaseServices.ObjectId)
Метод задает ПСК (UCS) для записи таблицы видов или видовых экранов, используя указанный объект UcsTableRecord.
Метод определяет новую именованную пользовательскую систему координат (ПСК, UCS) для записи таблицы видов или видовых экранов.
Используемый для этого входной идентификатор id должен ссылаться на действительный объект UcsTableRecord.
id: Входной идентификатор объекта UcsTableRecord. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AbstractViewTableRecord.SetUcs(Teigha.DatabaseServices.OrthographicView)
Метод задает UCS (ПСК) с указанной ориентацией для записи таблицы видов или видовых экранов.
Ориентация определяется аргументом из перечисления OrthographicView.
Метод задает новую пользовательскую систему координат (UCS, ПСК) для записи таблицы видов или видовых экранов.
Новая UCS является неименованной, ее ориентация определяется указанным вариантом ортогонального вида из перечисления OrthographicView.
view: Вариант ортогонального вида, в соответствии с которым задается ориентация UCS (ПСК). Значение из перечисления OrthographicView.

Teigha.DatabaseServices.AbstractViewTableRecord.SetUcs(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод задает для записи таблицы видов или видовых экранов новую неименованную пользовательскую систему координат.
Метод задает новую неименованную пользовательскую систему координат (UCS, ПСК) для записи таблицы видов или видовых экранов.
Ориентация этой UCS определяется указанными началом координат и направляющими векторами координатных осей X и Y.
origin: Входная точка начала координат. Тип Point3d.
x: Направляющий вектор координатной оси X. Тип Vector3d.
y: Направляющий вектор координатной оси Y. Тип Vector3d.

Teigha.DatabaseServices.AbstractViewTableRecord.SetViewDirection(Teigha.DatabaseServices.OrthographicView)
Метод переопределяет направление камеры вида для записи таблицы видов или видовых экранов в соответствии с указанным вариантом ортогонального вида из перечисления OrthographicView.
Метод переопределяет направление камеры вида для записи таблицы видов или видовых экранов в соответствии с указанным вариантом ортогонального вида из перечисления OrthographicView.
view: Вариант ориентации ортогонального вида, связанной с ПСК. Значение из перечисления OrthographicView.

Teigha.DatabaseServices.AbstractViewTableRecord.AmbientLightColor
Свойство AmbientLightColor предоставляет доступ к цвету объекта при рассеянном освещении в видовом экране.
Свойство AmbientLightColor предоставляет доступ к цвету объекта при рассеянном освещении в видовом экране.
Returns: Возвращает цвет объекта при рассеянном освещении.
Тип Colors.Color.

Teigha.DatabaseServices.AbstractViewTableRecord.BackClipDistance
Свойство BackClipDistance предоставляет доступ к положению задней плоскости отсечения для TableRecord.
Свойство BackClipDistance предоставляет доступ к расстоянию от точки цели до задней плоскости отсечения для TableRecord.
Notes
Положительные значения указывают, что плоскость отсечения находится перед точкой цели (то есть между целью и камерой).
Отрицательные значения указывают, что плоскость отсечения находится позади точки цели.
Returns: Возвращает расстояние от точки цели до задней плоскости отсечения.
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.BackClipEnabled
Свойство BackClipEnabled позволяет определить, включен ли режим заднего отсечения для TableRecord.
Свойство BackClipEnabled позволяет определить, включен ли режим заднего отсечения для TableRecord вида или видового экрана.
Returns: Возвращает true, если режим заднего отсечения включен.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewTableRecord.Background
Свойство Background предоставляет доступ к объекту фона, который связан с данным видом.
Свойство Background предоставляет доступ к объекту фона, который связан с данным видом.
Чтобы подавить фон, следует задать значение NULL.
Returns: Возвращает идентификатор объекта фона.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AbstractViewTableRecord.Brightness
Свойство Brightness предоставляет доступ к коэффициенту яркости для данного видового экрана.
Свойство Brightness предоставляет доступ к коэффициенту яркости для данного видового экрана.
Returns: Возвращает значение коэффициента яркости.
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.CenterPoint
Свойство CenterPoint предоставляет доступ к центральной точке вида в координатах дисплея (DCS).
Свойство CenterPoint предоставляет доступ к центральной точке вида в системе координат дисплея (DCS).
Returns: Возвращает положение точки центра вида в координатах дисплея (DCS).
Тип Point2d.

Teigha.DatabaseServices.AbstractViewTableRecord.Contrast
Свойство Contrast предоставляет доступ к коэффициенту контрастности для видового экрана.
Свойство Contrast предоставляет доступ к коэффициенту контрастности для видового экрана.
Returns: Возвращает значение коэффициента контрастности для видового экрана.
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.DefaultLightingOn
Свойство DefaultLightingOn позволяет определить, включено ли освещение по умолчанию для видового экрана.
Свойство DefaultLightingOn позволяет определить, включено ли освещение по умолчанию для видового экрана.
Returns: Возвращает true, если освещение по умолчанию включено.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewTableRecord.DefaultLightingType
Свойство DefaultLightingType предоставляет доступ к типу освещения по умолчанию, которое используется в видовом экране.
Свойство DefaultLightingType предоставляет доступ к типу освещения по умолчанию, которое используется в видовом экране.
Returns: Возвращает тип освещения по умолчанию в видовом экране. Перечисление DatabaseServices.DefaultLightingType.

Teigha.DatabaseServices.AbstractViewTableRecord.Elevation
Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана.
Свойство Elevation представляет возвышение плоскости ПСК (UCS) данного видового экрана.
Notes
Возвышение - это расстояние от начала мировой системы координат (МСК, WCS) до плоскости ПСК объекта.
Returns: Возвращает возвышение плоскости ПСК (UCS) видового экрана.
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.FrontClipAtEye
Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
Свойство FrontClipAtEyeOn позволяет определить, проходит ли передняя плоскость отсечения через точку камеры.
Returns: Возвращает true, если передняя плоскость отсечения проходит через камеру (точку глаза) независимо от значения FrontClipDistance.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewTableRecord.FrontClipDistance
Свойство FrontClipDistance предоставляет доступ к положению передней плоскости отсечения видового экрана.
Свойство FrontClipDistance предоставляет доступ к положению передней плоскости отсечения видового экрана.
Notes
Положение передней плоскости отсечения измеряется от точки цели до плоскости отсечения вдоль линии камера - цель.
Положительные значения указывают, что плоскость отсечения находится перед целью (то есть между целью и камерой).
Отрицательные значения указывают, что плоскость отсечения находится позади цели.
Returns: Возвращает расстояние от точки цели до передней плоскости отсечения.
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.FrontClipEnabled
Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения для TableRecord.
Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения для TableRecord.
Returns: Возвращает true, если режим переднего отсечения для данного вида включен.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewTableRecord.Height
Свойство Height представляет высоту данного объекта TableRecord в координатах DCS.
Свойство Height представляет высоту данного объекта TableRecord в координатах дисплея (DCS).
Returns: Возвращает высоту объекта TableRecord в координатах DCS.
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.LensLength
Свойство LensLength предоставляет доступ к фокусному расстоянию (в мм) для TableRecord в режиме перспективного проецирования.
Свойство LensLength предоставляет доступ к фокусному расстоянию (в мм) для TableRecord в режиме перспективного проецирования (DXF 42).
Returns: Возвращает фокусное расстояние камеры вида (в мм).
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.PerspectiveEnabled
Свойство PerspectiveEnabled позволяет определить, включен ли режим перспективного проецирования для объекта TableRecord
Свойство PerspectiveEnabled позволяет определить, включен ли режим перспективного проецирования для объекта TableRecord
Returns: Возвращает true, если режим перспективного проецирования включен.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewTableRecord.RenderMode
Свойство RenderMode представляет текущий режим рендеринга для объекта TableRecord.
Свойство RenderMode представляет текущий режим рендеринга (каркасное представление, скрытые линии, режим тонирования и т.п.).
Notes
Код DXF 281.
Returns: Возвращает режим рендеринга.
Значение из перечисления DatabaseServices.ViewTableRecordRenderMode.

Teigha.DatabaseServices.AbstractViewTableRecord.SunId
Свойство SunId представляет идентификатор объекта, связанного с объектом солнца в видовом экране.
Свойство SunId представляет идентификатор объекта, связанного с объектом солнца в видовом экране.
Returns: Возвращает идентификатор объекта солнца.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AbstractViewTableRecord.Target
Свойство Target предоставляет доступ к точке цели вида в координатах WCS.
Свойство Target предоставляет доступ к точке цели вида в мировой системе координат (WCS).
Returns: Возвращает точку цели вида.
Тип Point3d.

Teigha.DatabaseServices.AbstractViewTableRecord.Ucs
Свойство Ucs представляет пользовательскую систему координат для записи в таблице видовых экранов.
Свойство Ucs представляет пользовательскую систему координат (ПСК, UCS), связанную с объектом TableRecord.
Returns: Возвращает пользовательскую систему координат для TableRecord.
Тип Geometry.CoordinateSystem3d.

Teigha.DatabaseServices.AbstractViewTableRecord.UcsName
Свойство UcsName представляет идентификатор объекта пользовательской системы координат, связанной с видовым экраном.
Свойство UcsName представляет идентификатор объекта пользовательской системы координат (ПСК, UCS), связанной с видовым экраном (DXF 345).
Returns: Возвращает идентификатор объекта UCS.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AbstractViewTableRecord.UcsOrthographic
Свойство UcsOrthographic представляет ортогональный вид, связанный с UCS.
Свойство UcsOrthographic представляет ортогональный вид, связанный с пользовательской системой координат (ПСК, UCS).
Returns: Возвращает ортогональный вид, связанный с UCS.
Значение из перечисления DatabaseServices.OrthographicView.

Teigha.DatabaseServices.AbstractViewTableRecord.ViewDirection
Свойство ViewDirection предоставляет доступ к направлению вида в координатах WCS.
Свойство ViewDirection предоставляет доступ к направлению вида в координатах WCS.
Это вектор из точки цели в точку камеры вида.
Returns: Возвращает вектор, определяющий направление вида.
Тип Vector3d.

Teigha.DatabaseServices.AbstractViewTableRecord.ViewOrthographic
Свойство ViewOrthographic представляет используемый тип ортогонального вида.
Свойство ViewOrthographic представляет используемый тип ортогонального вида, связывающий положения камеры вида и целевой точки вида.
Returns: Возвращает тип ортогонального вида.
Перечисление DatabaseServices.OrthographicView.

Teigha.DatabaseServices.AbstractViewTableRecord.ViewTwist
Свойство ViewTwist предоставляет доступ к углу поворота вида в видовом экране.
Свойство ViewTwist предоставляет доступ к величине угла поворота (в радианах) вида в видовом экране.
Returns: Возвращает угол поворота вида (в радианах).
Тип double.

Teigha.DatabaseServices.AbstractViewTableRecord.VisualStyleId
Свойство VisualStyleId предоставляет доступ к идентификатору объекта визуального стиля, используемого в видовом экране.
Свойство VisualStyleId предоставляет доступ к идентификатору объекта визуального стиля, используемого в видовом экране.
Returns: Возвращает идентификатор объекта визуального стиля.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AbstractViewTableRecord.Width
Свойство Width представляет ширину объекта TableRecord в координатах дисплея (DCS).
Свойство Width представляет ширину объекта TableRecord в координатах дисплея (DCS).
Returns: Возвращает ширину объекта TableRecord в координатах DCS.
Тип double.