Teigha.DatabaseServices.Filters.Filter
Данный класс является базовым для всех классов фильтров.
Этот класс определяет "запрос" и предоставляет "ключ" к объекту FilteredBlockIterator.
Индекс, соответствующий этому ключу возвращает свойство IndexClass.
Данный класс является базовым для всех классов фильтров.
Этот класс определяет "запрос" и предоставляет "ключ" к объекту FilteredBlockIterator.
Индекс, соответствующий этому ключу возвращает свойство IndexClass.
Applications that need to provide their own indexing scheme need to provide versions of these three classes:
Приложения, которым требуется специфическая схема индексации, должны реализовать собственные версии следующих трех классов:
* Index,
* Filter,
* FilteredBlockIterator.

Teigha.DatabaseServices.Filters.Filter.#ctor(IntPtr,System.Boolean)
Конструктор класса Filter.
Конструктор класса Filter.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.Filters.Filter.IndexClass
Свойство IndexClass предоставляет доступ к дескриптору класса Index  для данного фильтра.
Свойство IndexClass предоставляет доступ к дескриптору класса Index  для данного фильтра.
Используется при инициализации перечислителя FilteredBlockIterator.
Returns: Возвращает дескриптор класса. Тип RXClass.