Teigha.Geometry.PlanarEquationCoefficients
Структура PlanarEquationCoefficients представляет коэффициенты общего уравнения плоскости в трехмерном пространстве.
Структура PlanarEquationCoefficients представляет коэффициенты общего уравнения плоскости в трехмерном пространстве.
Notes
Общее уравнение плоскости имеет вид:
a * X + b * Y + c * Z + d = 0
где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (т.е., a, b и c не могут равняться нулю одновременно).
Величины a, b, c служат компонентами вектора нормали этой плоскости.

Teigha.Geometry.PlanarEquationCoefficients.#ctor(System.Double,System.Double,System.Double,System.Double)
Конструктор структуры PlanarEquationCoefficients.
Создает экземпляр структуры с указанными параметрами.
Конструктор структуры PlanarEquationCoefficients.
Создает экземпляр структуры с указанными параметрами.
a: Коэффициент a в общем уравнении плоскости. Тип double.
b: Коэффициент b в общем уравнении плоскости. Тип double.
c: Коэффициент c в общем уравнении плоскости. Тип double.
d: Коэффициент d в общем уравнении плоскости. Тип double.

Teigha.Geometry.PlanarEquationCoefficients.A
Свойство A представляет коэффициент a в общем уравнении плоскости.
Свойство A представляет коэффициент a в общем уравнении плоскости.
Returns: Возвращает коэффициент a в общем уравнении плоскости.
Тип double.

Teigha.Geometry.PlanarEquationCoefficients.B
Свойство B представляет коэффициент b в общем уравнении плоскости.
Свойство B представляет коэффициент b в общем уравнении плоскости.
Returns: Возвращает коэффициент b в общем уравнении плоскости.
Тип double.

Teigha.Geometry.PlanarEquationCoefficients.C
Свойство C представляет коэффициент c в общем уравнении плоскости.
Свойство C представляет коэффициент c в общем уравнении плоскости.
Returns: Возвращает коэффициент c в общем уравнении плоскости.
Тип double.

Teigha.Geometry.PlanarEquationCoefficients.D
Свойство D представляет коэффициент d в общем уравнении плоскости.
Свойство D представляет коэффициент d в общем уравнении плоскости.
Returns: Возвращает коэффициент d в общем уравнении плоскости.
Тип double.