Teigha.Runtime.ProgressMeter.MeterProgress
Метод увеличивает счетчик данного индикатора прогресса.
Метод увеличивает счетчик данного индикатора ProgressMeter.  Процент выполнения задачи определяется отношением количества вызовов этого метода к значению, установленному при вызове метода SetLimit().
В случае выброса исключения операция, связанная с данным объектом ProgressMeter, должна быть остановлена.