Teigha.Geometry.EllipticalArc3d.GetPlane
Метод позволяет получить бесконечную плоскость, в которой располагается данная эллиптическая дуга (или эллипс).
Метод позволяет получить бесконечную плоскость, в которой располагается данная эллиптическая дуга (или эллипс).
Returns: Возвращает 3D-плоскость, в которой располагается данный объект.
Тип Plane.