Teigha.DatabaseServices.OleDvAspect.Content
Значение: 1. Представление объекта, позволяющее его отображение в качестве встроенного объекта в некотором контейнере.
Это значение обычно указывается для составных объектов документа.
Представление может быть ориентировано как на дисплей, так и на принтер.