Teigha.Runtime.SystemObjects
Класс SystemObjects предоставляет доступ к системным объектам ClassDictionary, ServiceDictionary и DynamicLinker.
Класс SystemObjects предоставляет доступ к системным объектам ClassDictionary, ServiceDictionary и DynamicLinker.

Teigha.Runtime.SystemObjects.ClassDictionary
Свойство ClassDictionary представляет словарь системного объекта.
Свойство ClassDictionary представляет словарь системного объекта.
Returns: Возвращает словарь системного объекта.
Тип Dictionary.

Teigha.Runtime.SystemObjects.DynamicLinker
Свойство DynamicLinker представляет динамический компоновщик системного объекта.
Свойство DynamicLinker представляет динамический компоновщик системного объекта.
Returns: Возвращает динамический компоновщик. Тип DynamicLinker.

Teigha.Runtime.SystemObjects.ServiceDictionary
Свойство ServiceDictionary представляет словарь служб системного объекта.
Свойство ServiceDictionary представляет словарь служб системного объекта.
Returns: Возвращает словарь служб системного объекта.  Тип Dictionary.