Teigha.DatabaseServices.LayerEvaluation
Перечисление LayerEvaluation предназначено для настройки переменной заголовка LAYEREVAL.
Перечисление LayerEvaluation используется для настройки переменной заголовка LAYEREVAL.
Переменная LAYEREVAL определяет, должен ли список слоев проверяться на предмет новых слоев при добавлении к чертежу или к прикрепленным внешним ссылкам.