Teigha.Geometry.Matrix2d.Inverse
Метод предоставляет матрицу, которая является обратной для данной матрицы.
Метод предоставляет матрицу, которая является обратной для данной матрицы.
Returns: Возвращает обратную матрицу.
Тип Matrix2d.