Teigha.DatabaseServices.RevolveOptions.Clone
Метод предназначен для клонирования текущих настроек операции вращения.
Метод предназначен для клонирования текущих настроек операции вращения.
Returns: Возвращает объект, являющийся клоном текущих настроек операции вращения. Тип Object.