Teigha.DatabaseServices.LoftOptionsNormalOption.EndsNormal
Значение: 3.
Если установлено это значение, направление поверхности в первом и последнем сечениях будет совпадать с нормалями плоскостей соответствующих сечений.