Teigha.GraphicsSystem.ImpDevice.GetSizeRect
Метод предоставляет размеры данного устройства как объект System.Drawing.Rectangle.
Метод позволяет получить объект System.Drawing.Rectangle, представляющий размеры данного устройства.
Returns: Возвращает прямоугольник, представляющий размеры устройства.
Тип System.Drawing.Rectangle.