Teigha.Geometry.Vector3dCollectionEnumerator.MoveNext
Метод реализует переход перечислителя к следующему элементу в коллекции.
Метод реализует переход перечислителя к следующему элементу в коллекции.
Returns: Возвращает true, если текущий элемент перечислителя находится в коллекции (его индекс не превышает количество элементов коллекции).
В случае выхода за границы коллекции возвращает false.