HostMgd.EditorInput.Editor.PromptingForString
Событие возникает при начале операции ввода строки,
позволяя настроить параметры приглашения до начала ввода.
Событие не реализовано.
Событие инициируется перед началом интерактивного ввода текстовой строки
— например, при вызове метода GetString() или команды, требующей ввода текста.
Оно предоставляет доступ к параметрам ввода через объект PromptStringOptionsEventArgs,
что позволяет разработчику динамически изменять:
* текст приглашения (Message),
* ключевые слова (Keywords),
* разрешение на пустой ввод (AllowNone),
* режим ввода (например, только ключевые слова или произвольный текст).
Событие реализуется через делегат PromptStringOptionsEventHandler
и вызывается до отображения запроса пользователю, что позволяет
адаптировать параметры ввода в реальном времени.
Example
C#