Teigha.GraphicsInterface.GIRasterImage.pixelFormat
Метод позволяет получить пиксельный формат данного растрового изображения согласно цветовой палитре.
Метод позволяет получить пиксельный формат данного растрового изображения согласно цветовой палитре.
Если палитра не задана, возвращается формат самого изображения.
Returns: Возвращает детальные сведения о пиксельном формате данного объекта. Тип PixelFormatInfo.