Teigha.DatabaseServices.DwgFiler.ReadInt32
Метод предназначен для получения значения Int32 из текущего элемента данного объекта Filer.
Метод предназначен для получения значения Int32 из текущего элемента данного объекта Filer.
Returns: Возвращает значение из текущего элемента данного объекта Filer. Тип int.