Teigha.Geometry.Curve2dCollection.GetEnumerator
Метод предоставляет перечислитель этой коллекции.
Метод предоставляет перечислитель этой коллекции.
Returns: Возвращает перечислитель этой коллекции.
Тип System.Collections.IEnumerator.