Teigha.DatabaseServices.DynamicDimensionDataCollection
Класс DynamicDimensionDataCollection представляет коллекцию объектов DynamicDimensionData.
Класс DynamicDimensionDataCollection представляет коллекцию объектов DynamicDimensionData.

Teigha.DatabaseServices.DynamicDimensionDataCollection.#ctor
Конструктор класса по умолчанию.
Конструктор класса по умолчанию.

Teigha.DatabaseServices.DynamicDimensionDataCollection.Add(Teigha.DatabaseServices.DynamicDimensionData)
Метод Add() добавляет в коллекцию объект DynamicDimensionData.
Метод Add() добавляет в коллекцию объект DynamicDimensionData и возвращает его индекс в коллекции.
data: Добавляемый в коллекцию объект. Тип DynamicDimensionData.
Returns: Возвращает позицию нового элемента в коллекции. Тип int.

Teigha.DatabaseServices.DynamicDimensionDataCollection.CopyTo(array,System.Int32)
Метод CopyTo() копирует эту коллекцию в указанный массив по указанному индексу.
Метод CopyTo() копирует эту коллекцию в указанный массив по указанному индексу.
arr: Массив, в который копируется данная коллекция. Тип DynamicDimensionData[].
index: Индекс в указанном массиве, начиная с которого в массиве сохраняются элементы коллекции.  Тип int.

Teigha.DatabaseServices.DynamicDimensionDataCollection.RemoveAt(System.Int32)
Метод RemoveAt() позволяет удалить из коллекции элемент с указанным индексом.
Метод RemoveAt() позволяет удалить из коллекции элемент с указанным индексом.
i: Индекс удаляемого элемента коллекции. Тип int.

Teigha.DatabaseServices.DynamicDimensionDataCollection.Count
Свойство Count обеспечивает доступ к текущему количеству элементов в коллекции.
Свойство Count обеспечивает доступ к текущему количеству элементов в коллекции.
Returns: Возвращает количество элементов в коллекции. Тип int.

Teigha.DatabaseServices.DynamicDimensionDataCollection.Item
Свойство Item задает или возвращает элемент коллекции с указанным индексом.
Свойство Item задает или возвращает элемент коллекции с указанным индексом.
index: Индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции по его индексу.  Тип DynamicDimensionData.