HostMgd.PlottingServices
Пространство имен HostMgd.PlottingServices включает классы, структуры и перечисления, предназначенные для работы с объектами службы печати nanoCAD.
Пространство имен HostMgd.PlottingServices включает классы, перечисления и делегаты, предназначенные для работы с объектами службы печати nanoCAD.