Teigha.DatabaseServices.Unit
Данное перечисление определяет реальные единицы измерения длины в пространстве модели, представляющие одну единицу чертежа nanoCAD.
Данное перечисление определяет реальные единицы измерения длины в пространстве модели, представляющие одну единицу чертежа nanoCAD.