Teigha.Runtime.DynamicLinker.ModuleUnloading
Событие ModuleUnloading создается, когда динамический компоновщик выгружает модуль приложения.
Событие ModuleUnloading создается, когда динамический компоновщик выгружает модуль приложения.