Teigha.GraphicsInterface.FaceData.GetSelectionMarkers
Метод предоставляет массив маркеров выделения графической системы для граней, используемых этим объектом FaceData.
Метод предоставляет массив маркеров выделения графической системы, по одному для каждой грани сети или оболочки, с которыми используется данный объект FaceData.
Notes
Возвращается фактический массив указателей маркеров выделения, используемый графической системой, а не их копии.
Returns: Возвращает массив маркеров выделения графической системы (gsmarkers).
Тип IntPtr[].
Возвращает NULL, если массив маркеров выделения не был задан.