Teigha.Colors.EntityColorCollectionEnumerator.MoveNext
Метод перемещает указатель перечислителя на следующий элемент коллекции EntityColorCollection.
Метод перемещает указатель перечислителя на следующий элемент коллекции EntityColorCollection.
Returns: Возвращает true, если перемещение указателя выполнено успешно.
В противном случае возвращает false.