Teigha.DatabaseServices.TransactionManager.QueueForGraphicsFlush
Этот метод формирует очередь графического обновления всех измененных объектов-резидентов любых транзакций этого менеджера транзакций.
Этот метод формирует очередь графического обновления всех измененных объектов-резидентов любых транзакций этого менеджера транзакций.