Teigha.DatabaseServices.XrefGraphNode
Класс XrefGraphNode представляет в базе данных узлы графа внешних ссылок.
Класс XrefGraphNode представляет в базе данных узлы графа внешних ссылок.
Граф внешних ссылок реализуется классом XrefGraph, этот ориентированный граф описывает связи между главным чертежом и чертежами, на которые в нем имеются внешние ссылки, а также с любыми чертежами по вложенным внешним ссылкам.
Каждый узел графа внешних ссылок представляет записи внешней базы данных или ее таблицы блоков, на которые имеются внешние ссылки.
Корневой узел всегда представляет главный чертеж.
Каждая внешняя ссылка (между базами данных) представлена в графе своим ребром.
Входящие ребра узла соответствуют ссылкам на этот узел, а исходящие - ссылкам этого узла на другие узлы.
Родительский класс GraphNode предоставляет свойства и методы для работы с входящими и исходящими ссылками узла.
Хотя по внешней ссылке на одну запись в таблице блоков вполне могут ссылаться несколько вхождений блоков, между узлами XrefNode создается только одно соответствующее ребро.

Teigha.DatabaseServices.XrefGraphNode.BlockTableRecordId
Свойство BlockTableRecordId представляет идентификатор объекта BlockTableRecord, связанный с данным узлом.
Свойство BlockTableRecordId представляет идентификатор объекта BlockTableRecord, связанный с данным узлом.
Returns: Возвращает идентификатор связанного объекта BlockTableRecord.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.XrefGraphNode.Database
Свойство Database представляет базу данных, соответствующую данному узлу.
Свойство Database представляет базу данных, соответствующую данному узлу.
Returns: Возвращает базу данных для данного объекта.
Тип DatabaseServices.Database.

Teigha.DatabaseServices.XrefGraphNode.IsNested
Свойство IsNested позволяет проверить, представляет ли данный узел вложенную внешнюю ссылку.
Свойство IsNested позволяет проверить, представляет ли данный узел внешний объект, на который главный чертеж напрямую не ссылается.
Returns: Возвращает true, если данный узел представляет вложенную внешнюю ссылку.
В противном случае возвращает false.

Teigha.DatabaseServices.XrefGraphNode.Name
Свойство Name представляет имя, связанное с данным узлом.
Свойство Name представляет имя, связанное с данным узлом.
Returns: Возвращает связанное с данным узлом имя.
Тип String.

Teigha.DatabaseServices.XrefGraphNode.XrefNotificationStatus
Свойство XrefNotificationStatus представляет состояние уведомления о внешней ссылке для данного узла.
Свойство XrefNotificationStatus представляет состояние уведомления о внешней ссылке для данного узла.
Returns: Возвращает состояние уведомления о внешней ссылке. Перечисление DatabaseServices.XrefNotificationStatus.

Teigha.DatabaseServices.XrefGraphNode.XrefStatus
Свойство XrefStatus представляет состояние данного узла.
Свойство XrefStatus представляет состояние данного узла.
Returns: Возвращает состояние данного узла. Перечисление DatabaseServices.XrefStatus.