HostMgd.PlottingServices.MatchingPolicy.MatchEnabledTemporaryCustom
Значение: 4. Сопоставление носителей включено.
Если носитель соответствующего размера не найден, создается пользовательский размер и сохраняется во временном файле PC3/PMP, который удаляется при уничтожении проверенного объекта PlotInfo.