Teigha.DatabaseServices.TableBreakFlowDirection
Перечисление TableBreakFlowDirection определяет поддерживаемые направления разбиения таблицы.
Перечисление TableBreakFlowDirection определяет поддерживаемые направления разбиения таблицы.