Teigha.Geometry.KnotCollection
Класс KnotCollection представляет однородный узловой вектор сплайна как неубывающую последовательность действительных значений.
Класс KnotCollection представляет однородный узловой вектор сплайна как неубывающую последовательность равномерно распределенных действительных значений.

Teigha.Geometry.KnotCollection.#ctor
Конструктор по умолчанию класса KnotCollection.
Конструктор по умолчанию класса KnotCollection.

Teigha.Geometry.KnotCollection.Add(System.Double)
Метод добавляет к данному узловому вектору новый узел и возвращает его индекс в коллекции.
Метод добавляет к данному узловому вектору новый узел и возвращает его индекс в коллекции.
value: Добавляемый узел. Тип double.
Returns: Возвращает индекс нового узла в коллекции. Тип int.

Teigha.Geometry.KnotCollection.Contains(System.Double)
Метод позволяет проверить, содержится ли указанное значение в данной коллекции.
Метод позволяет проверить, содержится ли указанное значение в данной коллекции.
value: Проверяемое значение. Тип double.
Returns: Возвращает true, если значение value содержится в коллекции.
В противном случае возвращает false.

Teigha.Geometry.KnotCollection.CopyTo(cli.array,System.Int32)
Метод копирует данную коллекцию узлов в указанный массив.
Метод копирует данную коллекцию узлов в указанный массив.
a: Массив, в который копируются значения из коллекции. Тип double[].
index: Индекс в массиве, начиная с которого в массиве сохраняются элементы коллекции. Тип int.

Teigha.Geometry.KnotCollection.GetInterval(System.Int32,System.Double,[Out] Interval%)
Метод находит ненулевой узловой интервал, в который попадает точка с указанным значением параметра.
Метод вычисляет ненулевой узловой интервал, в который попадает точка, определяемая параметром parameter.
Значение параметра должно находиться между узлами с индексами (order - 1) и (length() - order), где order представляет порядок сплайна.
order: Входной порядок сплайна. Тип int.
parameter: Входное значение параметра, определяющее точку в коллекции узлов. Тип double.
interval: Найденный узловой интервал. Тип Interval.
Returns: Возвращает индекс найденного узлового интервала interval.
Тип int.

Teigha.Geometry.KnotCollection.GetMultiplicityAt(System.Int32)
Метод определяет кратность узла с указанным индексом.
Метод определяет кратность узла с указанным индексом (количество совпадающих последовательных узлов).
Notes
Если последовательные узлы отличаются в пределах допуска, узлы считаются идентичными, а их кратности складываются.
i: Индекс узла. Тип int.
Returns: Возвращает кратность узла с указанным индексом.
Тип int.

Teigha.Geometry.KnotCollection.Insert(System.Int32,System.Double)
Метод вставляет в данную коллекцию указанное значение в позицию с заданным индексом.
Метод вставляет в коллекцию значение value в позицию с индексом index .
index: Индекс позиции в коллекции. Тип int.
value: Вставляемое в коллекцию значение. Тип double.

Teigha.Geometry.KnotCollection.IsOn(System.Double)
Метод позволяет проверить, является ли указанный узел элементом данной коллекции узлов в пределах заданной точности KnotCollection.Tolerance.
Метод позволяет проверить, является ли указанный узел элементом данной коллекции узлов в пределах заданной точности KnotCollection.Tolerance.
knot: Проверяемое значение. Тип double.
Returns: Возвращает true, если значение knot является элементом данной коллекции в пределах заданной точности.
В противном случае возвращает false.

Teigha.Geometry.KnotCollection.RemoveAt(System.Int32)
Метод предназначен для удаления из данной коллекции узла с указанным индексом.
Метод предназначен для удаления из данной коллекции узла с индексом index.
index: Индекс удаляемого узла.

Teigha.Geometry.KnotCollection.SetRange(System.Double,System.Double)
Метод позволяет переопределить общий интервал значений данного узлового вектора.
Метод позволяет переопределить общий интервал значений данного узлового вектора, используя новые значения для первого и последнего узлов в коллекции.
lower: Новый нижний узел. Должен быть меньше нового верхнего узла. Тип double.
upper: Новый верхний узел. Должен быть больше нового нижнего узла. Тип double.

Teigha.Geometry.KnotCollection.Split(System.Double,System.Int32,System.Int32)
Метод предназначен для разделения данного узлового вектора (коллекции узлов) на две части в точке, которая задается указанным значением входного параметра.
Метод предназначен для разделения данного узлового вектора (коллекции узлов) на две части в точке, которая задается указанным значением  параметра. Дополнительно позволяет настроить кратность узлов на смежных концах полученных двух узловых векторов.
parameter: Параметр, определяющий точку разделения данной коллекции (узлового вектора) на две части. Тип double.
multiplicityLast: Кратность последнего узла головной части. Тип int.
multiplicityFirst: Кратность первого узла хвостовой части. Тип int.
Returns: Возвращает массив из двух узловых векторов, полученных в результате разделения на две части исходного узлового вектора.
Тип KnotCollection[].
Нулевой элемент массива содержит головную часть разделения, а первый - хвостовую.

Teigha.Geometry.KnotCollection.Count
Свойство Count представляет общее количество элементов в коллекции.
Свойство Count представляет общее количество элементов в коллекции.
Returns: Возвращает общее количество элементов в коллекции.
Тип int.

Teigha.Geometry.KnotCollection.EndParameter
Свойство EndParameter представляет значение параметра в конечном узле коллекции.
Свойство EndParameter представляет значение параметра в конечном узле коллекции.
Returns: Возвращает значение параметра в конечном узле коллекции.
Тип double.

Teigha.Geometry.KnotCollection.IsFixedSize
Свойство IsFixedSize позволяет проверить, является ли фиксированным размер данной коллекции.
Свойство IsFixedSize позволяет проверить, является ли фиксированным размер данной коллекции.
Returns: Возвращает true, если размер данной коллекции является фиксированным.
В противном случае возвращает false.

Teigha.Geometry.KnotCollection.IsReadOnly
Свойство IsReadOnly позволяет определить, доступна ли эта коллекция только для чтения.
Свойство IsReadOnly позволяет определить, доступна ли эта коллекция только для чтения.
Returns: Возвращает true, если коллекция доступна только для чтения.
В противном случае возвращает false.

Teigha.Geometry.KnotCollection.IsSynchronized
Свойство IsSynchronized позволяет проверить, является ли доступ к этой коллекции потокобезопасным.
Свойство IsSynchronized позволяет проверить, является ли доступ к этой коллекции потокобезопасным.
Returns: Возвращает true, если доступ к этой коллекции является потокобезопасным.
В противном случае возвращает false.

Teigha.Geometry.KnotCollection.Item
Свойство Item представляет элемент коллекции с указанным индексом.
Свойство Item представляет элемент коллекции с указанным индексом.
A_0: Входной индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип double.

Teigha.Geometry.KnotCollection.NumberOfIntervals
Свойство NumberOfIntervals представляет количество узловых интервалов, связанных с данной коллекцией.
Свойство NumberOfIntervals представляет количество узловых интервалов, связанных с данной коллекцией.
Returns: Возвращает количество узловых интервалов.
Тип int.

Teigha.Geometry.KnotCollection.StartParameter
Свойство StartParameter представляет параметр в начальном узле коллекции.
Свойство StartParameter представляет параметр в начальном узле коллекции.
Returns: Возвращает параметр в начальном узле коллекции.
Тип double.

Teigha.Geometry.KnotCollection.SyncRoot
Свойство SyncRoot представляет объект, используемый для синхронизации доступа к данной коллекции.
Свойство SyncRoot представляет объект, используемый для синхронизации доступа к данной коллекции.
Returns: Возвращает объект, используемый для синхронизации доступа к данной коллекции.
Тип Object.

Teigha.Geometry.KnotCollection.Tolerance
Свойство Tolerance представляет доступ к точности, которая используется в данной коллекции для проверки узлов на совпадение.
Свойство Tolerance представляет доступ к точности, которая используется в данной коллекции для проверки узлов на совпадение.
Returns: Возвращает точность для проверки узлов на совпадение.
Тип double.