Teigha.DatabaseServices.AssocNetwork
Класс AssocNetwork представляет сеть ассоциативных действий AssocAction.  Не реализован.
Класс AssocNetwork поддерживает сеть ассоциативных действий, представленных объектами AssocAction.
Поскольку класс AssocNetwork является производным от класса AssocAction, его экземпляры ведут себя как отдельные ассоциативные действия. Как следствие, сеть в целом может быть связана с другими объектами ассоциативными зависимостями AssocDependency или принадлежать сети AssocNetwork более высокого уровня, что позволяет создавать иерархические ассоциативные структуры.
Зависимости между действиями в сети AssocNetwork определяют характер ассоциативных взаимосвязей действий и объектов.  Например, если одно действие изменяет объект (write), а другое действие этот объект использует (read), то второе действие оказывается зависимым от первого, и вычислять это второе действие необходимо только после вычисления первого.
В настоящее время класс не реализован.

Teigha.DatabaseServices.AssocNetwork.#ctor
Конструктор по умолчанию. Не реализован.
Конструктор по умолчанию.
В настоящее время не реализован.