Teigha.DatabaseServices.CellRange
Этот класс представляет диапазоны ячеек таблицы.
Этот класс представляет диапазоны ячеек таблицы.

Teigha.DatabaseServices.CellRange.Create(Teigha.DatabaseServices.Table,System.Int32,System.Int32,System.Int32,System.Int32)
Метод создает диапазон ячеек, заключенный между двумя строками и двумя столбцами таблицы.
Метод создает диапазон ячеек, заключенный между двумя строками и двумя столбцами таблицы.
table: Таблица, содержащая ячейки, из которых следует сформировать диапазон ячеек. Тип Table.
topRow: Индекс верхней строки диапазона ячеек. Тип int.
leftColumn: Индекс левого столбца диапазона ячеек. Тип int.
bottomRow: Индекс нижней строки диапазона ячеек. Тип int.
rightColumn: Индекс правого столбца диапазона ячеек. Тип int.
Returns: Возвращает диапазон ячеек таблицы в указанных границах.  Тип CellRange.

Teigha.DatabaseServices.CellRange.Equals(Object)
Метод позволяет проверить на равенство два диапазона ячеек.
Метод позволяет проверить на равенство два диапазона ячеек.
pRange: Диапазон, который проверяется на равенство данному объекту. Тип Object.
Returns: Возвращает true, если диапазоны равны. В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.CellRange.GetCustomData(String)
Метод возвращает значение пользовательских данных из текущей ячейки данного диапазона.
Метод возвращает значение пользовательских данных из текущей ячейки данного диапазона.
key: Ключ, используемый для доступа к пользовательским данным. Тип String.
Returns: Возвращает пользовательские данные. Тип Object.

Teigha.DatabaseServices.CellRange.SetCustomData(String,Object)
Метод позволяет задать значение пользовательских данных для ячеек этого диапазона.
Метод позволяет задать значение пользовательских данных для ячеек этого диапазона.
key: Ключ для доступа к пользовательским данным. Тип String.
value: Значение пользовательских данных. Тип Object.

Teigha.DatabaseServices.CellRange.SetDataLink(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать внешнюю ссылку для ячеек этого диапазона.
Метод позволяет задать внешнюю ссылку для ячеек этого диапазона.
dataLinkId: Идентификатор объекта внешней ссылки. Тип ObjectId.
bUpdate: Флаг, определяющий, следует ли после установки обновить данные по этой внешней ссылке. Тип bool.

Teigha.DatabaseServices.CellRange.!=(Teigha.DatabaseServices.CellRange,Teigha.DatabaseServices.CellRange)
Оператор неравенства для класса CellRange. Проверяет два диапазона ячеек на неравенство.
Оператор неравенства для класса CellRange. Проверяет два диапазона ячеек на неравенство.
t1: Левый операнд.  Тип CellRange. Может быть нулевым.
t2: Правый операнд. Тип CellRange. Может быть нулевым.
Returns: Возвращает true, только если операнды t1 и t2 не равны (любой из них может быть нулевым) ,т.е. не выполняется хотя бы одно из перечисленных ниже условий:
* Совпадают верхние строки.
* Совпадают нижние строки.
* Совпадают левые столбцы.
* Совпадают правые столбцы.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.==(Teigha.DatabaseServices.CellRange,Teigha.DatabaseServices.CellRange)
Оператор равенства для класса CellRange. Проверяет равенство двух диапазонов ячеек.
Оператор равенства для класса CellRange. Проверяет равенство двух диапазонов ячеек.
t1: Левый операнд.  Тип CellRange. Не должен быть нулевым.
t2: Правый операнд. Тип CellRange. Не должен быть нулевым.
Returns: Возвращает true в случае равенства ненулевых операндов t1 и t2, т.е. если выполняются все перечисленные ниже условия:
* Совпадают верхние строки.
* Совпадают нижние строки.
* Совпадают левые столбцы.
* Совпадают правые столбцы.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.Alignment
Свойство обеспечивает доступ к настройкам выравнивания в ячейках диапазона.
Свойство обеспечивает доступ к настройкам выравнивания в ячейках диапазона.
Returns: Возвращает значение выравнивания из перечисления Тип CellAlignment.

Teigha.DatabaseServices.CellRange.BackgroundColor
Свойство обеспечивает доступ к цвету фоновой заливки ячеек данного диапазона.
Свойство обеспечивает доступ к цвету фоновой заливки ячеек данного диапазона.
Returns: Возвращает цвет фона ячеек диапазона. Тип Colors.Color.

Teigha.DatabaseServices.CellRange.Borders
Свойство возвращает границы ячеек диапазона.
Свойство возвращает границы ячеек диапазона.
Returns: Возвращает границы ячеек. Тип CellBorders.

Teigha.DatabaseServices.CellRange.BottomRight
Свойство возвращает правую нижнюю ячейку диапазона.
Свойство возвращает правую нижнюю ячейку диапазона.
Returns: Возвращает ячейку диапазона. Тип Cell.

Teigha.DatabaseServices.CellRange.BottomRightPlusOne
Свойство возвращает ячейку, следующую за правой нижней ячейкой диапазона.
Свойство возвращает ячейку, следующую за правой нижней ячейкой диапазона.
Returns: Возвращает ячейку таблицы. Тип Cell.

Teigha.DatabaseServices.CellRange.BottomRow
Свойство возвращает индекс нижней строки диапазона ячеек.
Свойство возвращает индекс нижней строки диапазона ячеек.
Returns: Возвращает индекс нижней строки диапазона. Тип int.

Teigha.DatabaseServices.CellRange.CanDeleteColumns
Свойство позволяет определить, возможно ли удаление столбцов из диапазона.
Свойство позволяет определить, возможно ли удаление столбцов из диапазона.
Returns: Возвращает true, если удаление столбцов возможно.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.CanDeleteRows
Свойство позволяет определить, возможно ли удаление строк из диапазона.
Свойство позволяет определить, возможно ли удаление строк из диапазона.
Returns: Возвращает true, если удаление строк возможно.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.CanInsertColumn
Свойство позволяет определить, можно ли вставить столбец в диапазон.
Свойство позволяет определить, можно ли вставить столбец в диапазон.
Returns: Возвращает true, если вставить столбец можно.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.CanInsertRow
Свойство позволяет определить, можно ли вставить строку в диапазон.
Свойство позволяет определить, можно ли вставить строку в диапазон.
Returns: Возвращает true, если вставить строку можно.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.ContentColor
Свойство обеспечивает доступ к цвету содержимого ячеек диапазона.
Свойство обеспечивает доступ к цвету содержимого ячеек диапазона.
Returns: Возвращает цвет содержимого ячеек диапазона.
Тип Colors.Color.

Teigha.DatabaseServices.CellRange.ContentLayout
Свойство обеспечивает доступ к настройкам размещения содержимого ячеек диапазона из перечисления CellContentLayout.
Свойство обеспечивает доступ к настройкам размещения содержимого ячеек диапазона из перечисления CellContentLayout.
Returns: Возвращает вариант размещения содержимого ячеек.  Значение из перечисления CellContentLayout.

Teigha.DatabaseServices.CellRange.DataFormat
Свойство обеспечивает доступ к формату данных в ячейках диапазона.
Свойство обеспечивает доступ к формату данных в ячейках диапазона.
Returns: Возвращает формат данных. Тип String.

Teigha.DatabaseServices.CellRange.DataType
Свойство обеспечивает доступ к типу данных в ячейках диапазона.
Свойство обеспечивает доступ к типу данных в ячейках диапазона.
Returns: Возвращает тип данных в ячейках диапазона. Тип DataTypeParameter.

Teigha.DatabaseServices.CellRange.IsBackgroundColorNone
Свойство позволяет проверить, задан ли цвет фона в ячейках диапазона.
Свойство позволяет проверить, задан ли цвет фона в ячейках диапазона.
Returns: Возвращает true, если цвет фона не задан. В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsContentEditable
Свойство позволяет проверить, допустимо ли редактирование содержимого ячеек диапазона.
Свойство позволяет проверить, допустимо ли редактирование содержимого ячеек диапазона.
Returns: Возвращает true, если редактирование содержимого ячеек возможно.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsEmpty
Свойство позволяет проверить, является ли пустым данный диапазон.
Свойство позволяет проверить, является ли пустым данный диапазон.
Returns: Возвращает true, если диапазон является пустым.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsFormatEditable
Свойство позволяет проверить, возможно ли изменять формат ячеек данного диапазона.
Свойство позволяет проверить, возможно ли изменять формат ячеек данного диапазона.
Returns: Возвращает true, если формат ячеек диапазона можно редактировать.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsLinked
Свойство позволяет проверить наличие в ячейках диапазона внешних ссылок.
Свойство позволяет проверить наличие в ячейках диапазона внешних ссылок.
Returns: Возвращает true, если содержимое ячеек диапазона определяется внешними ссылками.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsMergeAllEnabled
Свойство позволяет проверить, включен ли режим слияния всех ячеек диапазона.
Свойство позволяет проверить, включен ли режим слияния всех ячеек диапазона.
Returns: Возвращает true, если режим слияния всех ячеек диапазона включен.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsMerged
Свойство позволяет проверить, выполнено ли слияние ячеек диапазона.
Свойство позволяет проверить, выполнено ли слияние ячеек диапазона.
Returns: Возвращает true, если слияние ячеек диапазона выполнено.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsNull
Свойство позволяет проверить, является ли нулевым объект диапазона ячеек.
Свойство позволяет проверить, является ли нулевым объект диапазона ячеек.
Returns: Возвращает true, если объект диапазона ячеек является нулевым.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.IsSingleCell
Свойство позволяет проверить, состоит ли диапазон из единственной ячейки.
Свойство позволяет проверить, состоит ли диапазон из единственной ячейки.
Returns: Возвращает true, если диапазон состоит из единственной ячейки.
В противном случае возвращает false.

Teigha.DatabaseServices.CellRange.Item
Свойство возвращает ячейку с указанными индексами строки и столбца.
Свойство возвращает ячейку с указанными индексами строки и столбца.
row: Индекс строки. Тип int.
column: Индекс столбца. Тип int.
Returns: Возвращает ячейку диапазона с указанными индексами строки и столбца.  Тип Cell.

Teigha.DatabaseServices.CellRange.LeftColumn
Свойство возвращает индекс левого столбца данного диапазона ячеек.
Свойство возвращает индекс левого столбца данного диапазона ячеек.
Returns: Возвращает индекс левого столбца диапазона. Тип int.

Teigha.DatabaseServices.CellRange.Parent
Свойство обеспечивает доступ к родительскому объекту данного диапазона ячеек.
Свойство обеспечивает доступ к родительскому объекту данного диапазона ячеек.
Returns: Возвращает родительский объект диапазона. Тип Object.

Teigha.DatabaseServices.CellRange.ParentTable
Свойство возвращает родительскую таблицу данного диапазона ячеек.
Свойство возвращает родительскую таблицу данного диапазона ячеек.
Returns: Возвращает родительскую таблицу данного диапазона. Тип Table.

Teigha.DatabaseServices.CellRange.RightColumn
Свойство возвращает индекс правого столбца данного диапазона ячеек.
Свойство возвращает индекс правого столбца данного диапазона ячеек.
Returns: Возвращает индекс правого столбца диапазона.  Тип int.

Teigha.DatabaseServices.CellRange.State
Свойство управляет текущим состоянием ячеек данного диапазона.
Свойство управляет текущим состоянием ячеек данного диапазона.
Returns: Возвращает состояние ячеек данного диапазона из перечисления CellStates.

Teigha.DatabaseServices.CellRange.Style
Свойство позволяет управлять стилем ячеек диапазона.
Свойство позволяет управлять стилем ячеек диапазона.
Returns: Возвращает имя стиля ячеек. Тип String.

Teigha.DatabaseServices.CellRange.TextHeight
Свойство позволяет управлять высотой текста в ячейках диапазона.
Свойство позволяет управлять высотой текста в ячейках диапазона.
Returns: Возвращает высоту текста в ячейках диапазона. Тип double.

Teigha.DatabaseServices.CellRange.TextStyleId
Свойство обеспечивает доступ к текстовому стилю ячеек диапазона.
Свойство обеспечивает доступ к текстовому стилю ячеек диапазона.
Returns: Возвращает идентификатор объекта текстового стиля. Тип ObjectId.

Teigha.DatabaseServices.CellRange.TopLeft
Свойство возвращает верхнюю левую ячейку диапазона.
Свойство возвращает верхнюю левую ячейку диапазона.
Returns: Возвращает верхнюю левую ячейку диапазона. Тип Cell.

Teigha.DatabaseServices.CellRange.TopRow
Свойство возвращает индекс верхней строки этого диапазона ячеек.
Свойство возвращает индекс верхней строки этого диапазона ячеек.
Returns: Возвращает индекс верхней строки диапазона. Тип int.