Teigha.DatabaseServices.BlockTableRecordEnumerator
Этот класс реализует перечислитель для объекта BlockTableRecord.
Этот класс реализует перечислитель для объекта BlockTableRecord.

Teigha.DatabaseServices.BlockTableRecordEnumerator.#ctor(IntPtr,System.Boolean,System.Boolean)
Конструктор класса BlockTableRecordEnumerator.
Конструктор класса BlockTableRecordEnumerator.
unmanagedPointer: Неуправляемый указатель на входной объект.  Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
skipDeleted: Флаг, определяющий, следует ли пропускать удаленный объект. Тип bool.

Teigha.DatabaseServices.BlockTableRecordEnumerator.Current
Свойство возвращает текущий блок данного перечислителя.
Свойство возвращает текущий блок данного перечислителя.
Returns: Возвращает идентификатор текущего блока. Тип ObjectId.