Teigha.DatabaseServices.DuplicateRecordCloning
Данное перечисление определяет варианты действий в случаях, когда при глубоком клонировании объектов обнаруживается, что в целевой базе данных уже присутствуют дубликаты их клонов.
Данное перечисление определяет варианты действий в случаях, когда при глубоком клонировании объектов обнаруживается, что в целевой базе данных уже присутствуют дубликаты их клонов.