HostMgd.EditorInput.PromptNestedEntityOptions
Класс предоставляет параметры для настройки операции выбора вложенного
геометрического объекта — например, внутри блока или внешней ссылки.
Класс используется при вызове метода GetNestedEntity() для настройки
интерактивного выбора объекта, находящегося внутри составного элемента чертежа
— такого как блок или внешняя ссылка. Он позволяет задать:
* текст приглашения (Message),
* разрешение на отмену ввода (AllowNone),
* ключевые слова (Keywords),
* другие режимы поведения команды .
Этот класс обеспечивает гибкость при реализации команд, требующих работы с вложенными объектами,
позволяя адаптировать интерфейс ввода под конкретный контекст — например, изменить сообщение,
добавить подсказки или ограничить действия пользователя.
Класс используется совместно с событиями PromptingForNestedEntity и PromptedForNestedEntity,
что позволяет как настраивать параметры перед вводом, так и обрабатывать результат после выбора.

HostMgd.EditorInput.PromptNestedEntityOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса с заданным приглашающим сообщением
для операции выбора вложенного объекта.
Конструктор создаёт объект класса PromptNestedEntityOptions, используемый при настройке
интерактивного выбора геометрического объекта, вложенного в блок или внешнюю ссылку.
Он устанавливает текст приглашения, который отображается в командной строке перед началом выбора,
и служит основой для взаимодействия с пользователем.
После создания объекта можно дополнительно настроить его параметры, такие как:
* разрешение на отмену выбора (AllowNone),
* добавление ключевых слов (Keywords),
* установка глобальных команд (GlobalKeywords).
Этот конструктор является основным способом инициализации параметров
при работе с методом GetNestedEntity().
message: Текст приглашения, отображаемый пользователю перед началом выбора вложенного объекта.
Пример: "Выберите линию внутри блока

HostMgd.EditorInput.PromptNestedEntityOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением,
включающим локальные ключевые слова, и списком глобальных ключевых слов.
Конструктор создаёт объект класса PromptNestedEntityOptions, используемый при настройке операции выбора
вложенного геометрического объекта — например, внутри блока или внешней ссылки. Он позволяет одновременно задать:
* текст приглашения с локальными ключевыми словами, заключёнными в квадратные скобки: "Выберите объект [Линия/Круг]",
* глобальные ключевые слова , доступные в любой момент ввода, разделённые пробелом: "Отмена Выход".
Этот конструктор особенно полезен при реализации интерактивных команд, где пользователь может выбрать
действие из списка или ввести системную команду, не прерывая операцию.
После вызова конструктора локальные ключевые слова автоматически добавляются в коллекцию Keywords,
а глобальные становятся доступными через GlobalKeywords.
messageAndKeywords: Строка, содержащая сообщение и список локальных ключевых слов в формате
Пример: "Выберите тип объекта [Прямоугольник/Полилиния]".
globalKeywords: Строка, содержащая глобальные команды, разделённые пробелом.
Пример: "Отмена Выход Повтор".

HostMgd.EditorInput.PromptNestedEntityOptions.AllowNone
Свойство определяет, разрешено ли завершить операцию выбора вложенного
объекта нажатием клавиши Enter без указания объекта.
Свойство позволяет указать, может ли пользователь завершить операцию выбора
вложенного геометрического объекта без фактического выбора — просто нажав Enter .
Если свойство установлено в true, такая возможность разрешена, и результат ввода
будет иметь статус PromptStatus.None. Если false — пользователь обязан указать объект
или ввести ключевое слово.
Returns: Возвращает значение типа bool:
* true — завершение ввода нажатием Enter разрешено.
* false — требуется обязательный выбор объекта или ввод команды.

HostMgd.EditorInput.PromptNestedEntityOptions.NonInteractivePickPoint
Свойство устанавливает или возвращает точку выбора, используемую при программном
(неинтерактивном) выборе вложенного геометрического объекта.
Свойство  используется для задания точки, в которой должен быть "выбран" вложенный объект
без участия пользователя — например, в автоматизированных или фоновых операциях.
Оно применяется при программном вызове метода GetNestedEntity() в режиме без интерактивного ввода,
когда выбор объекта должен быть выполнен автоматически на основе указанной точки.
Точка задаётся в мировых координатах (WCS), но при обработке преобразуется в локальную систему координат
контейнера (например, блока), чтобы корректно определить, какой вложенный объект находится в указанной позиции.
Это свойство особенно полезно при реализации команд, где требуется:
* автоматический выбор объектов внутри блоков,
* анализ компонентов по заданным координатам,
* массовая обработка вложенных элементов без пользовательского ввода.
Returns: Возвращает или устанавливает объект типа Point3d:
* Если точка задана — используется как позиция для автоматического выбора.
* Если значение Point3d.Null — режим программного выбора отключён, и операция ожидает интерактивного ввода.

HostMgd.EditorInput.PromptNestedEntityOptions.UseNonInteractivePickPoint
Свойство определяет, будет ли операция выбора вложенного объекта использовать
заданную программную точку выбора вместо ожидания ввода от пользователя.
Свойство указывает, следует ли применять значение, заданное в свойстве NonInteractivePickPoint,
для автоматического выбора вложенного объекта без участия пользователя.
Если свойство установлено в true, система пытается найти и выбрать объект в указанной точке
(заданной через NonInteractivePickPoint) без отображения приглашения и ожидания действий пользователя.
Если false — операция работает в стандартном интерактивном режиме.
Это свойство позволяет переключаться между интерактивным и неинтерактивным режимами выбора,
что особенно полезно при автоматизации задач, тестировании или реализации фоновых операций.
Свойство должно использоваться совместно с NonInteractivePickPoint,
иначе попытка неинтерактивного выбора будет игнорироваться или завершится ошибкой.
Returns: Возвращает значение типа bool:
* true — система использует NonInteractivePickPoint для автоматического выбора объекта.
* false — включается стандартный интерактивный режим ввода (ожидание указания мышью).