Teigha.Runtime.RXClass.Create
Метод создает новый экземпляр класса, используя данный объект в псевдоконструкторе класса.
Метод создает новый экземпляр класса, используя данный объект в псевдоконструкторе класса.
Возвращает интеллектуальный указатель на вновь созданный экземпляр.
Returns: Возвращает интеллектуальный указатель на вновь созданный экземпляр RXObject.