Teigha.DatabaseServices.AssocAction
Класс AssocAction представляет ассоциативные действия, позволяющие реализовать ассоциативное поведение объектов.
Класс AssocAction представляет ассоциативные действия, позволяющие реализовать ассоциативное поведение объектов.
Всякий объект, который должен отличаться ассоциативным поведением, т.е. должен автоматически обновляться ассоциативным механизмом в случае изменения влияющих на него объектов, должен быть производным от класса AssocActionBody (см. комментарии к классу AssocActionBody) и принадлежать родительскому объекту AssocAction. Действия полностью принадлежат своим родительским действиям.  Например, удаление родительского действия удаляет и принадлежащее ему действие.
Сам по себе класс AssocAction не имеет виртуальных методов, которые можно было бы переопределить, поэтому внешние разработчики не могут непосредственно наследовать класс AssocAction и переопределять его методы.  Разработчики самой платформы nanoCAD в принципе могут наследовать класс AssocAction и переопределять его виртуальные методы, но к этому следует прибегать только в случае отсутствия всякой возможности создать прокси-объекты для объектов производных классов действий.
Каждое действие принадлежит объекту AssocNetwork, который в свою очередь сам является действием, что делает возможным представление иерархических ассоциативных структур.
Основным протоколом класса AssocAction является метод evaluate(), который вызывает метод evaluateOverride() принадлежащего ему объекта AssocActionBody.
Действиям принадлежат объекты AssocDependency, которые позволяют действиям зависеть от любых объектов Objects.
Связность в сети представлена следующим образом.
В случае изменения объектов, от которых зависят зависимости, уведомления получают как сами зависимости, так и владеющие зависимостями действия, а также иерархия сетей, владеющих действиями.
Эти уведомления лишь меняют статус AssocStatus зависимостей и действий/сетей, отражая сам факт изменений, но не приводя к перевычислению действий.
Фактическое перевычисление действия происходит тогда, когда клиентский код вызывает метод evalaute() сети верхнего уровня.
При этом автоматически перевычисляются все действия, которые принадлежат сети и которые нуждаются в обновлении, поскольку напрямую или опосредованно зависят от изменившихся объектов.
Если некоторое действие изменяет зависимый объект (имеет write-dependency), и существует другое действие, которое использует этот измененный объект (имеет read-dependency), тогда при вычислении первого действия второе действие также потребует перевычисления
Поток информации имеет следующий вид:
Object1 --ReadDep--> Action1 --WriteDep1--> Object2 --ReadDep--> Action2 ...
Обратите внимание, что действие может как зависеть от нескольких объектов, так может и изменять несколько других объектов.
Сеть образует ориентированный ациклический граф.
Алгоритм вычисления гарантирует, что вычисляются все требующие обновления действия, и что вычисления происходят в правильном порядке.
Последнее означает, что всякое действие оценивается только после того, как были перевычислены все другие действия, изменяющие объекты, от которых это действие зависит.
(В действительности ситуация несколько сложнее, поскольку есть и другие аспекты, контролирующие порядок вычислений.)
Для перевычисления сети верхнего уровня базы данных следует использовать статический метод AssocManager.evaluateTopLevelNetwork().
Он подберет и вычислит все действия, которые в этом нуждаются.
Явное перевычисление отдельных подсетей не рекомендуется.

Teigha.DatabaseServices.AssocAction.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.AssocAction.AddDependency(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод добавляет к данному действию заданную ассоциативную зависимость AssocDependency.
Метод добавляет к данному действию заданную ассоциативную зависимость AssocDependency.
Если аргумент setThisActionAsOwningAction имеет значение true, данное действие становится владельцем указанной зависимости (что является наиболее распространенным случаем).  В противном случае действие будет просто ссылаться на эту зависимость.
dependencyId: Идентификатор добавляемой зависимости. Тип Teigha.DatabaseServices.ObjectId.
setThisActionAsOwningAction: Флаг "присвоения" зависимости действием. Тип bool.  В случае значения true данное действие становится владельцем добавляемой зависимости.  В противном случае действие будет просто ссылаться на зависимость.

Teigha.DatabaseServices.AssocAction.AddMoreObjectsToDeepClone(Teigha.DatabaseServices.IdMapping,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет добавить в процесс глубокого клонирования дополнительные объекты, которые ассоциативно связаны с уже клонированными объектами.
Метод позволяет добавить в процесс глубокого клонирования дополнительные объекты, которые ассоциативно связаны с уже клонированными объектами.
Метод вызывается непосредственно перед завершением основного цикла глубокого клонирования (перед уведомлением реактора Teigha.DatabaseServices.Database.BeginDeepCloneTranslation()), когда объекты уже клонированы, но их идентификаторы еще не транслированы.
Метод опрашивает действия, у которых есть зависимости AssocDependency с клонируемыми объектами, требуется ли действиям включить какие-либо дополнительные объекты в процесс глубокого клонирования.  В этот момент действия могут сообщить о дополнительных объектах, подлежащих глубокому клонированию, и основной цикл клонирования продолжит глубокое клонирование этих добавленных объектов. Если количество клонируемых объектов возросло, опрашиваются действия, ассоциативно связанные с этими вновь клонированными объектами, что может привести к дальнейшему расширению списка клонируемых объектов.  Этот рекурсивный процесс продолжается до тех пор, пока объекты для клонирования не закончатся.
Если действие владеет объектом AssocActionBody, который переопределяет обратный вызов AddMoreObjectsToDeepCloneOverride(), вызывается этот переопределенный обратный вызов.
idMap: Объект IdMapping текущей сессии глубокого клонирования.
additionalObjectsToClone: Коллекция дополнительных объектов, которые требуется включить в процесс глубокого клонирования.

Teigha.DatabaseServices.AssocAction.AreDependenciesEqual(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.AssocDependency)
Метод реализует проверку равенства ассоциативных зависимостей.
Решение принимается на уровне действия, являющегося владельцем зависимости.
Метод реализует проверку равенства ассоциативных зависимостей.
Метод делегирован из принадлежащего зависимости предиката AssocDependency.IsEqualTo().
Это позволяет владеющему действию, а не самой зависимости, решать, равны ли две зависимости.
Реализация по умолчанию просто возвращает false.
Если действие владеет объектом AssocActionBody, который переопределяет предикат areDependencyEqualOveride(), то вызывается этот предикат (а не просто возвращается false).
dependency1: Первая ассоциативная зависимость. Тип AssocDependency.
dependency2: Вторая ассоциативная зависимость. Тип AssocDependency.
Returns: Возвращает true в случае равенства зависимостей. В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.AreDependenciesOnTheSameThing(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить, зависят ли две заданные ассоциативные зависимости от одного и того же объекта.  Решение принимается на уровне действия-владельца зависимости.
Метод позволяет проверить, зависят ли две заданные ассоциативные зависимости от одного и того же объекта.
Метод делегирован из принадлежащего зависимости предиката AssocDependency.IsDependentOnTheSameThingAs().
Это позволяет владеющему действию, а не самой зависимости, решать, зависят ли указанные две ассоциативные зависимости от одного и того же объекта.
Реализация по умолчанию просто возвращает true.
Если действие владеет объектом AssocActionBody, который переопределяет предикат IsDependentOnTheSameThingOveride(), то вызывается этот предикат (а не просто возвращается true).
dependency1: Первая ассоциативная зависимость. Тип AssocDependency.
dependency2: Вторая ассоциативная зависимость. Тип AssocDependency.
Returns: Возвращает true, если указанные две ассоциативные зависимости от одного и того же объекта.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.DependentObjectCloned(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.DBObject)
Метод вызывается в момент обратного вызова постоянного реактора AssocDependency.Copied() принадлежащей действию зависимости.
Метод вызывается в момент обратного вызова постоянного реактора AssocDependency.Copied() принадлежащей действию зависимости.
Он уведомляет действие-владельца о том, что клонирование объекта, от которого зависит действие, завершено.
Клонирование может быть лишь поверхностным (shallow), т.е. не обязательно глубоким (deep) или блочным.
Если действие владеет объектом AssocActionBody, который переопределяет обратный вызов dependentObjectClonedOverride(), вызывается именно этот обратный вызов.
dependency: Зависимость на клонированном объекте DBObject.  Тип AssocDependency.
dbObj: Исходный объект. Тип DBObject.
newObj: Только что созданный клон. Тип DBObject.

Teigha.DatabaseServices.AssocAction.DragStatus(Teigha.DatabaseServices.DragStatus)
Метод вызывается для уведомления действия о выполнении операции перетаскивания, в которой задействованы некоторые объекты, от которых прямо или косвенно зависит данное действие.
Метод вызывается для уведомления действия о выполнении операции перетаскивания, в которой задействованы некоторые объекты, от которых прямо или косвенно зависит данное действие.
status: Статус операции перетаскивания. Член перечисления DragStatus.

Teigha.DatabaseServices.AssocAction.EvaluateDependency(Teigha.DatabaseServices.AssocDependency)
Метод реализует перевычисление ассоциативной зависимости на уровне действия-владельца.
Метод делегирован из метода AssocDependency.evaluateOverride() принадлежащей данному действию зависимости.  Это позволяет действию-владельцу выполнять перевычисление вместо самой зависимости.  Реализация по умолчанию всего лишь выставляет статус зависимости равным  IsUpToDateAssocStatus.
Если действию принадлежит объект AssocActionBody с переопределенным методом AssessmentDependencyOverride(), именно переопределенный метод вызывается для вычисления зависимости.
dependency: Входная ассоциативная зависимость. Тип AssocDependency.

Teigha.DatabaseServices.AssocAction.GetActionBody(Teigha.DatabaseServices.ObjectId)
Метод позволяет получить ObjectId тела ассоциативного действия.
Метод позволяет получить ObjectId тела ассоциативного действия.
actionId: Идентификатор ассоциативного действия. Тип Teigha.DatabaseServices.ObjectId.
Returns: Возвращает идентификатор тела действия. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocAction.GetActionsDependentOnObject(Teigha.DatabaseServices.DBObject,System.Boolean,System.Boolean)
Метод позволяет получить все действия, которые зависят от заданного объекта DBObject (т.е. имеют зависимости AssocDependency для этого объекта).
Метод позволяет получить все действия, которые зависят от заданного объекта DBObject (т.е. имеют зависимости AssocDependency для этого объекта).
dbObj: Входной объект, для которого ищутся ассоциативные действия. Тип DBObject. Объект должен быть открыт по крайней мере для чтения.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от объекта dbObj. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые изменяют объект dbObj. Тип bool.
Returns: Возвращает коллекцию ObjectId найденных зависимостей. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.GetActionsDependentOnObject(Teigha.DatabaseServices.DBObject,System.Boolean,System.Boolean,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет получить все действия, которые зависят от заданного объекта DBObject. Идентификаторы найденных зависимостей сохраняются в заданной коллекции.
Метод позволяет получить все действия, которые зависят от заданного объекта DBObject (т.е. имеют зависимости AssocDependency для этого объекта). Идентификаторы найденных зависимостей сохраняются в заданной коллекции actionIds.
dbObj: Входной объект, для которого ищутся ассоциативные действия. Тип DBObject. Объект должен быть открыт по крайней мере для чтения.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от объекта dbObj. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые изменяют объект dbObj. Тип bool.
actionIds: Входная коллекция для найденных зависимостей. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.GetDependencies(System.Boolean,System.Boolean)
Метод позволяет получить коллекцию зависимостей AssocDependency для данного ассоциативного действия.
Метод позволяет получить зависимости AssocDependency для данного ассоциативного действия.  Реализация по умолчанию получает все зависимости, принадлежащие базовому классу ассоциативных действий, и допускает настройку выбора в зависимости от требуемого типа зависимостей (чтение/запись).
Если действию принадлежит объект AssocActionBody с переопределенным методом getDependencyOverride(), вызывается именно этот переопределенный метод, заменяя тем самым реализацию по умолчанию.  Это позволяет пользовательским классам тел действий самим контролировать, какие зависимости возвращать, а какие не указывать.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от данного действия. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые влияют на данное действие. Тип bool.
Returns: Возвращает коллекцию ObjectId с найденными зависимостями. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.GetDependentObjects(System.Boolean,System.Boolean)
Метод позволяет получить коллекцию объектов, от которых зависит или которые изменяет данное действие.
Метод позволяет получить коллекцию объектов, от которых зависит или которые изменяет данное действие.
Реализация по умолчанию собирает все объекты, для которых действие имеет зависимость типа AssocDependency.
Если действию принадлежит объект AssocActionBody с переопределенным методом GetDependentObjectsOverride(), вызывается именно этот переопределенный метод вместо реализации по умолчанию.
Это позволяет пользовательским классам для тел действий самим контролировать, какие объекты возвращать, а какие не указывать.  Впрочем, обычно нет необходимости переопределять этот метод, поскольку реализации по умолчанию, которая обходит все зависимости данного действия, должно быть вполне достаточно.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от данного действия. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые влияют на данное действие. Тип bool.
Returns: Возвращает коллекцию ObjectId с найденными зависимостями. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.HasDependencyCachedValue(Teigha.DatabaseServices.AssocDependency)
Метод позволяет определить имеет ли указанная зависимость кэшированное значение.
Метод позволяет определить имеет ли указанная зависимость кэшированное значение.
Метод делегирован из предиката AssocDependency.HasCachedValue() принадлежащей зависимости.  Это позволяет действию-владельцу, а не самой зависимости, решать, имеет ли зависимость кэшированное значение.  Реализация по умолчанию просто возвращает false.
Таким образом, кэшированное значение может храниться либо в самой зависимости, либо в действии, которому она принадлежит, в зависимости от того, что удобнее для конкретных типов действий или зависимостей.
Если действию принадлежит объект AssocActionBody с переопределенным предикатом HasDependencyCachedValueOverride(), вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
dependency: Входная зависимость, у которой проверяется наличие кэшированного значения. Тип AssocDependency. Должна быть открыта как минимум для чтения.
Returns: Возвращает true, если у входной зависимости имеется кэшированное значение.  В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsEqualTo(Teigha.DatabaseServices.AssocAction)
Метод реализует сравнение данного действия на равенство указанному действию.
Метод сравнивает данное действие с указанным действием и возвращает true тогда и только тогда, когда они равны (что бы это ни значило).  Оба действия должны быть доступны как минимум для чтения.
Если действие владеет объектом AssocActionBody с переопределенным предикатом IsEqualToOverride(), вызывается именно этот переопределенный предикат.
otherAction: Входное действие.  Тип AssocAction.  Должно быть доступно для чтения.
Returns: Возвращает true в случае равенства действий. В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsExternalDependency(Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить, является ли входная зависимость AssocDependency, принадлежащая данному действию, внешней по отношению к этому действию.
Метод проверяет, является ли входная зависимость AssocDependency, принадлежащая данному действию, внешней по отношению к этому действию, т.е. зависит ли она от DBObject, который не является этим действием и не принадлежит этому действию (когда действие является сетью).
Кроме того, зависимость, которая не зависит ни от какого объекта, считается внешней.
Если действию принадлежит объект AssocActionBody с переопределенным предикатом IsExternalDependencyOverride(), вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
dependency: Входная зависимость. Тип AssocDependency.
Returns: Возвращает true, если входная зависимость оказывается внешней по отношению к данному действию.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsOwnedDependency(Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить, принадлежит ли указанная зависимость AssocDependency данному действию напрямую или, если данное действие является сетью, принадлежит ли зависимость действию, принадлежащему сети.
Метод проверяет, принадлежит ли указанная зависимость AssocDependency данному действию напрямую или, если данное действие является сетью, принадлежит ли зависимость действию, принадлежащему сети.
Реализация по умолчанию сначала проверяет, совпадают ли OwnerId() зависимости и ObjectId() этого действия.
Если нет, и действие является сетью, вызывается метод GetDependencies(), чтобы проверить, окажется ли данная зависимость в полученном списке зависимостей.  Вторая проверка является общей и применима к любому действию, но она не используется в качестве реализации по умолчанию для каких-либо действий, поскольку более затратна.
Если действию принадлежит объект AssocActionBody с переопределенным предикатом IsOwnedDependencyOverride(), вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
dependency: Входная зависимость, проверяемая на принадлежность данному действию. Тип AssocDependency. Должна быть доступна как минимум на чтение.
Returns: Возвращает true, если зависимость dependency принадлежит данному действию напрямую или принадлежит действию, принадлежащему сети (когда данное действие является сетью). В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsRelevantDependencyChange(Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить входную зависимость на актуальность изменения в объекте, от которого она зависит.
Метод позволяет проверить входную зависимость на актуальность изменения в объекте, от которого она зависит.
Метод делегирован из принадлежащего зависимости предиката AssocDependency.IsRelevantChange().  Он позволяет действию-владельцу, а не самой зависимости, решать, относится ли изменение объекта к этой конкретной зависимости.  Реализация по умолчанию просто возвращает true.
Таким образом, данные (обычно кэшированное значение), необходимые для принятия решения о том, относится ли изменение объекта к зависимости определенного типа, могут храниться либо в самой зависимости, либо в действии, которому она принадлежит, в зависимости от того, что удобнее для каждого конкретного действия или типа зависимости.
Если действию принадлежит объект AssocActionBody с переопределенным предикатом IsRelevantDependencyChangeOverride(), то вместо реализации по умолчанию вызывается именно этот переопределенный предикат.
dependency: Входная зависимость, проверяемая на актуальность изменения в объекте, от которого она зависит. Тип AssocDependency. Должна быть доступна как минимум на чтение.
Returns: Возвращает true, если изменение зависимости актуально, и false в противном случае.
Реализация по умолчанию возвращает true.

Teigha.DatabaseServices.AssocAction.OwnedDependencyStatusChanged(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.AssocStatus)
Метод позволяет уведомить действие-владельца зависимости о том, что статус этой зависимости был только что изменен.
Метод уведомляет действие-владельца зависимости о том, что статус этой зависимости был только что изменен.
Этот метод представляет собой обратный вызов из AssocDependency.SetStatus(..., true). Он уведомляет действие, владеющее зависимостью, о том, что статус зависимости только что был изменен.  Зависимость остается пока открытой на запись и уже имеет новый статус.
Если действию принадлежит объект AssocActionBody с переопределенным методом OwnedDependencyStatusChangedOverride(), то он вызывается после выполнения реализации по умолчанию в классе AssocAction.  Впрочем, переопределять этот метод обычно не требуется.
ownedDependency: Входная зависимость, чей статус был только что изменен. Тип AssocDependency.
previousStatus: Предыдущий статус этой зависимости из перечисления AssocStatus.

Teigha.DatabaseServices.AssocAction.PostProcessAfterDeepClone(Teigha.DatabaseServices.IdMapping)
Метод позволяет реализовать уведомление исходных действий о завершении процедуры их глубокого клонирования.
Метод вызывается из метода уведомления реактора (идентификаторы клонов уже оттранслированы) для информирования исходных действий о завершении их клонирования, чтобы они могли обновить клоны или выполнить какие-либо другие необходимые операции.
Заметим, что исходное действие может найти свой клон, обратившись к переданному в метод объекту IdMapping.
Если действие владеет объектом AssocActionBody с переопределенным обратным вызовом PostProcessAfterDeepCloneOverride(), вызывается переопределенный обратный вызов.
idMap: Экземпляр класса IdMapping в текущей сессии глубокого клонирования.

Teigha.DatabaseServices.AssocAction.PostProcessAfterDeepCloneCancel(Teigha.DatabaseServices.IdMapping)
Метод позволяет реализовать уведомление исходных действий об отмене их глубокого клонирования.
Метод позволяет реализовать уведомление исходных действий об отмене их глубокого клонирования.
Метод вызывается из метода уведомления реактора.  Исходное действие может получить свой клон, обратившись к переданному в метод объекту IdMapping сеанса глубокого клонирования.
Если действие владеет объектом AssocActionBody с переопределенным обратным вызовом PostProcessAfterDeepCloneCancelOverride(), вызывается переопределенный обратный вызов.  Заметим, что обычно безопаснее не переопределять этот обратный вызов и просто ничего не предпринимать.
idMap: Экземпляр класса IdMapping текущего сеанса глубокого клонирования. Тип IdMapping.

Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject(Teigha.DatabaseServices.ObjectId)
Метод отключает зависимости, контролирующие указанный объект.
Метод отключает зависимости, контролирующие указанный объект.
Зависимости отключаются в обратном порядке, начиная с последней зависимости и заканчивая первой.
Метод на данный момент не реализован.
objID: Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies).  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject(Teigha.DatabaseServices.ObjectId,System.Int32)
Метод отключает зависимости, контролирующие указанный объект, а также позволяет настроить обработку зависимостей со статусом "только для чтения".
Метод отключает зависимости, контролирующие указанный объект, а также позволяет настроить обработку зависимостей со статусом "только для чтения".
Зависимости отключаются в обратном порядке, начиная с последней зависимости и заканчивая первой.
Метод на данный момент не реализован.
objID: Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies).  Тип Teigha.DatabaseServices.ObjectId.
readOnlyDependencyHandling: Определяет, как обрабатывать зависимости только для чтения. Тип int.
Допустимые значения аргумента readOnlyDependencyHandling:

Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject(Teigha.DatabaseServices.ObjectId,System.Int32,Teigha.DatabaseServices.ObjectId)
Метод отключает зависимости, контролирующие указанный объект. Дополнительно метод позволяет настроить обработку зависимостей со статусом "только для чтения" и указать объект, на который будут перенаправления такие зависимости.
Метод отключает зависимости, контролирующие указанный объект. Дополнительно метод позволяет настроить обработку зависимостей со статусом "только для чтения" и указать объект, на который будут перенаправления такие зависимости.
Зависимости отключаются в обратном порядке, начиная с последней зависимости и заканчивая первой.
Метод на данный момент не реализован.
objID: Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies).  Тип Teigha.DatabaseServices.ObjectId.
readOnlyDependencyHandling: Определяет, как обрабатывать зависимости только для чтения. Тип int.
objectToRedirectReadOnlyDependenciesTo: Объект, на который перенаправляются зависимости только для чтения.  Тип Teigha.DatabaseServices.ObjectId.
Допустимые значения аргумента readOnlyDependencyHandling:

Teigha.DatabaseServices.AssocAction.RemoveAllDependencies(System.Boolean)
Метод позволяет удалить все зависимости AssocDependencies, хранящиеся в векторе зависимостей данного действия, и опционально стереть их.
Метод удаляет все зависимости AssocDependencies, хранящиеся в векторе зависимостей данного действия, и опционально стирает их.
Если действие владеет объектом AssocActionBody с переопределенным методом RemoveAllDependenciesOverride(), то для уведомления об удалении зависимостей вызывается переопределенный метод.  Это происходит после того, как все зависимости уже удалены.
alsoEraseThem: Флаг стирания зависимостей после их удаления из данного действия. Тип bool.

Teigha.DatabaseServices.AssocAction.RemoveDependency(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод удаляет указанную зависимость AssocDependency из данного действия и опционально стирает ее.
Метод удаляет входную зависимость dependencyId из данного действия и опционально стирает ее.
dependencyId: Входной идентификатор удаляемой зависимости. Тип Teigha.DatabaseServices.ObjectId.
alsoEraseIt: Флаг стирания зависимости после ее удаления из данного действия. Тип bool.

Teigha.DatabaseServices.AssocAction.SetOwningNetwork(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать сеть-владельца для данного действия.
Метод позволяет задать сеть-владельца для данного действия.
Всякое действие, за исключением самой верхней сети AssocNetwork, логически принадлежит единственной сети AssocNetwork.
Эта сеть также может быть «физическим» владельцем ассоциативного действия в базе данных (сеть имеет идентификатор жесткого владения действием), но «физическим» владельцем может быть и какой-либо иной объект.  Например, для сетей, подключенных к BlockTableRecords, «логическим» владельцем является сеть верхнего уровня всей базы данных, а «физическим» владельцем в базе данных является подсловарь словаря расширения AcBdBlockTableRecord.
Этот метод не следует вызывать напрямую. Вместо этого следует использовать методы AssocNetwork.AddAction() и AssocNetwork.RemoveAction(), которые, в свою очередь, вызывают SetOwningNetwork().
networkId: Входная сеть ассоциативных зависимостей, которая логически должна владеть данным действием. Тип Teigha.DatabaseServices.ObjectId.
alsoSetAsDatabaseOwner: Флаг назначения владельца. Тип bool. Задать true, если требуется сделать сеть networkId "физическим" владельцем этого действия в базе данных. В противном случае передать false.

Teigha.DatabaseServices.AssocAction.SetStatus(Teigha.DatabaseServices.AssocStatus,System.Boolean,System.Boolean)
Метод устанавливает для данного действия требуемый статус из перечисления AssocStatus.
Метод устанавливает для данного действия статус newStatus из перечисления AssocStatus.
Если новый статус таков, что предикат IsEvaluationRequest() возвращает для него значение true, т.е. действие нуждается в вычислении, но текущий статус действия перевычисления не предполагает, метод распространяет новый статус до сети-владельца AssocNetwork и по цепочке владения до всех вышестоящих сетей в сетевой иерархии с тем, чтобы все сети-владельцы знали, что они содержат действие, которое требует вычисления.
Если новый статус требует перевычисления (т.е. IsEvaluationRequest() возвращает true), а метод EvaluationRequestSeverityLevel() для нового статуса дает уровень ниже текущей оценки необходимости перевычисления действия, то текущий более высокий статус действия сохраняется без изменений и не заменяется более низким новым статусом.
Кроме того, если текущий статус действия IsToBeSkipped(), он не перезаписывается никаким новым статусом IsEvaluationRequest().
Чтобы в такой ситуации изменить статус действия, статус следует сначала изменить на IsUpToDateAssocStatus, а уже после этого изменить на статус IsEvaluationRequest().
newStatus: Новый статус действия из перечисления AssocStatus.
notifyOwningNetwork: Если задано true, и переданный статус newStatus указывает, что действие необходимо вычислить, статус сети AssocNetwork, владельца этой зависимости, устанавливается в тот же статус (если только статус вычисления сети уже не является более высоким, чем новый).  Тип bool.
setInOwnedActions: Флаг настройки статусов в принадлежащих действиях. Тип bool. Если задано true, и этому действию принадлежат некоторые другие действия, статус устанавливается и во всех действиях, принадлежащих данному действию как напрямую, так и рекурсивно.

Teigha.DatabaseServices.AssocAction.TransformActionBy(Teigha.Geometry.Matrix3d)
Метод позволяет уведомить данное действие о том, что владелец действия был подвергнут геометрическому преобразованию.
Метод уведомляет данное действие о том, что владелец действия был подвергнут геометрическому преобразованию.  Например, были преобразованы все объекты в записи BlockTableRecord, владеющей сетью, которой принадлежит данное действие.
transform: Входная матрица геометрического преобразования. Тип Teigha.Geometry.Matrix3d.

Teigha.DatabaseServices.AssocAction.ActionBody
Свойство позволяет получить или задать ObjectId тела данного действия.
Свойство позволяет получить или задать ObjectId объекта класса, производного от AssocActionBody, или значение null, если объект тела действия не задан.
Объект AssocActionBody принадлежит данному объекту AssocAction и реализует тело пользовательского действия.
Дополнительную информацию см. в описании класса AssocActionBody.
Returns: Возвращает идентификатор тела ассоциативного действия. Тип Teigha.DatabaseServices.ObjectId

Teigha.DatabaseServices.AssocAction.IsActionBodyAProxy
Свойство позволяет проверить, не является ли тело действия прокси-объектом.
Свойство позволяет проверить, не является ли тело действия прокси-объектом.
Returns: Возвращает true, если тело действия является прокси-объектом. В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsActionEvaluationInProgress
Свойство позволяет проверить, не находится ли система в данный момент в процессе вычисления данного действия или сети действий.
Свойство позволяет проверить, не находится ли система в данный момент в процессе вычисления данного действия или сети действий.
Следует отметить, что во время вычисления действия уведомления у зависимостей отключаются. Когда объект, к которому зависимости прикреплены, изменяется, зависимости игнорируют это уведомление и в свою очередь также не уведомляют действия, владеющие зависимостями. Это необходимо, поскольку в противном случае возникают риски зацикливания.  Так, если вычисление одного действия изменит некоторые объекты, зависимости от этих объектов получат соответствующие уведомления, будет изменен статус других действий, владеющих этими зависимостями, что повлечет за собой запросы на повторное вычисление действий. Это приведет к бесконечным циклам.
Returns: Возвращает true, если система в данный момент находится в процессе вычисления данного действия.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.OwningNetwork
Свойство позволяет получить ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей.
Свойство позволяет получить ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей.
Каждое действие, за исключением самой верхней сети AssocNetwork, «логически» принадлежит единственной сети AssocNetwork.
Эта сеть может быть «физическим» владельцем действия в базе данных (такая сеть имеет идентификатор жесткого владения действием), но «физическим» владельцем может быть и какой-либо иной объект.
Например, для сетей, подключенных к BlockTableRecords, «логическим» владельцем является сеть верхнего уровня всей базы данных, но «физическим» владельцем в базе данных является подсловарь словаря расширения AcBdBlockTableRecord.
Returns: Возвращает ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей.  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocAction.Status
Свойство позволяет получить или установить текущий статус AssocStatus данного действия.
Свойство позволяет получить или установить текущий статус AssocStatus данного действия.
Returns: Возвращает текущий статус данного действия.  Тип AssocStatus.