Teigha.DatabaseServices.FlowDirection
Данное перечисление определяет направление, в котором текстовая строка следует от начала к своему концу.
Данное перечисление определяет направление, в котором текстовая строка следует от начала к своему концу.