Teigha.DatabaseServices.CellMargins
Данное перечисление определяет типы полей у ячеек в таблицах.
Данное перечисление определяет типы полей у ячеек в таблицах.
Поля задают расстояния между границами и содержимым ячейки слева, справа, сверху и снизу.