HostMgd.PlottingServices.MatchingPolicy
Данное перечисление определяет поддерживаемые классом PlotInfoValidator
политики сопоставления медиа-данных при слиянии настроек, относящихся к печати.
Перечисление MatchingPolicy определяет поддерживаемые классом PlotInfoValidator
политики сопоставления медиа-данных при слиянии настроек, относящихся к печати.