Teigha.DatabaseServices.HyperLinkCollection
Класс HyperlinkCollection представляет собой коллекцию объектов Hyperlink.
Класс HyperlinkCollection представляет собой коллекцию объектов Hyperlink.
Индексация гиперссылок в коллекции начинается с 0.

Teigha.DatabaseServices.HyperLinkCollection.Add(Teigha.DatabaseServices.HyperLink)
Метод позволяет добавить в данную коллекцию указанный объект HyperLink.
Метод позволяет добавить в данную коллекцию указанный объект HyperLink.
value: Добавляемая гиперссылка. Тип HyperLink.
Returns: Возвращает текущее количество объектов в коллекции после добавления гиперссылки value.  Тип int.

Teigha.DatabaseServices.HyperLinkCollection.Contains(Teigha.DatabaseServices.HyperLink)
Метод позволяет проверить, содержит ли эта коллекция гиперссылку, соответствующую указанному объекту HyperLink.
Метод позволяет проверить, содержит ли эта коллекция гиперссылку, соответствующую указанному объекту HyperLink.
value: Проверяемая гиперссылка.  Тип HyperLink.
Returns: Возвращает true, если в коллекции уже содержится указанный объект value.
В противном случае возвращает false.

Teigha.DatabaseServices.HyperLinkCollection.CopyTo(array,System.Int32)
Метод предназначен для копирования этой коллекции в указанный массив по указанному индексу.
Метод предназначен для копирования этой коллекции в массив arr по указанному индексу index.
arr: Массив, в который копируется данная коллекция. Тип HyperLink[].
index: Индекс массива, начиная с которого в массиве сохраняются элементы коллекции. Тип int.

Teigha.DatabaseServices.HyperLinkCollection.IndexOf(Teigha.DatabaseServices.HyperLink)
Метод позволяет получить индекс объекта HyperLink в этой коллекции, соответствующий указанной гиперссылке.
Метод позволяет получить индекс объекта HyperLink в этой коллекции, соответствующий указанной гиперссылке value.
value: Гиперссылка, для которой вычисляется индекс в данной коллекции. Тип HyperLink.
Returns: Возвращает индекс указанного объекта HyperLink в этой коллекции. Тип int.

Teigha.DatabaseServices.HyperLinkCollection.Insert(System.Int32,Teigha.DatabaseServices.HyperLink)
Метод позволяет вставить указанную гиперссылку HyperLink в эту коллекцию по указанному индексу.
Метод позволяет вставить указанную гиперссылку HyperLink в эту коллекцию в позицию с индексом index.
index: Индекс в коллекции, по которому выполняется вставка нового элемента. Тип int.
value: Вставляемый элемент. Тип HyperLink.

Teigha.DatabaseServices.HyperLinkCollection.Remove(Teigha.DatabaseServices.HyperLink)
Метод предназначен для удаления из коллекции гиперссылки, соответствующей указанному объекту HyperLink.
Метод предназначен для удаления из коллекции гиперссылки, соответствующей указанному объекту HyperLink.
value: Удаляемая из коллекции гиперссылка. Тип HyperLink.

Teigha.DatabaseServices.HyperLinkCollection.RemoveAt(System.Int32)
Метод позволяет удалить из коллекции объект HyperLink с указанным индексом.
Метод позволяет удалить из коллекции объект HyperLink с указанным индексом index.
index: Индекс удаляемого из коллекции объекта. Тип int.

Teigha.DatabaseServices.HyperLinkCollection.Count
Свойство возвращает текущее количество элементов в данной коллекции.
Свойство возвращает текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции. Тип int.

Teigha.DatabaseServices.HyperLinkCollection.Item
Свойство предоставляет доступ к элементу коллекции с указанным индексом.
Свойство предоставляет доступ к элементу коллекции с указанным индексом index.
index: Индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции с индексом index.  Тип HyperLink.