HostMgd.EditorInput.Editor.PromptedForCorner
Событие возникает после завершения операции ввода точки,
используемой как угол прямоугольной области.
Событие не реализовано.
Событие вызывается в .NET API nanoCAD при завершении интерактивного ввода угла (точки),
который обычно используется для задания прямоугольной области — например,
при работе с командами, требующими указания двух противоположных углов.
Оно позволяет разработчику получить доступ к результату ввода,
обработать координаты точки или выполнить дополнительные действия
на основе введённых данных.
Событие реализуется через делегат PromptPointResultEventHandler,
который передаёт объект PromptPointResultEventArgs,
содержащий статус операции и значение точки (Point3d)
в мировых координатах.
Example
C#