Teigha.DatabaseServices.DynamicDimensionData
Класс DynamicDimensionData поддерживает динамические размеры для производных от Entity объектов.
Класс DynamicDimensionData поддерживает динамические размеры для производных от Entity объектов.
Динамические размеры — это временные объекты размеров, которые можно вызывать и отображать при создании новых объектов базы данных или резидентных объектов базы данных с функционалом редактирования посредством ручек.

Teigha.DatabaseServices.DynamicDimensionData.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DynamicDimensionData.#ctor(Teigha.DatabaseServices.Dimension)
Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
dimension: Входной размер, на основе которого создается динамический размер. Тип Dimension.

Teigha.DatabaseServices.DynamicDimensionData.#ctor(Teigha.DatabaseServices.Dimension,System.Boolean)
Конструктор класса DynamicDimensionData.
Создает динамический размер на основе данных указанного объекта Dimension.
Дополнительный аргумент позволяет включить или отключить возможность редактирования динамического размера.
Конструктор класса DynamicDimensionData.
Создает динамический размер на основе данных указанного объекта Dimension.
Дополнительный аргумент позволяет включить или отключить возможность редактирования динамического размера..
dimension: Входной размер, на основе которого создается динамический размер. Тип Dimension.
editable: Флаг, который определяет, является ли создаваемый динамический размер редактируемым. Тип bool.

Teigha.DatabaseServices.DynamicDimensionData.#ctor(Teigha.DatabaseServices.Dimension,System.Boolean,System.Boolean)
Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
Дополнительные аргументы позволяют настроить возможность редактирования и видимость динамического размера.
Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
Дополнительные аргументы позволяют настроить возможность редактирования и видимость динамического размера.
dimension: Входной размер, на основе которого создается динамический размер. Тип Dimension.
editable: Флаг, который определяет, является ли создаваемый динамический размер редактируемым. Тип bool.
hideIfValueIsZero: Флаг, который определяет, следует ли скрывать создаваемый динамический размер в случае нулевого значения. Тип bool.

Teigha.DatabaseServices.DynamicDimensionData.Create(IntPtr,System.Boolean)
Метод позволяет создать новый объект DynamicDimensionData на основе переданного в метод указателя.
Метод позволяет создать новый объект DynamicDimensionData на основе переданного в метод указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый экземпляр класса DynamicDimensionData.

Teigha.DatabaseServices.DynamicDimensionData.ApplicationData
Свойство ApplicationData обеспечивает доступ к данным приложения, связанным с этим объектом.
Свойство ApplicationData обеспечивает доступ к данным приложения, связанным с этим объектом.
Returns: Возвращает данные приложения, связанные с динамическим размером. Тип Object.

Teigha.DatabaseServices.DynamicDimensionData.Dimension
Свойство Dimension обеспечивает доступ объекту Dimension этого динамического размера.
Свойство Dimension обеспечивает доступ на изменение к объекту Dimension этого динамического размера.
Returns: Возвращает объект размера. Тип Dimension.

Teigha.DatabaseServices.DynamicDimensionData.Editable
Свойство Editable позволяет определить, доступен ли для редактирования этот динамический размер.
Свойство Editable позволяет определить, доступен ли для редактирования этот динамический размер.
Returns: Возвращает true, если динамический размер доступен для редактирования.
В противном случае возвращает false.

Teigha.DatabaseServices.DynamicDimensionData.Focal
Свойство Focal позволяет определить, находится ли в фокусе данный динамический размер.
Свойство Focal позволяет определить, находится ли в фокусе данный динамический размер.
Returns: Возвращает true, если этот динамический размер в фокусе.
В противном случае возвращает false.

Teigha.DatabaseServices.DynamicDimensionData.HideIfValueIsZero
Свойство HideIfValueIsZero определяет, следует ли скрывать этот размер в случае нулевого значения.
Свойство HideIfValueIsZero определяет, следует ли скрывать этот размер в случае нулевого значения.
Returns: Возвращает true, если динамичекий размер должен скрываться при нулевом значении.
В противном случае возвращает false.

Teigha.DatabaseServices.DynamicDimensionData.Visible
Свойство Visible предоставляет возможность управлять видимостью динамического размера.
Свойство Visible предоставляет возможность управлять видимостью динамического размера.
Returns: Возвращает true, если динамический размер является видимым.
В противном случае возвращает false.