Teigha.DatabaseServices.DbDictionaryEnumerator.MoveNext
Метод выполняет переход перечислителя к следующей записи в коллекции, в случае успеха возвращает true.
Метод пытается осуществить переход перечислителя к следующей записи в коллекции.
Возвращает логическое значение в зависимости от успеха этой операции.
Returns: Возвращает true, если запись найдена. В противном случае возвращает false.