HostMgd.ApplicationServices.XrefFileLock
.NET класс, соответствующий классу NcEdXrefFileLock nanoCAD API.

HostMgd.ApplicationServices.XrefFileLock.ConsistencyCheck(Teigha.DatabaseServices.ObjectId)
По выбранному ID записи таблицы блоков для внешней ссылки
этот метод определяет, является ли файл внешней ссылки все
еще синхронизованым с тем файлом, который использовался во
время загрузки чертежа. Он также определяет, являются ли
любые другие записи таблицы блоков, относящиеся к тому же
самому файлу внешней ссылки, также синхронизированными. Эта
проверка выполняется путем проверки даты/времени файла
внешней ссылки и его размера во время загрузки по сравнению с
этими же его характеристиками, актуальными во время
выполнения метода. Если внешняя ссылка не синхронизирована,
то все ID записей таблицы блоков, которые относятся к файлу
внешней ссылки, возвращаются.
selectedBlockId: ID записей таблицы блоков, которые

HostMgd.ApplicationServices.XrefFileLock.GetXloadCtlType(Teigha.DatabaseServices.ObjectId)
Метод возвращает значение системной переменной XLOADCTL для
текущего заблокированного объекта. Метод xloadctlType()
работает в реальном времени (определяет ID внешней ссылки,
когда метод выполняется) и не влияет на текущее значение
режима блокировки объекта.
selectedBlockId: Выбранный ID записи таблицы блоков

HostMgd.ApplicationServices.XrefFileLock.LockFile(Teigha.DatabaseServices.ObjectId)
Файл внешней ссылки по заданному ID записи таблицы блоков
становится блокированным в режиме на монопольную запись.
Всем, обращающиеся к файлу на чтение, чтение разрешено, но
получение данных не гарантировано. Если файл внешней ссылки
имеет значение системной переменной XLOADCTL, установленное в
1 (потребуется загрузка), то текущее значение этой переменой
меняется на 0 (полностью загружен) или 2 (копия). Это
позволяет файлу внешней ссылки быть заблокированным при
блокировке объекта. При реализации посредством метода
ReleaseFile(), значение переменной XLOADCTL для ссылки этого
блока сохраняется (либо 0, либо 2).
selectedBlockId: ID записи таблицы блоков

HostMgd.ApplicationServices.XrefFileLock.OutOfSyncBlockIds
Возвращает коллекцию ID рассинхронизированных записей таблицы
блоков. Одно из возможных применений этой коллекции
заключается в выделении тех элементов, к которым должны быть
применены сделанные изменения.

HostMgd.ApplicationServices.XrefFileLock.ReloadFile(Teigha.DatabaseServices.ObjectIdCollection)
Перезагрузка соответствующего файла (ов) внешней ссылки по
списку ID записей таблицы блоков (рассинхронизированных) для
текущего чертежа. После этого (т.е. после перезагрузки самих
файлов внешних ссылок) файлы внешних ссылок будут снова
синхронизированы для всех внешних ссылок.
blocks: Список ID

HostMgd.ApplicationServices.XrefFileLock.ReloadFile(Teigha.DatabaseServices.ObjectIdCollection,System.Int32)
Перезагрузка соответствующего файла (ов) по внешней ссылке по
списку ID записей таблицы блоков (рассинхронизированных) для
текущего чертежа. После этого (т.е. после перезагрузки самих
файлов внешних ссылок) файлы внешних ссылок будут снова
синхронизированы для всех внешних ссылок.
Параметр xldCtlType разрешает установить системную переменую
XLOADCTL для задания режима перезагрузки. Если этот параметр
не указан, то используется значение по умолчанию переменной
XLOADCTL.
Этот вариант метода использует внутренний список ID
рассинхронизированных записей.
В настоящее время системная переменная XLOADCTL отсутствует в
nanoCAD.
blocks: Список ID
xldCtlType: Разрешение установки системной переменой

HostMgd.ApplicationServices.XrefFileLock.ReloadFile(System.Int32)
Перезагрузка соответствующего файла (ов) по внешней ссылке по
списку ID записей таблицы блоков (рассинхронизированных) для
текущего чертежа. После этого (т.е. после перезагрузки самих
файлов внешних ссылок) файлы внешних ссылок будут снова
синхронизированы для всех внешних ссылок.
Параметр xldCtlType разрешает установить системную переменую
XLOADCTL для задания режима перезагрузки. Если этот параметр
не указан, то используется значение по умолчанию переменной
XLOADCTL.
В настоящее время системная переменная XLOADCTL отсутствует в
nanoCAD.
xldCtlType: Список ID

HostMgd.ApplicationServices.XrefFileLock.XloadCtlType
Возвращает системную переменную XLOADCTL типа/режима файла
внешней ссылки, относящегося к текущему ID записи таблицы
блоков.