Teigha.DatabaseServices.MTextFragment
Этот класс описывает фрагмент текста, создаваемый методом MText.ExplodeFragments().
Этот класс описывает фрагмент текста, создаваемый методом MText.ExplodeFragments().
Каждый такой фрагмент представляет собой часть текста с уникальным сочетанием информации о стиле (шрифт, размер, цвет и т.д.).

Teigha.DatabaseServices.MTextFragment.BigFont
Свойство возвращает имя большого шрифта SHX.
Свойство возвращает имя большого шрифта SHX.
Returns: Возвращает имя большого шрифта. Тип String.

Teigha.DatabaseServices.MTextFragment.Bold
Свойство позволяет проверить, представлен ли текст полужирным шрифтом.
Свойство позволяет проверить, представлен ли текст полужирным шрифтом.
Returns: Возвращает true, если текст представлен полужирным шрифтом.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.CapsHeight
Свойство возвращает высоту текста.
Свойство возвращает высоту текста.
Returns: Возвращает высоту текста. Тип double.

Teigha.DatabaseServices.MTextFragment.Color
Свойство возвращает цвет текста.
Свойство возвращает цвет текста.
Returns: Возвращает цвет текста. Тип Colors.EntityColor.

Teigha.DatabaseServices.MTextFragment.Direction
Свойство возвращает направление оси X текста.
Свойство возвращает направление оси X текста.
Returns: Возвращает направление оси X текста.
Тип Vector3d.

Teigha.DatabaseServices.MTextFragment.Extents
Свойство возвращает ограничивающий (габаритный) бокс данного объекта в системе координат объекта (OCS).
Свойство возвращает ограничивающий (габаритный) бокс данного объекта в системе координат объекта (OCS).
Координаты X и Y соответствуют ширине и высоте текста, соответственно.
Returns: Возвращает размеры двумерного ограничивающего бокса в системе координат объекта (OCS).
Тип Point2d.

Teigha.DatabaseServices.MTextFragment.Italic
Свойство позволяет проверить, представлен ли текст наклонным шрифтом.
Свойство позволяет проверить, представлен ли текст наклонным шрифтом (italic).
Returns: Возвращает true, если текст представлен наклонным шрифтом.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.LineBreak
Свойство позволяет проверить, завершается ли данный фрагмент символом разрыва строки.
Свойство позволяет проверить, завершается ли данный фрагмент символом разрыва строки.
Returns: Возвращает true, если фрагмент завершается разрывом строки.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.Location
Свойство возвращает точку вставки текста.
Свойство возвращает точку вставки текста.
Returns: Возвращает точку вставки текста. Тип Point3d.

Teigha.DatabaseServices.MTextFragment.NewParagraph
Свойство позволяет проверить, является ли данный фрагмент началом нового абзаца текста.
Свойство позволяет проверить, является ли данный фрагмент началом нового абзаца текста.
Returns: Возвращает true, если данный фрагмент представляет начало нового абзаца текста.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.Normal
Свойство представляет вектор нормали плоскости, в которой располагается данный объект.
Свойство представляет вектор нормали плоскости, в которой располагается данный объект.
Returns: Возвращает вектор нормали плоскости объекта.  Тип Vector3d.

Teigha.DatabaseServices.MTextFragment.ObliqueAngle
Свойство возвращает угол наклона текста.
Свойство возвращает угол наклона текста.
Returns: Возвращает угол наклона текста (в радианах).  Тип double.

Teigha.DatabaseServices.MTextFragment.Overlined
Свойство позволяет проверить, является ли текст надчёркнутым.
Свойство позволяет проверить, является ли текст надчёркнутым.
Returns: Возвращает true, если текст является надчёркнутым.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.ShxFont
Свойство возвращает имя шрифта SHX.
Свойство возвращает имя шрифта SHX.
Returns: Возвращает имя шрифта SHX. Тип String.

Teigha.DatabaseServices.MTextFragment.StackBottom
Свойство позволяет проверить, представляет ли данный фрагмент знаменатель дробного текста.
Свойство позволяет проверить, представляет ли данный фрагмент знаменатель дробного текста.
Returns: Возвращает true, если данный фрагмент представляет знаменатель дробного текста.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.StackTop
Свойство позволяет проверить, представляет ли данный фрагмент числитель дробного текста.
Свойство позволяет проверить, представляет ли данный фрагмент числитель дробного текста.
Returns: Возвращает true, если данный фрагмент представляет числитель дробного текста.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.Text
Свойство возвращает текст данного фрагмента в виде строки, очищенной от кодов форматирования.
Свойство возвращает текст данного фрагмента в виде строки, очищенной от кодов форматирования.
Returns: Возвращает строку текста данного фрагмента.
Тип String.

Teigha.DatabaseServices.MTextFragment.TrackingFactor
Свойство возвращает коэффициент трекинга в данном фрагменте.
Свойство возвращает коэффициент трекинга в данном фрагменте.
Этот безразмерный коэффициент отражает изменение межбуквенного расстояния.
Returns: Возвращает коэффициент трекинга. Тип double.

Teigha.DatabaseServices.MTextFragment.TrueTypeFont
Свойство представляет имя шрифта TrueType.
Свойство представляет имя шрифта TrueType.
Returns: Возвращает имя шрифта TrueType.
Тип String.

Teigha.DatabaseServices.MTextFragment.Underlined
Свойство позволяет проверить, является ли текст фрагмента подчёркнутым.
Свойство позволяет проверить, является ли текст фрагмента подчёркнутым.
Returns: Возвращает true, если данный фрагмент представляет подчёркнутый текст.
В противном случае возвращает false.

Teigha.DatabaseServices.MTextFragment.WidthFactor
Свойство представляет коэффициент растяжения символов текста.
Свойство представляет коэффициент растяжения символов текста.
Нормальной ширине символов шрифта соответствует значение 1,0.
Значение 2,0 означает, что символы растянуты по ширине вдвое.
Returns: Возвращает коэффициент растяжения символов текста.
Тип double.