Teigha.DatabaseServices.DimAssocPointType
Перечисление DimAssocPointType определяет типы опорных точек ассоциативных размеров.
Перечисление DimAssocPointType определяет типы опорных точек ассоциативных размеров.