HostMgd.EditorInput.ObjectSnapMasks.Immediate
Значение: 65536 (0x10000).
Флаг немедленной объектной привязки.
Точка привязки устанавливается непосредственно в позицию курсора без применения каких-либо дополнительных режимов привязки (например, OSNAP, сетка или полярное отслеживание).