Teigha.BoundaryRepresentation.Exception
Класс Exception представляет контейнер для ошибок BREP.
Класс Exception представляет контейнер для ошибок BREP.

Teigha.BoundaryRepresentation.Exception.#ctor
Конструктор по умолчанию класса Exception.
Конструктор по умолчанию класса Exception.

Teigha.BoundaryRepresentation.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus)
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки.
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки.
es: Входной статус ошибки.  Тип BoundaryRepresentation.ErrorStatus.

Teigha.BoundaryRepresentation.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String)
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки и с указанным сообщением.
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки и с указанным сообщением.
es: Входной статус ошибки.  Тип BoundaryRepresentation.ErrorStatus.
message: Входное сообщение об ошибке. Тип String.

Teigha.BoundaryRepresentation.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String,Teigha.BoundaryRepresentation.Exception)
Конструктор класса Exception.
Создает экземпляр класса с указанными статусом ошибки, сообщением об ошибке и с внутренним исключением.
Конструктор класса Exception.
Создает экземпляр класса с указанными статусом ошибки, сообщением об ошибке и с внутренним исключением.
es: Входной статус ошибки.         Тип BoundaryRepresentation.ErrorStatus.
message: Входное сообщение об ошибке.   Тип String.
innerException: Входное внутреннее исключение. Тип Exception.

Teigha.BoundaryRepresentation.Exception.#ctor(SerializationInfo,StreamingContext)
Конструктор класса Exception. Создает исключение, используя указанную информацию о сериализации и потоковом контексте.
Конструктор класса Exception. Создает исключение, используя указанную информацию о сериализации и потоковом контексте.
info: Входные данные, необходимые для сериализации/десериализации объекта.  Тип SerializationInfo.
context: Входной контекст сериализованного потока.  Тип StreamingContext.

Teigha.BoundaryRepresentation.Exception.GetObjectData(SerializationInfo,StreamingContext)
Данный метод вызывает версию своего суперкласса, а затем добавляет статус ошибки во входной объект SerializationInfo.
Данный метод вызывает версию своего суперкласса , а затем добавляет значение с именем AcadErrorStatus к данным в параметре info.
info: Входные данные, необходимые для сериализации/десериализации объекта.  Тип SerializationInfo.
context: Входной контекст сериализованного потока.  Тип StreamingContext.

Teigha.BoundaryRepresentation.Exception.ErrorStatus
Свойство ErrorStatus предоставляет доступ к статусу ошибки.
Свойство ErrorStatus предоставляет доступ к статусу ошибки.
Returns: Возвращает статус ошибки BREP.  Тип BoundaryRepresentation.ErrorStatus.