HostMgd.EditorInput.PromptDoubleResult.ToString
Метод возвращает строковое представление вещественного числа,
введённого пользователем в ходе интерактивной операции.
Метод переопределяет стандартный метод Object.ToString()
и предоставляет строковое значение результата ввода угла или расстояния,
полученного от пользователя через такие команды, как GetAngle() или GetDistance().
Он используется для удобного отображения или логгирования введённого значения,
включая его форматированное представление в зависимости от контекста операции.
Returns: Возвращает значение типа string, представляющее собой текстовое отображение
введённого пользователем вещественного числа (например, "45.0" или "3.14159").
Если значение не было введено или операция была отменена, может вернуть пустую строку
или строку с информацией о статусе операции.
Example
C#