HostMgd.ApplicationServices.CheckingOutEventHandler
Делегат CheckingOutEventHandler определяет тип, используемый для обработки события LongTransactionManager.CheckingOut.
Делегат CheckingOutEventHandler определяет тип, используемый для обработки события LongTransactionManager.CheckingOut.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип CheckingOutEventArgs.