Teigha.DatabaseServices.RasterImageDef
Класс является неграфической частью объекта "изображение" на чертеже.
Объект RasterImageDef (или "объект - определение
изображения"), работает вместе с геометрическим объектом
RasterImage (или "объект - изображение") для использования
растровых изображений внутри nanoCAD. Отношение между двумя
этими классами наиболее похоже на отношение между
определением блока nanoCAD и геометрическим объектом,
вставленным в блок.
Объект - определение изображения играет "закулисную" роль
определения блока, управляет связями с исходным изображением
и управляет операциями низкого уровня с изображением,
требуемыми для отображения и прорисовки изображения.
Объекты - определение изображения хранятся в специальном
словаре nanoCAD с именем ISM_RASTER_IMAGE_DICT. Они не
являются геометрическими объектами nanoCAD, поэтому они не
могут отображаться или выбираться конечными пользователями.
Они понимают только 2D координаты, поэтому все запросы на
обработку изображений отображаются как 2D операции.
Операции обработки изображений, так же как масштабирование и
поворот изображений при отображении, выполняются специальной
компонентой nanoCAD (OdGiRasterImage). Эта компонента имеет
свое собственное API , в котором могут быть реализованы
сложные приложения редактирования изображений.

Teigha.DatabaseServices.RasterImageDef.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.RasterImageDef.CreateImageDictionary(DatabaseServices.Database)
Вызов данного метода предназначен для создания нового словаря
изображения, если метод RasterImageDef.GetImageDictionary
возвращает 0, что означает, что не существует словаря
изображений.
database: База данных, в которой должен быть создан словарь

Teigha.DatabaseServices.RasterImageDef.GetEntityCount([Out]bool%)
Возвращает количество геометрических объектов RasterImage в
текущем чертеже, которые зависят от данного объекта для
отображения графики. Если параметр locked не нулевой, то
данная функция возвратит true, если любой зависимый
геометрический объект размещен на заблокированных слоях.
locked: Величина для проверки блокировки

Teigha.DatabaseServices.RasterImageDef.GetImageDictionary(DatabaseServices.Database)
Возвращает Id словаря изображений для в указанной базе данных
чертежа или 0, если словарь изображений в базе данных не
найден.
database: База данных, в которой надо найти словарь

Teigha.DatabaseServices.RasterImageDef.ImageCopy(System.Boolean)
Создает копию данных чертежа и возвращает указатель на нее.
forceImageLoad: Признак, указывающий, нужно ли загрузить

Teigha.DatabaseServices.RasterImageDef.SetImage(IntPtr,IntPtr,System.Boolean)
Прямо устанавливает, что будет использоваться объект в
памяти OdGiRasterImage
Этот метод предназначен для разработчиков приложений
редактирования растрового изображения.
Статус loaded должен быть установлен в false при вызове
метода. Он может быть создан для создания объекта
RasterImageDef вместо вызова ActiveFileName.
Если image не null и является корректным, статус loaded будет
установлен в true. В противном случае, статус loaded будет
установлен в false.
Если modifyDatabase равен true, запись в буфер Undo будет
производиться для изменений, сделанных в объекте
RasterImageDef.
Используйте механизм ImageModified и RasterImageDefReactor
для уведомления о попытках удаления изображения.
image: указатель на корректный объект
fileDescription: null
modifyDatabase: Признак того, должна ли производиться

Teigha.DatabaseServices.RasterImageDef.SuggestName(Teigha.DatabaseServices.DBDictionary,String)
Преобразует исходное имя файла изображения в строку,
максимально подобную имени файла, но подходящую для
использования в каталоге изображений.
Возвращает строку с уникальным именем, подходящем для
использования в каталоге изображений.
imageDictionary: Указатель на (ранее открытый на чтение)
newImagePathName: Указатель на строку, содержащую исходное

Teigha.DatabaseServices.RasterImageDef.Unload(System.Boolean)
Немедленно выгружает данные изображения в RasImageDef из
рабочей памяти, но не уничтожает собственно RasImageDef.
Посылаются уведомления, которые вызывают перерисовку для всех
зависимых геометрических объектов RasterImage. Метод требует,
чтобы RasImageDef был открыт на запись.
Если modifyDatabase равен true, то все изменения, сделанные с
объектом RasImageDef, будут записаны в буфер Undo.
modifyDatabase: Признак, указывающий, нужно ли выполнять

Teigha.DatabaseServices.RasterImageDef.ResolutionMMPerPixel
Устанавливает или возвращает физический размер одной точки
изображения в миллиметрах. Если изображение не имеет
разрешения по умолчанию, то функция возвращает высоту и
ширину пикселя, равными 1/(ширину изображения в пикселях).

Teigha.DatabaseServices.RasterImageDef.ResolutionUnits
Устанавливает или возвращает единицы, в которых определено
разрешение изображения в исходном файле изображения. Если
файл изображения не содержит информации о разрешении, то
возвращается значение None.

Teigha.DatabaseServices.RasterImageDef.ActiveFileName
Обеспечивает доступ к пути реального файла, который будет
использоваться для определения изображения. Требует, чтобы
RasterImageDef был открыт на чтение.

Teigha.DatabaseServices.RasterImageDef.ColorDepth
Возвращает количество битов на точку при отображении исходных
данных изображения. Возможные значения 1, 8, 24, 32.

Teigha.DatabaseServices.RasterImageDef.FileDescCopy
Возвращает копию объекта OdGiRasterImage.FileReadDescriptor.
Если объект не имеет корректного значения
OdGiRasterImage.FileReadDescriptor, то возвращается null.

Teigha.DatabaseServices.RasterImageDef.FileType
Возвращает тип файла изображения, такой как BMP для точечного
изображения.

Teigha.DatabaseServices.RasterImageDef.ImageModified
Обеспечивает доступ к внутреннему признаку изменения данных
изображения, который устанавливается в true, если данные были
изменены.

Teigha.DatabaseServices.RasterImageDef.IsEmbedded
Возвращает true, если изображение встроено в файл чертежа.

Teigha.DatabaseServices.RasterImageDef.IsLoaded
Возвращает true, если изображение загружено. Заметим, что при
"ленивой" загрузке изображение физически может и не
находиться в памяти, даже хотя данное свойство возвращает
true.

Teigha.DatabaseServices.RasterImageDef.Organization
Возвращает схема организации точек исходного файла
изображения. Для того чтобы свойство работало правильно,
требуется, чтобы файл был загружен. Если файл не загружен,
возвращается значение RGBA.

Teigha.DatabaseServices.RasterImageDef.SearchForActivePath
Свойство осуществляет поиск на локальных устройствах и в сети
корректного файла изображения, который соответствует имени
исходного файла, который был сохранен в файле чертежа. Этот
механизм позволяет файлам изображений размещаться отдельно на
рабочей станции, которая используется для редактирования или
просмотра файла чертежа. Пользователь может установить пути
поиска файлов в проекте, которые содержат каталоги, в которых
могут располагаться файлы изображений и внешних ссылок.
Поиск корректных файлов изображений производится в
определенном порядке. Сначала, исходное имя файла (путь
устанавливается с помощью SourceFileName и сохраняется в
чертеже) проверяется, как оно есть. Если файл не найден, то
имя файла выделяется из пути.

Teigha.DatabaseServices.RasterImageDef.Size
Возвращает количество битов, занимаемых точкой исходного
изображения. Допустимые значения — 1,8,24,32.

Teigha.DatabaseServices.RasterImageDef.SourceFileName
Обеспечивает доступ к пути имени файла изображения, который
расположен отдельно. Это имя файла сохраняется в файле формата .dwg.
Требует, чтобы объект RasterImageDef был открыт на
чтение.