HostMgd.ApplicationServices.InplaceTextEditor.ImportTextDialog
Метод вызывает диалог импорта текста.
В текущей версии не реализован.
Метод вызывает диалог импорта текста.
В текущей версии не реализован.