HostMgd.EditorInput.PromptOptions
Базовый класс, предназначенный для хранения набора параметров,
необходимых для запроса данных у пользователя.
Абстрактный класс, предназначенный для для хранения набора параметров, необходимых для запроса данных у пользователя.
Является базовым классом для класса .
Класс предоставляет возможность установить для запроса приглашающее сообщение, ключевые слова,
значение по умолчанию и признак его использования.

HostMgd.EditorInput.PromptOptions.SetMessageAndKeywords(String,String)
Метод предназначен для обработки приглащающего сообщения с ключевыми словами и набора глобальных ключевых слов.
Метод обрабатывает полученные строки messageAndKeywords и globalKeywords
как массив символов, выделяя из строки messageAndKeywords вида "message [key0/key1/key3]"
приглашающее сообщение message, записывая его в свойство класса Message, и ключевые слова key0/key1/key3,
преобразовывая их в тип данных  и записывая в свойство класса Keywords
вместе с глобальными ключевыми словами из строки globalKeywords вида "globalKey0 globalKey1 globalKey2".
Каждое ключевое слово в строке messageAndKeywords должно соответствовать глобальному
ключевому слову в строке globalKeywords на той же позиции.
Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с
количеством ключевых слов, то возникает событие System.ArgumentException.
messageAndKeywords: Cтрока, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе данных.
Набор отображаемых ключевых слов строки messageAndKeywords" должен быть заключен в скобки: "[" в начале и "]" в конце.