Teigha.DatabaseServices.ParseOption.PreserveMtextFormat
Значение: 2.
Формат MText в текущей строке формата сохраняется без изменений, если формат анализируемого текста отличается от MText.
Если анализируемый текст имеет формат MText, то его формат переопределит формат MText в текущей строке формата.