Teigha.Geometry.ExternalEntityKind
Перечисление ExternalEntityKind определяет типы внешних графических объектов, доступ к которым поддерживается интерфейсом графической системы платформы.
Перечисление ExternalEntityKind определяет типы внешних графических объектов, доступ к которым поддерживается интерфейсом графической системы платформы.