Teigha.DatabaseServices.DwgFiler.ReadUInt16
Метод предназначен для получения значения UInt16 из текущего элемента данного объекта Filer.
Метод предназначен для получения 16-разрядного целого числа без знака (UInt16) из текущего элемента данного объекта Filer.
Returns: Возвращает значение 16-разрядного целого числа без знака. Тип ushort.