HostMgd.PlottingServices.PlotConfigInfoCollection
Класс PlotConfigInfoCollection представляет коллекцию объектов PlotConfigInfo.
Класс PlotConfigInfoCollection представляет коллекцию объектов PlotConfigInfo.
Элементы этой коллекции содержат основную информацию о конкретных установленных устройствах вывода.

HostMgd.PlottingServices.PlotConfigInfoCollection.#ctor
Конструктор по умолчанию класса PlotConfigInfoCollection.
Конструктор по умолчанию класса PlotConfigInfoCollection.

HostMgd.PlottingServices.PlotConfigInfoCollection.CopyTo(Array,System.Int32)
Метод предназначен для копирования элементов данной коллекции в указанный массив базового типа Array с указанием стартовой позиции в массиве.
Метод предназначен для копирования элементов данной коллекции в массив типа Array, начиная с позиции index в массиве.
a: Целевой массив. Тип Array.
index: Индекс позиции в массиве, начиная с которой в массив копируются элементы коллекции. Тип int. Нумерация индексов начинается с нуля.

HostMgd.PlottingServices.PlotConfigInfoCollection.CopyTo(array,System.Int32)
Метод предназначен для копирования элементов данной коллекции в указанный массив, начиная с заданной позиции в массиве.
Метод предназначен для копирования элементов данной коллекции в массив PlotConfigInfo[], начиная с позиции index в массиве.
array: Целевой массив. Тип HostMgd.PlottingServices.PlotConfigInfo[].
index: Индекс позиции в массиве, начиная с которой в массив копируются элементы коллекции. Тип int. Нумерация индексов начинается с нуля.

HostMgd.PlottingServices.PlotConfigInfoCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет количество элементов, фактически содержащихся в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.