HostMgd.ApplicationServices.UnknownCommandEventArgs
Класс обеспечивает данными событие UnknownCommand класса
Document.

HostMgd.ApplicationServices.UnknownCommandEventArgs.GlobalCommandName
Имя команды, которая привела к возникновению события.