Teigha.GraphicsInterface.TransientManager
Класс TransientManager представляет функционал менеджера временных отображаемых объектов растровой графики.
Класс TransientManager предоставляет функциональность менеджера временных отображаемых объектов растровой графики.
Данный менеджер позволяет управлять временными отображаемыми объектами, обеспечивая поддержку операций их добавления, удаления и обновления.

Teigha.GraphicsInterface.TransientManager.AddChildTransient(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод добавляет дочерний отображаемый объект к указанному родительскому отображаемому объекту.
Метод добавляет дочерний отображаемый объект к указанному родительскому отображаемому объекту.
Notes
Метод не нуждается в указании параметров TransientDrawingMode, subDrawingMode или viewportNumber, поскольку дочерний объект наследует эти свойства у родительского объекта.
added: Входной добавляемый дочерний объект. Тип Drawable.
parent: Входной родительский объект. Тип Drawable.
Returns: Возвращает true в случае успешного завершения метода.
В противном случае возвращает false.

Teigha.GraphicsInterface.TransientManager.AddTransient(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.TransientDrawingMode,System.Int32,Teigha.Geometry.IntegerCollection)
Метод добавляет указанный временный отображаемый объект в список видовых экранов.
Метод добавляет входной временный отображаемый объект added в указанные видовые экраны.
added: Входной добавляемый временный отображаемый объект. Тип Drawable.
mode: Режим отрисовки, в котором будет добавлен временный отображаемый объект. Тип TransientDrawingMode.
subDrawingMode: Входной индекс порядка отрисовки.  Тип int.
viewportNumbers: Входной список номеров видовых экранов, в которые требуется добавить временный отображаемый объект added. Тип IntegerCollection.
Returns: Возвращает true в случае успешного добавления отображаемого объекта added или false в одном из следующих случаев:
* Переданный режим mode больше или равен TransientDrawingMode.Count.
* Указанный индекс порядка отрисовки превышает максимально допустимое значение целого числа со знаком.

Teigha.GraphicsInterface.TransientManager.EraseChildTransient(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод удаляет дочерний временный отображаемый объект из родительского временного объекта.
Метод предназначен для удаления дочернего временного отображаемого объекта из родительского временного объекта.
erased: Удаляемый дочерний объект. Тип Drawable.
parent: Родительский объект. Тип Drawable.
Returns: Возвращает true, если удаление объекта erased из объекта parent завершилось успешно.
В противном случае возвращает false.

Teigha.GraphicsInterface.TransientManager.EraseTransient(Teigha.GraphicsInterface.Drawable,Teigha.Geometry.IntegerCollection)
Метод удаляет временный отображаемый объект в данном менеджере.
Метод удаляет из данного менеджера временный отображаемый объект erased, добавленный ранее методом AddTransient().
Объект erased удаляется из указанного списка видовых экранов.
erased: Входной удаляемый объект. Тип Drawable.
viewportNumbers: Список номеров видовых экранов. Тип IntegerCollection.
Returns: Возвращает true, если удаление завершилось успешно.
В противном случае возвращает false.

Teigha.GraphicsInterface.TransientManager.EraseTransients(Teigha.GraphicsInterface.TransientDrawingMode,System.Int32,Teigha.Geometry.IntegerCollection)
Метод удаляет в указанных видовых экранах все временные отображаемые объекты, отрисовка которых выполнялась в указанных режиме и порядке отображения.
Метод удаляет в указанных видовых экранах все временные отображаемые объекты, отрисовка которых выполнялась в режиме mode и порядке subDrawingMode.
mode: Входной режим отрисовки. Тип TransientDrawingMode.
subDrawingMode: Входной индекс порядка отрисовки. Тип int.
viewportNumbers: Входной список номеров видовых экранов. Тип IntegerCollection.
Returns: Возвращает true, если удаление объектов завершилось успешно.
В противном случае возвращает false. Это возможно, в частности, по следующим причинам:
* Переданное значение mode оказалось больше или равно TransientDrawingMode.Count.
* Указанный индекс порядка отрисовки превышает максимально допустимое значение целого числа со знаком.

Teigha.GraphicsInterface.TransientManager.GetFreeSubDrawingMode(Teigha.GraphicsInterface.TransientDrawingMode,Teigha.Geometry.IntegerCollection,int%)
Метод предназначен для поиска свободного индекса порядка отрисовки в указанном режиме отрисовки.
Метод предназначен для поиска свободного индекса порядка отрисовки в указанном режиме отрисовки.
mode: Входной режим отрисовки. Тип TransientDrawingMode.
viewportNumbers: Входной список номеров видовых экранов. Тип IntegerCollection.
subDrawingMode: Входной индекс порядка отрисовки. Тип int.
Returns: Возвращает
* 0, если указанный индекс порядка отрисовки уже занят, и данный менеджер не смог найти свободный индекс.
* 1, если указанный индекс порядка отрисовки свободен.
* 2, если указанный индекс порядка отрисовки уже занят, но данный менеджер смог найти свободный индекс.
Тип int.

Teigha.GraphicsInterface.TransientManager.UpdateChildTransient(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод обновляет заданный дочерний отображаемый объект указанного родительского отображаемого объекта.
Метод обновляет в данном менеджере заданный дочерний отображаемый объект указанного родительского отображаемого объекта. Фактически это частичное обновление родительского объекта.
updated: Входной дочерний объект. Тип Drawable.
parent: Входной родительский объект. Тип Drawable.

Teigha.GraphicsInterface.TransientManager.UpdateTransient(Teigha.GraphicsInterface.Drawable,Teigha.Geometry.IntegerCollection)
Метод обновляет заданный временный отображаемый объект в указанных видовых экранах.
Метод обновляет заданный временный отображаемый объект updated в указанных списком видовых экранах.
updated: Входной обновляемый временный отображаемый объект. Тип Drawable.
viewportNumbers: Входной список номеров видовых экранов. Тип IntegerCollection.

Teigha.GraphicsInterface.TransientManager.CurrentTransientManager
Свойство CurrentTransientManager предоставляет доступ к текущему менеджеру временных отображаемых объектов растровой графики.
Свойство CurrentTransientManager предоставляет доступ к текущему менеджеру временных отображаемых объектов растровой графики.
Returns: Возвращает текущий менеджер временных отображаемых объектов растровой графики.
Тип Teigha.GraphicsInterface.TransientManager.