Teigha.DatabaseServices.ExposureType
Данное перечисление определяет поддерживаемые типы управления экспозицией при рендеринге.
Данное перечисление определяет поддерживаемые типы управления экспозицией при рендеринге.