Teigha.DatabaseServices.FeatureControlFrame.GetBoundingPolyline
Метод предназначен для получения последовательности несовпадающих угловых точек этого объекта FeatureControlFrame.
Метод предназначен для получения последовательности несовпадающих угловых точек этого объекта FeatureControlFrame.
Returns: Возвращает последовательность угловых точек данного объекта.  Тип Point3dCollection.