Teigha.DatabaseServices.PropertiesOverrule
Этот класс переопределяет подмножество специфичных для объекта операций, связанных со свойствами.
Он служит базовым классом для классов, производных от DBObject или DBEntity, и используется для настройки их поведения.
Этот класс переопределяет подмножество специфичных для объекта операций, связанных со свойствами.
Он служит базовым классом для классов, производных от DBObject или DBEntity, и используется для настройки их поведения.
Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.

Teigha.DatabaseServices.PropertiesOverrule.GetClassID(Teigha.DatabaseServices.DBObject)
Метод предназначен для получения ClassID объекта DBObject.
Метод предназначен для получения ClassID объекта DBObject.
entity: Объект в базе данных чертежа, тип DBObject.
Returns: Возвращает Guid объекта чертежа.

Teigha.DatabaseServices.PropertiesOverrule.List(Teigha.DatabaseServices.Entity)
Метод позволяет переопределить текст, выводимый командой LIST.
Метод позволяет переопределить текст, выводимый командой LIST.
entity: Объект из базы данных чертежа, тип Entity.

Teigha.DatabaseServices.PropertiesOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD искал в словаре расширений запись с именем entryName.  Переопределения не будут вызываться, если запись с entryName не будет найдена в словаре расширений.
entryName: Имя записи, тип String.

Teigha.DatabaseServices.PropertiesOverrule.SetIdFilter(array)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
ids: Массив идентификаторов объектов. Тип ObjectId[].

Teigha.DatabaseServices.PropertiesOverrule.SetXDataFilter(String)
Метод включает использование указанных расширенных данных в условии применимости объектного переопределения.
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
registeredApplicationName: Имя зарегистрированного приложения, тип String.