HostMgd.Windows.ToolPalette.CustomToolBase.GetDropTarget
Метод предназначен для получения интерфейса IDropTarget от инструмента.
Не реализован.
Метод предназначен для получения интерфейса IDropTarget от инструмента.
Если инструменту требуется поддержка перетаскивания объектов, он должен реализовать этот интерфейс и передать его фреймворку через этот метод.
В текущей версии не реализован.
Returns: Возвращает ссылку на интерфейс IDropTarget инструмента.
Тип System.Object.