HostMgd.ApplicationServices.DocumentLockModeChangeVetoedEventArgs
Класс, обеспечивающий данными событие
DocumentLockModeChangeVetoed класса DocumentCollection.

HostMgd.ApplicationServices.DocumentLockModeChangeVetoedEventArgs.Document
Соответствует функции HostApDocManager::document() nanoCAD API.
Ссылка на документ, принадлежащий входной базе данных.

HostMgd.ApplicationServices.DocumentLockModeChangeVetoedEventArgs.GlobalCommandName
Возвращает имя команды, которая требует произведения
изменений.