Teigha.DatabaseServices.DBObject.GetReactors
Метод предоставляет коллекцию указателей на реакторы этого объекта. Этот метод устаревший. Для получения реакторов можно воспользоваться
GetTransientReactors() и GetPersistentReactors().
Метод предоставляет коллекцию указателей на реакторы этого объекта. Этот метод устаревший. Для получения реакторов можно воспользоваться
GetTransientReactors() и GetPersistentReactors().
Returns: Возвращает коллекцию указателей на реакторы объекта. Тип Generic.List\