Teigha.DatabaseServices.DxfFiler.ReadBoolean
Метод возвращает логическое значение из текущего элемента этого объекта Filer.
Метод возвращает логическое значение из текущего элемента этого объекта Filer.
Returns: Возвращает логическое значение.  Тип bool.