Teigha.DatabaseServices.ViewTableRecord.DisassociateUcsFromView
Метод предназначен для отвязки именованного вида от ПСК.
Метод отделяет ПСК от именованного вида. Если эта функция вызвана,
то никакие ПСК не будут связаны с именованным видом и ПСК
не изменится при восстановлении вида.