Teigha.GraphicsInterface.FaceModifiers
Перечисление FaceModifiers определяет модификаторы режимов отображения граней. Привносимые модификаторами изменения применяются к граням до выполнения любых расчетов, связанных с освещением и тонированием.
Перечисление FaceModifiers определяет модификаторы режимов отображения граней. Привносимые модификаторами изменения применяются к граням до выполнения любых расчетов, связанных с освещением и тонированием.