HostMgd.EditorInput.PromptSelectionOptionsEventHandler
Делегат предназначен для обработки события, возникающего перед началом
операции выбора объектов, и позволяет настроить параметры команды выборки.
Делегат используется как сигнатура метода-обработчика для события PromptingForSelection,
которое генерируется перед началом интерактивного выбора одного или нескольких объектов
в редакторе nanoCAD. Он позволяет разработчику изменить параметры операции выбора
— такие как сообщение, режим выбора, ключевые слова и разрешения — до того, как пользователь
начнёт взаимодействовать с командой.
Этот делегат применяется при реализации команд, требующих выделения объектов,
и обеспечивает гибкость при настройке поведения выборки в зависимости от контекста
— например, при фильтрации объектов, установке подсказок или управлении режимами выделения.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий параметры выбора.