HostMgd.ApplicationServices.InplaceTextEditor.SpellSettingDialog
Метод вызывает диалоговое окно настроек проверки орфографии.
В текущей версии не реализован.
Метод вызывает диалоговое окно настроек проверки орфографии в данном текстовом редакторе.
В текущей версии метод не реализован.