Teigha.DatabaseServices.DBObject.Close
Метод закрывает объект. Все изменения, внесенные в объект с момента его открытия, фиксируются в базе данных, и отправляется уведомление о том, что объект теперь "закрыт".
В настоящее время не реализован.
Закрывает объект. Все изменения, сделанные с объектом с
момента открытия, фиксируются в базе данных, объект
помечается как выгружаемый, и
формируется событие "закрыт" (так же, как и, в соответствующих
случаях, события "изменен", "очищен" и т.д.).