Teigha.GraphicsInterface.MaterialNormalMapComponent
Структура MaterialNormalMapComponent представляет карту материала для канала нормального компонента наложения материала, используемый метод вычисления и вклад (strength) этого канала.
Структура MaterialNormalMapComponent представляет карту материала для канала нормального компонента наложения материала, используемый метод вычисления и вклад (strength) этого канала.

Teigha.GraphicsInterface.MaterialNormalMapComponent.#ctor(Teigha.GraphicsInterface.MaterialMap,Teigha.GraphicsInterface.NormalMapMethod,System.Double)
Конструктор структуры MaterialNormalMapComponent.
Создает экземпляр структуры с заданными картой материалов, методом вычисления нормального наложения и вкладом канала.
Конструктор структуры MaterialNormalMapComponent.
Создает экземпляр структуры с заданными картой материалов, методом вычисления нормального наложения и вкладом канала.
map: Карта материала. Тип MaterialMap.
method: Метод вычисления нормального наложения. Тип NormalMapMethod.
strength: Вклад канала. Тип double.

Teigha.GraphicsInterface.MaterialNormalMapComponent.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialNormalMapComponent.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, которое учитывает предписанные языковые и региональные настройки.
Метод позволяет получить эквивалентное строковое представление данного объекта, которое учитывает предписанные языковые и региональные настройки. Результат включает информацию о нормальном наложении материала, методе его вычисления и вкладе этого компонента.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.

Teigha.GraphicsInterface.MaterialNormalMapComponent.!=(Teigha.GraphicsInterface.MaterialNormalMapComponent,Teigha.GraphicsInterface.MaterialNormalMapComponent)
Оператор неравенства структуры MaterialNormalMapComponent.
Оператор неравенства структуры MaterialNormalMapComponent.
Notes
Критерием неравенства двух предоставленных экземпляров данной структуры является невыполнение хотя бы одного из следующих условий:
* Методы, используемые для вычисления сравниваемых экземпляров структуры MaterialNormalMapComponent, равны (оба могут быть null).
* Значения вклада компонентов равны.
a: Левый  операнд. Тип MaterialNormalMapComponent.
b: Правый операнд. Тип MaterialNormalMapComponent.
Returns: Возвращает true, если левый и правый оператор не равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialNormalMapComponent.==(Teigha.GraphicsInterface.MaterialNormalMapComponent,Teigha.GraphicsInterface.MaterialNormalMapComponent)
Оператор равенства структуры MaterialNormalMapComponent.
Оператор равенства структуры MaterialNormalMapComponent.
Notes
Критерием равенства двух предоставленных экземпляров данной структуры является совместное выполнение следующих условий:
* Методы, используемые для вычисления сравниваемых экземпляров структуры MaterialNormalMapComponent, равны (оба могут быть null).
* Значения вклада компонентов равны.
a: Левый  операнд. Тип MaterialNormalMapComponent.
b: Правый операнд. Тип MaterialNormalMapComponent.
Returns: Возвращает true, если левый и правый оператор равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialNormalMapComponent.Map
Свойство Map представляет карту материала для канала нормального компонента наложения материала.
Свойство Map представляет карту материала для канала нормального компонента наложения материала.
Returns: Возвращает карту материала для канала нормального компонента.
Тип MaterialMap.

Teigha.GraphicsInterface.MaterialNormalMapComponent.Method
Свойство Method представляет метод вычисления нормального компонента наложения материала.
Свойство Method представляет метод вычисления нормального компонента наложения материала.
Returns: Возвращает метод вычисления нормального компонента наложения материала.
Тип NormalMapMethod.

Teigha.GraphicsInterface.MaterialNormalMapComponent.Strength
Свойство Strength представляет вклад нормального компонента наложения материала.
Свойство Strength представляет значение вклада нормального компонента наложения материала (channel strength).
Returns: Возвращает значение вклада нормального компонента наложения материала.
Тип double.