Teigha.DatabaseServices.HatchEdgeType
Перечисление HatchEdgeType определяет типы геометрических кривых, используемые для границ областей штриховки.
Перечисление HatchEdgeType определяет типы геометрических кривых, которые могут использоваться для построения границ областей штриховки.