Teigha.Geometry.CircularArc3d.GetPlane
Метод позволяет найти плоскость, в которой лежит данная дуга.
Метод позволяет найти плоскость, в которой лежит данная дуга.
Returns: Возвращает плоскость, в которой лежит эта дуга. Тип Plane.