HostMgd.EditorInput.JigPromptAngleOptions.GetDefaultValueString
Вспомогательный метод. Предназначен для преобразования значения угла по умолчанию в строку (string).
Метод преобразовывает значение свойства DefaultValue в строку.
Returns: Возвращает строку string, в которой указано значение угла, заданное по умолчанию.