Teigha.DatabaseServices.CellAlignment
Данное перечисление определяет варианты выравнивания текста в ячейке таблицы, которые доступны только для горизонтально ориентированного текста.
Данное перечисление определяет варианты выравнивания текста в ячейке таблицы, которые доступны только для горизонтально ориентированного текста.