HostMgd.EditorInput.PointHistoryBits
Данное перечисление определяет битовые маски в значениях истории ввода точек, позволяющие выяснить, какие способы фильтрации точек оказали влияние на ввод точки в конкретном системном событии.
Перечисление PointHistoryBits используется для анализа источника или способа ввода точек в системных событиях.
Оно определяет битовые маски в значениях истории ввода точек,  позволяющие выяснить, какие способы фильтрации точек оказали влияние на ввод точки в конкретном системном событии.