Teigha.DatabaseServices.LayerStateRenameEventArgs
Класс LayerStateRenameEventArgs представляет данные для события LayerStateRename базы данных.
Класс LayerStateRenameEventArgs представляет данные для события LayerStateRename базы данных.

Teigha.DatabaseServices.LayerStateRenameEventArgs.Name
Свойство Name представляет текущее имя слоя.
Свойство Name представляет текущее имя слоя (старое имя).
Returns: Возвращает текущее имя слоя.
Тип String.

Teigha.DatabaseServices.LayerStateRenameEventArgs.NewName
Свойство NewName представляет новое имя слоя.
Свойство NewName представляет новое имя слоя.
Returns: Возвращает новое имя слоя.
Тип String.