Teigha.DatabaseServices.LayoutEventArgs
Этот класс представляет данные для связанных с листом событий в менеджере листов.
Этот класс представляет данные для связанных с листом событий в менеджере листов (AbortLayoutCopied, AbortLayoutRemoved, LayoutCreated, LayoutRemoved, LayoutSwitched, LayoutToBeCopied and XrefSubCommandAborted).

Teigha.DatabaseServices.LayoutEventArgs.Id
Свойство представляет идентификатор объекта измененного листа.
Свойство представляет идентификатор объекта измененного листа.
Returns: Возвращает идентификатор объекта измененного листа. Тип ObjectId.

Teigha.DatabaseServices.LayoutEventArgs.Name
Свойство представляет имя измененного листа.
Свойство представляет имя измененного листа.
Returns: Возвращает имя измененного листа. Тип String.