Teigha.DatabaseServices.BlockTableRecord.GetAnonymousBlockIds
Метод предназначен для получения коллекции ObjectId
анонимных блоков чертежа.
Метод формирует коллекцию ObjectId
анонимных блоков, которые создаются платформой из определения
динамического блока.
Returns: Метод возвращает коллекцию ObjectId в
формате ObjectIdCollection.