Teigha.DatabaseServices.CellRange.GetStyleOverrides
Метод позволяет получить переопределения стиля ячеек в этом диапазоне ячеек.
Метод позволяет получить переопределения стиля ячеек в этом диапазоне ячеек.
Returns: Возвращает массив переопределений стиля ячеек. Тип TableStyleOverride[].