Teigha.GraphicsInterface.FaceData.GetLayers
Метод предоставляет массив идентификаторов слоев, используемых для граней данным объектом FaceData.
Метод предоставляет массив идентификаторов объектов LayerTableRecord, по одному для каждой грани сети или оболочки, с которой используется объект FaceData.
Returns: Возвращает массив идентификаторов слоев, используемых данным объектом для граней сети или оболочки.
Тип ObjectId[].
Если массив идентификаторов слоев не задан, то возвращает NULL.