Teigha.DatabaseServices.Ole2Frame
Этот класс обеспечивает поддержку объектов OLE 2 в чертежах nanoCAD.
Этот класс обеспечивает поддержку объектов OLE 2 в чертежах nanoCAD.
По сути, он предоставляет окно для отображения предписанного объекта OLE 2.

Teigha.DatabaseServices.Ole2Frame.#ctor
Конструктор по умолчанию класса Ole2Frame.
Конструктор по умолчанию класса Ole2Frame.

Teigha.DatabaseServices.Ole2Frame.CreateFromFile(String)
Метод предназначен для создания объекта Ole2Frame, используя указанный файл в качестве источника данных.
Метод предназначен для создания объекта Ole2Frame, используя указанный файл в качестве источника данных.
FileName: Имя файла с данными. Тип String.
Returns: Возвращает true в случае успешного завершения операции.
В противном случае возвращает false.

Teigha.DatabaseServices.Ole2Frame.getCompoundDocument(Runtime.StreamBuf)
Метод выполняет запись данных составного документа в указанный поток.
Метод выполняет запись данных составного документа в указанный поток.
streamBuf: Буфер потока, в который выполняется запись данных.

Teigha.DatabaseServices.Ole2Frame.setCompoundDocument(System.Int32,Runtime.StreamBuf)
Метод выполняет чтение данных составного документа из указанного потока.
Метод выполняет чтение данных составного документа из указанного потока.
nSize: Размер считываемых составных данных в байтах. Тип int.
streamBuf: Буфер потока, из которого выполняется чтение данных.

Teigha.DatabaseServices.Ole2Frame.setHimetricSize(short,short)
Метод задает значения необрабатываемым полям.
В текущей версии не используется, в будущих релизах будет удален или переименован.
Метод задает значения необрабатываемым полям.
В текущей версии не используется, в будущих релизах будет удален или переименован.
Width: Ширина окна. Тип short.
Height: Высота окна. Тип short.

Teigha.DatabaseServices.Ole2Frame.AutoOutputQuality
Свойство представляет качество печати, "автоматически выбираемое приложением".
Свойство представляет качество печати, "автоматически выбираемое приложением".
Качество печати влияет на глубину цвета и разрешение, используемые при выводе OLE-объекта на печать.
См. также свойство OutputQuality.
Returns: Возвращает качество печати. Тип byte.

Teigha.DatabaseServices.Ole2Frame.DrawAspect
Свойство представляет характер представления объекта при отрисовке или получении данных.
Свойство представляет характер представления объекта при отрисовке или получении данных.
Returns: Возвращает значение из перечисления OleDvAspect.

Teigha.DatabaseServices.Ole2Frame.HimetricHeight
Свойство представляет высоту окна в единицах измерения, не зависящих от разрешения устройства вывода.
Не используется, в будущих релизах будет удалено или переименовано.
Свойство представляет высоту окна в единицах измерения, не зависящих от разрешения устройства вывода.
Не используется и в будущих релизах будет удалено или переименовано.
Returns: Возвращает высоту окна.
Тип short.

Teigha.DatabaseServices.Ole2Frame.HimetricWidth
Свойство представляет ширину окна в единицах измерения, не зависящих от разрешения устройства вывода.
Не используется и в будущих релизах будет удалено или переименовано.
Свойство представляет ширину окна в единицах измерения, не зависящих от разрешения устройства вывода.
Не используется и в будущих релизах будет удалено или переименовано.
Returns: Возвращает ширину окна.
Тип short.

Teigha.DatabaseServices.Ole2Frame.IsLinked
Свойство позволяет проверить, является ли данный объект связанным.
Свойство позволяет проверить, является ли данный объект связанным.
Returns: Возвращает true, если данный объект является связанным.
В противном случае возвращает false.

Teigha.DatabaseServices.Ole2Frame.LinkName
Свойство представляет имя файла и элемент, с которым связан данный объект Ole2Frame.
Свойство представляет имя файла и элемент, с которым связан данный объект Ole2Frame.
Пример: D:/My Documents/My Workbook.xls!Sheet2!R1C1:R10C10
Returns: Возвращает строку, содержащую имя файла и элемент в файле, с которым связан OLE-объект.
Тип String.

Teigha.DatabaseServices.Ole2Frame.LinkPath
Свойство представляет имя файла, с которым связан данный объект Ole2Frame.
Свойство представляет имя файла и элемент, с которым связан данный объект Ole2Frame.
Пример: D:/My Documents/My Workbook.xls
Returns: Возвращает полное имя файла. Тип String.

Teigha.DatabaseServices.Ole2Frame.Location
Свойство представляет координатную точку левого верхнего угла объекта OLE.
Свойство представляет координатную точку левого верхнего угла объекта OLE.
Returns: Возвращает точку привязки данного объекта.
Тип Point3d.

Teigha.DatabaseServices.Ole2Frame.LockAspect
Свойство позволяет управлять блокировкой пропорций окна данного объекта при изменении размеров окна.
Свойство представляет состояние флага блокировки соотношения сторон окна данного объекта.
Это свойство влияет на поведение объекта OLE при изменении его размера.
Returns: Возвращает true, если при изменении размеров окна объекта пропорции окна должны оставаться неизменными.
В противном случае возвращает false.

Teigha.DatabaseServices.Ole2Frame.OleObject
Свойство предоставляет доступ к объекту MFC, который в данный момент используется объектом Ole2Frame.
Свойство предоставляет доступ к объекту MFC, который в данный момент используется объектом Ole2Frame.
Returns: Возвращает используемый объект MFC. Тип Object.

Teigha.DatabaseServices.Ole2Frame.OutputQuality
Свойство представляет текущую установку качества печати для данного OLE-объекта.
Свойство представляет значение качества печати, установленное для данного OLE-объекта.
Качество печати влияет на глубину цвета и разрешение, используемые при выводе OLE-объекта на печать.
Множество допустимых значений:
Наименование       Значение    Описание
---------------    --------    -------------------------
kMonochrome        0           Монохромный вывод. Электронная таблица.
kLowGraphics       1           Невысокое разрешение. Цветной текст и круговые диаграммы.
kHighGraphics      2           Высокое разрешение. Фотография.
kAutomatic         3           Автоматический выбор.
Returns: Возвращает значение качества печати. Тип byte.

Teigha.DatabaseServices.Ole2Frame.Position2d
Свойство представляет координаты четырех угловых точек OLE-объекта в координатах GDI текущего видового экрана.
Свойство представляет координаты четырех угловых точек OLE-объекта в координатах GDI текущего видового экрана.
Returns: Возвращает четыре угловые точки OLE-объекта в виде объекта System.Drawing.Rectangle.

Teigha.DatabaseServices.Ole2Frame.Position3d
Свойство представляет координаты четырех угловых точек OLE-объекта в мировой системе координат (WCS).
Свойство представляет координаты четырех угловых точек OLE-объекта, определенные в мировой системе координат (WCS).
Returns: Возвращает четыре угловых точки OLE-объекта в виде объекта Rectangle3d.

Teigha.DatabaseServices.Ole2Frame.Rotation
Свойство представляет угол поворота для этого OLE-объекта.
Свойство представляет угол поворота для этого OLE-объекта.
Returns: Возвращает угол поворота OLE-объекта (в радианах). Тип double.

Teigha.DatabaseServices.Ole2Frame.ScaleHeight
Свойство представляет масштабный коэффициент OLE-объекта по высоте, выраженный в процентах.
Свойство представляет выраженное в процентах отношение текущей и исходной высоты OLE-объекта, т.е. его масштаб по высоте.
Returns: Возвращает масштаб OLE-объекта по высоте.
Тип double.

Teigha.DatabaseServices.Ole2Frame.ScaleWidth
Свойство представляет масштабный коэффициент OLE-объекта по ширине, выраженный в процентах.
Свойство представляет выраженное в процентах отношение текущей и исходной ширины OLE-объекта, т.е. его масштаб по ширине.
Returns: Возвращает масштаб OLE-объекта по ширине.
Тип double.

Teigha.DatabaseServices.Ole2Frame.Type
Свойство представляет тип данного OLE-объекта.
Свойство представляет тип данного OLE-объекта.
Returns: Возвращает тип OLE-объекта из перечисления ItemType.

Teigha.DatabaseServices.Ole2Frame.UserType
Свойство представляет определяемое пользователем наименование типа OLE-объекта.
Свойство представляет определяемое пользователем наименование типа OLE-объекта.
Примеры: "Word Document", "Excel Chart".
Returns: Возвращает пользовательское наименование типа OLE-объекта.
Тип String.

Teigha.DatabaseServices.Ole2Frame.WcsHeight
Свойство представляет фактическую высоту этого OLE-объекта в мировой системе координат (WCS).
Свойство представляет фактическую высоту этого OLE-объекта в мировой системе координат (WCS).
Высота может изменяться вследствие выполнения команд типа STRETCH (РАСТЯЖЕНИЕ), изменения высоты объекта в палитре свойств или в диалоговом окне «Размер текста», а также при изменении размера объекта в результате операций с ручками.
Returns: Возвращает высоту OLE-объекта.
Тип double.

Teigha.DatabaseServices.Ole2Frame.WcsWidth
Свойство представляет фактическую ширину этого OLE-объекта в мировой системе координат (WCS).
Свойство представляет фактическую ширину этого OLE-объекта в мировой системе координат (WCS).
Returns: Возвращает ширину OLE-объекта.
Тип double.