Teigha.DatabaseServices.XrefGraph
Класс XrefGraph представляет дерево внешних ссылок базы данных.
Класс XrefGraph является производным от класса Graph и представляет дерево внешних ссылок базы данных.
Объект XrefGraph описывает связи между главным чертежом и чертежами, на которые в нем имеются внешние ссылки, а также любыми чертежами по вложенным внешним ссылкам.
Каждая ссылка (между базами данных) представлена в графе ребром.
Узлами графа являются объекты XrefGraphNode, которые представляют записи базы данных или таблицы блоков, на которые имеются внешние ссылки.
Запросы к узлам графа позволяют получать входящие и исходящие ссылки этих узлов.
Корневым узлом графа внешних ссылок всегда является главный чертеж.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(DatabaseServices.ObjectId)
Метод позволяет получить объект XrefGraphNode, соответствующий указанному идентификатору объекта.
Метод позволяет получить объект XrefGraphNode, соответствующий указанному идентификатору объекта.
btrId: Идентификатор объекта записи BlockTableRecord.
Returns: Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(System.Int32)
Метод позволяет получить объект XrefGraphNode по указанному индексу узла.
Метод позволяет получить объект XrefGraphNode по указанному индексу узла.
idx: Индекс искомого узла. Тип int.
Returns: Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(DatabaseServices.Database)
Метод позволяет получить объект XrefGraphNode, соответствующий указанной базе данных.
Метод позволяет получить объект XrefGraphNode, соответствующий указанной базе данных.
db: База данных, для которой требуется найти узел. Тип DatabaseServices.Database.
Returns: Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(String)
Метод позволяет получить объект XrefGraphNode с указанным именем.
Метод позволяет получить объект XrefGraphNode с указанным именем.
name: Имя узла. Тип String.
Returns: Возвращает объект XrefGraphNode, если узел найден, или null в противном случае.

Teigha.DatabaseServices.XrefGraph.HostDrawing
Свойство HostDrawing представляет корневой узел графа внешних ссылок, связанный с главным чертежом.
Свойство HostDrawing представляет корневой узел графа внешних ссылок, связанный с главным чертежом.
Returns: Возвращает корневой узел графа внешних ссылок, связанный с главным чертежом.
Тип XrefGraphNode.