Teigha.DatabaseServices.DxfFiler.ReadObjectId
Метод возвращает идентификатор объекта из текущего элемента этого объекта Filer.
Метод возвращает идентификатор объекта из текущего элемента этого объекта Filer.
Returns: Возвращает идентификатор объекта. Тип ObjectId.