Teigha.Geometry.CurveCurveIntersector3d.OverlapDirection
Метод позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
Метод позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
Notes
Полученное значение имеет смысл, только если метод OverlapCount() возвращает положительное значение, т.е. только при наличии перекрытий.
Returns: Возвращает true, если две кривые ориентированы в одном направлении на участке их перекрытия.
В случае противоположной ориентации перекрывающихся кривых возвращает значение false. Тип bool.