Teigha.BoundaryRepresentation
Пространство имен Teigha.BoundaryRepresentation включает определения, относящиеся к граничным представлениям.
Пространство имен Teigha.BoundaryRepresentation включает определения, относящиеся к граничным представлениям.