Teigha.DatabaseServices.DBObjectReference
Структура DBObjectReference содержит идентификатор объекта и групповой код DXF, представляющий тип объекта.
Структура DBObjectReference содержит идентификатор объекта и групповой код DXF, представляющий тип объекта.

Teigha.DatabaseServices.DBObjectReference.#ctor(Teigha.DatabaseServices.ObjectId,System.Int32)
Конструктор класса DBObjectReference.
Создает экземпляр класса с указанными параметрами.
Конструктор класса DBObjectReference.
Создает экземпляр класса с указанным идентификатором объекта ObjectId и заданным типом объекта kind.
id: Идентификатор ссылки на объект. Тип ObjectId.
kind: Вид объектной ссылки (код DXF). Тип int.

Teigha.DatabaseServices.DBObjectReference.Kind
Свойство Kind представляет вид объектной ссылки для данного объекта.
Свойство Kind представляет вид объектной ссылки для данного объекта (код DXF).
Returns: Возвращает вид объектной ссылки.
Тип int.

Teigha.DatabaseServices.DBObjectReference.ObjectId
Свойство ObjectId представляет идентификатор объектной ссылки.
Свойство ObjectId представляет идентификатор ObjectId объектной ссылки.
Returns: Возвращает идентификатор объектной ссылки.
Тип DatabaseServices.ObjectId.