HostMgd.ApplicationServices.InplaceTextEditor.NewFeatureWorkShop
Метод вызывает диалоговое окно настройки новой функции текстового редактора.
В текущей версии не реализован.
Метод вызывает диалоговое окно настройки новой функции текстового редактора.
В текущей версии не реализован.