Teigha.DatabaseServices.FieldCodeFlags.TextField
Значение: 256.
Если этот флаг установлен, код поля обрабатывается как текст с внедренными полями.
Этот флаг неприменим при получении кода поля и будет игнорироваться в этом контексте.