Teigha.Geometry.PointOnCurve3d.GetCurvature
Метод вычисляет кривизну кривой в данной точке на кривой.
Метод не реализован.
Метод вычисляет кривизну кривой в данной точке на кривой.
Метод не реализован.
Returns: Возвращает значение кривизны кривой в данной точке на кривой. Тип double.