Teigha.Geometry.Curve3dCollection
Класс Curve3dCollection представляет коллекцию объектов Curve3d.
Класс Curve3dCollection представляет коллекцию объектов Curve3d.

Teigha.Geometry.Curve3dCollection.#ctor
Конструктор по умолчанию класса Curve3dCollection.
Конструктор по умолчанию класса Curve3dCollection.

Teigha.Geometry.Curve3dCollection.Add(Teigha.Geometry.Curve3d)
Метод добавляет в данную коллекцию новую кривую Curve3d.
Метод добавляет в данную коллекцию новую кривую Curve3d.
value: Входная кривая, которая добавляется в коллекцию.
Returns: Возвращает индекс добавленной кривой в данной коллекции.
Тип int.

Teigha.Geometry.Curve3dCollection.Contains(Teigha.Geometry.Curve3d)
Метод позволяет проверить, содержится ли в коллекции указанная кривая.
Метод позволяет проверить, содержится ли в коллекции указанная кривая.
value: Проверяемая кривая.
Returns: Возвращает true, если кривая value содержится в данной коллекции.
В противном случае возвращает false.

Teigha.Geometry.Curve3dCollection.CopyTo(array,System.Int32)
Метод копирует элементы этой коллекции в предоставленный массив, начиная с указанного индекса.
Метод копирует элементы этой коллекции в массив array, начиная с индекса index.
array: Массив, в который следует копировать элементы коллекции.  Тип Curve3d[].
index: Индекс в массиве, начиная с которого в массив копируются элементы коллекции.  Тип int.

Teigha.Geometry.Curve3dCollection.IndexOf(Teigha.Geometry.Curve3d)
Метод позволяет найти индекс указанной кривой в данной коллекции.
Метод позволяет найти индекс указанной кривой value в данной коллекции.
value: Искомая кривая.  Тип Curve3d.
Returns: Возвращает индекс элемента value в коллекции.
Тип int.

Teigha.Geometry.Curve3dCollection.Insert(System.Int32,Teigha.Geometry.Curve3d)
Метод вставляет в коллекцию указанный элемент в позицию с заданным индексом.
Метод вставляет в коллекцию указанный элемент value в позицию с заданным индексом index.
index: Позиция вставляемого элемента в коллекции.  Тип int.
value: Вставляемый в коллекцию элемент.  Тип Curve3d.

Teigha.Geometry.Curve3dCollection.Remove(Teigha.Geometry.Curve3d)
Метод предназначен для удаления из коллекции указанного элемента, если он там существует.
Метод предназначен для удаления из коллекции указанного элемента, если он там существует.
value: Удаляемый элемент.  Тип Curve3d.

Teigha.Geometry.Curve3dCollection.RemoveAt(System.Int32)
Метод предназначен для удаления из коллекции элемента в позиции с указанным индексом, если он существует.
Метод предназначен для удаления из коллекции элемента в позиции с указанным индексом index, если он существует.
index: Индекс удаляемого элемента.  Тип int.

Teigha.Geometry.Curve3dCollection.Count
Свойство Count представляет количество объектов в данной коллекции.
Свойство Count представляет количество объектов в данной коллекции.
Returns: Возвращает текущее количество объектов в коллекции.
Тип int.

Teigha.Geometry.Curve3dCollection.IsFixedSize
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Returns: Возвращает true, если размер коллекции является фиксированным.
В противном случае возвращает false.

Teigha.Geometry.Curve3dCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Returns: Возвращает true, если данная коллекция доступна только на чтение.
В противном случае возвращает false.

Teigha.Geometry.Curve3dCollection.Item
Свойство Item представляет элемент коллекции с указанным индексом.
Свойство Item представляет элемент коллекции с указанным индексом.
index: Входной индекс элемента коллекции.  Тип int.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип Curve3d.