Teigha.BoundaryRepresentation.ErrorStatus.UnrecoverableErrors
Значение: 121 = 0x79.
Неустранимые ошибки.
Например, объект BREP не инициализирован или недействителен или отсутствует реализация функции.