HostMgd.EditorInput.Editor.UpdateTiledViewportsFromDatabase
Метод обновляет видовые экраны в текущем чертеже, используя сохранённые в базе данных настройки.
Метод применяется для обновления конфигурации и параметров видовых экранов (viewport'ов),
расположенных в пространстве листа (paper space), на основе данных, хранящихся в базе чертежа.
Это позволяет восстановить или синхронизировать отображение видовых экранов после изменения
их свойств или переключения между листами. Метод особенно полезен при работе
с шаблонами чертежей или при программном управлении несколькими видовыми экранами.
Example
C#