HostMgd.Windows.PaneCollection.Add(HostMgd.Windows.Pane,HostMgd.Windows.Pane)
Добавление объекта Pane в коллекцию.

HostMgd.Windows.PaneCollection.CopyTo(array,System.Int32)
a: Массив, куда копируются элементы коллекции. Индекс
index: Значение индекса в массиве, начиная с котрого в него