HostMgd.EditorInput.JigPromptOptions.Cursor
Тип курсора, используемый в приглашении.
Свойство предназначено для определения внешнего вида курсора при запросе во время использования технологии Jig.
Внешний вид курсора определяется одним из элементов перечисления .
Returns: Возвращает тип выбранного курсора.