HostMgd.ApplicationServices.LispWillStartEventArgs
Обеспечивает данными событие LispWillStart класса Document.

HostMgd.ApplicationServices.LispWillStartEventArgs.FirstLine
Возвращает первую строку процедуры lisp для выполнения.