HostMgd.EditorInput.Editor.TurnForcedPickOn
Метод включает режим принудительного выбора объектов и возвращает его предыдущее состояние.
Метод активирует режим принудительного выбора (forced pick), при котором пользователь
может выбирать объекты только по одному щелчком мыши, исключая массовый выбор рамкой
или другими способами. Этот режим используется для точного контроля над выбором объектов
в интерактивных командах. Метод возвращает предыдущее состояние режима, что позволяет
восстановить настройку после выполнения операции.
Returns: Возвращает значение типа int, представляющее предыдущее состояние режима принудительного выбора:
0 — режим был выключен.
1 — режим уже был включен.
Это значение может быть использовано для последующего восстановления исходного состояния
с помощью метода TurnForcedPickOff() или повторного вызова TurnForcedPickOn().
Example
C#