HostMgd.ApplicationServices.IConfigurationSection
Интерфейс для создания, хранения
и управления данными конфигурации приложения.

HostMgd.ApplicationServices.IConfigurationSection.Contains(String)
Возвращает признак того, содержит ли коллекция объект, имя
которого содержит name.
name: Имя для поиска

HostMgd.ApplicationServices.IConfigurationSection.ContainsSubsection(String)
Этот метод должен быть разработан, чтобы проверить, что
секция конфигурации содержит подсекцию с заданным именем.
name: Имя подсекции, которое должно быть найдено

HostMgd.ApplicationServices.IConfigurationSection.CreateSubsection(String)
Создает конфигурационную подсекцию с именем name.
name: Имя создаваемой подсекции

HostMgd.ApplicationServices.IConfigurationSection.Delete(String)
Этот метод должен быть разаработан для удаления элемента с
именем name в секции конфигурации.
name: Имя элемента, который должен быть удален

HostMgd.ApplicationServices.IConfigurationSection.DeleteSubsection(String)
Этот метод должен быть разработан для удаления
конфигурационной подсекции с именем name.
name: Имя удаляемой подсекции

HostMgd.ApplicationServices.IConfigurationSection.IsReadOnly
Возвращает признак того, является ли объект доступным только
на чтение.

HostMgd.ApplicationServices.IConfigurationSection.OpenSubsection(String)
Этот метод должен быть разработан для открытия
конфигурационной подсекции с именем name.
name: Имя открываемой подсекции

HostMgd.ApplicationServices.IConfigurationSection.ReadProperty(String,System.Object)
Метод возвращает значение свойства с именем name. Если такого имени свойства нет, то
должно быть возвращено значение defaultValue.
name: Имя свойства
defaultValue: Значение по умолчанию, возвращаемое методом

HostMgd.ApplicationServices.IConfigurationSection.WriteProperty(String,System.Object)
Метод присваивает значение value свойству с именем name.
name: Имя свойства
value: Присваиваемое значение