HostMgd.ApplicationServices.LongTransactionManager.CheckedIn
Событие CheckedIn возникает после успешного возврата объектов из длительной транзакции в основную базу данных (операция CheckIn).
В текущей версии не реализовано.
Событие CheckedIn возникает после успешного завершения возврата объектов из длительной транзакции в основную базу данных (операция CheckIn).
В текущей версии  не реализовано.