Teigha.BoundaryRepresentation.LoopEdgeEnumerator
Класс LoopEdgeEnumerator представляет перечислитель коллекции рёбер цикла грани.
Класс LoopEdgeEnumerator представляет перечислитель коллекции рёбер цикла грани.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.Current
Свойство Current представляет текущий элемент перечислителя.
Свойство Current представляет текущий элемент перечислителя.
Returns: Возвращает текущий элемент перечислителя.
Тип Edge.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.IsEdgeOrientToLoop
Свойство IsEdgeOrientToLoop позволяет проверить, совпадают ли ориентации текущего ребра и цикла грани.
Свойство IsEdgeOrientToLoop позволяет проверить, совпадают ли ориентации текущего ребра и цикла грани.
Returns: Возвращает true, если ориентация текущего ребра и цикла совпадают.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.OrientedCurve
Свойство OrientedCurve предоставляет доступ к ориентированной кривой для текущего ребра данного перечислителя.
Свойство OrientedCurve предоставляет доступ к ориентированной кривой для текущего ребра данного перечислителя.
Returns: Возвращает кривую для текущего ребра.  Тип Curve3d.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.ParamCurve
Свойство ParamCurve представляет параметрическую 2D-кривую для текущего ребра данного перечислителя.
Свойство ParamCurve представляет параметрическую 2D-кривую для текущего ребра данного перечислителя.
Returns: Возвращает параметрическую 2D-кривую.
Тип Curve2d.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.ParamCurveAsNurb
Свойство ParamCurveAsNurb представляет NURB 2D-кривую для текущего ребра перечислителя.
Свойство ParamCurveAsNurb представляет NURB 2D-кривую для текущего ребра перечислителя.
Returns: Возвращает NURB 2D-кривую для текущего ребра.
Тип NurbCurve2d.