Teigha.GraphicsInterface.FillType
Перечисление FillType определяет типы заливки для замкнутых геометрических примитивов.
Перечисление FillType определяет типы заливки для замкнутых геометрических примитивов.
Заливка допускается для кругов, многоугольников, оболочек, сетей, текста, а также круговых секторов и сегментов.
Для полилиний и простых незамкнутых дуг заливка не применяется.
Notes
Тип заливки устанавливается перед вызовом метода WorldDraw() и зависит от типа регенерации.
Если задан тип регенерации StandardDisplay, используется тип заливки FillNever.
В случае иного типа регенерации используется тип заливки FillAlways.