HostMgd.EditorInput.SelectionSetDelayMarshalled.Count
Возвращает количество элементов, реально содержащихся в
выбранном наборе.

HostMgd.EditorInput.SelectionSetDelayMarshalled
Класс SelectionSetDelayMarshalled представляет набор выделенных объектов чертежа с отложенным маршаллингом.
В текущей версии не реализован.
Класс SelectionSetDelayMarshalled представляет набор выделенных объектов чертежа с отложенным маршаллингом.
В текущей версии не реализован.

HostMgd.EditorInput.SelectionSetDelayMarshalled.Count
Свойство Count представляет количество объектов в данном наборе выбранных объектов чертежа.
Не реализовано.
Свойство Count представляет количество объектов в данном наборе выбранных объектов чертежа.
В текущей версии не реализовано.
Returns: Возвращает количество объектов в данном наборе.
Тип int.