HostMgd.EditorInput.PromptForSelectionEndingEventArgs
Класс предоставляет данные для события PromptForSelectionEnding,
возникающего после завершения операции выбора объектов в редакторе nanoCAD.
Класс наследуется от EventArgs и реализует интерфейс IDisposable.
Он используется при обработке событий, связанных с интерактивным выбором множества объектов,
и предоставляет информацию о результате выборки — такую как набор выделенных объектов (SelectionSet),
статус операции и дополнительные параметры. Объект этого класса создаётся системой
при возникновении события PromptForSelectionEnding, и позволяет реагировать
на изменения перед фиксацией выбора пользователем.
Notes
Так как класс реализует интерфейс IDisposable,
рекомендуется освобождать используемые ресурсы после обработки события.
Example
C#

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Add(HostMgd.EditorInput.SelectedObject)
Метод добавляет указанный геометрический объект к текущему набору выделенных объектов.
Метод используется для программного добавления объекта в набор выбранных элементов.
Это позволяет формировать или изменять выборку перед выполнением массовых операций,
таких как удаление, перемещение или изменение свойств группы объектов.
Метод принимает объект типа SelectedObject, который содержит ссылку
на идентификатор (ObjectId) и дополнительные данные о подобъекте.
value: Объект, представляющий геометрический элемент, который необходимо добавить

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.AddSubEntity(HostMgd.EditorInput.SelectedSubObject)
Метод добавляет указанный геометрический подобъект
к текущему набору выделенных подобъектов.
Метод используется для программного добавления подобъекта (например, ребра, вершины или контура)
в состав текущей выборки. Это может быть полезно при работе с командами,
которые требуют выделения отдельных частей сложных объектов — таких как полигоны,
блоки или трехмерные тела. Метод позволяет динамически управлять содержимым выборки
на уровне подобъектов перед выполнением операции.
Notes
Этот метод применяется в интерактивных операциях, где требуется работать не с целыми объектами,
а с их отдельными компонентами — например, при редактировании сложных геометрий или выполнении
точечного выбора.
value: Объект, представляющий подобъект, который необходимо добавить в текущую выборку.

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Remove(System.Int32)
Метод удаляет объект из набора выделенных элементов по указанному индексу.
Метод используется для удаления объекта из коллекции выбранных элементов (SelectionSet)
по его позиции в списке. Это позволяет программно изменять состав выделения,
исключая определённые объекты перед выполнением команд, таких как перемещение,
удаление или редактирование. Метод особенно полезен при обработке событий,
где требуется фильтрация или коррекция выборки перед её использованием.
Notes
Если указанный индекс выходит за пределы диапазона, будет выброшено исключение ArgumentOutOfRangeException.
index: Порядковый номер удаляемого объекта в наборе выделенных элементов.

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.RemoveSubEntity(System.Int32,System.Int32)
Метод удаляет указанный подобъект из составного объекта
по заданным индексам геометрического объекта и подобъекта.
Метод применяется при работе с составными геометрическими объектами,
которые содержат подобъекты (например, полигоны, блоки, сложные линии и др.).
Он позволяет программно удалить конкретный подобъект по его индексу внутри указанного объекта.
Метод может использоваться в интерактивных командах или обработчиках выборки
для изменения структуры выделения на уровне подобъектов.
entityIndex: Индекс геометрического объекта в наборе выделенных объектов,
subEntityIndex: Индекс подобъекта внутри указанного геометрического объекта,

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Flags
Свойство предоставляет дополнительные сведения о текущем режиме
или состоянии операции выбора объектов в редакторе nanoCAD.
Свойство возвращает значение перечисления SelectionFlags, которое содержит флаги,
определяющие контекст и параметры выполняемой в данный момент операции выбора объектов.
Эти флаги могут указывать, например, разрешено ли добавлять новые объекты к выделению,
требуется ли выбирать только один объект, или выполняется ли выбор подобъектов.
Свойство особенно полезно при обработке событий, связанных с выборкой,
таких как PromptForSelectionEnding.
Returns: Возвращает значение типа SelectionFlags — это битовое перечисление,
где каждый флаг представляет определённый режим или состояние выборки.
Возможные значения:
* AddAllowed — разрешено добавлять объекты.
* RemoveAllowed — разрешено удалять объекты.
* SinglePick — разрешено только одиночное выделение.
* SubEntitySelection — активирован режим выбора подобъектов.
* И другие.
Если операция выбора не активна, значение может быть недопустимым (например, None).
Example
C#

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Selection
Свойство предоставляет доступ к набору объектов,
выбранных пользователем в результате интерактивного приглашения.
Свойство возвращает объект типа SelectionSet, который содержит
коллекцию геометрических объектов, выделенных пользователем в ходе интерактивной операции.
Оно используется, например, в обработчиках событий редактора nanoCAD,
таких как PromptForSelectionEnding, и позволяет получить
или проанализировать текущее выделение перед его использованием в команде.
Свойство доступно только для чтения и обновляется автоматически при завершении выборки.
Returns: Возвращает объект типа SelectionSet, представляющий собой набор выделенных объектов.
Если объекты были выбраны — SelectionSet будет содержать список ObjectId этих объектов.
Если выборка не была выполнена или отменена, возвращается null или пустой SelectionSet.
Example
C#