Teigha.DatabaseServices.BulgeVertex
Класс представляет безразмерную величину прогиба сегмента полилинии, берущего начало в двумерной вершине.
Класс представляет безразмерную величину прогиба сегмента полилинии, берущего начало в соответствующей двумерной вершине.
Численно значение прогиба определяется отношением высоты сегмента круглой дуги к половине длины хорды, стягивающей эту дугу.  Так, если дуга представляет собой половину окружности, то прогиб = 1. Значение 0 соответствует прямолинейному сегменту.
Знак прогиба определяется положением дуги относительно хорды.
Если дуга располагается правее хорды, значение прогиба положительно (движение по дуге против часовой стрелки), если левее хорды - отрицательно (движение по дуге по часовой стрелке).

Teigha.DatabaseServices.BulgeVertex.#ctor(Geometry.Point2d,System.Double)
Конструктор класса BulgeVertex.
Конструктор класса BulgeVertex.
point: 2D-координаты новой вершины. Тип Geometry.Point2d.
bulge: Новое значение выпуклости. Тип double.

Teigha.DatabaseServices.BulgeVertex.Bulge
Свойство обеспечивает доступ к значению прогиба данного объекта BulgeVertex.
Свойство обеспечивает доступ к значению прогиба данного объекта BulgeVertex.
Returns: Возвращает выличину прогиба дугового сегмента. Тип double.

Teigha.DatabaseServices.BulgeVertex.Vertex
Свойство обеспечивает доступ к вершине, с которой связан объект BulgeVertex.
Свойство обеспечивает доступ к вершине, с которой связан объект BulgeVertex.
Returns: Возвращает координаты 2D-вершины. Тип Geometry.Point2d.