Teigha.GraphicsSystem.Device.GetSizeRect
Метод позволяет получить объект System.Drawing.Rectangle, представляющий размеры данного устройства.
Метод позволяет получить объект System.Drawing.Rectangle, представляющий размеры данного устройства.
Returns: Возвращает прямоугольник, представляющий размеры устройства.
Тип System.Drawing.Rectangle.