Teigha.BoundaryRepresentation.FaceLoopCollection.GetEnumerator
Метод позволяет получить перечислитель для данной коллекции.
Метод позволяет получить перечислитель для данной коллекции.
Returns: Возвращает перечислитель циклов грани BREP.
Тип FaceLoopEnumerator.