Teigha.Geometry.Vector2d.IsUnitLength
Метод проверяет, является ли данный вектор единичным.
Метод проверяет, является ли данный вектор единичным.
Реализация использует вызов метода Vector2d.IsUnitLength(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
Returns: Возвращает true, если в пределах точности по умолчанию данный вектор можно считать единичным.
В противном случае возвращает false.