HostMgd.EditorInput.EntityJig.Update
Абстрактный метод, обязателен к реализации при наследовании класса EntityJig.
В методе должен быть реализован алгоритм преобразования данных в формат, необходимый
для построения примитива на экране.