HostMgd.EditorInput.Camera
Класс Camera представляет свойства камеры текущего вида в процессе интерактивного ввода пользователя через редактор nanoCAD. В текущей версии не реализован.
Класс Camera представляет свойства камеры текущего вида в процессе интерактивного ввода пользователя через редактор nanoCAD.
В текущей версии не реализован.

HostMgd.EditorInput.Camera.BackClipDistance
Свойство BackClipDistance предоставляет доступ к положению задней плоскости отсечения камеры.
Не реализовано.
Свойство BackClipDistance предоставляет доступ к положению задней плоскости отсечения камеры.
В текущей версии не реализовано.
Returns: Возвращает расстояние до задней плоскости отсечения.
Тип double.

HostMgd.EditorInput.Camera.BackClipEnabled
Свойство BackClipEnabled позволяет проверить, включен ли режим заднего отсечения.
Не реализовано.
Свойство BackClipEnabled позволяет проверить, включен ли режим заднего отсечения.
В текущей версии не реализовано.
Returns: Возвращает true, если режим заднего отсечения включен.
В противном случае возвращает false.

HostMgd.EditorInput.Camera.FieldOfView
Свойство FieldOfView представляет размер поля для данной камеры.
Не реализовано.
Свойство FieldOfView представляет размер поля для данной камеры.
В текущей версии не реализовано.
Returns: Возвращает размер поля для данной камеры.
Тип double.

HostMgd.EditorInput.Camera.FrontClipDistance
Свойство FrontClipDistance представляет положение передней плоскости отсечения камеры.
Не реализовано.
Свойство FrontClipDistance представляет положение передней плоскости отсечения камеры.
В текущей версии не реализовано.
Returns: Возвращает расстояние до передней плоскости отсечения.
Тип double.

HostMgd.EditorInput.Camera.FrontClipEnabled
Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения.
Не реализовано.
Свойство FrontClipEnabled позволяет определить, включен ли режим переднего отсечения.
В текущей версии не реализовано.
Returns: Возвращает true, если режим переднего отсечения включен.
В противном случае возвращает false.

HostMgd.EditorInput.Camera.IsCameraPlottable
Свойство IsCameraPlottable позволяет проверить, доступна ли печать для данной камеры.
Не реализовано.
Свойство IsCameraPlottable позволяет проверить, доступна ли печать для данной камеры.
В текущей версии не реализовано.
Returns: Возвращает true, если печать для камеры доступна.
В противном случае возвращает false.

HostMgd.EditorInput.Camera.LensLength
Свойство LensLength представляет фокусное расстояние камеры в режиме перспективного проецирования.
Не реализовано.
Свойство LensLength представляет фокусное расстояние камеры в режиме перспективного проецирования.
В текущей версии не реализовано.
Returns: Возвращает фокусное расстояние камеры.
Тип double.

HostMgd.EditorInput.Camera.Position
Свойство Position представляет точку положения камеры.
Не реализовано.
Свойство Position представляет точку положения камеры.
В текущей версии не реализовано.
Returns: Возвращает точку положения камеры.
Тип Point3d.

HostMgd.EditorInput.Camera.Target
Свойство Target возвращает положение точки цели камеры.
Не реализовано.
Свойство Target возвращает положение точки цели камеры.
В текущей версии не реализовано.
Returns: Возвращает положение точки цели камеры.
Тип Point3d.

HostMgd.EditorInput.Camera.ViewId
Свойство ViewId представляет идентификатор объекта данной камеры.
Не реализовано.
Свойство ViewId представляет идентификатор объекта данной камеры.
В текущей версии не реализовано.
Returns: Возвращает идентификатор объекта камеры.
Тип Teigha.DatabaseServices.ObjectId.

HostMgd.EditorInput.Camera.ViewTwist
Свойство ViewTwist предоставляет доступ к углу поворота камеры.
Не реализовано.
Свойство ViewTwist предоставляет доступ к величине угла поворота (в радианах) камеры.
В текущей версии не реализовано.
Returns: Возвращает угол поворота камеры.
Тип double.