HostMgd.EditorInput.Editor.PointMonitor
Событие возникает при каждом перемещении мыши в окне редактора nanoCAD,
позволяя отслеживать координаты указателя в реальном времени.
Событие предназначено для отслеживания движения мыши в графической области чертежа.
Оно вызывается каждый раз, когда курсор перемещается в пределах окна редактора,
и может использоваться для реализации интерактивных функций —
таких как динамическое отображение координат, подсказки, контекстные подсветки
или пользовательские привязки. В отличие от события PointFilter,
не позволяет изменять точку ввода, а только наблюдать за ней.
Notes
Событие использует делегат PointMonitorEventHandler,
который передаёт данные о текущем положении мыши
и состоянии ввода через объект PointMonitorEventArgs.
Example
C#