Teigha.Runtime.Exception
Класс Exception представляет контейнер для значения перечисления Teigha.Runtime.ErrorStatus.
Класс Exception представляет контейнер для значения перечисления Teigha.Runtime.ErrorStatus.
Его следует использовать только в том случае, если есть уверенность, что не возникнет конфликтов имен.

Teigha.Runtime.Exception.#ctor
Конструктор по умолчанию класса Exception.
Конструктор по умолчанию класса Exception.

Teigha.Runtime.Exception.#ctor(Runtime.ErrorStatus)
Конструктор класса Exception. Создает экземпляр класса с указанным статусом ошибки.
Конструктор класса Exception. Создает экземпляр класса с указанным статусом ошибки.
es: Статус ошибки.  Тип Runtime.ErrorStatus.

Teigha.Runtime.Exception.#ctor(Runtime.ErrorStatus,String)
Конструктор класса Exception.
Создает экземпляр класса с указанным статусом ошибки и текстовым сообщением.
Конструктор класса Exception.
Создает экземпляр класса с указанным статусом ошибки и текстовым сообщением.
es: Статус ошибки.  Тип Runtime.ErrorStatus.
message: Сообщение об ошибке.  Тип String.

Teigha.Runtime.Exception.#ctor(Runtime.ErrorStatus,String,System.Exception)
Конструктор класса Exception.
Создает экземпляр класса с указанным статусом ошибки, текстовым сообщением и внутренним исключением.
Конструктор класса Exception.
Создает экземпляр класса с указанным статусом ошибки, текстовым сообщением и внутренним исключением.
es: Статус ошибки.          Тип Runtime.ErrorStatus.
message: Сообщение об ошибке.    Тип String.
innerException: Внутреннее исключение.  Тип System.Exception.

Teigha.Runtime.Exception.GetObjectData(SerializationInfo,StreamingContext)
Метод вызывает версию своего суперкласса и затем добавляет значение с именем AcadErrorStatus к данным указанного потока сериализации.
Метод вызывает версию своего суперкласса и затем добавляет значение с именем AcadErrorStatus к данным указанного потока сериализации info.
info: Входные данные о потоке сериализации.  Тип SerializationInfo.
context: Входной контекст.  Тип StreamingContext.

Teigha.Runtime.Exception.ErrorStatus
Свойство ErrorStatus представляет значение статуса ошибки.
Свойство ErrorStatus представляет значение статуса ошибки.
Returns: Возвращает статус ошибки.  Тип Runtime.ErrorStatus.