Teigha.DatabaseServices.Unit.Astronomical
Значение: 18. Астрономическая единица.
Астрономическая единица, используемая для измерения расстояний в астрономии.
1 а.е. точно равна
149 597 870 700 м (среднее расстояние от Земли до Солнца).