Teigha.DatabaseServices.BlockTableRecord
Класс предназначен для хранения определения блока.
Класс предназначен для хранения определения блока.
Определение блока является его неграфической частью и
содержит полное описание блока: какие объекты в него входят,
какие у них значения свойств, и как они расположены
относительно друг друга в данном блоке.
Класс BlockTableRecord позволяет работать с определениями
блоков: создавать, изменять, просматривать значения их
свойств.
Example
Ниже приведен пример работы с классом. В примере создается
новое определение блока, и далее вставка этого блока
добавляется в пространство модели чертежа.
C#

Teigha.DatabaseServices.BlockTableRecord.#ctor
Конструктор класса
Конструктор по умолчанию. Инициализирует объект в точке
(0,0,0) со значениями признаков IsAnonymous,
HasAttributeDefinitions, IsFromExternalReference и
IsFromOverlayReference, установленными в false и PathName,
установленным в NULL. Дополнительно, вызывается конструктор
по умолчанию класса SymbolTableRecord.

Teigha.DatabaseServices.BlockTableRecord.AppendEntity(Teigha.DatabaseServices.Entity)
Метод предназначен для добавления примитива в блок и в базу
данных чертежа.
\ \
Метод добавляет примитив entity в блок и базу данных чертежа.
entity: Добавляемый примитив (не должен быть NULL)
Returns: Возвращает ObjectId добавленного примитива.

Teigha.DatabaseServices.BlockTableRecord.AssumeOwnershipOf(Teigha.DatabaseServices.ObjectIdCollection)
Метод предназначен для передачи блоку права собственности на
объекты и обеспечения безопасного перемещения этих объектов
между блоками.
Метод передает блоку права собственности на все объекты,
перечисленные в параметре entitiesToMove и обеспечивает
безопасное пермещение этих объектов между блоками.
Изменение принадлежности объектов блоку возможно только при
выполнении всех перечисленных ниже условий:
* метод может открыть все объекты, перечисленные в
параметре entitiesToMove для записи;
* все объекты, перечисленные в параметре entitiesToMove
расположены в той же базе данных, что и блок;
* текущими владельцами примитивов являются все экземпляры
блока.
Если все условия соблюдены, то принадлежность всех примитивов
изменится, примитивы будут отмечены в базе данных, как
измененные. Операция изменения принадлежности примитивов
относится к типу «все или ничего». Если хоть один примитив из
коллекции примитивов entitiesToMove не может быть перемещен в
другой блок, то ни один примтив не будет перемещен.
Если какой#45;то из примитивов во время перемещения уже
открыт для записи, это может привести к завершению работы
программы.
entitiesToMove: Коллекция ObjectId примитивов,

Teigha.DatabaseServices.BlockTableRecord.GetBlockReferenceIds(System.Boolean,System.Boolean)
Метод предназначен для получения коллекции ObjectId
всех вставок блоков чертежа, которые ссылаются на это
определение блока.
Возвращает коллекцию ObjectId блоков, которые косвенно
или напрямую ссылаются на данное определение блока. В
коллекцию ссылок включаются только те ссылки, которые в
данный момент активны. Можно использовать метод
для получения списка очищенных
ссылок.
directOnly: Признак добавления в коллекцию косвенных
forceValidity: Этот параметр применим только, если параметр directOnly
Returns: Метод возвращает коллекцию ObjectId в формате ObjectIdCollection.
Note
При вызове данного метода нужно решить, какое значение
forceValidity будет наиболее эффективным. Например, если
нужно установить Id в порядке очереди BlockReference на
регенерацию, чтобы избежать вызова REGENALL, возможно, более
дешевым будет установить forceValidity в false и выполнить
REGENALL.
Полная регенерация будет быстрее и лучше использовать память,
чем принудительная загрузка всего файла в память. Тем не
менее, если метод вызывается для определения циклических
ссылок в блоках, то forceValidity должен быть установлен в
true для того, чтобы гарантировать, что все ссылки блоков
(потенциально циклические) будут найдены.

Teigha.DatabaseServices.BlockTableRecord.GetXrefDatabase(System.Boolean)
Метод предназначен для внешних блоков и позволяет получить
базу данных, в которой есть определение внешнего блока.
Метод применим для внешних блоков, то есть блоков,
вставленных из других чертежей и возвращает базу данных, в
которой есть определение данного блока.
incrementUnresolved: Признак того, что нужно открыть базу
Returns: Метод возвращает тип данных Database.

Teigha.DatabaseServices.BlockTableRecord.BlockBeginId
Свойство предназначено для хранения ObjectID начала блока.
В свойстве хранится ObjectId объекта
BlockBegin.
Объект BlockBegin создается автоматически
при создании блока и существует в чертеже для совместимости.
Returns: Возвращает ObjectId объекта
BlockBegin текущей записи таблицы блоков
(BlockTableRecord).

Teigha.DatabaseServices.BlockTableRecord.BlockEndId
Свойство предназначено для хранения BlockEndId.
В свойстве хранится ObjectId объекта BlockEnd.
Объект BlockEnd создается автоматически при создании
блока и существует в чертеже для совместимости.
Returns: Возвращает ObjectId объекта BlockEnd текущей
записи таблицы блоков (BlockTableRecord).

Teigha.DatabaseServices.BlockTableRecord.BlockScaling
В свойстве хранятся характеристики масштабирования вставок
данного определения блока.
Свойство предназначено для хранения характеристик
масштабирования вставок блока. Возможно два варианта:
масштабирование одинаково для всех вставок или возможен свой
масштаб для каждой вставки.
Returns: Возвращает/принимает одно из значений перечисления
.
Return Value List
Any : разный масштаб у всех вставок;
Uniform : одинаковый масштаб у всех вставок.

Teigha.DatabaseServices.BlockTableRecord.Comments
Свойство предназначено для хранения текстовых данных,
относящихся к этому определению блока.
Свойство предназначено для хранения текстовых данных,
относящихся к этому определению блока.
Текстовыми данными могут быть, например,
описание блока, комментарии о его особенностях,
инструкция по его использованию и прочее.
Returns: Возвращает string.

Teigha.DatabaseServices.BlockTableRecord.DrawOrderTableId
В свойстве хранится ObjectId записи таблицы DrawOrderTable,
связанной с этим блоком.
В свойстве хранится ObjectId записи таблицы DrawOrderTable,
которая относится к данному определению блока.
Открыв запись таблицы DrawOrderTable по этому ObjectId можно
получить информацию о позиции данного блока в порядке
отрисовки объектов на чертеже.
Returns: Возвращает ObjectId объекта DrawOrderTable.

Teigha.DatabaseServices.BlockTableRecord.Explodable
Свойство указывает на возможность разбивать вставки этого
блока на отдельные примитивы.
Свойство указывает, можно ли разбить вставки этого
определения блока на отдельные примитивы.
Returns: Возвращает тип данных bool:
* true #45; вставки этого определения блока можно
разбить на отдельные примитивы;
* false #45; вставки этого определения блока нельзя
разбить на отдельные примитивы.

Teigha.DatabaseServices.BlockTableRecord.HasAttributeDefinitions
Свойство показывает, есть ли в блоке атрибуты.
Свойство показывает, есть ли в блоке определения атрибутов.
Returns: Возвращает тип данных bool:
* true - в блоке определены атрибуты;
* false - в блоке нет атрибутов.

Teigha.DatabaseServices.BlockTableRecord.HasPreviewIcon
Признак наличия иконки предпросмотра у блока.
В свойстве хранится признак наличия у блока иконки
предпросмотра.
Returns: Возвращает тип данных bool:
* true - у блока есть иконка предпросмотра;
* false - у блока нет иконки предпросмотра.

Teigha.DatabaseServices.BlockTableRecord.IncludingErased
Свойство предназначено для получения копии определения блока,
включающей удаленные из него примитивы.
В свойстве хранится копия определения блока, включающая
удаленные из этого определения примитивы.
Returns: Возвращает определение блока BlockTableRecord, значение
свойства IncludingErased.

Teigha.DatabaseServices.BlockTableRecord.IsAnonymous
Свойство предназначено для определения, является ли данное
определение блока анонимным.
Свойство показывает, является ли данное определение блока
анонимным, то есть блоком без quot;действительногоquot;
имени. Анонимные блоки создаются автоматически для поддержки
динамических блоков, таблиц, образцов штриховки и
ассоциативных размеров.
Иногда анонимный блок является вложенным блоком, который
отображается либо в редакторе блоков, либо путем расчленения
блока.
Значение свойства используется для первого бита в коде группы
DXF 70.
Returns: Возвращает тип данных bool:
* true - блок является анонимным.
* false - не анонимный.

Teigha.DatabaseServices.BlockTableRecord.IsDynamicBlock
Свойство показывает, является ли данный блок динамическим.
Свойство показывает, является ли данное определение блока
динамическим.
Динамические блоки, в отличие от статических, содержат в себе
правила и ограничения, управляющие внешним видом и поведением
блока при его вставке в чертеж.
Returns: Возвращает тип данных bool:
* true - блок является динамическим.
* false - блок статический.

Teigha.DatabaseServices.BlockTableRecord.IsFromExternalReference
Свойство предназначено для определения того, загружен блок из
другого чертежа или создан непосредственно в этом чертеже.
Свойство показывает, является ли даное определение блока
внешним для чертежа,либо создано непосредственно в этом
чертеже.
Returns: Возвращает тип данных bool:
* true #45; блок является внешним для документа, то есть
вставлен из другого документа.
* false #45; блок был создан в текущем документе.
Note
Значение свойства используется для 3-его бита группового кода
70 DXF.

Teigha.DatabaseServices.BlockTableRecord.IsFromOverlayReference
Свойство предназначено для изменения типа ссылки на внешний
блок.
Свойство меняет тип ссылки на определение блока. Возможны два
типа ссылок: наложенная и вложенная.
Если ссылка наложенная, то при использовании данного
определения блока в другом чертеже, блок с наложенной ссылкой
в этом чертеже не отобразится и не загрузится в него.
Если ссылка вложенная, то при использовании данного
определения блока в другом чертеже, блок с вложенной ссылкой
добавится в этот чертеж, как часть другого блока.
Returns: Возвращает тип данных bool:
* true #45; блок является внешним для
документа, то есть вставлен из другого документа, и тип
ссылки на вставку этого блока – наложенная;
* false #45; блок является внешним для документа и тип
ссылки на вставку этого блока #45; вложенная.
Note
Значение свойства используется для 3-его бита
группового кода 70 DXF.

Teigha.DatabaseServices.BlockTableRecord.IsLayout
Признак того, что данное определение блока описывает лист.
Признак того, что данное определение блока описывает лист.
Листом является как пространство модели, так и остальные
листы.
Returns: Возвращает тип данных bool:
* true #45; блок представляет собой лист или пространство
модели;
* false #45; остальные блоки.

Teigha.DatabaseServices.BlockTableRecord.IsUnloaded
Признак того, что определение блока выгружено.
Признак того, что определение блока выгружено. Выгрузка
определений блоков используется для того, чтобы этот блок
можно было потом использовать в других чертежах, как внешний
блок.
Returns: Возвращает тип данных bool:
* true #45; данная запись описывает блок, который является
внешним, т.е. взят из другого документа, и этот блок был
выгружен из настоящего документа.
* false #45; внешний блок не выгружен из настоящего
документа.
Если эти условия не соблюдаются, свойство возвращает false.

Teigha.DatabaseServices.BlockTableRecord.LayoutId
Свойство предназначено для хранения ObjectId листа документа,
к которому на текущий момент относится блок.
В свойстве хранится ObjectId листа документа, к которому в
текущий момент относится определение блока.
Returns: Возвращает ObjectId

Teigha.DatabaseServices.BlockTableRecord.Origin
Свойство предназначено для хранения данных о базовой точке
блока.
Базовая точка блока, или точка его вставки в WCS (World
Coordinate System). Точка является началом системы координат
MCS (локальная система мировых координат для геометрических
объектов в записи таблицы блоков).
Returns: Возвращает точку
с тремя координатами расположения базовой точки блока.
Note
Точка всегда имеет координаты (0, 0, 0). Не рекомендуется
менять её значение.

Teigha.DatabaseServices.BlockTableRecord.PathName
Свойство предназначено для хранения ссылки на внешний блок.
Свойство предназначено для внешних блоков и хранит в себе
ссылку на этот блок в виде строки. Если запись таблицы блоков
не является внешней ссылкой, то строка будет занесена в
запись таблицы блоков, но не будет использоваться.
Returns: Тип данных string.
Note
Значение свойства соответствует групповому коду 1 DXF.

Teigha.DatabaseServices.BlockTableRecord.PreviewIcon
Свойство предназначено для хранения иконки предпросмотра
блока.
Иконка предпросмотра блока.
Returns: Тип данных System.Drawing.Bitmap

Teigha.DatabaseServices.BlockTableRecord.Units
Свойство предназначено для хранения единицы измерения.
Свойство хранит в себе единицу измерения блока – одно из
значений перечисления UnitsValue.
Returns: Тип данных UnitsValue.

Teigha.DatabaseServices.BlockTableRecord.XrefStatus
Свойство предназначено для внешних блоков и хранит информацию
о состоянии ссылки.
Свойство предназначено для внешних блоков, то есть блоков,
вставленных в чертеж из других чертежей, и хранит в себе
информацию о состоянии ссылки на этот внешний блок, которая
может принимать одно из значений перечисления .
Returns: Тип данных .

Teigha.DatabaseServices.BlockTableRecord.ModelSpace
Свойство предназначено для хранения названия служебного блока
пространства модели.
Свойство предназначено для быстрого поиска служебного блока
пространства модели в базе данных чертежа, и хранит в себе
название этого блока.
Returns: Тип данных string.

Teigha.DatabaseServices.BlockTableRecord.PaperSpace
Свойство предназначено для хранения названия служебного блока
листов dwg-документа.
Свойство предназначено для быстрого поиска служебного блока
листа в базе данных чертежа, и хранит в себе название этого
блока.
Returns: Тип данных string.