Teigha.GraphicsInterface.ColorRGB
Структура ColorRGB предназначена для представления цвета в формате RGB.
Структура ColorRGB предназначена для представления цвета с красной (R), зеленой (G) и синей (B) компонентами в формате чисел двойной точности.

Teigha.GraphicsInterface.ColorRGB.#ctor(System.Double,System.Double,System.Double)
Конструктор структуры ColorRGB.
Создает экземпляр структуры с указанными значениями красной, зеленой и синей компонент.
Конструктор структуры ColorRGB.
Создает экземпляр структуры с указанными значениями красной, зеленой и синей компонент.
red: Красная компонента. Тип double.
green: Зеленая компонента. Тип double.
blue: Синяя компонента.   Тип double.

Teigha.GraphicsInterface.ColorRGB.Blue
Свойство Blue представляет текущее значение синей компоненты цвета.
Свойство Blue представляет значение синей компоненты цвета.
Returns: Возвращает значение синей компоненты цвета.
Тип double.

Teigha.GraphicsInterface.ColorRGB.Green
Свойство Green представляет значение зелёной компоненты цвета.
Свойство Green представляет значение зелёной компоненты цвета.
Returns: Возвращает значение зелёной компоненты цвета.
Тип double.

Teigha.GraphicsInterface.ColorRGB.Red
Свойство Red представляет значение красной компоненты цвета.
Свойство Red представляет значение красной компоненты цвета.
Returns: Возвращает значение красной компоненты цвета.
Тип double.