Teigha.DatabaseServices.ObjectOverrule.SetCustomFilter
Метод включает использование метода IsApplicable, чтобы установить, должно ли к данному объекту
применяться переопределение.
Метод включает использование метода IsApplicable, чтобы установить, должно ли к данному объекту
применяться переопределение.