Teigha.DatabaseServices.DuplicateRecordCloning.UnmangleName
Значение: 5.
В основном используется в RefEdit при возвращении записей в исходную базу данных.
Любое изменение, внесенное MangleName, отменяется, а затем устанавливается значение по умолчанию "Ignore".
Другими словами, если дубликат обнаружен после удаления искажения, nanoCAD продолжает использовать существующую запись и игнорирует клонированную.