Teigha.BoundaryRepresentation.BrepVertexEnumerator
Класс BrepVertexEnumerator представляет перечислитель коллекции вершин граничного представления B-Rep.
Класс BrepVertexEnumerator представляет перечислитель коллекции вершин граничного представления B-Rep.

Teigha.BoundaryRepresentation.BrepVertexEnumerator.Current
Свойство Current представляет доступ к текущему элементу данного перечислителя.
Свойство Current представляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает вершину B-Rep, которая является текущим элементом данного перечислителя.
Тип Vertex.