Teigha.DatabaseServices.DbHomeView.ToggleDefaultSettings
Метод предназначен для приведения данного объекта к настройкам по умолчанию.
Метод предназначен для приведения данного объекта к настройкам по умолчанию.