Teigha.DatabaseServices.FeatureControlFrame
Класс FeatureControlFrame представляет в базе данных рамки символов допусков формы и расположения.
Класс FeatureControlFrame представляет в базе данных символы допусков формы и расположения.
Эти символы представляют собой многосекционные прямоугольные рамки.

Teigha.DatabaseServices.FeatureControlFrame.#ctor
Конструктор по умолчанию класса FeatureControlFrame.
Конструктор по умолчанию класса FeatureControlFrame.

Teigha.DatabaseServices.FeatureControlFrame.#ctor(String,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса FeatureControlFrame. Создает экземпляр класса с указанными кодами, точкой вставки и ориентацией в заданной плоскости.
Конструктор класса FeatureControlFrame.
Создает экземпляр класса с указанными кодами, точкой вставки и ориентацией в заданной плоскости.
codes: Текст данного символа. Предполагает использование esc-последовательностей для настройки символа. Тип String.
insertionPoint: Точка вставки символа. Тип Point3d.
normalVector: Вектор нормали плоскости, в которой располагается данный символ. Тип Vector3d. Задается в WCS.
x: Направление оси X в указанной плоскости. Тип Vector3d. Задается в WCS.
Для настройки символа FeatureControlFrame допускается использовать следующие управляющие esc-последовательности:

Teigha.DatabaseServices.FeatureControlFrame.SetDimstyleData(Teigha.DatabaseServices.DimStyleTableRecord)
Метод позволяет задать для этого объекта настройки размерного стиля, включая переопределения, из указанной записи таблицы размерных стилей.
Метод позволяет задать для этого объекта настройки размерного стиля, включая переопределения, из указанной записи таблицы размерных стилей.
style: Нерезидентная запись таблицы размерных стилей. Тип DimStyleTableRecord.

Teigha.DatabaseServices.FeatureControlFrame.SetOrientation(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет задать векторы ориентации данного объекта FeatureControlFrame.
Метод позволяет задать векторы ориентации этого объекта FeatureControlFrame.
norm: Вектор нормали плоскости данного символа допусков. Тип Vector3d.
dir: Направляющий вектор оси X данного символа допусков в указанной плосткости. Тип Vector3d.

Teigha.DatabaseServices.FeatureControlFrame.Dimclrd
Свойство Dimclrd представляет текущее значение системной переменной DIMCLRD, которая задает цвет размерных и выносных линий, рамок и стрелок.
Свойство Dimclrd представляет текущее значение системной переменной DIMCLRD, которая задает цвет размерных и выносных линий, рамок и стрелок.
Returns: Возвращает цвет, используемый для отображения данного объекта.  Тип Colors.Color.

Teigha.DatabaseServices.FeatureControlFrame.Dimclrt
Свойство Dimclrt представляет текущее значение системной переменной DIMCLRT, которая задает цвет размерного текста.
Свойство Dimclrt представляет текущее значение системной переменной DIMCLRT, которая задает цвет размерного текста.
Returns: Возвращает цвет размерного текста. Тип Colors.Color.

Teigha.DatabaseServices.FeatureControlFrame.DimensionStyle
Свойство DimensionStyle представляет идентификатор объекта размерного стиля для этого объекта.
Свойство DimensionStyle представляет идентификатор объекта размерного стиля для этого объекта.
Returns: Возвращает идентификатор объекта размерного стиля. Тип ObjectId.

Teigha.DatabaseServices.FeatureControlFrame.DimensionStyleName
Свойство DimensionStyleName возвращает имя размерного стиля данного объекта.
Свойство DimensionStyleName возвращает имя размерного стиля данного объекта.
Returns: Возвращает имя размерного стиля данного. Тип String.

Teigha.DatabaseServices.FeatureControlFrame.Dimgap
Свойство Dimgap представляет текущее значение системной переменной DIMGAP, которая определяет зазор между размерным текстом и размерными линиями.
Свойство Dimgap представляет текущее значение системной переменной DIMGAP, которая определяет зазор между размерным текстом и размерными линиями.
* В случае отрицательного значения переменной DIMGAP размерный текст отображается в рамке.
* Значение переменной DIMGAP используется также в качестве минимальной длины каждого сегмента размерной линии.
Для размещения элементов линейного размера между выносными линиями требуется наличие достаточного пространства для двух стрелок (2 x DIMASZ), двух сегментов размерной линии (2 x DIMGAP), двух зазоров по обе стороны от размерного текста (2 x DIMGAP) и собственной длины размерного текста, которая зависит от текущей высоты размерного текста и количества отображаемых десятичных знаков.
Returns: Возвращает текущее значение системной переменной DIMGAP. Тип double.

Teigha.DatabaseServices.FeatureControlFrame.Dimscale
Свойство Dimscale представляет текущее значение системной переменной DIMSCALE. Эта системная переменная определяет масштабный множитель, применяемый ко всем размерным переменным, которые регулируют размеры, смещения и расстояния.
Свойство Dimscale представляет текущее значение системной переменной DIMSCALE. Эта системная переменная определяет масштабный множитель, применяемый ко всем размерным переменным, которые регулируют размеры, смещения и расстояния.
Returns: Возвращает текущее значение системной переменной DIMSCALE. Тип double.

Teigha.DatabaseServices.FeatureControlFrame.Dimtxsty
Свойство Dimtxsty представляет текущее значение системной переменной DIMTXSTY, которая определяет текстовый стиль размерного текста.
Свойство Dimtxsty представляет текущее значение системной переменной DIMTXSTY, которая определяет текстовый стиль размерного текста.
Returns: Возвращает идентификатор объекта текстового стиля размерного текста. Тип ObjectId.

Teigha.DatabaseServices.FeatureControlFrame.Dimtxt
Свойство Dimtxt представляет текущее значение системной переменной DIMTXT, которая определяет высоту размерного текста.
Свойство Dimtxt представляет текущее значение системной переменной DIMTXT, которая определяет высоту размерного текста.
Returns: Возвращает высоту размерного текста как значение системной переменной DIMTXT. Тип double.

Teigha.DatabaseServices.FeatureControlFrame.Direction
Свойство Direction представляет направляющий вектор оси X данного объекта.
Свойство Direction представляет направляющий вектор оси X данного объекта.
Вектор задается в мировой системе координат WCS.
Returns: Возвращает направляющий вектор оси X. Тип Vector3d.

Teigha.DatabaseServices.FeatureControlFrame.Location
Свойство Location возвращает точку вставки (WCS) данного объекта.
Свойство Location возвращает 3D-точку вставки данного объекта.
Точка задается в мировой системе координат WCS.
Returns: Возвращает точку вставки данного объекта. Тип Point3d.

Teigha.DatabaseServices.FeatureControlFrame.Normal
Свойство Normal возвращает вектор нормали плоскости, в которой располагается данный объект.
Свойство Normal возвращает вектор нормали плоскости, в которой располагается данный объект.
Returns: Возвращает вектор нормали плоскости. Тип Vector3d.

Teigha.DatabaseServices.FeatureControlFrame.Text
Свойство Text представляет текстовую строку, которая используется данным объектом.
Свойство Text представляет текстовую строку, которая используется данным объектом.
Returns: Возвращает текстовую строку данного объекта.  Тип String.

Teigha.DatabaseServices.FeatureControlFrame.TextStyleId
Свойство TextStyleId представляет идентификатор текстового стиля, который используется данным объектом.
Свойство TextStyleId представляет идентификатор текстового стиля, который используется данным объектом.
Returns: Возвращает идентификатор текстового стиля. Тип ObjectId.

Teigha.DatabaseServices.FeatureControlFrame.TextStyleName
Свойство TextStyleName представляет имя текстового стиля, который используется данным объектом.
Свойство TextStyleName представляет имя текстового стиля, который используется данным объектом.
Returns: Возвращает имя текстового стиля. Тип String.