Teigha.Geometry.Cylinder.IsClosed
Метод позволяет проверить, является ли основание данного цилиндра полной окружностью.
Используется геометрическая точность по умолчанию.
Метод позволяет проверить, является ли основание данного цилиндра полной окружностью.
Используется вызов метода Cylinder.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) со значением геометрической точности, равным Tolerance.Global.
Returns: Возвращает true, если с используемой точностью основание данного цилиндра можно считать полной окружностью.
В противном случае возвращает false.