Teigha.GraphicsInterface.PositionBehavior.Viewport
Значение: 1.
Положение геометрии определяется в нормализованной 2D-системе координат видового экрана.
Координаты X и Y изменяются в диапазоне [0.0 .. 1.0].
Точкам в левом нижнем и правом верхнем углу видового экрана соответствуют координаты (0.0, 0.0) и (1.0, 1.0), соответственно.