Teigha.BoundaryRepresentation.BrepEntity.GetSurfaceArea
Метод позволяет получить площадь поверхности данного топологического объекта.
Используемая точность определяется глобальными настройками.
Метод позволяет получить площадь поверхности данного топологического объекта как значение типа double с применением максимального масштабного коэффициента из вложенных преобразований.
Используемая точность определяется глобальными настройками.
Площадь поверхности можно определять для большинства топологических объектов, которые представляют объемные фигуры.
Returns: Возвращает площадь поверхности данного объекта.
Тип double.