Teigha.DatabaseServices.DwgFiler.ReadAddress
Метод предназначен для получения значения адреса памяти текущего элемента данного объекта Filer.
Метод предназначен для получения значения адреса памяти текущего элемента данного объекта Filer.
Реализация должна обеспечить следующие функции:
* проверка текущего статуса файла;
* чтение по адресу памяти;
* возвращать прочитанный адрес.
Returns: Возвращает адреса памяти текущего элемента объекта Filer. Тип IntPtr.