Teigha.Runtime.Dictionary.GetEnumerator
Метод предоставляет объект перечислителя для данного словаря.
Метод предоставляет объект перечислителя для данного словаря.
Returns: Возвращает объект перечислителя.
Тип IDictionaryEnumerator.