Teigha.GraphicsInterface.DistantLightTraits
Класс DistantLightTraits представляет характеристики удаленного источника света.
Класс DistantLightTraits представляет характеристики удаленного источника света.
Такой источник света располагается бесконечно далеко от сцены и излучает свет в направлении модели параллельными лучами.

Teigha.GraphicsInterface.DistantLightTraits.#ctor
Конструктор по умолчанию класса DistantLightTraits.
Конструктор по умолчанию класса DistantLightTraits.
Инициализирует члены класса разумными значениями по умолчанию.

Teigha.GraphicsInterface.DistantLightTraits.IsSunlight
Свойство IsSunlight позволяет определить, отображается ли этот удаленный источник как солнечное освещение.
Свойство IsSunlight позволяет определить, отображается ли этот удаленный источник как солнечное освещение.
Returns: Возвращает true, если этот источник света представляет солнечное освещение.
В противном случае возвращает false.

Teigha.GraphicsInterface.DistantLightTraits.LightDirection
Свойство LightDirection представляет направление, в котором излучает удаленный источник света.
Свойство LightDirection представляет направление, в котором излучает удаленный источник света.
Returns: Возвращает направление излучения удаленного источника света. Тип Vector3d.
Положительное направление этого вектора — от источника к объекту.