Teigha.Geometry.Cone.GetHalfAngles
Метод позволяет получить косинус и синус угла между осью конуса и его образующей.
Метод позволяет получить косинус и синус угла между осью конуса и его образующей.
Returns: Возвращает массив, в котором элемент с индексом 0 представляет косинус угла, а с индексом 1 — синус угла между осью конуса и его образующей. Тип double[].