Teigha.DatabaseServices.NurbsData.GetWeights
Метод предоставляет коллекцию значений весов NURBS.
Метод предоставляет коллекцию значений весов NURBS.
Чем ближе значение веса к нулю, тем ближе кривая к прямой линии вблизи соответствующей управляющей вершины.
Если вес увеличивается, кривая приближается к соответствующей управляющей вершине.
Если вес уменьшается, кривая отдаляется от соответствующей управляющей вершины.
Returns: Возвращает коллекцию весов NURBS.
Тип DoubleCollection.