Teigha.DatabaseServices.PlotStyleNameType
Перечисление PlotStyleNameType представляет типы определения имени стиля печати.
Перечисление PlotStyleNameType представляет типы определения имени стиля печати.