Teigha.DatabaseServices.Arc
Класс Arc представляет в nanoCAD геометрический объект
quot;дугаquot;.
Класс Arc представляет в nanoCAD геометрический объект
quot;дугаquot;.

Teigha.DatabaseServices.Arc.#ctor
Конструктор по умолчанию.
Конструктор создаёт арку с нормалью (0,0,1),
центральной точкой (0,0,0) радиусом, начальным и конечными
углами, равными 0.0. Необходимо изменить радиус на ненулевое
значение перед закрытием объекта первый раз. Центральная
точка и вектор нормали должны быть в WCS координатах.

Teigha.DatabaseServices.Arc.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Конструктор с параметрами.
Этот конструктор создает дугу, используя передаваемые в него
значения. Значение параметра center должно быть в WCS
координатах. Дуга инициализируется с толщиной, равной 0.0.
center: Центральная точка дуги
normal: Вектор нормали к плоскости, на которой создается
radius: Радиус дуги
startAngle: Начальный угол дуги
endAngle: Конечный угол дуги

Teigha.DatabaseServices.Arc.#ctor(Teigha.Geometry.Point3d,System.Double,System.Double,System.Double)
Конструктор с параметрами.
Этот конструктор создает дугу, используя передаваемые в него
значения. Значение параметра center должно быть в WCS координатах.
Дуга инициализируется с вектором нормали, равным (0,0,1) и
толщиной, равной 0.0.
center: Центральная точка дуги
radius: Радиус дуги
startAngle: Начальный угол дуги
endAngle: Конечный угол дуги

Teigha.DatabaseServices.Arc.Center
Свойство предназначено для хранения координат центральной точки дуги.
Возвращает или устанавливает центральную точку дуги. Она
должна быть в WCS координатах.
Returns: Возвращает тип данных Point3d.
Notes
Значение центральной точки является эквивалентом DXF
группового кода 10.

Teigha.DatabaseServices.Arc.EndAngle
Свойство предназначено для хранения значения конечного угла дуги в радианах.
Устанавливает или возвращает конечный угол дуги, который
должен быть в радианах.
Returns: Тип данных double.
Notes
Угол отсчитывается от оси X OCS и является положительным при
движении против часовой стрелки, если смотреть вниз по оси Z
по направлению к центру системы координат. Ось X OCS
определяется с использованием нормали к дуге, оси Z WCS и с
помощью специального алгоритма задания осей Графического
редактора.
Если угол содержит отрицательное значение, дуга все еще
рисуется против часовой стрелки, но рассчитывается в
противоположном направлении. Например, дуга, заданная с углом
в 4,7124 радиана (270 градусов) это тот же угол, что и
\-1,5708 (-90 градусов).
Величина конечного угла используется для DXF группового кода
51.

Teigha.DatabaseServices.Arc.Length
Свойство предназначено для хранения значения длины дуги.
Возвращает длину дуги.
Returns: Тип данных double.

Teigha.DatabaseServices.Arc.Normal
Свойство предназначено для хранения вектора нормали к плоскости, содержащей дугу.
Возвращает или устанавливает вектор нормали к плоскости,
содержащей дугу. Нормаль должна быть в WCS координатах и
должна быть ненулевой длины.
Returns: Тип данных Vector3d.
Note
Значение нормали используется для группового кода 210 DXF.

Teigha.DatabaseServices.Arc.Radius
Свойство предназначено для хранения величины радиуса дуги.
Устанавливает или возвращает радиус дуги.
Returns: Тип данных double.
Note
Величина радиуса используется для группового кода 40 DXF.

Teigha.DatabaseServices.Arc.StartAngle
Свойство предназначено для хранения величины начального угла дуги в радианах.
Устанавливает или возвращает начальный угол дуги, который
должен быть в радианах.
Returns: Тип данных double.
Notes
Угол отсчитывается от оси X OCS и является положительным при
движении против часовой стрелки, если смотреть вниз по оси Z
по направлению к центру системы координат. Ось X OCS
определяется с использованием нормали к дуге, оси Z WCS и с
помощью специального алгоритма задания осей nanoCAD.
Если угол содержит отрицательное значение, дуга все еще
рисуется против часовой стрелки, но рассчитывается в
противоположном направлении. Например, дуга, заданная с углом
в 4,7124 радиана (270 градусов) это тот же угол, что и
\-1,5708 (-90 градусов).
Величина начального угла используется для DXF группового кода
50.

Teigha.DatabaseServices.Arc.Thickness
Свойство предназначено для хранения значения толщины линии, которой отрисовывается дуга.
Свойство хранит или устанавливает толщину линии дуги.
Returns: Тип данных double.
Notes
Толщина дуги — это размер дуги в направлении вдоль вектора
нормали (иногда называемое направление выталкивания).
Величина радиуса используется для группового кода 39 DXF.

Teigha.DatabaseServices.Arc.TotalAngle
Свойство предназначено для хранения величины развертки дуги сегмента угла.
Свойство хранит или устанавливает величину развертки дуги сегмента угла.
Returns: Тип данных double.