Teigha.BoundaryRepresentation.ComplexShellEnumerator
Класс ComplexShellEnumerator представляет перечислитель оболочек, соответствующих комплексу.
Класс ComplexShellEnumerator представляет перечислитель оболочек, соответствующих комплексу.

Teigha.BoundaryRepresentation.ComplexShellEnumerator.Current
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип Shell.