Teigha.DatabaseServices.AbstractViewportData
Класс AbstractViewportData является базовым классом  классов расширения протокола для объектов Viewport и ViewportTableRecord.
Класс AbstractViewportData является базовым классом  классов расширения протокола для объектов Viewport и ViewportTableRecord.

Teigha.DatabaseServices.AbstractViewportData.#ctor(Teigha.Runtime.RXObject)
Конструктор класса AbstractViewportData.
Создает экземпляр класса на основе указанного видового экрана.
Конструктор класса AbstractViewportData.
Создает экземпляр класса на основе указанного видового экрана.
pViewport: Исходный видовой экран. Тип RXObject.

Teigha.DatabaseServices.AbstractViewportData.SetProps(Teigha.Runtime.RXObject)
Метод позволяет переопределить свойства связанного видового экрана, используя свойства указанного вида.
Метод позволяет переопределить свойства связанного видового экрана, используя свойства указанного вида.
pSourceView: Входной вид, который служит источником данных для свойств. Тип RXObject.

Teigha.DatabaseServices.AbstractViewportData.CircleSides
Свойство CircleSides предоставляет доступ к количеству линейных сегментов, используемых при тесселяции окружностей.
Свойство CircleSides предоставляет доступ к количеству линейных сегментов, используемых при тесселяции окружностей в видовом экране.
Returns: Возвращает количество линейных сегментов, используемых для аппроксимации окружности.
Тип UInt16.

Teigha.DatabaseServices.AbstractViewportData.GridIncrement
Свойство GridIncrement представляет шаг сетки вдоль осей X и Y UCS (ПСК) в данном видовом экране.
Свойство GridIncrement представляет текущие значения шага сетки вдоль осей X и Y пользовательской системы координат (в единицах чертежа) в данном видовом экране.
Returns: Возвращает объект типа Vector2d, компоненты которого представляют шаг сетки вдоль соответствующей оси UCS (ПСК).

Teigha.DatabaseServices.AbstractViewportData.GsView
Свойство GsView предоставляет доступ к объекту GraphicsSystem.View, который связан с видовым экраном.
Свойство GsView предоставляет доступ к объекту GraphicsSystem.View, который связан с видовым экраном.
Returns: Возвращает объект GraphicsSystem.View, связанный с видовым экраном.

Teigha.DatabaseServices.AbstractViewportData.IsGridOn
Свойство IsGridOn позволяет определить, включен ли в видовом экране режим отображения сетки.
Свойство IsGridOn позволяет определить, включен ли в видовом экране режим отображения сетки.
Returns: Возвращает true, если режим отображения сетки включен.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewportData.IsSnapIsometric
Свойство IsSnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
Свойство IsSnapIsometric позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
Returns: Возвращает true, если изометрическая привязка является текущим типом шаговой привязки в видовом экране.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewportData.IsSnapOn
Свойство IsSnapOn позволяет определить, включен ли в видовом экране режим шаговой привязки.
Свойство IsSnapOn позволяет определить, включен ли в видовом экране режим шаговой привязки.
Returns: Возвращает true, если режим шаговой привязки включен.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewportData.IsUcsFollowModeOn
Свойство IsUcsFollowModeOn позволяет определить, включен ли в видовом экране переход к отображению в плане при переключении с одной UCS (ПСК) на другую.
Свойство UcsFollowModeOn позволяет определить, включен ли в видовом экране переход к отображению в плане при переключении с одной пользовательской системы координат (ПСК, UCS) на другую.
Когда этот режим включен, при каждом изменении ПСК в видовом экране происходит переключение на обновленный вид в плане.
Returns: Возвращает true, если при каждой смене ПСК включен переход к отображению в плане.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewportData.IsUcsIconAtOrigin
Свойство IsUcsIconAtOrigin позволяет определить, отображается ли в видовом экране значок UCS (ПСК) в начале пользовательской системы координат.
Свойство IsUcsIconAtOrigin позволяет определить, отображается ли в видовом экране значок UCS (ПСК) в начале пользовательской системы координат.
Returns: Возвращает true, если экране значок UCS (ПСК) отображается в начале пользовательской системы координат.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewportData.IsUcsIconVisible
Свойство IsUcsIconVisible позволяет определить, включено ли отображение значка UCS (ПСК) в видовом экране.
Свойство IsUcsIconVisible позволяет определить, включено ли отображение значка UCS (ПСК) в видовом экране.
Returns: Возвращает true, если отображение значка UCS (ПСК) включено.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewportData.IsUcsSavedWithViewport
Свойство IsUcsSavedWithViewport позволяет определить, сохраняется ли связь UCS (ПСК) с видовым экраном.
Свойство IsUcsSavedWithViewport позволяет определить, сохраняется ли связь UCS (ПСК) с видовым экраном.
Returns: Возвращает true, если связь UCS (ПСК) с видовым экраном сохраняется.
В противном случае возвращает false.

Teigha.DatabaseServices.AbstractViewportData.SnapAngle
Свойство SnapAngle представляет угол поворота шаговой привязки в видовом экране относительно текущей UCS (ПСК).
Свойство SnapAngle представляет угол поворота шаговой привязки в данном видовом экране относительно текущей пользовательской системы координат.
Notes
Угол поворота определяется в плоскости XY ПСК относительно оси X ПСК. Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть вдоль оси Z ПСК в сторону начала системы координат.
Returns: Возвращает угол поворота шаговой привязки (в радианах).
Тип double.

Teigha.DatabaseServices.AbstractViewportData.SnapBase
Свойство SnapBase представляет в видовом экране базовую точку шаговой привязки относительно текущей UCS (ПСК).
Свойство SnapBase представляет положение базовой (начальной) точки шаговой привязки в данном видовом экране относительно текущей пользовательской системы координат (ПСК, UCS).
Returns: Возвращает базовую точку шаговой привязки.
Тип Point2d.

Teigha.DatabaseServices.AbstractViewportData.SnapIncrement
Свойство SnapIncrement предоставляет доступ к интервалу шаговой привязки в видовом экране.
Свойство SnapIncrement предоставляет доступ к интервалу шаговой привязки в видовом экране.
Returns: Возвращает интервал шаговой привязки. Тип Vector2d.

Teigha.DatabaseServices.AbstractViewportData.SnapIsoPair
Свойство SnapIsoPair представляет плоскость изометрии для видового экрана.
Свойство SnapIsoPair представляет плоскость изометрии для видового экрана.
Допустимые значения:
Значение    Описание
--------    ---------------------
0           Левая изоплоскость.
1           Верхняя изоплоскость.
2           Правая изоплоскость.
Returns: Возвращает код плоскости изометрии.
Тип UInt16.