Teigha.DatabaseServices.PlotStyleTableChangedEventArgs
Класс PlotStyleTableChangedEventArgs представляет данные для события PlotStyleTableChanged в диспетчере листов.
Класс PlotStyleTableChangedEventArgs представляет данные для события PlotStyleTableChanged в диспетчере листов.

Teigha.DatabaseServices.PlotStyleTableChangedEventArgs.Id
Свойство Id представляет идентификатор объекта изменённого листа.
Свойство Id представляет идентификатор объекта изменённого листа.
Returns: Возвращает идентификатор объекта изменённого листа.
Тип ObjectId.

Teigha.DatabaseServices.PlotStyleTableChangedEventArgs.NewName
Свойство NewName представляет имя новой таблицы стилей печати, которую только что связали с листом, имеющим идентификатор Id.
Свойство NewName представляет имя новой таблицы стилей печати, которую только что связали с листом, имеющим идентификатор Id.
Returns: Возвращает имя таблицы стилей печати.
Тип String.