Teigha.DatabaseServices.ViewTableRecordRenderMode
Перечисление ViewTableRecordRenderMode определяет режимы рендеринга для записи таблицы видовых экранов.
Перечисление ViewTableRecordRenderMode определяет режимы рендеринга для записи таблицы видовых экранов.