Teigha.DatabaseServices.HatchLoopTypes.TextIsland
Значение: 128 = 0x80.
Текстовые контуры, окруженные четным количеством внешних контуров.
При выполнении сплошной заливки островные контуры текста игнорируются.