Teigha.DatabaseServices.Polyline3d
Класс Polyline3d представляет 3D-полилинию в nanoCAD.
Класс Polyline3d представляет 3D-полилинию в nanoCAD.

Teigha.DatabaseServices.Polyline3d.#ctor
Конструктор по умолчанию. Создает незамкнутую полилинию с типом SimplePoly.
Конструктор по умолчанию. Создает незамкнутую полилинию с типом SimplePoly.

Teigha.DatabaseServices.Polyline3d.#ctor(Teigha.DatabaseServices.Poly3dType,Teigha.Geometry.Point3dCollection,System.Boolean)
Конструктор. Создает новую полилинию с типом из перечисления Poly3dType, проходящую по заданным вершинам и, если необходимо, то замкнутую.
Конструктор. Создает новую полилинию с типом из перечисления Poly3dType, проходящую по заданным вершинам и, если необходимо, то замкнутую.
type: Тип создаваемой полилинии из перечисления Poly3dType.
vertices: Коллекция точек Point3d для вершин полилинии.  Тип Point3dCollection
closed: логический флаг замкнутости полилинии.  True, если замкнута, и false в противном случае.
Returns: Возвращает новый экземпляр класса Polyline3d.

Teigha.DatabaseServices.Polyline3d.AppendVertex(Teigha.DatabaseServices.PolylineVertex3d)
Метод добавляет в список вершин полилинии объект PolylineVertex3d, заданный аргументом vertexToAppend.
Метод добавляет в список вершин полилинии объект PolylineVertex3d, заданный аргументом vertexToAppend, и делает полилинию владельцем этой вершины.
Кроме того, если полилиния является резидентной в базе данных, то вершина добавляется в ту же базу данных.
В случае нерезидентной полилинии новая вершина будет добавлена в базу данных как только сама полилиния будет добавлена в эту базу данных.
В случае резидентной полилинии добавляемая вершина обязательно должна быть явным образом закрыта вызывающим приложением после возврата из метода AppendVertex().  В случае нерезидентной полилинии явно закрывать вершину не требуется, поскольку она еще не введена в базу данных.
vertexToAppend: Указатель на добавляемую в полилинию вершину.
Returns: Возвращает ObjectId новой вершины полилинии.

Teigha.DatabaseServices.Polyline3d.ConvertToPolyType(Teigha.DatabaseServices.Poly3dType)
Метод предназначен для преобразования полилинии в тип, указанный значением аргумента newVal.
Метод предназначен для преобразования полилинии в тип, указанный значением аргумента newVal.
Используется метод SplineFit().  DXF-код группы 75 заменяется на 6.
newVal: Новый тип полилинии из перечисления Poly3dType.

Teigha.DatabaseServices.Polyline3d.InsertVertexAt(DatabaseServices.ObjectId,Teigha.DatabaseServices.PolylineVertex3d)
Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, заданной ее идентификатором ObjectId.
Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, у которой ObjectId равен indexVertexId, а также делает полилинию владельцем вершины.
Кроме того, если полилиния является резидентной в базе данных, то в ту же базу данных будет добавлена и вершина.
Чтобы вставить вершину в начало полилинии, в аргументе indexVertexId следует передать NULL.
Если полилиния является резидентной в базе данных, то вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt().
indexVertexId: Идентификатор ObjectId вершины полилинии, после которой должна быть вставлена новая вершина. Чтобы вставить вершину в начало полилинии, в аргументе indexVertexId следует передать Null.
newVertex: указатель на добавляемую вершину, тип PolylineVertex3d.
Returns: Возвращает ObjectId новой вершины полилинии.

Teigha.DatabaseServices.Polyline3d.InsertVertexAt(Teigha.DatabaseServices.PolylineVertex3d,Teigha.DatabaseServices.PolylineVertex3d)
Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, заданной аргументом indexVertex.
Этот метод вставляет объект PolylineVertex3d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины PolylineVertex3d, заданной аргументом indexVertex, а затем делает полилинию владельцем вершины.
Для успешного выполнения этой операции полилиния должна быть резидентной в базе данных.
Чтобы вставить вершину в начало полилинии, в аргументе indexVertex следует передать значение Null.
Вставленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода InsertVertexAt().
indexVertex: Вершина PolylineVertex3d, после которой должна быть вставлена новая вершина. Чтобы вставить новую вершину в начало полилинии, в аргументе indexVertex следует передать Null.
newVertex: Вставляемая вершина, тип PolylineVertex3d.

Teigha.DatabaseServices.Polyline3d.SplineFit(Teigha.DatabaseServices.Poly3dType,System.Int32)
Метод выполняет аппроксимацию полилинии сплайном требуемого типа и с заданным количеством сегментов.
Метод выполняет аппроксимацию полилинии сплайном. Метод преобразует все простые вершины полилинии в контрольные вершины и создает новые вершины аппроксимирующего сплайна требуемого типа и с заданным количеством сегментов.
value: Тип нового аппроксимирующего сплайна из перечисления Poly3dType.
segments: Количество сегментов в аппроксимирующем сплайне.

Teigha.DatabaseServices.Polyline3d.Closed
Свойство позволяет определить, является ли данная полилиния замкнутой.
Свойство позволяет определить, является ли данная полилиния замкнутой.
Если требуется замкнуть полилинию, между последней и первой вершинами будет построен линейный сегмент, образующий замкнутый многоугольник.
Returns: Возвращает true, если данная полилиния является замкнутой, и false в противном случае.

Teigha.DatabaseServices.Polyline3d.Length
Свойство предоставляет доступ к текущему значению длины полилинии.
Свойство предоставляет доступ к текущему значению длины полилинии.
Returns: Возвращает длину полилинии как значение типа double.

Teigha.DatabaseServices.Polyline3d.PolyType
Свойство предоставляет доступ к типу аппроксимации для данной 3D полилинии в виде элемента перечисления Poly3dType.
Свойство предоставляет доступ к типу аппроксимации для данной 3D полилинии в виде элемента перечисления Poly3dType.
Returns: Возвращает значение из перечисления Poly3dType.