Teigha.Geometry.Scale3d.ToArray
Метод формирует на основе данного объекта трехэлементный массив масштабных коэффициентов по осям X, Y и Z.
Метод формирует на основе данного объекта трехэлементный массив масштабных коэффициентов по осям X, Y и Z.
Returns: Возвращает трехэлементный массив масштабных коэффициентов по осям X, Y и Z.
Тип double[]. Индекс 0 соответствует направлению X, индекс 1 - направлению Y, индекс 2 - направлению Z.