HostMgd.EditorInput.SelectionSetDelayMarshalled.Item
Метод предоставляет доступ по индексу к элементам набора выделенных объектов чертежа.
Не реализован.
Метод предоставляет доступ к элементу с индексом index в наборе выделенных объектов чертежа.
В текущей версии не реализован.
index: Входной индекс элемента в наборе выделенных объектов чертежа. Тип int.
Returns: Возвращает элемент с индексом index в наборе выделенных объектов чертежа.
Тип HostMgd.EditorInput.SelectedObject.