Teigha.BoundaryRepresentation.BrepShellEnumerator
Класс BrepShellEnumerator представляет перечислитель оболочек, соответствующих граничному представлению B-Rep.
Класс BrepShellEnumerator представляет перечислитель оболочек, соответствующих граничному представлению B-Rep.

Teigha.BoundaryRepresentation.BrepShellEnumerator.Current
Свойство Current предоставляет доступ к оболочке, которая является текущим элементом данного перечислителя.
Свойство Current предоставляет доступ к оболочке, которая является текущим элементом данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип Shell.