HostMgd.EditorInput.PromptIntegerOptionsEventArgs
Класс предоставляет данные для события PromptingForInteger,
позволяя настроить параметры ввода целого числа перед началом операции.
Класс используется в .NET API nanoCAD для передачи параметров при начале
интерактивного ввода целого числа — например, перед вызовом метода GetInteger().
Объект этого класса передаётся в обработчик события PromptingForInteger,
предоставляя доступ к настройкам ввода через свойство Options.
Через этот класс можно:
* изменить текст приглашения (Message),
* задать значение по умолчанию (DefaultValue),
* установить допустимый диапазон (LowerLimit, UpperLimit),
* управлять режимами ввода (AllowNone, AllowNegative, AllowZero и др.).
Это позволяет гибко настраивать поведение команды ввода в зависимости от контекста —
например, при создании команд, требующих ввода количества копий,
номера слоя, параметра массива и других целочисленных значений.
Example
C#

HostMgd.EditorInput.PromptIntegerOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при интерактивном вводе целого числа.
Свойство возвращает объект типа PromptIntegerOptions,
содержащий настройки команды ввода целого числа —
такие как сообщение приглашения, значение по умолчанию,
допустимый диапазон и режимы ввода.
Оно используется в обработчике события PromptingForInteger
для динамической модификации параметров команды GetInteger()
перед началом взаимодействия с пользователем.
Returns: Возвращает объект типа PromptIntegerOptions, содержащий:
* Message — текст приглашения,
* DefaultValue — значение, используемое при нажатии Enter,
* LowerLimit / UpperLimit — минимальное и максимальное допустимые значения,
* AllowNone — разрешение на пропуск ввода,
* AllowNegative — разрешение на отрицательные значения,
* AllowZero — разрешение на ввод нуля.
Если объект не был инициализирован, может вернуть null.
Example
C#