Teigha.DatabaseServices.DwgFiler.ReadUInt64
Метод предназначен для получения 64-разрядного целого числа без знака (UInt64) из текущего элемента данного объекта Filer.
Метод предназначен для получения 64-разрядного целого числа без знака (UInt64) из текущего элемента данного объекта Filer.
Returns: Возвращает значение 64-разрядного целого числа без знака. Тип ulong.