Teigha.Geometry.Matrix2d
Структура Matrix2d представляет двумерное афинное геометрическое преобразование (перемещение, вращение, масштабирование).
Структура Matrix2d представляет двумерное афинное геометрическое преобразование (перемещение, вращение, масштабирование).
Объекты Matrix2d можно рассматривать как двумерные массивы размерности 3х3.
Матрица преобразования M имеет вид
a00   a01   t0
a10   a11   t1
0     0     1
Так называемую линейную часть матрицы M составляют элементы
a00   a01
a10   a11
Трансляционную часть матрицы M образует столбец
t0
t1
Нижняя строка матрицы не используется.
Преобразование двумерной точки P описывается матричным произведением M x P, где точка P представлена столбцом (p.x, p.y, 1.0)^T.
Преобразование 2D-вектора V описывается матричным произведением M x V, где вектор V представлен столбцом (v.x, v.y, 0.0)^T.
Всякую матрицу M можно использовать для описания системы координат. Такая система координат имеет начало в точке (t0, t1) и орты (a00, a10) и (a01, a11).
Матрица описывает преобразование координат из стандартной системы координат с началом (0, 0) и осями (1, 0) и (0, 1).

Teigha.Geometry.Matrix2d.#ctor(array)
Конструктор структуры Matrix2d.
Создает матрицу, элементы которой сформированы на основе данных из переданного массива.
Конструктор структуры Matrix2d.
Создает матрицу, элементы которой сформированы на основе данных из переданного массива.
Notes
Матрица заполняется значениями из первых девяти элементов массива data (матрица в однородных координатах).
Элементы матрицы задаются последовательно по строкам (data11, data12 ... data33).
data: Входной массив. Тип double[].

Teigha.Geometry.Matrix2d.AlignCoordinateSystem(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод предоставляет матрицу, которая преобразует одну систему координат в другую.
Каждая из систем координат указывается точкой начала и двумя осями.
Метод предоставляет матрицу, которая преобразует систему координат с началом fromOrigin и осями fromE0 и fromE1
в систему координат с началом toOrigin и осями toE0 и toE1.
fromOrigin: Точка начала исходной системы координат. Тип Point2d.
fromE0: Ось X исходной системы координат. Тип Vector2d.
fromE1: Ось Y исходной системы координат. Тип Vector2d.
toOrigin: Точка начала целевой  системы координат. Тип Point2d.
toE0: Ось X целевой  системы координат. Тип Vector2d.
toE1: Ось Y целевой  системы координат. Тип Vector2d.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.Displacement(Teigha.Geometry.Vector2d)
Метод формирует трансляционную часть матрицы преобразования на основе указанного вектора.
Метод формирует трансляционную часть матрицы преобразования на основе указанного вектора.
vector: Входной вектор переноса. Тип Vector2d.
Returns: Возвращает матрицу преобразования, трансляционная часть которой определяется вектором vector.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.Equals(Object)
Метод предназначен для проверки на равенство данного объекта и указанного объекта.
Метод предназначен для проверки на равенство данного объекта и указанного объекта.
Равенство матриц означает одновременное равенство всех соответствующих элементов обеих матриц.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, с которым сравнивается данная матрица. Тип Object.
Returns: Возвращает true, если obj не является нулевым, и каждый столбец данной матрицы равен соответствующему столбцу матрицы obj.
В противном случае возвращает false.

Teigha.Geometry.Matrix2d.IsConformal(Teigha.Geometry.Matrix2dInfo)
Метод позволяет проверить, представляет ли данная матрица конформное линейное преобразование.
Векторы в столбцах конформной матрицы равны по длине и взаимно ортогональны.
Метод позволяет проверить, представляет ли данная матрица конформное линейное преобразование, и возвращает сведения о масштабном коэффициенте, угле поворота, наличии зеркального отражения и направлении такого отражения.
Notes
Векторы в столбцах конформной матрицы равны по длине и взаимно ортогональны.
Проверка ортонормированности реализована в методе Matrix2d.IsUniscaledOrtho().
info: Выходной объект типа Matrix2dInfo, который предоставляет информацию о масштабном коэффициенте, угле поворота, наличии зеркального отражения и направлении зеркального отражения.
Returns: Возвращает true, если геометрическое преобразование, описываемое матрицей, является конформным, т.е. векторы в столбцах матрицы равны по длине и ортогональны друг другу.  В противном случае возвращает false.

Teigha.Geometry.Matrix2d.IsEqualTo(Teigha.Geometry.Matrix2d)
Метод реализует проверку равенства двух матриц с использованием точности по умолчанию.
Метод позволяет проверить, равна ли данная матрица указанной матрице.
Используется вызов метода Matrix2d.IsEqualTo(Matrix2d a, Tolerance tolerance) с точностью по умолчанию, которая равна Tolerance.Global.
a: Входная матрица, которая сравнивается с данной. Тип Matrix2d.
Returns: Возвращает true, если в пределах используемой точности каждый элемент данной матрицы равен соответствующему элементу матрицы a.
В противном случае возвращает false.

Teigha.Geometry.Matrix2d.IsEqualTo(Teigha.Geometry.Matrix2d,Teigha.Geometry.Tolerance)
Метод реализует проверку равенства двух матриц с использованием указанной точности.
Метод позволяет проверить равенство данной матрицы и указанной матрицы с использованием заданной точности.
a: Входная матрица, которая сравнивается с данной. Тип Matrix2d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности каждый элемент данной матрицы равен соответствующему элементу матрицы a, соответственно, обе матрицы можно считать равными.  В противном случае возвращает false.

Teigha.Geometry.Matrix2d.IsScaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах указанной точности.
Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах указанной точности.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true, если с указанной точностью tolerance векторы в линейной части данной матрицы можно считать ортогональными друг другу. В противном случае возвращает false.

Teigha.Geometry.Matrix2d.IsSingular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
Notes
Матрица является сингулярной, если для направляющих векторов координатных осей, возвращаемых свойством Matrix2d.CoordinateSystem2d, в пределах используемой точности выполняется хотя бы одно из следующих условий:
* по крайней мере один из векторов имеет нулевую длину;
* векторы являются параллельными друг другу.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой точности хотя бы один из направляющих векторов координатных осей, возвращаемых свойством Matrix2d.CoordinateSystem2d, является нулевым, или эти векторы параллельны друг другу.
В противном случае возвращает false.

Teigha.Geometry.Matrix2d.IsUniscaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу в пределах заданной точности.
Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу в пределах заданной точности.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance векторы в линейной части матрицы можно считать равными по длине и перпендикулярными друг другу. В противном случае возвращает false.

Teigha.Geometry.Matrix2d.Mirroring(Teigha.Geometry.Point2d)
Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной точки.
Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной точки.
point: Точка зеркального отражения. Тип Point2d.
Returns: Возвращает матрицу зеркального отражения относительно точки point.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.Mirroring(Teigha.Geometry.Line2d)
Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной оси.
Метод предоставляет матрицу, которая описывает зеркальное отражение относительно оси line.
line: Ось зеркального отражения. Тип Line2d.
Returns: Возвращает матрицу зеркального отражения относительно оси line.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.Multiply(Teigha.Geometry.Matrix2d)
Метод реализует левое умножение данной матрицы на указанную матрицу, являющуюся левым множителем.
Метод реализует левое умножение данной матрицы на матрицу matrix, являющуюся левым множителем, что эквивалентно применению метода Matrix2d.PreMultiplyBy(matrix).
Результат произведения (matrix) х (данная матрица) сохраняется в данной матрице.
matrix: Входная матрица, которая является левым множителем в матричном произведении. Тип Matrix2d.
Returns: Возвращает результат левого произведения данной матрицы на матрицу matrix.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.PostMultiplyBy(Teigha.Geometry.Matrix2d)
Метод реализует правое умножение данной матрицы на указанную матрицу, являющуюся правым множителем.
Метод реализует правое умножение данной матрицы на матрицу rightSide, которая в произведении выполняет роль правого множителя.
Результат произведения (данная матрица) х (rightSide) сохраняется в данной матрице.
rightSide: Входная матрица, которая в произведении является правым множителем. Тип Matrix2d.
Returns: Возвращает результат правого произведения данной матрицы на матрицу rightSide.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.PreMultiplyBy(Teigha.Geometry.Matrix2d)
Метод реализует левое умножение данной матрицы на указанную матрицу, являющуюся левым множителем.
Метод реализует левое умножение данной матрицы на матрицу leftSide, являющуюся левым множителем.
Результат произведения (leftSide) х (данная матрица) сохраняется в данной матрице.
leftSide: Входная матрица, которая в произведении является левым множителем. Тип Matrix2d.
Returns: Возвращает результат левого произведения данной матрицы на матрицу leftSide.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.Rotation(System.Double,Teigha.Geometry.Point2d)
Метод предоставляет матрицу, которая реализует вращение вокруг указанной точки на заданный угол.
Метод предоставляет матрицу, которая реализует вращение вокруг точки center на угол angle.
angle: Входное значение угла вращения.     Тип double.
center: Входные координаты центра вращения. Тип Point2d.
Returns: Возвращает матрицу преобразования, которая описывает вращение вокруг точки center на угол angle.
Тип Matrix2d.

Teigha.Geometry.Matrix2d.Scaling(System.Double,Teigha.Geometry.Point2d)
Метод предоставляет матрицу равномерного масштабирования относительно указанной точки с заданным коэффициентом масштабирования.
Метод предоставляет матрицу равномерного масштабирования относительно точки center с коэффициентом масштабирования scaleAll.
scaleAll: Масштабирующий множитель. Тип double.
center: Точка, относительно которой выполняется масштабирование. Тип Point2d.
Returns: Возвращает матрицу геометрического преобразования для равномерного масштабирования относительно точки center с коэффициентом масштабирования scaleAll.  Тип Matrix2d.

Teigha.Geometry.Matrix2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данной матрицы с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данной матрицы с учетом заданных языковых и региональных настроек.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данной матрицы с учетом заданных языковых и региональных настроек.
Тип String.

Teigha.Geometry.Matrix2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данной матрицы в заданном формате и с учетом указанных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данной матрицы в заданном формате и с учетом указанных языковых и региональных настроек.
format: Предписанный формат строкового представления. Тип String.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данной матрицы, которое учитывает заданный формат и предписанные языковые и региональные настройки. Тип String.

Teigha.Geometry.Matrix2d.!=(Teigha.Geometry.Matrix2d,Teigha.Geometry.Matrix2d)
Оператор неравенства для структуры Matrix2d.
Оператор неравенства для структуры Matrix2d.
a: Левый операнд.  Тип Matrix2d.
b: Правый операнд. Тип Matrix2d.
Returns: Возвращает true, если не равны значения хотя бы в одной паре соответствующих элементов двух матриц.
В противном случае возвращает false.

Teigha.Geometry.Matrix2d.*(Teigha.Geometry.Matrix2d,Teigha.Geometry.Matrix2d)
Оператор умножения для структуры Matrix2d.
Оператор умножения для структуры Matrix2d.
Выполняет матричное умножение левого операнда на правый операнд (a x b).
a: Левый  операнд. Тип Matrix2d.
b: Правый операнд. Тип Matrix2d.
Returns: Возвращает результат матричного умножения (a x b).
Тип Matrix2d.

Teigha.Geometry.Matrix2d.==(Teigha.Geometry.Matrix2d,Teigha.Geometry.Matrix2d)
Оператор равенства для структуры Matrix2d.
Оператор равенства для структуры Matrix2d.
a: Левый операнд.  Тип Matrix2d.
b: Правый операнд. Тип Matrix2d.
Returns: Возвращает true, если равны все соответствующие элементы матриц a и b.
В противном случае возвращает false.

Teigha.Geometry.Matrix2d.CoordinateSystem2d
Свойство CoordinateSystem2d представляет начало и оси системы координат, в которую данная матрица отображает стандартную систему координат с началом (0,0) и осями (1,0) и (0,1).
Свойство CoordinateSystem2d представляет начало и оси системы координат, в которую данная матрица отображает стандартную систему координат с началом (0,0) и осями (1,0) и (0,1).
Returns: Возвращает объект Geometry.CoordinateSystem2d, который представляет начало и оси системы координат.

Teigha.Geometry.Matrix2d.ElementAt
Свойство ElementAt представляет элементы матрицы по их индексам.
Свойство ElementAt представляет элементы матрицы по их индексам.
i: Номер строки  элемента. Тип int.
j: Номер столбца элемента. Тип int.
Returns: Возвращает элемент матрицы в строке i и столбце j.
Тип double.

Teigha.Geometry.Matrix2d.Translation
Свойство Translation представляет трансляционную часть данной матрицы преобразования.
Свойство Translation представляет трансляционную часть данной матрицы преобразования.
Returns: Возвращает вектор переноса, который представлен трансляционной частью матрицы.
Тип Vector2d.