Teigha.DatabaseServices.SecurityParameters.GetHashCode
Метод предоставляет хеш-код данного объекта.
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код данного объекта. Тип int.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство сравниваемых объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать данный GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.