Teigha.GraphicsInterface.MaterialOpacityComponent
Структура MaterialOpacityComponent представляет компонент непрозрачности для материала.
Структура MaterialOpacityComponent представляет компонент (канал) непрозрачности для материала.

Teigha.GraphicsInterface.MaterialOpacityComponent.#ctor(System.Double,Teigha.GraphicsInterface.MaterialMap)
Конструктор структуры MaterialOpacityComponent.
Создает экземпляр структуры с указанным процентом непрозрачности и картой материала.
Конструктор структуры MaterialOpacityComponent.
Создает новый экземпляр структуры с указанным процентом непрозрачности и картой материала, которая определяет, как именно используется значение непрозрачности.
percentage: Процент непрозрачности. Тип double.
map: Карта материала. Тип MaterialMap.

Teigha.GraphicsInterface.MaterialOpacityComponent.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialOpacityComponent.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки.
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки.  Результирующая строка включает карту материала и значение непрозрачности.
provider: Провайдер языковых и региональных настроек.  Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.

Teigha.GraphicsInterface.MaterialOpacityComponent.!=(Teigha.GraphicsInterface.MaterialOpacityComponent,Teigha.GraphicsInterface.MaterialOpacityComponent)
Оператор неравенства структуры MaterialOpacityComponent.
Оператор неравенства структуры MaterialOpacityComponent.
Позволяет установить факт неравенства двух компонентов непрозрачности MaterialOpacityComponent.
Notes
Критерием неравенства двух экземпляров структуры MaterialOpacityComponent является невыполнение хотя бы одного из следующих условий:
* Карты материалов операндов равны (либо обе равны null);
* Значения процента непрозрачности операндов равны.
a: Левый операнд.  Тип MaterialOpacityComponent.
b: Правый операнд. Тип MaterialOpacityComponent.
Returns: Возвращает true, если левый операнд не равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialOpacityComponent.==(Teigha.GraphicsInterface.MaterialOpacityComponent,Teigha.GraphicsInterface.MaterialOpacityComponent)
Оператор равенства структуры MaterialOpacityComponent.
Оператор равенства структуры MaterialOpacityComponent.
Позволяет установить факт равенства двух компонентов непрозрачности MaterialOpacityComponent.
Notes
Критерием равенства двух экземпляров структуры MaterialOpacityComponent является совместное выполнение следующих условий:
* Карты материалов операндов равны (либо обе равны null);
* Значения процента непрозрачности операндов равны.
a: Левый операнд.  Тип MaterialOpacityComponent.
b: Правый операнд. Тип MaterialOpacityComponent.
Returns: Возвращает true, если левый операнд равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialOpacityComponent.Map
Свойство Map представляет карту материала, связанную с данным объектом.
Свойство Map представляет карту материала, связанную с данным объектом.
Returns: Возвращает карту материала.
Тип MaterialMap.

Teigha.GraphicsInterface.MaterialOpacityComponent.Percentage
Свойство Percentage представляет текущее значение непрозрачности.
Свойство Percentage представляет текущее значение непрозрачности.
Returns: Возвращает значение непрозрачности.
Тип double.