Teigha.DatabaseServices.GeomRef
Класс GeomRef является базовым для конкретных производных классов, таких как EdgeRef, FaceRef и VertexRef.
Эти простые классы, которые хранят ссылку на подобъект объекта чертежа и используются главным образом не для хранения, а для передачи информации о геометрии подобъекта.
Класс GeomRef является базовым для конкретных производных классов, таких как EdgeRef, FaceRef и VertexRef.
Эти простые классы, которые хранят ссылку на подобъект объекта чертежа и используются главным образом не для хранения, а для передачи информации о геометрии подобъекта.
Ссылки на подобъекты не являются постоянными.
При всяком изменении или перевычислении родительского объекта ссылка на его подобъект становится недействительной.

Teigha.DatabaseServices.GeomRef.IsEmpty
Свойство позволяет проверить, не является ли данный объект пустым, когда он не ссылается ни на какую геометрию.
Свойство позволяет проверить, не является ли данный объект пустым, когда он не ссылается ни на какую геометрию.
Returns: Возвращает true, если данный объект является пустым.  В противном случае возвращает false.

Teigha.DatabaseServices.GeomRef.IsValid
Свойство позволяет проверить, является ли данный объект действительным.
Свойство позволяет проверить, является ли данный объект действительным.
Returns: Возвращает true, если данный объект является действительным.
В противном случае возвращает false.