Teigha.DatabaseServices.DimAssoc.AddToPointRefReactor
Метод добавляет реактор между геометрией и связанным с ней ассоциативным размером для каждого фрагмента геометрии в опорных точках.
Метод добавляет реактор между геометрией и связанным с ней ассоциативным размером для каждого фрагмента геометрии в опорных точках.