Teigha.DatabaseServices.AuditInfo.ResetNumEntities
Метод обнуляет количество объектов, поддерживаемых данным экземпляром AuditInfo.
Метод обнуляет количество объектов, поддерживаемых данным экземпляром AuditInfo.