Teigha.DatabaseServices.HostApplicationServices.UserBreak
Метод вызывается (обычно кодом базы данных), чтобы определить, ввел ли пользователь команду CTRL+C.
В текущей версии метод не реализован.
Метод вызывается (обычно кодом базы данных), чтобы определить, ввел ли пользователь команду CTRL+C.
В текущей версии метод не реализован.
Returns: Возвращает true, если пользователь нажал CTRL+C.
В противном случае возвращает false.