HostMgd.PlottingServices.PlotConfigInfo.FullPath
Полный путь доступа учтройства.
Если это принтер, то значение совпадает со значением DeviceName.
Если файл PC3 - свойство возаращает полный путь доступа к файлу.