Teigha.Geometry.Vector2d.Negate
Метод меняет направление данного вектора на противоположное.
Метод преобразует данный объект в вектор с координатами (-x, -y), меняя его направление на противоположное.
Returns: Возвращает вектор, обратный данному.
Тип Vector2d.