Teigha.Geometry.PlanarEntity.GetCoordinateSystem
Метод предоставляет каноническую ортонормированную систему координат плоскости данного объекта.
Метод предоставляет каноническую ортонормированную систему координат плоскости данного объекта.
Такая система координат определена следующим образом:
Параметр            Описание                                                                Вычисляется как
---------           -----------------------------------------                               ----------------------------------
origin       Точка начала на плоскости.                                              origin
axis1        Единичный вектор в плоскости.                                           uAxis.normal()
axis2        Единичный вектор в плоскости, перпендикулярный вектору axis1.    Normal.crossProduct(axis1)
Returns: Возвращает систему координат плоскости данного объекта.
Тип CoordinateSystem3d.