HostMgd.EditorInput.Editor.SelectionAdded
Событие возникает при добавлении одного или нескольких
объектов в текущий набор выделенных объектов в редакторе nanoCAD.
Событие нициируется системой nanoCAD при изменении набора
выбранных объектов, когда один или несколько объектов добавляются
в выборку — например, при щелчке по объекту, выделении рамкой
или использовании режима добавления (с клавишей Shift или кнопкой "Добавить").
Оно предоставляет доступ к новым объектам через объект SelectionSet,
что позволяет разработчику отслеживать динамику выборки и реагировать на неё
— например, обновлять панель свойств, активировать инструменты,
запускать анализ или визуализировать выбранные элементы.
Событие реализуется через делегат SelectionAddedEventHandler
и вызывается автоматически при каждом расширении выборки.
Example
C#