Teigha.Geometry.ExternalBoundedSurface
Класс ExternalBoundedSurface представляет ограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
Класс ExternalBoundedSurface представляет ограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
Логически каждый экземпляр ExternalBoundedSurface включает экземпляр ExternalSurface, представляющий геометрию неограниченной поверхности, и коллекцию экземпляров CurveBoundary, каждый из которых представляет некоторую границу на этой неограниченной поверхности.
С экземплярами ExternalBoundedSurface можно работать как с любыми объектами Surface.
Следует учитывать, что данное представление является геометрическим, в классе ExternalBoundedSurface не представлена никакая топологическая информация.
Операции, характерные для ограниченных поверхностей, в своих алгоритмах учитывают границы (пример — вычисление ближайших точек).
Доступ к ExternalBoundedSurface можно получить как к соответствующей поверхности Surface, если она существует.
Кроме того, что более эффективно, можно получить доступ к внешним данным в их нативной форме.
Одним из примеров использования ExternalBoundedSurface является доступ к поверхности ACIS.

Teigha.Geometry.ExternalBoundedSurface.#ctor
Конструктор по умолчанию класса ExternalBoundedSurface.
Конструктор по умолчанию класса ExternalBoundedSurface.
Создает пустой экземпляр по умолчанию с нулевым указателем на определение поверхности, неопределенным типом поверхности (другими словами, нет информации о системе, в которой была создана внешняя ограниченная поверхность) и опцией предотвращения копирования внешней поверхности.

Teigha.Geometry.ExternalBoundedSurface.#ctor(IntPtr,Teigha.Geometry.ExternalEntityKind)
Конструктор класса ExternalBoundedSurface.
Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
Конструктор класса ExternalBoundedSurface.
Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
surfaceDefinition: Входное определение внешней поверхности. Тип IntPtr.
surfaceKind: Информация о системе, в которой было создано определение внешней ограниченной поверхности. Перечисление ExternalEntityKind.

Teigha.Geometry.ExternalBoundedSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип ExternalBoundedSurface.

Teigha.Geometry.ExternalBoundedSurface.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Текущее определение данного объекта удаляется.
surfaceDef: Указатель на определение внешней ограниченной поверхности. Тип IntPtr.
surfaceKind: Информация о системе, в которой было создано определение внешней ограниченной поверхности. Перечисление ExternalEntityKind.

Teigha.Geometry.ExternalBoundedSurface.BaseSurface
Свойство BaseSurface предоставляет доступ к геометрии базовой неограниченной поверхности.
Свойство BaseSurface предоставляет доступ к геометрии базовой неограниченной поверхности (т.е. неограниченной ничем, кроме своих параметрических границ, если таковые имеются).
Результат преобразуется в нативную поверхность, если соответствующий нативный тип поверхности существует.
Returns: Возвращает базовую неограниченную поверхность для данного объекта. Тип Surface.

Teigha.Geometry.ExternalBoundedSurface.ExternalBaseSurface
Свойство ExternalBaseSurface представляет внешнюю базовую поверхность в ее исходном виде.
Свойство ExternalBaseSurface представляет внешнюю базовую поверхность в ее исходном виде.
Знание точного определения внешнего объекта потенциально обеспечивает эффективный доступ к объекту в его исходном виде.
Вызывающая сторона несет ответственность за высвобождение использованной при этом памяти.
Returns: Возвращает внешнюю базовую поверхность. Тип Surface.

Teigha.Geometry.ExternalBoundedSurface.ExternalSurfaceDefinition
Свойство ExternalSurfaceDefinition представляет определение внешней поверхности, связанной с данным объектом.
Свойство ExternalSurfaceDefinition представляет определение внешней поверхности, связанной с данным объектом.
Returns: Возвращает указатель на определение внешней поверхности. Тип IntPtr.

Teigha.Geometry.ExternalBoundedSurface.ExternalSurfaceKind
Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней ограниченной поверхности.
Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней ограниченной поверхности.
Returns: Возвращает информацию о системе, в которой было создано определение данного объекта.
Тип Geometry.ExternalEntityKind.

Teigha.Geometry.ExternalBoundedSurface.IsCone
Свойство IsCone позволяет проверить, является ли неограниченная базовая поверхность данного объекта конусом.
Свойство IsCone определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является конусом.
Returns: Возвращает true, если неограниченная базовая поверхность является конусом.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsCylinder
Свойство IsCylinder позволяет проверить, является ли неограниченная базовая поверхность данного объекта цилиндром.
Свойство IsCylinder определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является цилиндром.
Returns: Возвращает true, если неограниченная базовая поверхность является цилиндром.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsDefined
Свойство IsDefined позволяет проверить, является ли данный объект определенным.
Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение поверхности.
Returns: Возвращает true, если данный объект имеет определение поверхности.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsEllipCone
Свойство IsEllipCone позволяет проверить, является ли неограниченная базовая поверхность данного объекта эллиптическим конусом.
Свойство IsEllipCone определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является эллиптическим конусом.
Returns: Возвращает true, если неограниченная базовая поверхность данного объекта является эллиптическим конусом.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsEllipCylinder
Свойство IsEllipCylinder позволяет проверить, является ли неограниченная базовая поверхность данного объекта эллиптическим цилиндром.
Свойство IsEllipCylinder определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является эллиптическим цилиндром.
Returns: Возвращает true, если неограниченная базовая поверхность данного объекта является эллиптическим цилиндром.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsExternalSurface
Свойство IsExternalSurface позволяет убедиться, что базовая поверхность данного объекта является внешней поверхностью.
Свойство IsExternalSurface позволяет убедиться, что базовая поверхность данного объекта является внешней поверхностью.
Notes
Если проверки конкретного типа (IsCone, IsEllipCone, IsCylinder, IsEllipCylinder, IsNurbs, IsPlane, IsSphere, IsTorus) не дали положительного результата, но объект определён, то свойство IsExternalSurface должно возвращать true.
Returns: Возвращает true, если базовая поверхность данного объекта является внешней поверхностью.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsNurbs
Свойство IsNurbs позволяет проверить, является ли неограниченная базовая поверхность данного объекта NURBS поверхностью.
Свойство IsNurbs определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является NURBS поверхностью.
Returns: Возвращает true, если базовая поверхность данного объекта является NURBS поверхностью.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsOwnerOfSurface
Свойство IsOwnerOfSurface позволяет проверить, что данный объект является владельцем данных своего определения.
Свойство IsOwnerOfSurface позволяет проверить, что данный объект является владельцем данных своего определения.
Returns: Возвращает true, если данный объект является владельцем данных своего определения.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsPlane
Свойство IsPlane  позволяет проверить, является ли неограниченная базовая поверхность данного объекта плоскостью.
Свойство IsPlane определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является плоскостью.
Returns: Возвращает true, если базовая поверхность данного объекта является плоскостью.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsSphere
Свойство IsSphere позволяет проверить, является ли неограниченная базовая поверхность данного объекта сферой.
Свойство IsSphere определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является сферой.
Returns: Возвращает true, если базовая поверхность данного объекта является сферой.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.IsTorus
Свойство IsTorus позволяет проверить, является ли неограниченная базовая поверхность данного объекта тором.
Свойство IsTorus определяет тип неограниченной базовой поверхности данного объекта и возвращает true, если она является тором.
Returns: Возвращает true, если базовая поверхность данного объекта является тором.
В противном случае возвращает false.

Teigha.Geometry.ExternalBoundedSurface.NumContours
Свойство NumContours представляет количество криволинейных границ на этой поверхности.
Свойство NumContours представляет количество криволинейных границ на этой поверхности.
Returns: Возвращает  количество криволинейных границ на этой внешней ограниченной поверхности.
Тип int.