Teigha.DatabaseServices.Xrecord
Класс Xrecord — это класс для хранения и управления произвольными данными.
Класс Xrecord предназначен для хранения и управления произвольными данными без ограничений по размеру, которые имеются у Xdata (16 КБ на одну запись).
Каждый объект Xrecord может хранить до 2 Gb.
Данные формата Xrecord используются в словарях расширения. Если в словарь расширения объекта добавить Xrecord, то с таким объектом можно связать большой объем данных.
Как и в случае с Xdata, для доступа к данным класса Xrecord используется класс ResultBuffer, однако Xrecord работает со стандартными групповыми кодами DXF, значения которых меньше 1000:
Групповые коды XRECORD
Код           Описание
------------  -------------------------------------------------------
100           Маркер подкласса (Xrecord)
280           Флаг клонирования повторяющихся записей (выбор способа
объединения повторяющихся записей):0 =
неприменимо1 = оставить существующие2 =
использовать клонирование3 = lt;внешняя
ссылкаgt;$0$lt;имяgt;4 = $0$lt;имяgt;5
= восстановить имя
1–369 (за     Эти значения могут использоваться в приложении любым
исключением   способом
значений 5
и 105)
Это означает, что помимо всех обычно используемых типов данных Xrecord может хранить идентификаторы объектов любого из четырех типов:
Идентификатор		Код dxf
----------------	--------
HardOwnershipId  	360
HardPointerId  		340
SoftOwnershipId  	350
SoftPointerId  		330
Это позволяет хранить в Xrecord идентификаторы объектов, в том числе и других записей Xrecord.

Teigha.DatabaseServices.Xrecord.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.Xrecord.Data
Данное свойство обеспечивает доступ к данным XRecord.
Данное свойство обеспечивает доступ к данным XRecord.
Returns: Возвращает или изменяет данные XRecord. Тип ResultBuffer.

Teigha.DatabaseServices.Xrecord.XlateReferences
Данное свойство предоставляет доступ к логическому значению, которое указывает, требуется ли трансляция ссылок.
Данное свойство предоставляет доступ к логическому значению, которое указывает, требуется ли трансляция ссылок.
Returns: Возвращает или задает логическое значение, которое определяет необходимость трансляции ссылок. Тип bool.

Teigha.DatabaseServices.Xrecord.MergeStyle
Данное свойство задает стиль слияния для операций вставки.
Данное свойство задает стиль слияния для операций вставки.
Returns: Возвращает стиль слияния из перечисления Teigha.DatabaseServices.DuplicateRecordCloning.