HostMgd.EditorInput.SelectionAddedEventHandler
Делегат предназначен для обработки события,
возникающего при добавлении объектов в текущий
набор выделенных объектов.
Делегат используется как сигнатура метода-обработчика для события SelectionAdded,
которое генерируется в редакторе nanoCAD каждый раз, когда один или несколько объектов
добавляются в выборку. Он позволяет разработчику плагина отслеживать изменения в наборе
выбранных объектов и реагировать на них — например, обновлять пользовательский интерфейс,
активировать команды, запускать анализ или визуализировать новые элементы.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий данные о добавленных в выборку объектах чертежа