Teigha.DatabaseServices.DxfFiler.ReadUInt32
Метод возвращает 32-разрядное целое число без знака (uint) из текущего элемента этого объекта Filer.
Метод возвращает 32-разрядное целое число без знака (uint) из текущего элемента этого объекта Filer.
Returns: Возвращает 32-разрядное целое число без знака. Тип uint.