HostMgd.ApplicationServices.ConfigurationSectionOnRegistry
Класс для создания, хранения
и управления данными конфигурации приложения.

HostMgd.ApplicationServices.ConfigurationSectionOnRegistry.#ctor(String ,System.Boolean)
Конструктор.
name: Имя секции конфигурации

HostMgd.ApplicationServices.ConfigurationSectionOnRegistry.ReadProperty(String,System.Object)
Метод возвращает значение свойства с именем name. Если такого имени свойства нет, то
должно быть возвращено значение defaultValue.
name: Имя свойства
defaultValue: Значение по умолчанию, возвращаемое методом

HostMgd.ApplicationServices.ConfigurationSectionOnRegistry.WriteProperty(String,System.Object)
Метод присваивает значение value свойству с именем name.
name: Имя свойства
value: Присваиваемое значение

HostMgd.ApplicationServices.ConfigurationSectionOnRegistry.IsReadOnly
Возвращает признак того, является ли объект доступным только
на чтение.