Teigha.DatabaseServices.PolygonMesh.GetEnumerator
Метод предназначен для получения объекта перечислителя для этой коллекции.
Метод возвращает объект перечислителя для этой коллекции.
Returns: Возвращает объект System.Collections.IEnumerator.