HostMgd.ApplicationServices.DocumentCollectionEventArgs
Класс, обеспечивающий данными различные события класса
DocumentCollection.

HostMgd.ApplicationServices.DocumentCollectionEventArgs.Document
Соответствует функции HostApDocManager.document().
Ссылка на документ, который принадлежит входной базе данных.
Все базы данных созданные в nanoCAD API, текущая база данных,
и любая загруженная для внешней ссылки база данных имеют
документ, с которым они ассоциированы. Базы данных, созданные
с помощью приложений nanoCAD API, автоматически ассоциируются
с документом того контекста, в котором они созданы. В этом
документе содержится буфер Undo базы данных. Это тот же
документ, чей менеждер транзакций должен быть использован для
объектов базы данных.