HostMgd.ApplicationServices.DocumentCollection
Класс представляет коллекцию открытых в приложении dwg-документов.
Класс является контейнером для всех документов (для каждого открытого и начавшего редактироваться чертежа создается один объект).

HostMgd.ApplicationServices.DocumentCollection.Add(String)
Метод предназначен для создания нового документа по
указанному шаблону.
Метод позволяет создать новый dwg-документ по указанному в
параметре templateFileName шаблону.
templateFileName: Название файла шаблона и путь к нему, если
C\: \\Users\\[user

HostMgd.ApplicationServices.DocumentCollection.CloseAll
Метод предназначен для закрытия всех открытых dwg-документов без сохранения.
Метод закрывает все открытые dwg-документы без сохранения.

HostMgd.ApplicationServices.DocumentCollection.CopyTo(array,System.Int32)
Метод предназначен для копирования коллекции dwg-документов в одномерный массив.
Метод копирует коллекцию dwg-документов в одномерный массив, типипзированный классом Document.
arrDoc: Одномерный массив, в который копируются элементы коллекции документов класса. Этот массив должен иметь индексацию элементов, начинающуюся с 0. Тип Document[]
index: Индекс в массиве, начиная с которого в массив будут копироваться элементы коллекции. Тип int

HostMgd.ApplicationServices.DocumentCollection.ExecuteInApplicationContext(HostMgd.ApplicationServices.ExecuteInApplicationContextCallback,System.Object)
Метод предназначен для вызова функции, которая ничего не возвращает из контекста приложения.
Метод позволяет вызывать функцию, которая ничего не возвращает из контекста приложения.
callback: Делегат для вызова callback void функции из контекста приложения. Тип ExecuteInApplicationContextCallback
data: Любые данные, которые нужно использовать при вызове функции. Тип object

HostMgd.ApplicationServices.DocumentCollection.GetDocument(Teigha.DatabaseServices.Database)
Метод предназначен для поиска dwg-документа в базе данных.
Метод предназначен для поиска dwg-документа в базе данных.
db: База данных. Тип Teigha.DatabaseServices.Database
Returns: Возвращает dwg-документ. Тип Document

HostMgd.ApplicationServices.DocumentCollection.GetEnumerator
Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
Returns: Возвращает перечислитель. Тип System.Collections.IEnumerator.

HostMgd.ApplicationServices.DocumentCollection.Open(String)
Метод предназначен для открытия чертежа с уровнем доступа "для записи".
Метод открывает чертеж с уровнем доступа "для записи", путь к которому указан в параметре fileName, и возвращает объект типа Document, представляющий открытый чертеж. Этот объект добавляется к коллекции класса.
fileName: Полный путь к чертежу, который необходимо открыть. Тип string
Returns: Возвращает открытый документ. Тип Document

HostMgd.ApplicationServices.DocumentCollection.Open(String,System.Boolean)
Метод предназначен для открытия чертежа с указанным уровнем доступа.
Метод открывает чертеж, путь к которому указан в параметре fileName, с уровнем доступа, указанным в параметре forReadOnly и возвращает объект типа Document, представляющий открытый чертеж. Этот объект добавляется к коллекции класса.
fileName: Полный путь к чертежу, который необходимо открыть. Тип string
forReadOnly: Параметр, указывающий, в каком режиме открыть чертеж
Returns: Возвращает открытый документ. Тип Document

HostMgd.ApplicationServices.DocumentCollection.Open(System.String,System.Boolean,System.String)
Метод предназначен для открытия чертежа, защищенного паролем, с указанным уровнем доступа.
Метод открывает чертеж, путь к которому указан в параметре fileName, с уровнем доступа, указанным в параметре forReadOnly и возвращает объект типа Document, представляющий открытый чертеж. Этот объект добавляется к коллекции класса.
fileName: Полный путь к чертежу, который необходимо открыть. Тип string
forReadOnly: Параметр, указывающий, в каком режиме открыть чертеж
password: Пароль для открытия документа. Тпи string
Returns: Возвращает открытый документ. Тип Document

HostMgd.ApplicationServices.DocumentCollection.Count
Свойство предоставляет информацию о количестве документов в коллекции.
Свойство предоставляеи информацию о количестве документов в коллекции.
Returns: Возвращает количество документов в коллекции. Тип int

HostMgd.ApplicationServices.DocumentCollection.CurrentDocument
Свойство предназначено для получения активного dwg-документа или переключения между открытыми dwg-документами.
Свойство предназначено для получения активного dwg-документа или переключения между открытыми dwg-документами.
Returns: Возвращает активный dwg-документ. Тип Document

HostMgd.ApplicationServices.DocumentCollection.DocumentActivationEnabled
Свойство предназначено для определения возможности переключения между открытыми dwg-документами.
Свойство, определяющее возможность переключения между открытыми документами (активировать требуемый документ).
Returns: Возвращает признак возможности переключения между dwg-документами: true - переключение возможно, false - переключение невозможно. Тип bool

HostMgd.ApplicationServices.DocumentCollection.IsApplicationContext
Свойство предоставляет информацию о выполнении функции в контексте приложения.
Свойство предоставляет информацию о выполнении функции в контексте приложения.
Returns: Возвращает признак того, что в данный момент функция исполняется в контексте приложения: true - ункция исполняется в контексте приложения, false - функция не исполняется в контексте приложения. Тип bool

HostMgd.ApplicationServices.DocumentCollection.MdiActiveDocument
Метод предназначен для получения объекта активного dwg-документа.
Метод предназначен для получения объекта активного dwg-документа.
Returns: Возвращает текущий (активный) MDI документ. Тип Document

HostMgd.ApplicationServices.DocumentCollection.DocumentActivated
Событие, возникающее при активации dwg-документа.
Событие, возникающее, когда документ активирован и происходит успешное переключение на его контекст.
Соответствует функции NRX API HostApDocManagerReactor.documentActivated().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentActivationChanged
Событие, возникающее после событий DocumentActivated или DocumentDestroyed.
Событие, возникающее после того, как произошло событие DocumentActivated или DocumentDestroyed.
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentActivationChangedEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentBecameCurrent
Событие, возникающее при переключении между открытыми dwg-документами.
Событие возникает всегда, когда текущим становится другой документ.
Не следует путать это событие с событием получения фокуса или активации после отсутствия активности.
В таких случаях возможно, что активным станет тот же документ, что был до этого.
Данное событие возникает только в случае, когда происходит активация dwg-документа при переключении между открытыми dwg-документами.
Соответствует функции NRX API HostApDocManagerReactor.documentBecameCurrent().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentCreateStarted
Событие возникает перед созданием dwg-документа.
Событие, возникающее перед созданием документа, когда база данных еще не доступна.
Соответствует функции NRX API HostApDocManagerReactor.documentCreateStarted().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentCreated
Событие, возникающее после создания нового объекта типа Document.
Событие, возникающее после создания нового объекта типа Document.
Соответствует функции NRX API HostApDocManagerReactor.documentCreated().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentCreationCanceled
Событие, возникающее после отмены создания dwg-документа.
Событие возникает, когда пользователь отменил создание dwg-документа.
Данное событие может возникнуть только в режиме MDI и после события DocumentCreateStarted.
Соответствует функции NRX API HostApDocManagerReactor.documentCreationCanceled().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentDestroyed
Событие, возникающее после полного уничтожения dwg-документа.
Событие, возникающее, когда документ полностью разрушен и база данных, соответствующая этому документу, также уничтожена.
Соответствует функции NRX API HostApDocManagerReactor.documentDestroyed().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentLockModeChangeVetoed
Событие, возникающее при запрете блокировки dwg-документа.
Событие возникает при запрете блокировки dwg-документа.
Попытка блокировки документа может быть запрещена реактором, получившим событие DocumentLockModeChanged.
Если запрет произошел, все реакторы получат данное событие и все реакторы смогут получить информацию о запрете блокировки,
даже если не все реакторы получили событие DocumentLockModeChanged до того, как будет запрещена блокировка.
Соответствует функции NRX API HostApDocManagerReactor.documentLockModeChangeVetoed().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentLockModeChangeVetoedEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentLockModeChanged
Событие, возникающее при каждой блокировке/разблокировке dwg-документа.
Событие, возникающее при установке блокировки или разблокировании документа.
Вызов блокировки или разблокировки можно отличить.
При разблокировке документа имя команды начинается с символа '#'.
Блокировка документа может быть запрещена, а разблокировка — нет.
Соответствует функции NRX API HostApDocManagerReactor.documentLockModeChanged().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentLockModeChangedEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentLockModeWillChange
Событие, возникающее перед изменением режима блокировки dwg-документа.
Событие, возникающее перед тем, как будет изменен режим блокировки dwg-документа. Оно не может быть запрещено.
Соответствует функции NRX API HostApDocManagerReactor.documentLockModeWillChange().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentLockModeWillChangedEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentToBeActivated
Событие, возникающее перед активацией документа.
Событие, генерируемое перед активацией документа.
Соответствует функции NRX API HostApDocManagerReactor.documentToBeActivated().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentToBeDeactivated
Событие, возникающее перед деактивацией документа.
Событие, генерируемое перед деактивацией документа.
Соответствует функции NRX API HostApDocManagerReactor.documentToBeDeactivated().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler

HostMgd.ApplicationServices.DocumentCollection.DocumentToBeDestroyed
Событие, возникающее перед уничтожением документа.
Событие, возникающее перед уничтожением документа.
Соответствует функции NRX API HostApDocManagerReactor.documentToBeDestroyed().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentCollectionEventHandler