Teigha.Geometry.Curve3d
Этот абстрактный класс является базовым классом для всех трехмерных кривых.
Этот абстрактный класс является базовым классом для всех трехмерных кривых.
Любой производный класс представляет трехмерную кривую.
У класса есть следующие производные классы:
Teigha.Geometry.ElipticalArc3d,
Teigha.Geometry.ExternalCurve3d,
Teigha.Geometry.LinearEntity3d,
Teigha.Geometry.OffsetCurve3d,
Teigha.Geometry.SplineEntity3d,
Teigha.Geometry.SurfaceCurve2dTo3d.

Teigha.Geometry.Curve3d.Create(IntPtr,System.Boolean)
Метод создает объект Curve3d на основе переданного указателя.
Метод создает объект Curve3d на основе переданного указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый объект типа Curve3d.

Teigha.Geometry.Curve3d.EvaluatePoint(System.Double)
Метод позволяет получить точку на кривой, которая соответствует указанному значению параметра.
Метод позволяет получить точку на кривой, которая соответствует указанному значению параметра.
value: Входное значение параметра, которое соответствует искомой точке. Тип double.
Returns: Возвращает точку Point3d, которая соответствует значению параметра value.

Teigha.Geometry.Curve3d.Explode(Teigha.Geometry.Interval)
Метод разбивает кривую на составляющие ее подкривые.
Метод разбивает кривую на составляющие ее подкривые.
Если интервал не указан, то рассматривается вся кривая.
interval: Интервал кривой, на котором выполняется разбиение на составляющие подкривые. Тип Interval.
Returns: Возвращает массив кривых. Тип Curve3d[].

Teigha.Geometry.Curve3d.GetArea(System.Double,System.Double)
Метод вычисляет площадь под кривой на заданном параметрическом интервале.
Метод вычисляет площадь, которая определяется параметрическим интервалом кривой с указанными параметрами начальной и конечной точек кривой.  Используется вызов Curve3d.GetArea(Double startParameter, Double endParameter, Tolerance tolerance) с допуском, равным Global.
startingParameter: Значение параметра начальной точки интервала. Тип double.
endingParameter: Значение параметра конечной точки интервала (должно превышать значение startParameter). Тип double.
Returns: Возвращает площадь под кривой.  Тип double.

Teigha.Geometry.Curve3d.GetArea(System.Double,System.Double,Teigha.Geometry.Tolerance)
Метод вычисляет площадь под кривой на заданном параметрическом интервале и с указанным допуском.
Метод вычисляет площадь под кривой с указанным допуском tolerance на параметрическом интервале, который задан начальным и конечным параметрами startingParameter и endingParameter, соответственно.
Если точки кривой, соответствующие параметрам startingParameter и endingParameter, геометрически совпадают, метод вычисляет площадь замкнутой кривой.
Если же эти точки не совпадают, то метод соединяет их линейным сегментом и возвращает площадь со знаком между кривой и этой линией.
Если на заданном параметрическом интервале прямая линия не имеет пересечений с кривой, возвращаемая площадь считается положительной.
Если точки пересечения с кривой имеются, возвращаемая площадь представляет собой сумму площадей всех подобластей, ограниченных кривой и линейным сегментом.
Знак площади для каждой подобласти зависит от того, проходит ли кривая выше или ниже линейного сегмента.
Таким образом, общая площадь под кривой, возвращаемая этим методом, может быть положительной, отрицательной или даже равной нулю.
startingParameter: Значение параметра начальной точки интервала. Тип double.
endingParameter: Значение параметра конечной точки интервала (должно превышать значение startParameter). Тип double.
tolerance: Значение допуска. Тип double.
Returns: Возвращает площадь под кривой.  Тип double.

Teigha.Geometry.Curve3d.GetBoundBlockOf(Teigha.Geometry.Interval)
Метод позволяет определить ориентированный граничный бокс для участка данной кривой на указанном параметрическом подынтервале.
Метод позволяет определить ориентированный граничный бокс для участка данной кривой на указанном параметрическом подынтервале.
Ребра такого бокса не обязаны быть параллельными координатным осям.
range: Параметрический подынтервал участка кривой, для которого строится ориентированный граничный бокс. Тип Interval.
Returns: Возвращает направленный ориентированный граничный бокс. Тип BoundBlock3d.
Notes
Ориентированный граничный бокс представляет собой прямоугольный параллелепипед минимального объема, в котором целиком помещается целевой геометрический объект. Ориентация такого бокса определяется пространственной ориентацией геометрического объекта, таким образом, ребра этого бокса не обязаны быть параллельными координатным осям.

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Curve3d)
Метод позволяет найти ближайшие точки между данной кривой и кривой, переданной в аргументе.
Метод позволяет найти ближайшие точки между данной кривой и кривой, переданной в аргументе.
Вызывается метод Curve3d.GetClosestPointTo(Curve3d curve, Tolerance tolerance) с допуском, равным Global.
curve3d: Кривая, на которой следует искать ближайшие точки.  Тип Curve3d.
Returns: Возвращает массив точек. Тип PointOnCurve3d[].

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Tolerance)
Метод позволяет найти с заданной точностью ближайшие точки между данной кривой и кривой, переданной в аргументе.
Метод позволяет найти с заданной точностью ближайшие точки между данной кривой и кривой, переданной в аргументе.
curve3d: Кривая, для которой следует искать ближайшие точки.  Тип Curve3d.
tolerance: Допуск, определяющий точность геометрических построений. Тип Tolerance.
Returns: Возвращает массив точек. Тип PointOnCurve3d[].

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Point3d)
Метод находит точку на данной кривой, ближайшую к указанной точке.
Метод находит точку на данной кривой, ближайшую к указанной точке.
Используется метод Curve3d.GetClosestPointTo(Point3d point, Tolerance tolerance) с допуском, равным Global.
point: Входная точка, для которой следует найти ближайшую к ней точку на кривой.  Тип Point3d.
Returns: Возвращает точку на кривой.  Тип PointOnCurve3d.

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод находит точку на данной кривой, ближайшую к указанной точке в пределах указанного допуска.
Метод находит точку на данной кривой, ближайшую к указанной точке в пределах указанного допуска.
point: Входная точка, для которой ищется ближайшая к ней точка на кривой.  Тип Point3d.
tolerance: Допуск, определяющий точность геометрических построений. Тип Tolerance.
Returns: Возвращает точку на кривой.  Тип PointOnCurve3d.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Tolerance)
Метод вычисляет с заданной точностью минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
Метод вычисляет с заданной точностью минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
curve: Кривая, до которой вычисляются расстояния.  Тип Curve3d.
tolerance: Геометрический допуск, определяющий точность вычислений. Тип Tolerance.
Returns: Возвращает минимальное расстояние между кривыми. Тип double.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Curve3d)
Метод вычисляет минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
Метод вычисляет минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
Вызывается метод Curve3d.GetDistanceTo(Curve3d curve, Tolerance tolerance) с допуском Tolerance.Global.
curve: Кривая, до которой вычисляются расстояния. Тип Curve3d.
Returns: Возвращает минимальное расстояние между кривыми. Тип double.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод вычисляет с заданной точностью минимальное расстояние между указанной точкой и данной кривой.
Метод вычисляет с заданной точностью минимальное расстояние между указанной точкой и данной кривой.
point: Точка, до которой вычисляется расстояние. Тип Point3d.
tolerance: Геометрический допуск, определяющий точность вычислений. Тип Tolerance.
Returns: Возвращает минимальное расстояние от кривой до точки. Тип double.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Point3d)
Метод вычисляет минимальное расстояние от указанной точки до данной кривой.
Метод вычисляет минимальное расстояние от указанной точки до данной кривой.
Вызывается метод Curve3d.GetDistanceTo(Point3d point, Tolerance tolerance) с допуском Tolerance.Global.
point: Точка, до которой вычисляется расстояние. Тип Point3d.
Returns: Возвращает минимальное расстояние от точки до кривой. Тип double.

Teigha.Geometry.Curve3d.GetLength(System.Double,System.Double,System.Double)
Метод определяет длину вдоль кривой между двумя точками кривой, заданными параметрически.
Метод определяет длину вдоль кривой между двумя точками кривой, заданными параметрически.
fromParameter: Начальный параметр. Тип double.
toParameter: Конечный параметр. Тип double.
tolerance: Точность вычислений. Тип double.
Returns: Возвращает длину вдоль кривой. Тип double.

Teigha.Geometry.Curve3d.GetNormalPoint(Teigha.Geometry.Point3d)
Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через указанную точку.
Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через указанную точку.
Вызывает метод Curve3d.GetNormalPoint(Point3d point, Tolerance tolerance) с точностью, равной Tolerance.Global.
point: Точка, через которую требуется провести нормаль к кривой.  Тип Point3d.
Returns: Возвращает точку на кривой. Тип PointOnCurve3d.

Teigha.Geometry.Curve3d.GetNormalPoint(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через заданную точку в пределах указанного допуска.
Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через заданную точку в пределах указанного допуска.
Возвращаемая точка лежит в плоскости, которая проходит через точку на кривой и перпендикулярна касательной к кривой в этой точке.
Кривая не обязана быть плоской.
Если кривая плоская, переданная в метод точка не обязана лежать в плоскости кривой.
В случае, если условию удовлетворяют несколько точек на кривой, метод вернет точку, ближайшую к заданной.
point: Точка в пространстве, через которую должна пройти нормаль к кривой. Тип Point3d.
tolerance: Точность вычислений. Тип Tolerance.
Returns: Возвращает точку на кривой. Тип PointOnCurve3d.

Teigha.Geometry.Curve3d.GetOrthoBoundBlockOf(Teigha.Geometry.Interval)
Метод позволяет определить граничный бокс для участка кривой на заданном параметрическом подынтервале.
Ребра возвращаемого бокса ориентированы по осям системы координат.
Метод позволяет определить граничный бокс для участка кривой на заданном параметрическом подынтервале.
Ребра возвращаемого бокса ориентированы по осям системы координат.
range: Параметрический подынтервал участка кривой, для которого строится ограничивающий бокс. Тип Interval.
Returns: Возвращает ограничивающий бокс. Тип BoundBlock3d.
Notes
Граничный бокс представляет собой прямоугольный параллелепипед минимального объема, ребра которого параллельны координатным осям и в котором целиком помещается целевой геометрический объект. Ориентация граничного бокса не зависит от пространственной ориентации геометрического объекта.

Teigha.Geometry.Curve3d.GetOrthoProjectEntity(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод создает геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость. Геометрические построения выполняются с указанной точностью.
Метод создает геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость. Геометрические построения выполняются с указанной точностью.
Тип возвращаемого объекта может не совпадать с типом с исходной кривой.  Например, линия может проецироваться в точку, если она ортогональна плоскости проекции.
Ответственность за удаление созданного объекта-проекции возлагается на вызывающее приложение.
projectionPlane: Плоскость, на которую выполняется проецирование.  Тип Plane.
tolerance: Точность выполняемых вычислений.  Тип Tolerance.
Returns: Возвращает спроецированный объект.  Тип Entity3d.

Teigha.Geometry.Curve3d.GetOrthoProjectEntity(Teigha.Geometry.Plane)
Метод позволяет получить геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость.
Метод позволяет получить геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость.
Вызывается метод Curve3d.GetOrthoProjectEntity(Plane projectionPlane, Tolerance tolerance) с точностью, равной Tolerance.Global.
projectionPlane: Плоскость, на которую выполняется проецирование.  Тип Plane.
Returns: Возвращает спроецированный объект.  Тип Entity3d.

Teigha.Geometry.Curve3d.GetParameterAtLength(System.Double,System.Double,System.Boolean,System.Double)
Метод позволяет получить значение параметра для точки на кривой, расстояние вдоль кривой до которой от указанной параметрически начальной точки равно заданной длине.
Метод позволяет получить значение параметра для точки на кривой, расстояние вдоль кривой до которой от указанной параметрически начальной точки равно заданной длине length.
Аргументы метода дают возможность задать также направление вдоль кривой и точность вычислений.
datumParameter: Значение параметра для начальной точки. Тип double.
length: Целевое расстояние между точками, вычисляемое вдоль кривой. Тип double.
direction: Направление изменения параметра. Тип bool.
tolerance: Точность вычисления искомого параметра. Тип double.
Returns: Возвращает значение параметра для точки на кривой. Тип double.

Teigha.Geometry.Curve3d.GetParameterOf(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет получить с указанной точностью значение параметра для заданной точки на кривой.
Метод позволяет получить с указанной точностью значение параметра для заданной точки на кривой.
Реализация метода предполагает без проверки, что точка гарантированно лежит на кривой.
Если это условие не соблюдается, метод вернет непредсказуемое значение.
point: Точка на кривой. Тип Point3d.
tolerance: Точность вычисления параметра. Тип Tolerance.
Returns: Возвращает значение параметра для заданной точки на кривой. Тип double.

Teigha.Geometry.Curve3d.GetParameterOf(Teigha.Geometry.Point3d)
Метод позволяет получить значение параметра для заданной точки на кривой.
Метод позволяет получить значение параметра для заданной точки на кривой.
Реализация использует вызов метода Curve3d.GetParameterOf(Point3d point, Tolerance tolerance) с точностью, равной Tolerance.Global.
point: Точка на кривой. Тип Point3d.
Returns: Возвращает значение параметра для точки на кривой. Тип double.

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на указанную плоскость.
Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на плоскость с нормалью projectDirection.  Результатом является массив "ближайших" точек на данной кривой.
Используется вызов метода Curve3d.GetProjectedClosestPointTo(Curve3d curve, Vector3d projectDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда.
В этом случае метод возвращает точки двух кривых, которые в проекции кажутся ближайшими точками этих кривых (хотя, разумеется, в действительности ближайшими точками они могут и не быть).
curve3d: Входная 3D-кривая. Тип Curve3d.
projectDirection: Нормаль плоскости проецирования. Тип Vector3d.
Returns: Возвращает массив точек на 3D-кривой.  Тип PointOnCurve3d[].
Notes
Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда.
В этом случае метод возвращает точки двух кривых, которые в проекции кажутся ближайшими точками этих кривых (хотя, разумеется, в действительности ближайшими точками они могут и не быть).

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на заданную плоскость.  Метод позволяет задавать точность вычислений.
Метод находит точки на данной кривой и указанной кривой Curve3d, которые оказываются ближайшими точками на проекциях этих двух кривых на плоскость с нормалью projectDirection.
Результатом является массив "ближайших" точек на данной кривой.
Дополнительно метод позволяет задавать желаемую точность вычислений.
Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда.
В этом случае метод возвращает точки двух кривых, которые в проекции кажутся ближайшими точками этих кривых (хотя, разумеется, в действительности ближайшими точками они могут и не быть).
curve3d: Другая 3D-кривая. Тип Curve3d.
projectDirection: Нормаль плоскости проецирования. Тип Vector3d.
tolerance: Точность вычислений. Тип Tolerance.
Returns: Возвращает массив "ближайших" точек на 3D-кривой.  Тип PointOnCurve3d[].

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод находит точку на этой кривой, которая при проецировании кривой на заданную плоскость оказывается ближайшей точкой к проекции переданной в метод точки.  Метод использует указанную точность вычислений.
Метод находит точку на этой кривой, которая при проецировании кривой на плоскость с нормалью projectDirection оказывается ближайшей точкой к проекции заданной точки point.  Метод использует указанную точность вычислений tolerance.
Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда.
В этом случае метод возвращает точку на кривой, которая кажется ближайшей к переданной в метод точке (хотя в действительности ближайшей точкой она может и не быть).
point: Заданная внешняя точка. Тип Point3d.
projectDirection: Нормаль плоскости проецирования. Тип Vector3d.
tolerance: Точность вычислений. Тип Tolerance.
Returns: Возвращает точку на кривой. Тип PointOnCurve3d.

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод находит точку на этой кривой, которая при проецировании кривой на заданную плоскость оказывается ближайшей точкой к проекции указанной точки.
Метод находит точку на этой кривой, которая при проецировании кривой на плоскость с нормалью projectDirection оказывается ближайшей точкой к проекции заданной точки point.
Реализация использует вызов метода Curve3d.GetProjectedClosestPointTo(Point3d curve, Vector3d projectDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
point: Заданная внешняя точка. Тип Point3d.
projectDirection: Нормаль плоскости проецирования. Тип Vector3d.
Returns: Возвращает точку на кривой. Тип PointOnCurve3d.
Notes
Данный метод используется в основном в задачах графической визуализации, где projectDirection служит направлением взгляда.
В этом случае метод возвращает точку на кривой, которая кажется ближайшей к переданной в метод внешней точке (хотя в действительности ближайшей точкой она может и не быть).

Teigha.Geometry.Curve3d.GetProjectedEntity(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет получить объект, который является результатом проецирования данной кривой в указанном направлении на заданную плоскость.
Метод использует указанную точность вычислений.
Метод находит объект, который является результатом проецирования этой кривой в заданном направлении projectDirection на заданную плоскость projectionPlane.
Аргумент tolerance определяет требуемую точность вычислений.
Вектор projectDirection не должен быть параллелен плоскости проецирования.
Ответственность за удаление созданного объекта-проекции возлагается на вызывающее приложение.
projectionPlane: Плоскость проецирования. Тип Plane.
projectDirection: Направление проецирования. Тип Vector3d.
tolerance: Точность вычислений. Тип Tolerance.
Returns: Возвращает результат проецирования в виде объекта Entity3d.
Notes
Возвращаемый объект-проекция может отличаться по типу от исходной кривой, и может даже не быть кривой вовсе. Например, прямая линия проецируется в точку, если она параллельна вектору projectDirection.

Teigha.Geometry.Curve3d.GetProjectedEntity(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d)
Метод позволяет получить объект, который является результатом проецирования данной кривой в указанном направлении на заданную плоскость.
Метод находит объект, который является результатом проецирования этой кривой в указанном направлении на заданную плоскость.
Реализация использует вызов метода Curve3d.GetProjectedEntity(Plane projectionPlane, Vector3d projectDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
Вектор projectDirection не должен быть параллелен плоскости проецирования.
Ответственность за удаление созданного объекта-проекции возлагается на вызывающее приложение.
projectionPlane: Плоскость проецирования. Тип Plane.
projectDirection: Направление проецирования. Тип Vector3d.
Returns: Возвращает результат проецирования в виде объекта Entity3d.
Notes
Возвращаемый объект-проекция может отличаться по типу от исходной кривой, и может даже не быть кривой вовсе.
Например, прямая линия проецируется в точку, если она параллельна вектору projectDirection.

Teigha.Geometry.Curve3d.GetSamplePoints(System.Double,System.Double,System.Double)
Метод позволяет получить массив точек на кривой в указанном параметрическом интервале.
Метод позволяет получить массив точек на кривой в параметрическом интервале между fromParameter и toParameter.
Шаг между точками регулируется заданной высотой хорды chordHeight.
fromParameter: Значение параметра, представляющее начало параметрического интервала. Тип double.
toParameter: Значение параметра, представляющее конец параметрического интервала. Тип double.
chordHeight: Высота хорды, определяющая шаг между соседними точками. Тип double.
Returns: Возвращает массив точек на кривой.  Тип PointOnCurve3d[].

Teigha.Geometry.Curve3d.GetSamplePoints(System.Int32)
Метод формирует массив из указанного количества точек на кривой, равноотстоящих друг от друга в параметрическом представлении.
Метод формирует массив из указанного количества точек на кривой, равноотстоящих друг от друга в параметрическом представлении.
Например, если параметрическим интервалом кривой является [0,1], и заказанное количество точек numSample равно 5, то значения параметра полученных точек будут равны 0.0, 0.25, 0.5, 0.75, 1.0.
numSample: Заказанное количество точек, равноотстоящих друг от друга параметрически.  Тип int.
Returns: Возвращает массив точек на кривой.  Тип PointOnCurve3d[].

Teigha.Geometry.Curve3d.GetSplitCurves(System.Double)
Метод делит кривую на два сегмента в точке с указанным значением параметра.
Метод делит кривую на два сегмента в точке с указанным значением параметра.
value: Значение параметра для точки, в которой выполняется разделение кривой на два сегмента. Тип double.
Returns: Возвращает массив из двух кривых, являющихся результатом разделения кривой. Тип Curve3d[].
Notes
Если указанное значение параметра value оказывается за пределами параметрического интервала кривой или, если оно соответствует начальной или конечной точке кривой, массив может содержать нулевые объекты.

Teigha.Geometry.Curve3d.GetTrimmedOffset(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.OffsetCurveExtensionType,Teigha.Geometry.Tolerance)
Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой) при заданной точности вычислений.
Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой).
Точность вычислений определяет аргумент tolerance.
Исходная кривая должна быть плоской, а вектор planeNormal должен быть перпендикулярен плоскости кривой.
Направление смещения кривой задается знаком величины смещения distance.
За положительное направление смещения в точке на кривой принимается результат векторного произведения вектора planeNormal и вектора касательной в этой точке.
Обрезка смещенных кривых используется, чтобы исключить случаи самопересечения.
distance: Величина смещения. Тип double.
planeNormal: Вектор нормали к плоскости кривой. Тип Vector3d.
extensionType: Значение из перечисления OffsetCurveExtensionType, которое определяет вариант смещения в точках излома исходной кривой (точки разрыва C1).
tolerance: Геометрический допуск. Тип Tolerance.
Returns: Возвращает массив кривых, полученных смещением.

Teigha.Geometry.Curve3d.GetTrimmedOffset(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.OffsetCurveExtensionType)
Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой).
Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой).
Реализация использует вызов метода Curve3d.GetTrimmedOffset(Double distance, Vector3d planeNormal, OffsetCurveExtensionType extensionType, Tolerance tolerance) с геометрическим допуском, равным Tolerance.Global.
Исходная кривая должна быть плоской, а вектор planeNormal должен быть перпендикулярен плоскости кривой.
Направление смещения кривой задается знаком величины смещения distance.
За положительное направление смещения в точке на кривой принимается результат векторного произведения вектора planeNormal и вектора касательной в этой точке.
Обрезка смещенных кривых используется, чтобы исключить случаи самопересечения.
distance: Величина смещения. Тип double.
planeNormal: Вектор нормали к плоскости кривой. Тип Vector3d.
extensionType: Значение из перечисления OffsetCurveExtensionType, которое определяет вариант смещения в точках излома исходной кривой (точки разрыва C1).
Returns: Возвращает массив кривых, полученных смещением.

Teigha.Geometry.Curve3d.IsClosed(Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая замкнутой в пределах заданного допуска.
Метод проверяет,является ли данная кривая замкнутой в пределах заданного допуска.
Фактически метод проверяет, совпадают ли начальная и конечная точки кривой в пределах заданного допуска.
tolerance: Допуск, в пределах которого проверяется совпадение концов кривой.  Тип Tolerance.
Returns: Возвращает true, если кривая является замкнутой, и false в противном случае.

Teigha.Geometry.Curve3d.IsCoplanarWith(Teigha.Geometry.Curve3d,[Out]Plane%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли переданная в метод кривая компланарной данной кривой при заданной точности вычислений.
В случае компланарности обеих кривых метод возвращает их общую плоскость.
Метод проверяет, компланарна ли данной кривой переданная в метод кривая curve3d.
В случае компланарности обеих кривых метод возвращает их общую плоскость plane.
Точность вычислений задает аргумент tolerance.
curve3d: Произвольная 3D-кривая, компланарность с которой требуется проверить. Тип Curve3d.
plane: Плоскость, в которой располгаются обе кривые в случае их компланарности. Тип Plane.
tolerance: Требуемая точность вычислений. Тип Tolerance.
Returns: Возвращает true в случае компланарности кривых, в противном случае возвращает false.
Notes
Возвращаемое значение plane действительно только в том случае, когда метод возврашает true.

Teigha.Geometry.Curve3d.IsCoplanarWith(Teigha.Geometry.Curve3d,[Out]Plane%)
Метод проверяет, является ли переданная в метод кривая компланарной данной кривой.
В случае компланарности обеих кривых метод возвращает их общую плоскость.
Метод проверяет, является ли переданная в метод кривая компланарной данной кривой.
В случае компланарности обеих кривых метод возвращает их общую плоскость.
Реализация метода использует вызов  Curve3d.IsCoplanarWith(ref Curve3d curve3d, out Plane plane, Tolerance tolerance) со значением точности, равным Tolerance.Global.
curve3d: Произвольная 3D-кривая, компланарность с которой требуется проверить. Тип Curve3d.
plane: Плоскость, в которой располгаются обе кривые в случае их компланарности. Тип Plane.
Returns: Возвращает true в случае компланарности кривых, в противном случае возвращает false.
Notes
Возвращаемое значение plane действительно только в том случае, когда метод возврашает true.

Teigha.Geometry.Curve3d.IsDegenerate([Out]Entity3d%,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли кривая вырожденной в пределах указанной точности вычислений, и если да, то возвращает тип объекта, в который выродилась кривая.
Метод позволяет проверить, является ли кривая вырожденной, и если да, то возвращает объект result, в который выродилась кривая.
Объект result действителен только в том случае, если метод возвращает значение true.
Точность вычислений определяет аргумент tolerance.
Параметры
Параметр   Описание
---------  --------------------------------------------------------------------------
result     Тип объекта, в который выродилась кривая (если выродилась). Тип Entity3d.
tolerance  Требуемая точность вычислений. Тип Tolerance.
Returns: Возвращает true в случае, если данная кривая является вырожденной, иначе - false.

Teigha.Geometry.Curve3d.IsDegenerate([Out]Entity3d%)
Метод позволяет проверить, является ли кривая вырожденной, и если да, то возвращает тип объекта, в который выродилась кривая.
Метод позволяет проверить, является ли кривая вырожденной, и если да, то возвращает объект result, в который выродилась кривая.
Объект result действителен только в том случае, если метод возвращает значение true.
Реализация метода использует вызов  Curve3d.IsDegenerate(out Entity3d result, Tolerance tolerance) со значением точности, равным Tolerance.Global.
Параметры
Параметр   Описание
---------  --------------------------------------------------------------------------
result     Тип объекта, в который выродилась кривая (если выродилась). Тип Entity3d.
Returns: Возвращает true в случае, если данная кривая является вырожденной, иначе - false.

Teigha.Geometry.Curve3d.IsLinear([Out]Line3d%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая линейной в пределах заданного геометрического допуска.
Метод проверяет, является ли данная кривая линейной в пределах заданного геометрического допуска.
Параметр line содержит значимые данные только в том случае, если метод возвращает значение true.
line: Линия, с которой совпадает кривая в случае ее прямолинейности. Тип Line3d.
tolerance: Требуемая точность вычислений. Тип Tolerance.
Returns: Возвращает true, если кривая является линейной, и false в противном случае.

Teigha.Geometry.Curve3d.IsLinear([Out]Line3d%)
Метод проверяет, является ли данная кривая линейной.
Метод проверяет, является ли данная кривая линейной.
Параметр line содержит значимые данные только в том случае, если метод возвращает значение true.
Реализация метода использует вызов  Curve3d.IsLinear(out Line3d line, Tolerance tolerance) с допуском, равным Tolerance.Global.
line: Линия, с которой совпадает кривая в случае ее прямолинейности. Тип Line3d.
Returns: Возвращает true, если кривая является линейной, и false в противном случае.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска.
Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска tolerance. Параметр point содержит значимые данные только тогда, когда метод возвращает значение true.
point: Произвольная точка Point3d.
tolerance: Требуемая точность проверки. Тип Tolerance.
Returns: Возвращает true в случае, если указанная точка находится на данной кривой в пределах допуска tolerance, иначе - false.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d)
Метод позволяет установить, находится ли указанная точка на данной кривой.
Метод позволяет установить, находится ли указанная точка на данной кривой.
Параметр point содержит значимые данные только тогда, когда метод возвращает значение true.
Реализация метода использует вызов  Curve3d.IsOn(Point3d point, Tolerance tolerance) с допуском, равным Tolerance.Global.
point: Произвольная точка Point3d.
Returns: Возвращает true в случае, если указанная точка находится на данной кривой, иначе - false.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d,[Out]double%)
Метод позволяет установить, находится ли указанная точка на данной кривой. Дополнительно возвращает значение параметра для лежащей на кривой точки.
Метод позволяет установить, находится ли указанная точка на данной кривой.
Параметр value содержит значимые данные только тогда, когда метод возвращает значение true.
point: Произвольная точка Point3d.
value: Выходное значение параметра для точки на кривой (если точка лежит на кривой). Тип double.
Returns: Возвращает true в случае, если указанная точка находится на данной кривой, иначе - false.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d,[Out]double%,Teigha.Geometry.Tolerance)
Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска.
Метод позволяет установить, находится ли точка point на данной кривой в пределах заданного допуска tolerance.
Выходной параметр value возвращает значение параметра для точки point, если она лежит на кривой, и содержит значимые данные только тогда, когда метод возвращает значение true.
point: Произвольная точка Point3d.
value: Выходное значение параметра для точки на кривой (если точка лежит на кривой). Тип double.
tolerance: Геометрический допуск. Тип Tolerance.
Returns: Возвращает true в случае, если точка point находится на данной кривой, иначе - false.

Teigha.Geometry.Curve3d.IsOn(System.Double,Teigha.Geometry.Tolerance)
Метод позволяет установить, находится ли указанное значение параметра в пределах параметрического интервала данной кривой при заданной точности вычислений.
Метод позволяет установить, находится ли указанное значение параметра value в пределах параметрического интервала данной кривой.
Проверка выполняется с заданной точностью tolerance.
value: Входное значение параметра для точки на кривой. Тип double.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true в случае, если точка point находится на данной кривой, иначе - false.

Teigha.Geometry.Curve3d.IsOn(System.Double)
Метод позволяет установить, находится ли указанное значение параметра в пределах параметрического интервала данной кривой.
Метод позволяет установить, находится ли указанное значение параметра value в пределах параметрического интервала данной кривой.
Реализация метода использует вызов Curve3d.IsOn(double value, Tolerance tolerance) c точностью, равной Tolerance.Global.
value: Входное значение параметра для точки на кривой. Тип double.
Returns: Возвращает true в случае, если точка point находится на данной кривой, иначе - false.

Teigha.Geometry.Curve3d.IsPeriodic([Out]double%)
Метод позволяет установить, является ли данная кривая периодической.
Метод позволяет установить, является ли данная кривая периодической.
Выходное значение period имеет смысл только в том случае, когда метод возвращает значение true.
Notes
Кривая является периодической с периодом period тогда и только тогда, когда она замкнута, и для любого значения параметра t точки EvaluatePoint(t) и EvaluatePoint(t + period) всегда совпадают.
period: Выходное значение периода кривой (если она периодическая). Тип double.
Returns: Возвращает true, если кривая является периодической, иначе - false.

Teigha.Geometry.Curve3d.IsPlanar([Out]Plane%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая плоской в пределах указанного допуска.
Метод проверяет, является ли данная кривая плоской в пределах указанного допуска.
Если кривая геометрически является линией, этот метод возвращает произвольную плоскость, которая содержит эту линию.  Параметр plane возвращает значимые данные только в том случае, когда результирующим значением метода является true.
plane: Плоскость, которой принадлежит кривая (если она плоская). Тип Plane.
tolerance: Заданный допуск. Тип Tolerance.
Returns: Возвращает true в случае, если кривая является плоской, иначе - false.

Teigha.Geometry.Curve3d.IsPlanar([Out]Plane%)
Метод проверяет, является ли данная кривая плоской.
Метод проверяет, является ли данная кривая плоской.
Если кривая геометрически является линией, этот метод возвращает произвольную плоскость, которая содержит эту линию.  Параметр plane возвращает значимые данные только в том случае, когда результирующим значением метода является true.
Реализация метода использует вызов Curve3d.IsPlanar(out Plane plane, Tolerance tolerance) c допуском, равным Tolerance.Global.
plane: Плоскость, которой принадлежит кривая (если она плоская). Тип Plane.
Returns: Возвращает true в случае, если кривая является плоской, иначе - false.

Teigha.Geometry.Curve3d.SetInterval(Teigha.Geometry.Interval)
Метод переопределяет параметрический интервал данной кривой.
Метод переопределяет параметрический интервал данной кривой.
value: Входной параметрический интервал, на котором определена кривая. Тип Interval.

Teigha.Geometry.Curve3d.BoundBlock
Свойство позволяет получить ориентированный граничный бокс для данной кривой.
Свойство позволяет получить ориентированный граничный бокс для данной кривой.
Ребра такого бокса не обязаны быть параллельными координатным осям.
Returns: Возвращает ориентированный граничный бокс для данной кривой. Тип BoundBlock3d.

Teigha.Geometry.Curve3d.EndPoint
Свойство EndPoint возвращает конечную точку кривой.
Свойство EndPoint возвращает конечную точку кривой.
Returns: Возвращает конечную точку кривой. Тип Point3d.

Teigha.Geometry.Curve3d.HasEndPoint
Свойство позволяет установить, имеет ли данная кривая конечную точку.
Свойство позволяет установить, имеет ли данная кривая конечную точку.
Возвращаемое значение false означает, что параметрический интервал кривой верхней границы не имеет.
Returns: Возвращает true, если кривая имеет конечную точку.
Возвращает false, если параметрический интервал кривой сверху не ограничен.

Teigha.Geometry.Curve3d.HasStartPoint
Свойство позволяет установить, имеет ли данная кривая начальную точку.
Свойство позволяет установить, имеет ли данная кривая начальную точку.
Возвращаемое значение false означает, что параметрический интервал кривой нижней границы не имеет.
Returns: Возвращает true, если кривая имеет начальную точку.
Возвращает false, если параметрический интервал кривой снизу не ограничен.

Teigha.Geometry.Curve3d.OrthoBoundBlock
Свойство позволяет получить граничный бокс для данной кривой.
Ребра бокса ориентированы по осям системы координат.
Свойство позволяет получить граничный бокс для данной кривой.
Ребра такого бокса ориентированы по осям системы координат.
Returns: Возвращает граничный бокс для данной кривой. Тип BoundBlock3d.

Teigha.Geometry.Curve3d.StartPoint
Свойство возвращает начальную точку кривой.
Свойство возвращает начальную точку кривой.
Returns: Возвращает начальную точку кривой. Тип Point3d.