Teigha.DatabaseServices.NurbsData.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Метод позволяет получить хеш-код данного объекта.
Хеш-код представляет собой целочисленное значение, уникальное для любого экземпляра данной структуры.
Returns: Возвращает хеш-код данного объекта.  Тип int.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться согласованно с сохранением общей логики.
Если Equals возвращает true, хеш-коды обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать
NurbsData.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.