Teigha.GraphicsInterface.TransparencyMode
Перечисление TransparencyMode определяет режимы прозрачности для растровых изображений.
Перечисление TransparencyMode определяет режимы прозрачности для растровых изображений.