HostMgd.PlottingServices.AppPlotStatus.NoPlotYet
Значение: -1.
Статус означает, что в текущем сеансе nanoCAD пока не предпринимались попытки печати.
Является значением по умолчанию при старте платформы и предназначено исключительно для внутреннего использования.