Teigha.DatabaseServices.PlotStyleDescriptor
Данный класс инкапсулирует значение перечисления PlotStyleNameType и идентификатор объекта связанной записи в словаре имен стилей печати.
Данный класс инкапсулирует значение перечисления PlotStyleNameType и идентификатор объекта связанной записи в словаре имен стилей печати.

Teigha.DatabaseServices.PlotStyleDescriptor.#ctor(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.PlotStyleNameType)
Конструктор. Создает новый объект PlotStyleDescriptor.
Конструктор. Создает новый объект PlotStyleDescriptor.
id: Идентификатор ObjectId листа печати.
type: Тип стиля печати PlotStyleNameType.

Teigha.DatabaseServices.PlotStyleDescriptor.Equals(Object)
Данный метод предназначен для проверки объекта на равенство другому объекту.
Данный метод предназначен для проверки объекта на равенство другому объекту.
unmanagedObjPtr: объект, с которым выполняется проверка на идентичность.
Returns: Возвращает true, если данный объект идентичен объекту в аргументе, и false в противном случае.

Teigha.DatabaseServices.PlotStyleDescriptor.ToString(IFormatProvider)
Этот класс формирует эквивалентное строковое представление данного объекта в формате, зависящем от языка и региональных настроек, которые определяет указанный провайдер.
Этот класс формирует эквивалентное строковое представление данного объекта в формате, зависящем от языка и региональных настроек, которые определяет указанный провайдер.
provider: провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает строку String.

Teigha.DatabaseServices.PlotStyleDescriptor.!=(Teigha.DatabaseServices.PlotStyleDescriptor,Teigha.DatabaseServices.PlotStyleDescriptor)
Оператор возвращает true в случае неравенства операндов и false в противном случае.
Оператор возвращает true в случае неравенства операндов и false в противном случае.
a: Левый операнд, тип PlotStyleDescriptor.
b: Правый операнд, тип PlotStyleDescriptor.
Returns: Возвращает true в случае неравенства операндов и false в противном случае.

Teigha.DatabaseServices.PlotStyleDescriptor.==(Teigha.DatabaseServices.PlotStyleDescriptor,Teigha.DatabaseServices.PlotStyleDescriptor)
Оператор возвращает true в случае равенства операндов и false в противном случае.
Оператор возвращает true в случае равенства операндов и false в противном случае.
a: Левый операнд, тип PlotStyleDescriptor.
b: Правый операнд, тип PlotStyleDescriptor.
Returns: Возвращает true в случае равенства операндов и false в противном случае.

Teigha.DatabaseServices.PlotStyleDescriptor.Id
Свойство предоставляет доступ к ObjectId листа печати.
Свойство предоставляет доступ к ObjectId листа печати.
Returns: Возвращает ObjectId листа печати.

Teigha.DatabaseServices.PlotStyleDescriptor.Type
Свойство предоставляет доступ к имени стиля печати.
Свойство предоставляет доступ к имени стиля печати.
Returns: Возвращает имя стиля печати.  Тип PlotStyleNameType.