Teigha.Geometry.BoundBlock3d
Класс BoundBlock3d представляет трехмерную граничную рамку.
Класс BoundBlock3d представляет реализацию трехмерной граничной рамки.
Геометрически граничная рамка может принимать форму как обычного прямоугольного параллелепипеда, ориентированного по осям системы координат, так и непрямоугольного параллелепипеда.

Teigha.Geometry.BoundBlock3d.#ctor
Конструктор по умолчанию класса BoundBlock3d.
Конструктор по умолчанию класса BoundBlock3d.
Создает граничную рамку с минимальной и максимальной точками в начале системы координат.

Teigha.Geometry.BoundBlock3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса BoundBlock3d.
Создает граничную рамку в виде параллелепипеда с заданными сторонами и базовой точкой.
Конструктор класса BoundBlock3d.
Создает граничную рамку в виде параллелепипеда с заданными сторонами и базовой точкой.
point1: Базовая точка граничной рамки.  Тип Point3d.
dir1: Вектор, определяющий направление и длину первой стороны параллелепипеда.  Тип Vector3d.
dir2: Вектор, определяющий направление и длину второй стороны параллелепипеда.  Тип Vector3d.
dir3: Вектор, определяющий направление и длину третьей стороны параллелепипеда.  Тип Vector3d.

Teigha.Geometry.BoundBlock3d.Contains(Teigha.Geometry.Point3d)
Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
pointToTest: Входная 3D-точка.  Тип Point3d.
Returns: Возвращает true, если и только если указанная точка находится в пределах данной граничной рамки.
В противном случае возвращает false.

Teigha.Geometry.BoundBlock3d.Create(IntPtr,System.Boolean)
Метод создает объект BoundBlock3d на основе переданного указателя.
Метод создает объект BoundBlock3d на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект, на основе которого создается новый объект.  Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый объект типа BoundBlock3d.

Teigha.Geometry.BoundBlock3d.Extend(Teigha.Geometry.Point3d)
Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
pointToInclude: Входная точка, которая должна находиться в пределах граничной рамки.

Teigha.Geometry.BoundBlock3d.IsDisjoint(Teigha.Geometry.BoundBlock3d)
Метод позволяет проверить, пересекается ли данная граничная рамка с другой граничной рамкой.
Метод позволяет проверить, пересекается ли данная граничная рамка с указанной граничной рамкой.
block: Входная граничная рамка, пересечение с которой требуется проверить.
Returns: Возвращает true тогда и только тогда, когда указанная граничная рамка не пересекается с данной.
В противном случае возвращает false.

Teigha.Geometry.BoundBlock3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить минимальную и максимальную точки данной граничной рамки.
Метод позволяет переопределить минимальную и максимальную точки данной граничной рамки.
basePoint: Новая минимальная  точка граничной рамки. Тип Point3d.
maximumPoint: Новая максимальная точка граничной рамки. Тип Point3d.

Teigha.Geometry.BoundBlock3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелепипеда.
Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелепипеда.
basePoint: Входная базовая точка граничной рамки. Тип Point3d.
dir1: Первая сторона параллелепипеда.  Тип Vector3d.
dir2: Вторая сторона параллелепипеда.  Тип Vector3d.
dir3: Третья сторона параллелепипеда.  Тип Vector3d.

Teigha.Geometry.BoundBlock3d.Swell(System.Double)
Метод раздвигает стороны данной граничной рамки на заданное расстояние.
Метод раздвигает стороны данной граничной рамки на заданное расстояние.
distance: Величина смещения сторон граничной рамки.  Тип double.

Teigha.Geometry.BoundBlock3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод выполняет геометрическое преобразование этой граничной рамки, определяемое заданной 3D матрицей преобразования.
Метод выполняет геометрическое преобразование этой граничной рамки, определяемое заданной 3D матрицей преобразования.
A_0: Входная матрица преобразования.

Teigha.Geometry.BoundBlock3d.BasePoint
Свойство BasePoint предоставляет доступ к базовой точке данной граничной рамки.
Свойство BasePoint предоставляет доступ к базовой точке данной граничной рамки.
Returns: Возвращает базовую точку данной граничной рамки. Тип Point3d.

Teigha.Geometry.BoundBlock3d.Direction1
Свойство Direction1 представляет направление и длину первой стороны данной граничной рамки.
Свойство Direction1 представляет направление и длину первой стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий первую сторону граничной рамки.
Тип Vector3d.

Teigha.Geometry.BoundBlock3d.Direction2
Свойство Direction2 представляет направление и длину второй стороны данной граничной рамки.
Свойство Direction2 представляет направление и длину второй стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий вторую сторону граничной рамки. Тип Vector3d.

Teigha.Geometry.BoundBlock3d.Direction3
Свойство Direction3 представляет направление и длину третьей стороны данной граничной рамки.
Свойство Direction3 представляет направление и длину третьей стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий третью сторону граничной рамки. Тип Vector3d.

Teigha.Geometry.BoundBlock3d.IsBox
Свойство IsBox позволяет проверить, представлена ли граничная рамка прямоугольным параллелепипедом, который ориентирован вдоль осей системы координат.
Свойство IsBox позволяет проверить, представлена ли граничная рамка прямоугольным параллелепипедом, который ориентирован вдоль осей системы координат.
Returns: Возвращает true, если граничная рамка представлена прямоугольным параллелепипедом, который ориентирован вдоль осей системы координат.
В противном случае возвращает false.