HostMgd.EditorInput.PromptDoubleOptionsEventHandler
Делегат предназначен для обработки события, возникающего перед началом операции ввода вещественного числа,
и позволяет настроить параметры ввода.
Делегат `PromptDoubleOptionsEventHandler` используется как тип обработчика для события
`PromptingForDouble`, которое генерируется перед началом интерактивного ввода вещественного числа в nanoCAD.
Он позволяет разработчику изменять параметры команды ввода — такие как сообщение, начальное значение,
допустимый диапазон и режимы ввода — до того, как пользователь начнёт взаимодействовать с командой.
Этот делегат применяется в надстройках и плагинах для гибкой настройки поведения команд,
требующих ввода чисел с плавающей точкой, таких как масштабирование, параметризация,
вычисления и другие операции.
Example
C#
sender: Источник события.
e: Объект, содержащий параметры ввода вещественного числа.