Teigha.DatabaseServices.Ellipse
Класс Ellipse реализует в базе данных объекты эллипса и эллиптической дуги.
Класс Ellipse реализует в базе данных объект эллипса.
Этот класс наследует базовую функциональность объектов чертежа Entity.
Объект Ellipse может представлять собой либо эллиптическую замкнутую фигуру (эллипс), либо незамкнутый эллиптический сегмент (т.е. эллиптическую дугу) в мировой системе координат.
Когда начальный угол совпадает с конечным углом, фигура считается замкнутой, в этом случае объект представляет из себя эллипс.
Когда начальный угол отличается от конечного угла более чем на 1e-6, фигура считается незамкнутой, в этом случае объект представляет из себя эллиптическую дугу.

Teigha.DatabaseServices.Ellipse.#ctor
Конструктор класса Ellipse по умолчанию.
Конструктор класса Ellipse по умолчанию.
Результатом его работы является единичная окружность с центром (0,0,0).

Teigha.DatabaseServices.Ellipse.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Конструктор класса Ellipse. Создает эллипс (или эллиптическую дугу) с указанными параметрами.
Конструктор класса Ellipse. Создает эллипс (или эллиптическую дугу) с указанными параметрами.
Параметры center, unitNormal и majorAxis используются для вычисления начальной точки и ориентации эллипса в мировой системе координат.
Вектор majorAxis по модулю равен половине большой оси эллипса и задает начало отсчета для углов startAngle и endAngle.
Положительное направление отсчета углов определяется правилом правой руки - если смотреть вдоль вектора нормали на центр эллипса, то положительным считается направление против часовой стрелки.
Условиями замкнутости эллипса являются (startAngle = 0) и (endAngle = 2PI).
Значение radiusRatio должно находиться в диапазоне от 1E-6 до 1.0.
Скалярное произведение unitNormal с самим собой и majorAxis с самим собой должны превышать 1E-12.
Направления majorAxis и unitNormal должны быть перпендикулярными в пределах допуска 1E-6.
Разница между углами startAngle и endAngle должна быть больше 1E-6.
Чтобы проверить, удалось ли этому конструктору инициализировать эллипс переданными значениями, следует воспользоваться свойством isNull. В случае успешной инициализации оно возвращает значение false.
center: Центр эллипса в мировой системе координат (WCS). Тип Point3d.
unitNormal: Единичный вектор нормали к плоскости, в которой располагается эллипс. Задается в WCS. Тип Vector3d.
majorAxis: Направление большой оси эллипса в WCS. Тип Vector3d. По модулю составляет половину главной оси эллипса.
radiusRatio: Отношение малого радиуса эллипса к большому. Тип double. Для получения действительного эллипса этот параметр не должен быть меньше 1E-6 или больше 1.0.
startAngle: Начальный угол эллиптической дуги. Тип double.
endAngle: Конечный угол эллиптической дуги. Тип double.

Teigha.DatabaseServices.Ellipse.GetAngleAtParameter(System.Double)
Метод позволяет определить значение угла для точки на эллипсе, заданной параметрически.
Метод позволяет определить значение угла для точки на эллипсе, заданной указанным значением параметра.
Возвращаемый угол будет находиться в диапазоне от -PI до +PI.
Начало отсчета углов определяет вектор majorAxis эллипса.
Положительное направление отсчета углов определяется правилом правой руки - если смотреть вдоль вектора нормали на центр эллипса, то положительным считается направление против часовой стрелки.
value: Значение параметра в радианах. Тип double.
Returns: Возвращает угол в радианах. Тип double.

Teigha.DatabaseServices.Ellipse.GetParameterAtAngle(System.Double)
Метод позволяет определить значение параметра, соответствующее указанному значению угла.
Метод позволяет определить значение параметра, соответствующее указанному значению угла.
angle: Входное значение угла в радианах. Тип double.
Returns: Возвращает значение параметра в интервале от 0 до 2PI. Тип double.

Teigha.DatabaseServices.Ellipse.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Метод позволяет задать параметрам этого эллипса указанные значения.
Метод позволяет задать параметрам этого эллипса указанные значения.
Условиями построения замкнутого эллипса являются (startAngle = 0), (endAngle = 2PI) и (endAngle - startAngle) > 1e-6.
Отношение полуосей radiusRatio должно находиться в диапазоне [1e-6 to 1.0].
Направления majorAxis и unitNormal должны быть перпендикулярными в пределах допуска 1E-6.
center: Центр эллипса в мировой системе координат (WCS). Тип Point3d.
unitNormal: Единичный вектор нормали плоскости, в которой располагается эллипс. Задается в WCS. Тип Vector3d.
majorAxis: Направление большой оси эллипса в WCS. Тип Vector3d. По модулю составляет половину главной оси эллипса.
radiusRatio: Отношение малого радиуса эллипса к большому. Тип double. Для получения действительного эллипса этот параметр не должен быть меньше 1E-6 или больше 1.0.
startAngle: Начальный угол эллиптической дуги в радианах. Тип double.
endAngle: Конечный угол эллиптической дуги в радианах. Тип double.

Teigha.DatabaseServices.Ellipse.Center
Свойство Center позволяет задать или получить точку центра эллипса или эллиптической дуги (в системе координат WCS).
Свойство Center предоставляет доступ к точке центра эллипса или эллиптической дуги (в системе координат WCS).
Returns: Возвращает центр эллипса или эллиптической дуги.  Тип Point3d.

Teigha.DatabaseServices.Ellipse.EndAngle
Свойство EndAngle предоставляет доступ к конечному углу эллипса или эллиптической дуги в радианах.
Свойство EndAngle предоставляет доступ к конечному углу эллипса или эллиптической дуги в радианах.
Returns: Возвращает конечный угол. Тип double.

Teigha.DatabaseServices.Ellipse.EndParam
Свойство EndParam обеспечивает доступ к конечному значению параметра данного эллипса.
Свойство EndParam обеспечивает доступ к конечному значению параметра данного эллипса.
Returns: Возвращает конечный параметр эллипса. Тип double.

Teigha.DatabaseServices.Ellipse.IsNull
Свойство IsNull позволяет определить, действителен ли данный эллипс или эллиптическая дуга.
Свойство IsNull позволяет определить, действителен ли данный эллипс или эллиптическая дуга.
Returns: Возвращает true, если эллипс (или эллиптическая дуга) оказался недействительным.
В противном случае возвращает false.

Teigha.DatabaseServices.Ellipse.MajorAxis
Свойство MajorAxis возвращает направление большой оси эллипса или эллиптической дуги.
Свойство MajorAxis возвращает направление большой оси эллипса или эллиптической дуги.
Returns: Возвращает направление большой оси эллипса или эллиптической дуги.  Тип Vector3d.

Teigha.DatabaseServices.Ellipse.MajorRadius
Свойство MajorRadius возвращает длину большой полуоси эллипса или эллиптической дуги.
Свойство MajorRadius возвращает длину большой полуоси эллипса или эллиптической дуги.
Returns: Возвращает длину большой полуоси эллипса. Тип double.

Teigha.DatabaseServices.Ellipse.MinorAxis
Свойство MinorAxis возвращает направление малой оси эллипса или эллиптической дуги.
Свойство MinorAxis возвращает направление малой оси эллипса или эллиптической дуги.
Returns: Возвращает направление малой оси эллипса. Тип Vector3d.

Teigha.DatabaseServices.Ellipse.MinorRadius
Свойство MinorRadius возвращает длину малой полуоси эллипса или эллиптической дуги.
Свойство MinorRadius возвращает длину малой полуоси эллипса или эллиптической дуги.
Returns: Возвращает длину малой полуоси эллипса. Тип double.

Teigha.DatabaseServices.Ellipse.Normal
Свойство Normal возвращает вектор нормали плоскости, которой принадлежит данный эллипс или эллиптическая дуга.
Свойство Normal возвращает вектор нормали плоскости, которой принадлежит данный эллипс или эллиптическая дуга.
Returns: Возвращает вектор нормали плоскости. Тип Vector3d.

Teigha.DatabaseServices.Ellipse.RadiusRatio
Свойство RadiusRatio возвращает отношение длин малой и большой полуосей данного эллипса или эллиптической дуги.
Свойство RadiusRatio возвращает отношение длин малой и большой полуосей данного эллипса или эллиптической дуги.
Возвращаемое значение лежит в интервале [1e-6, 1.0].
Returns: Возвращает отношение длин полуосей эллипса или эллиптической дуги. Тип double.

Teigha.DatabaseServices.Ellipse.StartAngle
Свойство StartAngle возвращает значение начального угла данного эллипса или эллиптической дуги.
Свойство StartAngle возвращает значение начального угла данного эллипса или эллиптической дуги.
Returns: Возвращает значение начального угла эллипса или эллиптической дуги.  Тип double.

Teigha.DatabaseServices.Ellipse.StartParam
Свойство StartParam обеспечивает доступ к значению начального параметра эллипса или эллиптической дуги.
Свойство StartParam обеспечивает доступ к значению начального параметра эллипса или эллиптической дуги.
Параметр — это угол, измеряемый от большой оси против часовой стрелки в интервале от 0 до 2PI радиан, как если бы эллипс был окружностью с радиусом MajorRadius.
Returns: Возвращает значение начального параметра эллипса в радианах. Тип double.