Teigha.DatabaseServices.FieldEvaluatorLoader
Класс FieldEvaluatorLoader предназначен для загрузки вычислителей, которые необходимы для вычисления полей.
Класс FieldEvaluatorLoader используется для загрузки вычислителей, которые необходимы для вычисления полей.
Notes
Этот класс играет роль интерфейса между фреймворком полей и приложениями, которые реализуют свои вычислители полей.
Приложение, которое реализует вычислитель, должно наследовать этот класс и регистрировать объект этого класса в движке вычисления полей при загрузке приложения.
Зарегистрированный загрузчик используется фреймворком для получения объекта вычислителя.
Приложению требуется только один объект загрузчика, и он может поддерживать несколько вычислителей.
Объекты загрузчика поддерживаются глобально и используются всеми открытыми документами.

Teigha.DatabaseServices.FieldEvaluatorLoader.#ctor
Конструктор по умолчанию класса FieldEvaluatorLoader.
Конструктор по умолчанию класса FieldEvaluatorLoader.

Teigha.DatabaseServices.FieldEvaluatorLoader.FindEvaluator(Teigha.DatabaseServices.Field,String%)
Метод предоставляет вычислитель для поля, у которого не задан идентификатор вычислителя.
Метод предоставляет вычислитель для поля, у которого не задан идентификатор вычислителя.
pField: Поле, для которого требуется найти вычислитель. Тип Field.
pszEvalId: Найденный идентификатор вычислителя. Тип String.
Returns: Возвращает вычислитель, найденный для поля pField.
Тип FieldEvaluator.

Teigha.DatabaseServices.FieldEvaluatorLoader.GetEvaluator(String)
Движок вычисления полей вызывает этот метод, чтобы получить вычислитель по его идентификатору, после чего использует вычислитель для вычисления поля.
Движок вычисления полей вызывает этот метод, чтобы получить вычислитель по его идентификатору, после чего использует вычислитель для вычисления поля.
pszEvalId: Входной идентификатор требуемого вычислителя. Тип String.
Returns: Возвращает вычислитель с идентификатором pszEvalId.
Тип FieldEvaluator.