Teigha.DatabaseServices.DataTypeParameter
Структура DataTypeParameter представляет параметр типа данных.
Структура DataTypeParameter представляет параметр типа данных.

Teigha.DatabaseServices.DataTypeParameter.#ctor(Teigha.DatabaseServices.DataType,Teigha.DatabaseServices.UnitType)
Конструктор структуры DataTypeParameter.
Создает экземпляр структуры с указанными типом данных и типом единиц измерения.
Конструктор структуры DataTypeParameter.
Создает экземпляр структуры с указанными типом данных и типом единиц измерения.
dataType: Тип данных. Тип DataType.
unitType: Тип единиц измерения. Тип UnitType.

Teigha.DatabaseServices.DataTypeParameter.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
other: Входной объект, который проверяется на равенство данному объекту. Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.DatabaseServices.DataTypeParameter.!=(Teigha.DatabaseServices.DataTypeParameter,Teigha.DatabaseServices.DataTypeParameter)
Оператор неравенства для структуры DataTypeParameter.
Оператор неравенства для структуры DataTypeParameter.
Проверяет факт неравенства двух экземпляров структуры.
t1: Левый операнд.  Тип DataTypeParameter.
t2: Правый операнд. Тип DataTypeParameter.
Returns: Возвращает true в случае неравенства операндов (причем оба могут быть равны null).
Условием неравенства является невыполнение хотя бы одного из следующих условий:
* Типы данных равны.
* Типы единиц измерения равны.
В противном случае возвращает false. Тип bool.

Teigha.DatabaseServices.DataTypeParameter.==(Teigha.DatabaseServices.DataTypeParameter,Teigha.DatabaseServices.DataTypeParameter)
Оператор равенства для структуры DataTypeParameter.
Оператор равенства для структуры DataTypeParameter.
Проверяет факт равенства двух экземпляров структуры.
t1: Левый операнд.  Тип DataTypeParameter.
t2: Правый операнд. Тип DataTypeParameter.
Returns: Возвращает true, если оба операнда не равны null и совместно выполняется следующие условия:
* Типы данных равны.
* Типы единиц измерения равны.
В противном случае возвращает false. Тип bool.

Teigha.DatabaseServices.DataTypeParameter.DataType
Свойство DataType представляет тип данных для этого экземпляра структуры.
Свойство DataType представляет тип данных для этого экземпляра структуры.
Returns: Возвращает тип данных.
Значение из перечисления DatabaseServices.DataType.

Teigha.DatabaseServices.DataTypeParameter.UnitType
Свойство UnitType представляет тип единиц измерения для этого экземпляра структуры.
Свойство UnitType представляет тип единиц измерения для этого экземпляра структуры.
Returns: Возвращает тип единиц измерения.
Значение из перечисления DatabaseServices.UnitType.