Teigha.DatabaseServices.DBObject.OpenedForModify
Событие происходит каждый раз, когда объект открывается для изменения в режиме OpenMode.ForWrite.
Событие происходит каждый раз, когда объект открывается для изменения в режиме OpenMode.ForWrite.
Returns: Тип данных EventHandler, представляющий обработчик события.