Teigha.DatabaseServices.AlignedDimension
Класс AlignedDimension представляет тип размера, определяющего расстояние между двумя произвольными точками в пространстве.
Класс AlignedDimension используется для представления размера, определяющего расстояние между двумя произвольными точками в пространстве.
Вектор нормали размера должен быть перпендикулярен линии, соединяющей эти две опорные точки.
Опорные точки служат началом двух выносных линий размера.

Teigha.DatabaseServices.AlignedDimension.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию создает новый объект AlignedDimension, у которого точка привязки размерной линии и обе начальные точки выносных линий установлены в положение (0,0,0).  Угол наклона размерной линии равен 0.0.  Кроме того, выполняются конструкторы по умолчанию родительских классов Dimension, Entity и др.

Teigha.DatabaseServices.AlignedDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Данный конструктор создает новый объект AlignedDimension с использованием переданных в конструктор параметров (опорные точки, размерный текст, размерный стиль и т.д.).
Данный конструктор создает новый объект AlignedDimension, у которого задаются две опорные точки, между которыми измеряется расстояние, точка на размерной линии, текст на размере и идентификатор ObjectId стиля размера.
line1Point: Первая опорная точка размера, от которой измеряется длина. В ней начинается первая выносная линия. Тип Point3d.
line2Point: Вторая опорная точка размера, до которой измеряется длина. В ней начинается вторая выносная линия. Тип Point3d.
dimensionLinePoint: Точка, лежащая на размерной линии. Тип Point3d.
dimensionText: Текст на размере, заменяет текстовое представление измеренного значения. Тип String.
dimensionStyle: Идентификатор ObjectId размерного стиля, который используется для отображения объекта AlignedDimension.

Teigha.DatabaseServices.AlignedDimension.Oblique
Свойство предоставляет доступ на изменение к углу наклона этого размера (в радианах).
Свойство предоставляет доступ на изменение к углу наклона данного размера (в радианах).
Этот угол относится к линии, проходящей через начальные точки обеих выносных линий (xLine1Point и xLine2Point).
Положительным направлением отсчета углов является направление против часовой стрелки, если смотреть вдоль оси Z системы координат размера (OCS) в сторону начала координат.
Линия, соединяющая обе начальных точки выносных линий, делит плоскость, которой принадлежит размер, на две полуплоскости.
Выносные линии размера могут находиться только в той полуплоскости, в которой содержится точка определения размерной линии (см. свойство dimLinePoint).
Таким образом, угол наклона является периодическим с периодом от 0 до pi.
Углы наклона, превышающие число pi, приводятся к эквивалентным углам в первом периоде.
Отрицательные углы являются периодическими в пределах от 0 до -pi и дают тот же наклон, что и положительные углы, которые получаются при добавлении числа pi к отрицательному значению в первом периоде (например, -pi/4 дает  3*(pi/4).
Нулевой угол представляет собой особый случай, который интерпретируется как «использовать значение по умолчанию» и соответствует углу наклона pi/2 (90 градусов).
Returns: Возвращает угол наклона данного размера в радианах.

Teigha.DatabaseServices.AlignedDimension.dimLinePoint
Свойство предоставляет доступ на изменение к точке определения размерной линии (в координатах WCS).
Свойство предоставляет доступ на изменение к точке определения размерной линии (в координатах WCS).
Эта точка гарантированно располагается где-то на размерной линии.
Returns: Возвращает точку Point3d в мировой системе координат (WCS).

Teigha.DatabaseServices.AlignedDimension.xLine1Point
Свойство предоставляет доступ на изменение к начальной точке первой выносной линии размера (в координатах WCS).
Свойство предоставляет доступ на изменение к начальной точке первой выносной линии размера (в координатах WCS).
Returns: Возвращает начальную точку первой выносной линии размера (в координатах WCS).  Тип Point3d.

Teigha.DatabaseServices.AlignedDimension.xLine2Point
Свойство предоставляет доступ на изменение к начальной точке второй выносной линии размера (в координатах WCS).
Свойство предоставляет доступ на изменение к начальной точке второй выносной линии размера (в координатах WCS).
Returns: Возвращает начальную точку второй выносной линии размера (в координатах WCS). Тип Point3d.