Teigha.BoundaryRepresentation.Element2dShape
Данное перечисление определяет поддерживаемые геометрические формы 2D-элементов.
Данное перечисление определяет поддерживаемые геометрические формы 2D-элементов.