Teigha.DatabaseServices.DxfFiler.ReadPoint2d
Метод возвращает двумерную точку Point2d из текущего элемента этого объекта Filer.
Метод возвращает двумерную точку Point2d из текущего элемента этого объекта Filer.
Returns: Возвращает двумерную точку. Тип Point2d.