HostMgd.EditorInput.PointFilterEventArgs
Класс предоставляет данные для события PointFilter,
происходящего при перемещении мыши в редакторе nanoCAD.
Класс наследуется от EventArgs и реализует интерфейс IDisposable.
Он используется в связке с событием PointFilter редактора nanoCAD
и предоставляет доступ к координатам точки, связанной с текущим положением мыши.
Этот класс позволяет модифицировать точку ввода динамически
— например, применять пользовательские привязки или ограничения
во время интерактивных операций. Объект этого класса создаётся системой
при каждом перемещении указателя и участвует в обработке фильтрации
перед использованием точки в команде.
Notes
Так как класс реализует IDisposable, его необходимо корректно освобождать
после использования, особенно при работе с неуправляемыми ресурсами.
Example
C#

HostMgd.EditorInput.PointFilterEventArgs.CallNext
Свойство предназначено для определения, будет ли вызван следующий фильтр
в цепочке обработки события PointFilter.
Свойство используется в контексте события PointFilter, чтобы указать,
требуется ли продолжить фильтрацию точки другими зарегистрированными
обработчиками после текущего. Это позволяет управлять порядком
и поведением нескольких фильтров, задавая, должен ли результат текущего фильтра
передаваться далее по цепочке или остановиться на этом этапе.
Returns: Возвращает значение типа bool:
* true — если будет вызван следующий фильтр в цепочке.
* false — если дальнейшая фильтрация отменяется.
Это значение доступно только для чтения и определяется системой на основе текущего контекста обработки события.
Example
C#

HostMgd.EditorInput.PointFilterEventArgs.Context
Свойство предоставляет объект, содержащий контекстную информацию
о текущей операции ввода точки.
Свойство возвращает экземпляр класса InputPointContext,
который содержит дополнительные данные о контексте интерактивного ввода точки.
Оно используется при обработке события PointFilter и позволяет получить информацию
о типе ввода, состоянии привязок, текущем маркере графического ввода
и других параметрах, влияющих на поведение точки в редакторе nanoCAD.
Returns: Возвращает объект типа InputPointContext, предоставляющий доступ к контексту ввода точки — например:
* Текущая система координат (UCS).
* Активные режимы привязки.
* Маркер (GSMarker) для точечного ввода.
* Состояние командной строки и другие параметры.
Если контекст не определён или событие завершено, может вернуть null.
Example
C#

HostMgd.EditorInput.PointFilterEventArgs.Result
Свойство предоставляет доступ к объекту, позволяющему установить
или изменить результат текущего события фильтрации точки.
Свойство возвращает объект типа PointFilterResult, который используется
для управления итоговым значением точки ввода во время обработки события PointFilter.
Оно позволяет не только получить текущий результат, но и изменить точку, цвет,
стиль отображения и другие параметры, влияющие на интерактивный ввод мыши в nanoCAD.
Это особенно полезно при реализации пользовательских привязок,
ограничений по осям или визуальных подсказок.
Returns: Возвращает объект типа PointFilterResult, содержащий:
* Point — текущая точка ввода (может быть изменена).
* Color — цвет курсора или маркера.
* CursorType — тип курсора, отображаемого при фильтрации.
* Mode — режим фильтрации.
* Другие параметры, управляющие поведением точки.
Если событие ещё не инициализировало результат, может вернуть null.
Example
C#