Teigha.DatabaseServices.HostApplicationServices.NewProgressMeter
Метод позволяет получить индикатор прогресса, который визуально отражает ход завершения некоторого процесса.
В текущей версии не реализован.
Метод позволяет получить индикатор прогресса, который визуально отражает ход завершения некоторого процесса.
В текущей версии не реализован.
Returns: Если метод реализован, возвращает индикатор прогресса. Тип ProgressMeter.
В текущей версии возвращает null.