Teigha.DatabaseServices.ObjectErasedEventArgs
Данный класс представляет данные для события ObjectErased в базе данных.
Данный класс представляет данные для события ObjectErased в базе данных.

Teigha.DatabaseServices.ObjectErasedEventArgs.DBObject
Свойство DBObject представляет изменённый объект.
Свойство DBObject представляет изменённый объект.
Returns: Возвращает изменённый объект. Тип DatabaseServices.DBObject.

Teigha.DatabaseServices.ObjectErasedEventArgs.Erased
Свойство позволяет проверить, является ли указанный объект удалённым.
Свойство позволяет проверить, является ли указанный объект удалённым.
Returns: Возвращает true, если объект считается удалённым.
В противном случае возвращает false.