Teigha.DatabaseServices.PolygonMesh.Straighten
Метод удаляет все опорные вершины сплайна и восстанавливает исходную полигональную сеть контрольных точек.
Метод удаляет все опорные вершины сплайна и восстанавливает исходную полигональную сеть контрольных точек.
Эта операция выполняет ту же модификацию, что и опция «Desmooth» команды PEDIT.