HostMgd.ApplicationServices.DocumentActivationChangedEventArgs
Класс, обеспечивающий данными событие
DocumentActivationChanged класса DocumentCollection.

HostMgd.ApplicationServices.DocumentActivationChangedEventArgs.NewValue
Возвращает признак, является ли документ активным.