Teigha.DatabaseServices.DwgFiler.ReadBoolean
Метод предназначен для получения логического значения из текущего элемента этого объекта Filer.
Метод предназначен для получения логического значения из текущего элемента этого объекта Filer.
Returns: Возвращает логическое значение из текущего элемента этого объекта Filer.