Teigha.Geometry.Matrix2d.IsScaledOrtho
Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах точности по умолчанию.
Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу.
Используется вызов метода Matrix2d.IsScaledOrtho(Tolerance tolerance) с точностью по умолчанию, которая равна Tolerance.Global.
Returns: Возвращает true, если с указанной точностью векторы в линейной части данной матрицы можно считать ортогональными друг другу.
В противном случае возвращает false.