Teigha.DatabaseServices.ShadowSamplingMultiplier
Перечисление ShadowSamplingMultiplier определяет допустимые значения множителя выборки теней для протяженных источников света.
Перечисление ShadowSamplingMultiplier определяет допустимые значения множителя выборки теней для протяженных источников света.