Teigha.Geometry.CircularArc3d
Класс CircularArc3d представляет окружности и круглые дуги в трёхмерном пространстве.
Класс CircularArc3d представляет окружности и круглые дуги в трёхмерном пространстве.

Teigha.Geometry.CircularArc3d.#ctor
Конструктор по умолчанию класса CircularArc3d.
Создает трехмерную единичную окружность в плоскости XY с центром в точке (0,0,0).
Конструктор по умолчанию класса CircularArc3d.
Создает трехмерную единичную окружность в плоскости XY (вектор нормали (0,0,1)) с центром в точке (0,0,0).

Teigha.Geometry.CircularArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса CircularArc3d.
Создает круглую дугу по трем точкам.
Конструктор класса CircularArc3d.
Создает круглую дугу по трем точкам.
Никакие две точки из этих трех не должны совпадать, и все три не должны лежать на одной прямой.
Данный конструктор всегда строит ограниченную дугу и не может использоваться для построения полной окружности.
startPoint: Начальная точка дуги. Тип Point3d.
point: Точка на дуге. Тип Point3d.
endPoint: Конечная точка дуги. Тип Point3d.

Teigha.Geometry.CircularArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Конструктор класса CircularArc3d.
Создает окружность с заданными центром, радиусом и вектором нормали плоскости дуги.
Конструктор класса CircularArc3d.
Создает окружность с заданными центром, радиусом и вектором нормали плоскости дуги.
Созданная 3D-окружность ориентирована против часовой стрелки вокруг вектора нормали.
center: Центр 3D-окружности.  Тип Point3d.
normal: Вектор нормали плоскости, в которой создается 3D-окружность.  Тип Vector3d.
radius: Радиус 3D-окружности.  Тип double. Радиус не может равняться 0.

Teigha.Geometry.CircularArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Конструктор класса CircularArc3d.
Создает в заданной плоскости круглую 3D-дугу с указанными центром, радиусом, начальным и конечным углами.
Конструктор класса CircularArc3d.
Создает в заданной плоскости круглую 3D-дугу с указанными центром, радиусом, начальным и конечным углами.
Кроме того, задается направление, от которого будут отсчитываться углы.
Notes
Векторы normal и referenceVector должны быть перпендикулярными.
Угол измеряется против часовой стрелки вокруг вектора нормали.
Направление вектора referenceVector определяет начало отсчета углов (нулевой угол).
Угол начальной точки дуги startAngle должен быть меньше угла конечной точки endAngle.
Все углы представляются в радианах.
center: Центр дуги. Тип Point3d.
normal: Вектор нормали плоскости, в которой создается 3D-дуга. Тип Vector3d.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип Vector3d.
radius: Радиус дуги. Тип double. Не может равняться 0.
startAngle: Угол начальной точки дуги. Тип double.
endAngle: Угол конечной точки дуги. Тип double.

Teigha.Geometry.CircularArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity)
Метод позволяет найти на данной дуге точку, ближайшую к указанной плоскости.
Метод позволяет найти точку на данной дуге, которая находится ближе всего к заданной плоскости plane.
Используется вызов метода CircularArc3d.ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance) со значением точности, равным Tolerance.Global.
Результатом является массив из двух точек, в котором нулевой элемент соответствует ближайшей точке на дуге, а первый элемент - ближайшей точке на плоскости plane.
plane: Входная плоскость, для которой требуется найти ближайшую точку на дуге. Тип PlanarEntity.
Returns: Возвращает массив из двух ближайших точек, соответственно, на дуге и на плоскости.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет найти на данной дуге точку, ближайшую к указанной плоскости в пределах заданной точности.
Метод позволяет найти точку на данной дуге, которая находится ближе всего к заданной плоскости plane.
Вычисления выполняются с использованием заданной точности tolerance.
Результатом является массив из двух точек, в котором нулевой элемент соответствует ближайшей точке на дуге, а первый элемент - ближайшей точке на плоскости plane.
plane: Входная плоскость, для которой требуется найти ближайшую точку на дуге. Тип PlanarEntity.
tolerance: Точность вычислений. Тип Tolerance.
Returns: Возвращает массив из двух ближайших точек, соответственно, на дуге и на плоскости.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта CircularArc3d на основе переданного указателя.
Метод предназначен для создания объекта CircularArc3d на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на основе которого создается дуга CircularArc3d. Тип IntPtr.
autoDelete: Входной флаг, указывающий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданную дугу. Тип CircularArc3d.

Teigha.Geometry.CircularArc3d.GetTangent(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти трехмерную линию касательной в указанной точке этой дуги.
Метод позволяет с заданной точностью найти трехмерную линию касательной в указанной точке этой дуги.
pointValue: Входная точка на дуге.  Тип Point3d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает 3D-линию касательной к дуге в заданной точке дуги.
Тип Line3d.

Teigha.Geometry.CircularArc3d.GetTangent(Teigha.Geometry.Point3d)
Метод позволяет найти линию касательной в заданной точке дуги.
Метод позволяет найти трехмерную линию касательной в заданной точке этой дуги.
Используется вызов метода CircularArc3d.GetTangent(Point3d pointValue, Tolerance tolerance) со значением точности, равным Tolerance.Global.
pointValue: Входная точка на дуге, в которой требуется вычислить линию касательной.  Тип Point3d.
Returns: Возвращает 3D-линию касательной к дуге в заданной точке дуги.
Тип Line3d.

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.CircularArc3d)
Метод позволяет найти точки пересечения данной дуги с другой 3D-дугой.
Метод позволяет найти точки пересечения данной дуги с указанной 3D-дугой arc.
Используется вызов метода CircularArc3d.IntersectWith(CircularArc3d arc, Tolerance tolerance) с точностью, равной Tolerance.Global.
arc: Входная трехмерная дуга. Тип CircularArc3d.
Returns: Возвращает массив точек пересечения двух дуг.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.CircularArc3d,Teigha.Geometry.Tolerance)
Метод позволяет найти с заданной точностью точки пересечения данной дуги с другой 3D-дугой.
Метод позволяет найти с заданной точностью точки пересечения данной дуги с другой 3D-дугой.
arc: Входная дуга, точки пересечения с которой требуется найти. Тип CircularArc3d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает массив точек пересечения двух дуг.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод позволяет найти точки пересечения данной дуги с указанной 3D-линией.
Метод позволяет найти точки пересечения данной дуги с указанной 3D-линией.
Используется вызов метода CircularArc3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Входная 3D-линия, точки пересечения с которой требуется найти. Тип LinearEntity3d.
Returns: Возвращает массив точек пересечения дуги и линии.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти точки пересечения данной дуги с указанной 3D-линией.
Метод позволяет с заданной точностью tolerance найти точки пересечения данной дуги с указанной 3D-линией line.
line: Входная 3D-линия, точки пересечения с которой требуется найти. Тип LinearEntity3d.
tolerance: Заданная точность вычислений.  Тип Tolerance.
Returns: Возвращает массив точек пересечения дуги и линии.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.PlanarEntity)
Метод позволяет найти точки пересечения этой дуги с указанной плоскостью.
Метод позволяет найти точки пересечения этой дуги с указанной плоскостью.
Используется вызов метода CircularArc3d.IntersectWith(PlanarEntity plane, Tolerance permit) с точностью, равной Tolerance.Global.
plane: Плоскость, с которой требуется найти точки пересечения данной дуги. Тип PlanarEntity.
Returns: Возвращает массив точек пересечения дуги и плоскости.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти точки пересечения этой дуги с указанной плоскостью.
Метод позволяет с заданной точностью tolerance найти точки пересечения этой дуги с указанной плоскостью plane.
plane: Входная плоскость, точки пересечения с которой требуется найти. Тип PlanarEntity.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает массив точек пересечения дуги с плоскостью.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.IsInside(Teigha.Geometry.Point3d)
Метод позволяет определить, лежит ли указанная точка внутри данной дуги.
Метод позволяет определить, лежит ли указанная точка внутри данной дуги.
Этот метод рассматривает дугу как полную окружность, даже если она ограничена, и определяет, лежит ли входная точка внутри этой полной окружности.
Используется вызов метода CircularArc3d.IsInside(Point3d pointValue, Tolerance tolerance) с точностью, равной Tolerance.Global.
pointValue: Входная точка. Тип Point3d.
Returns: Возвращает true, если точка pointValue лежит внутри полной окружности данной дуги.
Возвращает значение false, если точка pointValue лежит на окружности или вне её или не лежит в плоскости дуги.

Teigha.Geometry.CircularArc3d.IsInside(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью определить, лежит ли указанная точка внутри данной дуги.
Метод позволяет с заданной точностью определить, лежит ли указанная точка внутри данной дуги.
Этот метод рассматривает дугу как полную окружность, даже если она ограничена, и определяет, лежит ли входная точка внутри полной окружности.
pointValue: Входная точка. Тип Point3d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает true, если точка pointValue лежит внутри полной окружности данной дуги.
Возвращает значение false, если точка pointValue лежит на окружности или за ее пределами или не лежит в плоскости дуги.

Teigha.Geometry.CircularArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d)
Метод позволяет найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
Метод позволяет найти точки пересечения проекций данной дуги и линии line на плоскость с вектором нормали projectionDirection.
Другими словами, метод находит те точки на дуге и линии, которые проецируются в одну и ту же точку на этой плоскости.
Используется вызов метода CircularArc3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
Notes
Метод используется преимущественно в задачах, где projectionDirection представляет собой направление взгляда.
В этом случае метод возвращает точки, которые представляются наблюдателю точками пересечения линии с дугой (но фактически точками пересечения могут и не быть).
line: Входная 3D-линия. Тип LinearEntity3d.
projectionDirection: Направление проецирования (нормаль плоскости проекции). Тип Vector3d.
Returns: Возвращает массив точек пересечения проекций дуги и линии на заданную плоскость.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
Метод позволяет с заданной точностью найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
Notes
Метод используется преимущественно в задачах, где projectionDirection представляет собой направление взгляда.
В этом случае метод возвращает точки, которые представляются наблюдателю точками пересечения линии с дугой (но фактически точками пересечения могут и не быть).
line: Входная 3D-линия. Тип LinearEntity3d.
projectionDirection: Направление проецирования (нормаль плоскости проецирования). Тип Vector3d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает массив точек пересечения проекций дуги и линии на заданную плоскость.
Тип Point3d[].

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить данную дугу по трем заданным точкам.
Метод позволяет переопределить данную дугу по трем заданным точкам.
Notes
Входные точки не должны лежать на одной прямой.
startPoint: Начальная точка дуги. Тип Point3d.
pointOnArc: Точка на дуге. Тип Point3d.
endPoint: Конечная точка дуги. Тип Point3d.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Метод позволяет переопределить дугу в полную окружность в указанной плоскости с заданными центром и радиусом.
Метод позволяет переопределить дугу в полную окружность в указанной плоскости с заданными центром и радиусом.
Notes
Окружность будет ориентирована против часовой стрелки относительно вектора нормали плоскости.
center: Цент окружности. Тип Point3d.
normal: Вектор нормали плоскости, в которой располагается окружность. Тип Vector3d.
radius: Радиус окружности. Тип double. Не может равняться 0.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Метод позволяет переопределить все параметры данной дуги - центр, радиус, начальный и конечный углы, плоскость, а также направление отсчета углов.
Метод позволяет переопределить все параметры данной дуги - центр, радиус, начальный и конечный углы, плоскость, а также направление отсчета углов.
Notes
Векторы normal и referenceVector должны быть перпендикулярными.
Угол измеряется против часовой стрелки вокруг вектора нормали.
Направление вектора referenceVector определяет начало отсчета углов (нулевой угол).
Угол начальной точки дуги startAngle должен быть меньше угла конечной точки endAngle.
Все углы представляются в радианах.
center: Центр дуги. Тип Point3d.
normal: Вектор нормали плоскости, в которой располагается 3D-дуга. Тип Vector3d.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип Vector3d.
radius: Радиус дуги. Тип double.
startAngle: Угол начальной точки дуги. Тип double.
endAngle: Угол конечной точки дуги. Тип double.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,System.Double,System.Double,System.Double)
Метод переопределяет дугу так, чтобы она имела заданный радиус и касалась двух указанных кривых.
Метод переопределяет дугу так, чтобы она имела заданный радиус и касалась двух указанных кривых.
Notes
Если новую дугу с указанными параметрами построить невозможно, данная дуга остается без изменений.
Кривые curve1 и curve2 должны быть компланарными.
curve1: Первая 3D-кривая, задающая условие касательности дуги. Тип Curve3d.
curve2: Вторая 3D-кривая, задающая условие касательности дуги. Тип Curve3d.
radius: Радиус дуги. Тип double.
param1: Возвращает параметр, соответствующий точке касания на кривой curve1.  Тип double.
param2: Возвращает параметр, соответствующий точке касания на кривой curve2.  Тип double.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 3D-кривым.
Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 3D-кривым.
Notes
Если круглую дугу с указанными требованиями построить не удаётся, то данная дуга будет оставлена без изменений.
curve1: Первая 3D-кривая, задающая условие касательности дуги.  Тип Curve3d.
curve2: Вторая 3D-кривая, задающая условие касательности дуги.  Тип Curve3d.
curve3: Третья 3D-кривая, задающая условие касательности дуги.  Тип Curve3d.
param1: Возвращает параметр, соответствующий точке касания на кривой curve1. Тип double.
param2: Возвращает параметр, соответствующий точке касания на кривой curve2. Тип double.
param3: Возвращает параметр, соответствующий точке касания на кривой curve3. Тип double.

Teigha.Geometry.CircularArc3d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить углы начальной и конечной точек данной дуги.
Метод позволяет переопределить углы начальной и конечной точек данной дуги.
startAngle: Новое значение начального угла. Тип double.
endAngle: Новое значение конечного угла.  Тип double.

Teigha.Geometry.CircularArc3d.SetAxes(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить вектор нормали и опорный вектор дуги.
Метод позволяет переопределить вектор нормали и опорный вектор дуги.
Векторы normal и referenceVector должны быть перпендикулярны друг другу.
normal: Вектор нормали плоскости, в которой располагается дуга. Тип Vector3d.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип Vector3d.

Teigha.Geometry.CircularArc3d.Center
Свойство Center предоставляет доступ к точке центра дуги.
Свойство Center предоставляет доступ к точке центра дуги.
Returns: Возвращает точку центра дуги. Тип Point3d.

Teigha.Geometry.CircularArc3d.EndAngle
Свойство EndAngle представляет угол конечной точки дуги.
Свойство EndAngle представляет угол конечной точки дуги.
Returns: Возвращает угол конечной точки дуги. Тип double.

Teigha.Geometry.CircularArc3d.EndPoint
Свойство EndPoint представляет конечную точку дуги.
Свойство EndPoint представляет конечную точку дуги.
Returns: Возвращает конечную точку дуги.
Тип Point3d.

Teigha.Geometry.CircularArc3d.Normal
Свойство Normal представляет вектор нормали плоскости дуги.
Свойство Normal представляет вектор нормали плоскости дуги.
Returns: Возвращает вектор нормали плоскости дуги.
Тип Vector3d.

Teigha.Geometry.CircularArc3d.Radius
Свойство Radius предоставляет доступ к значению радиуса дуги.
Свойство Radius предоставляет доступ к значению радиуса дуги.
Returns: Возвращает радиус дуги.
Тип double.

Teigha.Geometry.CircularArc3d.ReferenceVector
Свойство ReferenceVector представляет опорный вектор отсчета углов дуги.
Свойство ReferenceVector представляет опорный вектор отсчета углов дуги.
Returns: Возвращает опорный вектор дуги. Тип Vector3d.

Teigha.Geometry.CircularArc3d.StartAngle
Свойство StartAngle представляет угол начальной точки дуги.
Свойство StartAngle представляет угол начальной точки дуги.
Returns: Возвращает угол начальной точки дуги.
Тип double.

Teigha.Geometry.CircularArc3d.StartPoint
Свойство StartPoint представляет начальную точку дуги.
Свойство StartPoint представляет начальную точку дуги.
Returns: Возвращает начальную точку дуги.
Тип Point3d.