Teigha.Geometry.CubicSplineCurve3d
Класс CubicSplineCurve3d представляет интерполяционный кубический сплайн в трехмерном пространстве.
Класс CubicSplineCurve3d представляет интерполяционный кубический сплайн в трехмерном пространстве.

Teigha.Geometry.CubicSplineCurve3d.#ctor
Конструктор по умолчанию класса CubicSplineCurve3d.
Инициализирует кубический сплайн с пустым списком точек.
Конструктор по умолчанию класса CubicSplineCurve3d.
Инициализирует кубический сплайн с пустым списком точек (т.е. без фактических данных).

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Curve3d,System.Double)
Конструктор класса CubicSplineCurve3d.
Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
Конструктор класса CubicSplineCurve3d.
Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции epsilon.
curve: Кривая, для которой следует создать интерполирующий ее кубический сплайн. Тип Curve3d.
epsilon: Заданная точность интерполяции.  Тип double.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,System.Boolean)
Конструктор класса CubicSplineCurve3d.
Создает экземпляр класса с указанными определяющими точками, узловым вектором и первыми производными в определяющих точках.
Конструктор класса CubicSplineCurve3d.
Создает экземпляр класса с заданными определяющими точками, первыми производными в них и узловым вектором.
Дополнительно можно потребовать построение периодического (замкнутого) сплайна.
knots: Входной узловой вектор.  Тип KnotCollection.
fitPoints: Входная коллекция определяющих точек.  Тип Point3dCollection.
firstDerivatives: Входная коллекция векторов первых производных.  Тип Vector3dCollection.
periodic: Флаг, указывающий, что сплайн должен быть периодическим (замкнутым). Тип bool.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection)
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки.
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки.
Используется вызов метода CubicSplineCurve3d(ref Point3dCollection fitPoints, Tolerance tolerance) с точностью интерполяции Tolerance.Global.
points: Входной массив определяющих точек сплайна.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Tolerance)
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, с заданной точностью проходящий через указанные определяющие точки.
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, с заданной точностью проходящий через указанные определяющие точки.
points: Входной массив определяющих точек сплайна.  Тип Point3dCollection.
tolerance: Заданная точность интерполяции.  Тип Tolerance.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, и с указанными векторами первых производных в начале и в конце сплайна.
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, и с указанными векторами первых производных в начале и в конце сплайна.
Используется вызов метода CubicSplineCurve3d(ref Point3dCollection points, Vector3d startDerivative, Vector3d endDerivative, Tolerance tolerance); с точностью интерполяции Tolerance.Global.
points: Входной массив определяющих точек сплайна. Тип Point3dCollection.
startDerivative: Первая производная в начальной точке. Тип Vector3d.
endDerivative: Первая производная в конечной точке. Тип Vector3d.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, проходящий предписанной точностью через заданные определяющие точки, и с указанными векторами первых производных в начале и в конце сплайна.
Конструктор класса CubicSplineCurve3d.
Создает интерполяционный кубический сплайн, проходящий предписанной точностью через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
points: Входной массив определяющих точек сплайна. Тип Point3dCollection.
startDerivative: Первая производная в начальной точке. Тип Vector3d.
endDerivative: Первая производная в конечной точке. Тип Vector3d.
tolerance: Заданная точность интерполяции. Тип Tolerance.

Teigha.Geometry.CubicSplineCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект CubicSplineCurve3d на основе переданного указателя.
Метод создает объект CubicSplineCurve3d на основе переданного указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный трехмерный кубический сплайн.
Тип CubicSplineCurve3d.

Teigha.Geometry.CubicSplineCurve3d.FirstDerivativeAt(System.Int32)
Метод позволяет получить вектор первой производной в определяющей точке с заданным индексом.
Метод позволяет получить вектор первой производной в определяющей точке с заданным индексом.
i: Индекс определяющей точки, в которой требуется вычислить вектор первой производной.
Returns: Возвращает вектор первой производной в указанной определяющей точке сплайна.
Тип Vector3d.

Teigha.Geometry.CubicSplineCurve3d.FitPointAt(System.Int32)
Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
i: Индекс искомой определяющей точки данного сплайна.
Returns: Возвращает определяющую точку сплайна с индексом i.
Тип Point3d.

Teigha.Geometry.CubicSplineCurve3d.SetFirstDerivativeAt(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
i: Индекс определяющей точки.  Тип int.
derivative: Новый вектор первой производной в указанной определяющей точке. Тип Vector3d.

Teigha.Geometry.CubicSplineCurve3d.SetFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
i: Индекс определяющей точки.  Тип int.
point: Новые координаты определяющей точки с индексом i. Тип Point3d.

Teigha.Geometry.CubicSplineCurve3d.NumberOfFitPoints
Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
Returns: Возвращает количество определяющих точек сплайна. Тип int.