Teigha.GraphicsInterface.MaterialTexture
Класс MaterialTexture является абстрактным базовым классом для всех текстур материалов.
Класс MaterialTexture является абстрактным базовым классом для всех текстур материалов.

Teigha.GraphicsInterface.MaterialTexture.#ctor
Конструктор по умолчанию класса MaterialTexture.
Конструктор по умолчанию класса MaterialTexture.