Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs
Класс представляет данные для события BeginWblockEntireDatabase базы данных.
Класс представляет данные для события BeginWblockEntireDatabase базы данных.

Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs.From
Свойство предоставляет доступ к базе данных, для которой выполняется операция Wblock.
Свойство предоставляет доступ к базе данных, для которой выполняется операция Wblock.
Returns: Возвращает объект базы данных. Тип Database.