Teigha.DatabaseServices.SubDMesh.ComputeVolume
Метод предназначен для вычисления текущего объема сети.
Метод предназначен для вычисления текущего объема сети.
Returns: Возвращает объем сети, тип double.