Teigha.DatabaseServices.DBObject.UpgradeFromNotify
Метод обновляет объект, по крайней мере, из режима OpenMode.ForNotify в оба режима OpenMode.ForNotify и OpenMode.ForWrite.
В настоящее время не реализован.
Обновление объекта, который открыт по меньшей мере как
OpenMode.ForNotify, в открытый и как OpenMode.ForNotify, и
как OpenMode.ForWrite.
Эта функция должна сопровождаться в некоторый момент вызовом
DowngradeToNotify() без вызова Open() (в любой из форм) или
Close() между этими вызовами.
Этот метод может быть вызван только из других методов этого
же объекта, вызываемых изнутри объекта. Другими словами, этот
метод предназначен для использования в объекте для изменения
его собственного статуса открытия так, чтобы он мог безопасно
себя изменить.
Returns: Возвращает тип данных bool. true если обновление дотсупа к объекту прошло успешно