HostMgd.PlottingServices.CustomSizeResults.PmpFileReadOnly
Значение: 2048 (0x800).
Файл PMP доступен только для чтения.
Пользовательские размеры бумаги доступны только при условии создания временного PMP-файла.