Teigha.Geometry.Vector3d.GetPerpendicularVector
Метод создает единичный 3D-вектор, который перпендикулярен данному.
Метод создает единичный 3D-вектор, который перпендикулярен данному.
Если абсолютные значения координат x и y исходного вектора одновременно оказываются менее 1/64, то перпендикулярный вектор имеет координаты (vec.z, 0, -vec.x). В противном случае создается вектор (-vec.y, vec.x, 0).  Результат нормируется на единицу.
Returns: Возвращает 3D-вектор единичной длины. Тип Vector3d.