Teigha.Geometry
Пространство имен Teigha.Geometry содержит классы и перечисления, предоставляющие функционал для работы с геометрическими объектами в среде nanoCAD.
Пространство имен Teigha.Geometry содержит классы и перечисления, предоставляющие обширный функционал для работы с геометрическими объектами в среде nanoCAD.
Представлены базовые классы для 2D и 3D геометрических объектов, разнообразные графические примитивы (точки, кривые, поверхности, тела), классы для операций с 2D и 3D векторами и матрицами, а также ряд вспомогательных классов.