Teigha.DatabaseServices.DictionaryWithDefaultDictionary
Данный класс представляет словарь, обладающий записью по умолчанию.
Этот класс расширяет класс DBDictionary концепцией записи «по умолчанию».
Каждый экземпляр этого класса включает элемент данных HardPointerId, в котором хранится идентификатор объекта одной из его записей.
Этот идентификатор жесткого указателя определяет запись по умолчанию.
Для доступа к нему предусмотрены соответствующие методы GetAt() и SetAt().

Teigha.DatabaseServices.DictionaryWithDefaultDictionary.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DictionaryWithDefaultDictionary.DefaultId
Свойство предоставляет доступ на изменение к идентификатору объекта, который является записью по умолчанию для данного словаря.
Свойство предоставляет доступ на изменение к идентификатору объекта, который является записью по умолчанию для данного словаря.
Returns: Возвращает жесткий идентификатор записи по умолчанию данного словаря. Тип DatabaseServices.ObjectId.