Teigha.DatabaseServices.DwgFiler.ReadScale3d
Метод предназначен для получения масштаба из текущего элемента данного объекта Filer.
Метод предназначен для получения масштаба из текущего элемента данного объекта Filer.
Returns: Возвращает масштаб. Тип Scale3d.