Teigha.Geometry.Matrix3d.Transpose
Метод формирует матрицу, являющуюся результатом транспонирования данной матрицы.
Метод формирует матрицу, являющуюся результатом транспонирования данной матрицы.
Returns: Возвращает транспонированную матрицу. Тип Matrix3d.