Teigha.DatabaseServices.PlaceHolder
Данный класс предоставляет способ создания экземпляров заглушек для объектов DBObject.
Класс не имеет собственных данных и не реализует никаких новых методов.
Данный класс предоставляет способ создания экземпляров заглушек для объектов DBObject.
Класс не имеет собственных данных и не реализует никаких новых методов.
Его единственная цель — предоставить объекты для добавления в словари, чтобы  строки ключей в словаре можно было связывать с идентификаторами объектов.
Объекты этого класса используются в словаре имен стилей печати.

Teigha.DatabaseServices.PlaceHolder.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.