Teigha.GraphicsInterface.Tiling
Перечисление Tiling определяет типы мозаичной укладки (тайлинга) при наложении текстуры.
Перечисление Tiling определяет типы мозаичной укладки (тайлинга) при наложении текстуры.