Teigha.DatabaseServices.UnderlayItem
Класс UnderlayItem реализуется хост-приложениями, которым требуется поддержка подложек.
Класс UnderlayItem реализуется хост-приложениями, которым требуется поддержка подложек.
Используется объектами UnderlayDefinition и UnderlayReference для корректной работы.

Teigha.DatabaseServices.UnderlayItem.Extents
Свойство Extents представляет габаритную рамку данного элемента в координатах модели элемента.
Свойство Extents представляет габаритную рамку данного элемента в координатах модели элемента.
Notes
Свойство UnderlayReference.Transform предоставляет матрицу преобразования координат модели элемента в координаты пространства блока.
Координаты пространства блока обычно совпадают с координатами МСК (WCS), если только UnderlayReference не является частью блока.
Returns: Возвращает габаритную рамку элемента.
Тип Extents2d.

Teigha.DatabaseServices.UnderlayItem.Name
Свойство Name представляет уникальное имя данного элемента в файле.
Свойство Name представляет уникальное имя данного элемента в файле.
Returns: Возвращает уникальное имя элемента.
Тип String.

Teigha.DatabaseServices.UnderlayItem.Thumbnail
Свойство Thumbnail представляет изображение предварительного просмотра данного элемента.
Свойство Thumbnail представляет изображение предварительного просмотра данного элемента.
Returns: Возвращает изображение предварительного просмотра элемента.
Тип Bitmap.

Teigha.DatabaseServices.UnderlayItem.Units
Свойство Units представляет единицы измерения, используемые данным элементом.
Свойство Units представляет единицы измерения, используемые данным элементом.
Returns: Возвращает единицы измерения, используемые элементом. Перечисление UnitsValue.

Teigha.DatabaseServices.UnderlayItem.UsingPartialContent
Свойство UsingPartialContent позволяет определить, использует ли данный элемент только часть содержимого листа/модели, представленного элементом.
Свойство UsingPartialContent позволяет определить, использует ли данный элемент только часть содержимого листа/модели, представленного элементом.
Returns: Возвращает true, если элемент использует лишь часть содержимого листа/модели.
В противном случае возвращает false.