Teigha.DatabaseServices.FitData
Этот класс инкапсулирует данные, возвращаемые свойством Spline.FitData.
Этот класс инкапсулирует данные, возвращаемые свойством Spline.FitData.
Если у сплайна есть данные о подгонке, то эта структура представляет все его определяющие точки (в координатах WCS), допуск аппроксимации и касательные на концах сплайна, если они существуют.
Доступ к этим данным можно получить, используя метод GetFitPoints() и свойства FitTolerance, StartTangent и EndTangent, соответственно.

Teigha.DatabaseServices.FitData.Equals(Object)
Метод предназначен для проверки на идентичность данного и указанного в аргументе объектов.
Метод предназначен для проверки на идентичность данного и указанного в аргументе объектов.
Метод возвращает true, если данный объект идентичен указанному объекту.
obj: Объект, с которым выполняется сравнение. Тип Object.
Returns: Возвращает true, если данный объект идентичен объекту obj.
В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.

Teigha.DatabaseServices.FitData.IsEqualTo(Teigha.DatabaseServices.FitData)
Метод предназначен для сравнения этого объекта с другим объектом FitData и возвращает true, если они равны.
Метод предназначен для сравнения этого объекта с другим объектом FitData и возвращает true, если они равны.
other: Объект, с которым сравнивается данный.  Тип FitData.
Returns: Возвращает true, если объект other равен данному объекту.
В противном случае возвращает false.

Teigha.DatabaseServices.FitData.IsEqualTo(Teigha.DatabaseServices.FitData,Teigha.Geometry.Tolerance)
Метод предназначен для сравнения этого объекта с другим объектом FitData в пределах заданного допуска.
Метод предназначен для сравнения этого объекта с другим объектом FitData в пределах заданного допуска Tolerance.
other: Сравниваемый объект. Тип FitData.
tolerance: Допуск для сравнения на равенство. Тип Tolerance.
Returns: Возвращает true, если сравниваемые объекты совпадают в пределах заданного допуска.
В противном случае возвращает false.

Teigha.DatabaseServices.FitData.!=(Teigha.DatabaseServices.FitData,Teigha.DatabaseServices.FitData)
Оператор неравенства класса FitData.
Оператор неравенства класса FitData.
a: Левый операнд.  Тип FitData.
b: Правый операнд. Тип FitData.
Returns: Возвращает true, если операнды не равны.
В противном случае возвращает false.

Teigha.DatabaseServices.FitData.==(Teigha.DatabaseServices.FitData,Teigha.DatabaseServices.FitData)
Оператор равенства класса FitData.
Оператор равенства класса FitData.
a: Левый операнд.  Тип FitData.
b: Правый операнд. Тип FitData.
Returns: Возвращает true, если операнды равны.
В противном случае возвращает false.

Teigha.DatabaseServices.FitData.Degree
Свойство возвращает степень сплайна.
Свойство возвращает степень сплайна.
Returns: Возвращает степень сплайна. Тип int.

Teigha.DatabaseServices.FitData.EndTangent
Свойство возвращает направление касательной на конце сплайна.
Свойство возвращает направление касательной на конце сплайна.
Returns: Возвращает направление касательной. Тип Vector3d.

Teigha.DatabaseServices.FitData.FitTolerance
Свойство возвращает допуск аппроксимации сплайна.
Свойство возвращает допуск аппроксимации сплайна.
Returns: Возвращает допуск аппроксимации сплайна. Тип double.

Teigha.DatabaseServices.FitData.KnotParam
Свойство возвращает метод узловой параметризации сплайна, который строится по определяющим точкам.
Свойство возвращает метод внутренней узловой параметризации сплайна, который строится по определяющим точкам.
Returns: Возвращает метод узловой параметризации сплайна как значение из перечисления KnotParameterizationEnum.

Teigha.DatabaseServices.FitData.StartTangent
Свойство возвращает направление касательной в начале сплайна.
Свойство возвращает направление касательной в начале сплайна.
Returns: Возвращает направление касательной. Тип Vector3d.

Teigha.DatabaseServices.FitData.TangentsExist
Свойство позволяет проверить, определены ли касательные на концах сплайна.
Свойство позволяет проверить, определены ли касательные на концах сплайна.
Returns: Возвращает true, если касательные на концах сплайна определены.
В противном случае возвращает false.