Teigha.DatabaseServices.Group.Reverse
Этот метод меняет на обратный порядок индексирования объектов в этой группе.
Этот метод меняет на обратный порядок индексирования объектов в этой группе.
Изменяются только индексы объектов. Первый объект в группе становится последним объектом в группе, а последний - первым.