HostMgd.EditorInput.PromptEntityResult
Класс содержит результат операции выбора геометрического объекта,
выполненной пользователем через интерактивное приглашение.
Класс наследуется от базового класса PromptResult и используется для хранения данных
о результате операции выбора геометрического объекта в чертеже nanoCAD.
Он применяется после вызова методов ввода, таких как GetEntity(), и предоставляет информацию:
* Status — статус завершения операции (OK, Cancel, Error и др.).
* ObjectId — идентификатор выбранного объекта.
* PickedPoint — координата точки, где был выбран объект (в мировой системе координат, WCS).
* InputString — строковое значение, если операция была прервана клавиатурным вводом.
Этот класс играет ключевую роль при обработке пользовательского выбора объектов,
позволяя разработчикам надстроек nanoCAD выполнять дальнейшие действия с выбранным элементом чертежа.
Notes
Данный класс может быть использован совместно с событием PromptedForEntity
или методами ввода, которые возвращают результат выборки объекта.
Example
C#

HostMgd.EditorInput.PromptEntityResult.ToString(IFormatProvider)
Метод возвращает строковое представление результата выбора объекта,
отформатированное с учётом текущей локализации.
Метод формирует строковое описание операции выбора геометрического объекта,
применяя заданный провайдер форматирования.
Это позволяет корректно отображать числовые значения (например, координаты точки)
с учётом региональных настроек пользователя — таких как десятичный разделитель или формат дат.
Метод может использоваться для вывода информации в командную строку,
лог-файл или пользовательский интерфейс надстройки nanoCAD.
provider: Объект, предоставляющий информацию о правилах форматирования,
Returns: Возвращает значение типа string, представляющее результат выбора объекта в виде строки.
Строка содержит:
* Статус операции (например, OK, Cancel).
* Идентификатор выбранного объекта (ObjectId), если он был успешно выделен.
* Координаты точки выбора (PickedPoint) в мировой системе координат (WCS), отформатированные с помощью переданного provider.
Если объект не был выбран или операция была прервана, возвращается соответствующее текстовое сообщение.
Example
C#

HostMgd.EditorInput.PromptEntityResult.ObjectId
Свойство предоставляет идентификатор геометрического объекта,
выбранного пользователем в ходе интерактивной операции.
Свойство возвращает ссылку на геометрический объект в базе данных чертежа nanoCAD,
который был указан пользователем — например, через метод GetEntity() или событие PromptedForEntity.
Это значение позволяет получить уникальный идентификатор (ObjectId) выбранного элемента чертежа,
с которым можно выполнять дальнейшие операции: читать свойства, модифицировать объект или удалять его.
Свойство доступно только для чтения и обновляется автоматически при завершении операции выборки.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на выбранный геометрический объект в чертеже.
Если объект не был выбран или операция была прервана, возвращается ObjectId.Null.
Примеры использования ObjectId:
* Чтение данных объекта из базы.
* Открытие объекта для редактирования.
* Передача объекта другим командам.

HostMgd.EditorInput.PromptEntityResult.PickedPoint
Свойство возвращает точку в мировой системе координат,
которую пользователь использовал для указания на геометрический объект.
Свойство предоставляет доступ к координатам точки (Point3d)
в мировой системе координат (WCS), где пользователь щёлкнул мышью
или указал с помощью клавиатуры при выборе геометрического объекта
через такие методы, как GetEntity() или обработчики событий
типа PromptedForEntity.
Это значение может быть полезно при последующих построениях,
вычислениях или модификации чертежа — например,
для определения позиции взаимодействия с объектом.
Свойство доступно только для чтения и
устанавливается автоматически при завершении операции выбора.
Returns: Возвращает объект типа Point3d, представляющий собой трёхмерные координаты точки выбора
в мировой системе координат (X, Y, Z).
Если операция выбора была отменена или не выполнена, возвращается Point3d.Null.
* Point3d.Null — специальное значение, означающее недопустимую или неинициализированную точку.
* X , Y , Z — компоненты координат точки.
Example
C#