Teigha.DatabaseServices.SecurityAlgorithm
Данное перечисление определяет алгоритмы шифрования, поддерживаемые в документах nanoCAD.
Данное перечисление определяет алгоритмы шифрования, поддерживаемые в документах nanoCAD.