Teigha.GraphicsInterface.DiagnosticGridMode
Перечисление DiagnosticGridMode определяет доступные системы координат для построения диагностической сетки.
Перечисление DiagnosticGridMode определяет доступные системы координат для построения диагностической сетки.