HostMgd.EditorInput.PromptNestedEntityResultEventArgs
Класс предоставляет данные о завершённой операции выбора
вложенного геометрического объекта внутри блока или внешней ссылки.
Класс наследуется от EventArgs и используется для передачи информации
при завершении интерактивного выбора вложенного объекта — например,
после вызова метода GetNestedEntity().
Он содержит:
* идентификатор выбранного объекта (ObjectId),
* точку выбора (PickedPoint) в мировой системе координат (WCS),
* матрицу преобразования блока (BlockTransform),
* статус операции (Status).
Этот класс позволяет разработчикам надстроек nanoCAD обрабатывать результаты выбора объектов,
расположенных внутри составных элементов чертежа, таких как блоки или внешние ссылки.

HostMgd.EditorInput.PromptNestedEntityResultEventArgs.Result
Свойство предоставляет доступ к результату операции выбора
вложенного геометрического объекта, включая идентификатор объекта и точку выбора.
Свойство возвращает объект типа PromptNestedEntityResult,
который содержит данные о завершённой операции выбора вложенного объекта
— например, после вызова метода GetNestedEntity() или при обработке
события PromptedForNestedEntity.
Оно позволяет получить:
* статус операции (OK, Cancel, Error и др.),
* идентификатор выбранного объекта (ObjectId),
* точку выбора (Point3d) в мировой системе координат (WCS),
* матрицу преобразования блока , если объект находится внутри блока.
Это свойство используется для анализа результата и дальнейшей работы
с вложенным элементом чертежа.
Доступно только для чтения и автоматически обновляется после завершения интерактивной команды.
Returns: Возвращает экземпляр класса PromptNestedEntityResult, содержащий:
* Status — статус выполнения операции ввода.
* ObjectId — идентификатор выбранного вложенного объекта.
* PickedPoint — точка, в которой пользователь указал на объект.
* Transform — матрица преобразования, применённая к объекту внутри блока.
* StringResult — строковое значение, если выбор был прерван клавиатурным вводом.
Если операция не была успешно завершена, результат может содержать null или недопустимые значения.