Teigha.DatabaseServices.PatternDefinition
Класс PatternDefinition инкапсулирует данные определения штриховки, возвращаемые методом Hatch.GetPatternDefinitionAt().
Класс PatternDefinition инкапсулирует данные определения штриховки, возвращаемые методом Hatch.GetPatternDefinitionAt().

Teigha.DatabaseServices.PatternDefinition.#ctor(System.Double,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,Teigha.Geometry.DoubleCollection)
Конструктор класса PatternDefinition.
Конструктор класса PatternDefinition.
patternAngle: Угол штриховки. Тип double.
basePoint: Координаты точки привязки. Тип Point2d.
offsetVector: Вектор смещения.  Тип Point2d.
dashOffsets: Смещения штрихов. Тип DoubleCollection.

Teigha.DatabaseServices.PatternDefinition.Angle
Свойство представляет угол поворота штриховки.
Свойство представляет угол поворота штриховки.
Returns: Возвращает угол поворота в радианах. Тип double.

Teigha.DatabaseServices.PatternDefinition.BaseX
Свойство представляет x-координату базовой точки.
Свойство представляет x-координату базовой точки (точки привязки).
Returns: Возвращает x-координату базовой точки. Тип double.

Teigha.DatabaseServices.PatternDefinition.BaseY
Свойство представляет y-координату базовой точки.
Свойство представляет y-координату базовой точки.
Returns: Возвращает y-координату базовой точки. Тип double.

Teigha.DatabaseServices.PatternDefinition.OffsetX
Свойство представляет x-компоненту смещения.
Свойство представляет x-компоненту смещения.
Returns: Возвращает x-компоненту смещения. Тип double.

Teigha.DatabaseServices.PatternDefinition.OffsetY
Свойство представляет y-компоненту смещения.
Свойство представляет y-компоненту смещения.
Returns: Возвращает y-компоненту смещения.
Тип double.