Teigha.DatabaseServices
Пространство имен Teigha.DatabaseServices включает пространства имен и классы, предназначенные для работы с объектами базы данных чертежа.
Пространство имен Teigha.DatabaseServices включает пространства имен и классы, предназначенные для работы с объектами базы данных чертежа.