Teigha.Runtime.DynamicLinkerEventArgs
Класс DynamicLinkerEventArgs представляет данные событий динамического компоновщика.
Класс DynamicLinkerEventArgs представляет данные событий динамического компоновщика.

Teigha.Runtime.DynamicLinkerEventArgs.#ctor(String)
Конструктор класса DynamicLinkerEventArgs.
Создает новую связь с указанным файлом.
Конструктор класса DynamicLinkerEventArgs.
Создает новую связь с указанным файлом.
fileName: Входное имя файла, с которым создается связь.

Teigha.Runtime.DynamicLinkerEventArgs.FileName
Свойство FileName представляет имя файла, используемого данным объектом.
Свойство FileName представляет имя файла, используемого данным объектом.
Returns: Возвращает имя файла. Тип String.