Teigha.DatabaseServices.RegAppTable
Этот класс реализует таблицу символов APPID, которая представляет зарегистрированные имена приложений для расширенных данных объекта чертежа в базе данных.
Этот класс реализует таблицу символов APPID, которая представляет зарегистрированные имена приложений для расширенных данных объекта чертежа в базе данных.