Teigha.BoundaryRepresentation.BrepEntity.GetPerimeterLength
Метод предназначен для вычисления периметра данного топологического объекта. Точность вычислений определяется глобальными настройками.
Метод предназначен для вычисления периметра данного топологического объекта с применением максимального масштабного коэффициента из вложенных преобразований.
Точность вычислений определяется глобальными настройками.
Свойство длины периметра применимо к большинству объектов, представляющих собой плоские фигуры и некоторые 3D-фигуры.
Returns: Возвращает периметр данного объекта.
Тип double.