Teigha.DatabaseServices.RasterImageDef.OpenImage
Возвращает связанный объект с данными изображения для записи.
За каждым вызовом метода должен далее следовать вызов метода
RasterImageDef.CloseImage().
Подразумевается, что этот метод используется для
редактирования растрового изображения разработчиками
приложения (для доступа только на чтение к данным изображения
следует пользоваться методом RasterImageDef.ImageCopy()).
Изображение, возвращаемое данным методом — это изображение
для отображения. Любые изменения этого изображения появятся
следующий раз, когда изображение будет перерисовано. Копия
изображения автоматически сохраняется в буфере Undo.
Вы можете вызвать OpenImage и затем закрыть объект
RasterImageDef без вызова CloseImage. Это называется "долгий
срок блокировки записи". Вы можете изменять данные
изображения в течение всего времени, пока доступен указатель
OdGiRasterImage. Любые изменения, которые будут сделаны с
данными изображения, появятся в следующий раз, когда
геометрические объекты будут перерисованы. Блокировка на
запись не будет держаться так долго, чтобы это влияло на
работу других команд пользователя, таких как Image Reload,
Unload и Detach.