Teigha.GraphicsInterface.FaceData.GetVisibility
Метод предоставляет массив флагов видимости граней, используемых этим объектом FaceData.
Метод предоставляет массив флагов видимости граней, по одному для каждой грани сети или оболочки, с которыми используется данный объект FaceData.  Значение 1 означает видимое состояние, значение 0 - невидимое.
Notes
Возвращается фактический массив флагов видимости, используемый графической системой, а не его копия.
Returns: Возвращает массив флагов видимости граней.
Тип unsigned char[].