Teigha.DatabaseServices.ObjectClosedEventArgs
Класс ObjectClosedEventArgs представляет данные для события ObjectClosed базы данных.
Класс ObjectClosedEventArgs представляет данные для события ObjectClosed базы данных.

Teigha.DatabaseServices.ObjectClosedEventArgs.Id
Свойство Id представляет изменённый объект.
Свойство Id представляет изменённый объект.
Returns: Возвращает идентификатор изменённого объекта.
Тип ObjectId.