HostMgd.PlottingServices.PlotFactory.ProcessPlotState
Текущее состояние подсистемы печати.
Только для чтения.
Возвращает одно из трёх состояний:
NotPlotting        - печать не идёт.
ForegroundPlotting -
BackgroundPlotting - идёт печать в фоновом режиме (?)