Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.MoveNext
Метод выполняет переход к следующему элементу в коллекции.
Метод выполняет переход к следующему элементу в коллекции.
В случае успешного перехода возвращает true.
Returns: Возвращает true, если новое значение индекса остается в допустимом диапазоне.
Если новое значение индекса выходит за пределы коллекции, метод возвращает false.