Teigha.Geometry.ExternalCurve2d.SetToOwnCurve
Метод делает этот объект владельцем данных своего определения.
Метод делает этот объект владельцем данных своего определения.
Если текущий экземпляр уже является владельцем этих данных, метод не делает ничего.
В противном случае метод создает копию данных определения кривой перед тем, как сделать данный объект владельцем этой геометрии.
Notes
Данные, которыми владеет внешняя кривая, удаляются при уничтожении внешней кривой.