Teigha.Runtime.CommandFlags.DocReadLock
Значение: 524288 (0x80000).
Если этот флаг установлен, то при вызове команды выполняется блокировка документа для чтения (read lock).
Если флаг не установлен, осуществляется блокировка документа для записи (write lock).