Teigha.DatabaseServices.CompoundObjectId.SetEmpty
Метод позволяет задать данный объект CompoundObjectId как пустой идентификатор составного объекта, не имеющий каких-либо данных.
Метод позволяет задать данный объект CompoundObjectId как пустой идентификатор составного объекта, не имеющий каких-либо данных.