Teigha.Runtime.FileCreationDisposition.TruncateExisting
Значение: 5.
Файл будет усечен (обрезан).
Если файл не существует, операция завершается ошибкой.
Файл должен быть открыт с правами как минимум на запись.