Teigha.DatabaseServices.ObjectSnapModes.ModeApparentIntersection
Значение: 11.
Привязка к кажущемуся пересечению двух объектов, которые не пересекаются в 3D пространстве, но на текущем виде выглядят пересекающимися.