Teigha.DatabaseServices.Solid3d
Класс Solid3d представляет  в базе данных объекты трехмерных твердых тел.
Класс Solid3d представляет  в базе данных объекты трехмерных твердых тел.
Этот класс наследует базовую функциональность объектов чертежа.

Teigha.DatabaseServices.Solid3d.#ctor
Конструктор по умолчанию класса Solid3d.
Конструктор по умолчанию класса Solid3d.

Teigha.DatabaseServices.Solid3d.BooleanOperation(Teigha.DatabaseServices.BooleanOperationType,Teigha.DatabaseServices.Solid3d)
Метод предназначен для выполнения логических операций между данным объектом и другим твердым телом (объединение, пересечение, вычитание).
Метод предназначен для выполнения логических операций между данным объектом и другим твердым телом.
Допустимы следующие логические операции:
* BoolUnite - объединение данного объекта с другим твердым телом.
* BoolIntersect - пересечение данного объекта с другим твердым телом.
* BoolSubtract - вычитание указанного твердого тела из данного объекта.
operation: Тип логической операции. Перечисление BooleanOperationType.
solid: Другое твердое тело, участвующее в данной логической операции. Тип Solid3d.

Teigha.DatabaseServices.Solid3d.ChamferEdges(array,Teigha.DatabaseServices.SubentityId,System.Double,System.Double)
Метод предназначен для создания фасок на ребрах данного твердого тела.
Метод предназначен для создания фасок на ребрах данного твердого тела.
Этот метод реализован только в среде пространственного моделирования.
subentityIds: Массив идентификаторов объектов ребер данного твердого тела. Тип SubentityId[].
baseSubentityId: Идентификатор объекта основной грани, на ребрах которой создаются фаски. Тип SubentityId.
baseDist: Расстояние от ребра для построения фаски на основной грани.  Тип double.
otherDist: Расстояние от ребра для построения фасок на других гранях.   Тип double.

Teigha.DatabaseServices.Solid3d.CheckInterference(Teigha.DatabaseServices.Solid3d)
Метод позволяет проверить, пересекается ли данный объект с другим твердым телом.
Метод позволяет проверить, пересекается ли данный объект с другим твердым телом.
otherSolid: Другое твердое тело, участвующее в проверке на возможные коллизии. Тип Solid3d.
Returns: Возвращает true, если твердое тело otherSolid пересекается с данным объектом.
В противном случае возвращает false.

Teigha.DatabaseServices.Solid3d.ConvertToBrepAtSubentPaths(array)
Метод позволяет преобразовать отдельные элементы истории построения параметризованного типа в простое граничное представление без параметрической информации или данных о типе. В текущей версии метод не реализован.
Метод позволяет преобразовать отдельные элементы истории построения параметризованного типа в простое граничное представление без параметрической информации или данных о типе. В текущей версии метод не реализован.
paths: Массив элементов истории. Тип FullSubentityPath[].

Teigha.DatabaseServices.Solid3d.CopyEdge(Teigha.DatabaseServices.SubentityId)
Метод позволяет сделать копию указанного ребра данного объекта в виде отдельного объекта (экземпляра класса Line, Circle, Arc, Ellipse, Spline).
Метод позволяет сделать копию указанного ребра данного объекта в виде отдельного объекта (экземпляра класса Line, Circle, Arc, Ellipse, Spline).
subEntityId: Идентификатор подобъекта ребра в данном твердом теле. Тип SubentityId.
Returns: Возвращает копию ребра в виде самостоятельного экземпляра одного из геометрических примитивов. Тип Entity.

Teigha.DatabaseServices.Solid3d.CopyFace(Teigha.DatabaseServices.SubentityId)
Метод позволяет сделать копию указанной грани в виде отдельного объекта класса Region или Body.
Метод позволяет сделать копию указанной грани в виде отдельного объекта класса Region или Body.
subEntityId: Идентификатор подобъекта грани в данном твердом теле. Тип SubentityId.
Returns: Возвращает копию указанной грани в виде отдельного геометрического объекта. Тип Entity.

Teigha.DatabaseServices.Solid3d.CreateBox(System.Double,System.Double,System.Double)
Метод позволяет создать 3D-тело в виде прямоугольного параллелепипеда заданного размера, ребра которого выровнены по осям мировой системы координат (WCS), с центром в начале системы координат WCS.
Метод позволяет создать 3D-тело в виде прямоугольного параллелепипеда заданного размера, ребра которого выровнены по осям мировой системы координат (WCS), а центр располагается в начале этой системы координат.
lengthAlongX: Длина тела вдоль оси X WCS. Тип double.
lengthAlongY: Длина тела вдоль оси Y WCS. Тип double.
lengthAlongZ: Длина тела вдоль оси Z WCS. Тип double.
На значения входных аргументов накладываются следующие ограничения:

Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,System.Double,Teigha.DatabaseServices.SweepOptions)
Метод предназначен для создания твердого тела методом выдавливания указанной грани на заданную длину.
Метод предназначен для создания твердого тела методом выдавливания указанной грани на заданную длину.
Реализован только в среде пространственного моделирования.
sweepEntity: Выдавливаемый объект. Тип Entity.
faceSubEntityId: Идентификатор подобъекта грани, которую требуется выдавить. Тип SubentityId.
height: Длина выдавливания. Тип double. Используется как множитель для вектора направления выдавливания.
sweepOptions: Опции операции выдавливания. Тип SweepOptions.

Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.SweepOptions)
Метод предназначен для создания твердого тела методом выдавливания указанной грани, направление и длина которого задана входным вектором.
Метод предназначен для создания твердого тела методом выдавливания указанной грани, направление и длина которого задана входным вектором.  Реализован только в среде пространственного моделирования.
sweepEntity: Выдавливаемый объект. Тип Entity.
faceSubEntityId: Идентификатор подобъекта грани, которую требуется выдавить. Тип SubentityId.
directionVector: Вектор, определяющий направление и величину выдавливания. Тип Vector3d.
sweepOptions: Опции операции выдавливания. Тип SweepOptions.

Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid(Teigha.DatabaseServices.Entity,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.SweepOptions)
Метод предназначен для создания твердого тела выдавливанием плоской кривой, области или плоской поверхности, направление и длина которого задана входным вектором.
Метод предназначен для создания твердого тела выдавливанием плоской кривой, области или плоской поверхности, направление и длина которого задана входным вектором.  Реализован только в среде пространственного моделирования.
sweepEntity: Выдавливаемый объект. Тип Entity.
directionVector: Вектор, определяющий направление и величину выдавливания. Тип Vector3d.
sweepOptions: Опции операции выдавливания. Тип SweepOptions.

Teigha.DatabaseServices.Solid3d.CreateFrom(Teigha.DatabaseServices.Entity)
Метод предназначен для создания трехмерного твердого тела из указанного геометрического объекта.
Метод предназначен для создания трехмерного твердого тела из указанного геометрического объекта.
В качестве исходных могут использоваться следующие объекты:
* Поверхность Surface,
* Сеть SubDMesh,
* Замкнутая кривая с ненулевой толщиной,
* Твердое тело ненулевой толщины,
* След (trace) ненулевой толщины,
* Полилиния с постоянной шириной и толщиной.
Этот метод реализован только в среде пространственного моделирования.
fromEntity: Входной объект, из которого создается твердое тело. Тип Entity.

Teigha.DatabaseServices.Solid3d.CreateFrustum(System.Double,System.Double,System.Double,System.Double)
Метод создаёт усеченный конус, ориентированный по осям мировой системы координат (WCS), с центром основания в начале координат.
В зависимости от входных параметров метода геометрия получаемого твердого тела может иметь вид круглого или эллиптического цилиндра, круглого или эллиптического конуса, круглого или эллиптического усеченного конуса.
Метод создаёт усеченный конус, ориентированный по осям мировой системы координат (WCS), с центром основания в начале координат.
В зависимости от входных параметров метода геометрия получаемого твердого тела может иметь следующий вид.
* Круглый цилиндр (если радиус radiusAlongX равен topRadius, и совпадают радиусы radiusAlongX и radiusAlongY).
* Эллиптический цилиндр (если радиусы radiusAlongX и topRadius совпадают, а радиусы radiusAlongX и radiusAlongY отличаются).
* Круглый конус (если topRadius равен нулю, а радиусы radiusAlongX и radiusAlongY совпадают).
* Эллиптический конус (если topRadius равен нулю, а радиусы radiusAlongX и radiusAlongY отличаются).
* Усеченный круглый конус (когда topRadius отличается от нуля и не равен радиусу radiusAlongX, а радиусы radiusAlongX и radiusAlongY совпадают).
* Усеченный эллиптический конус (когда topRadius отличается от нуля и не равен радиусу radiusAlongX, а радиусы radiusAlongX и radiusAlongY отличаются).
Значения любого из входных аргументов должны быть больше или равны 1e-6 (в единицах чертежа).
height: Высота получаемого тела. Тип double. Значение не должно быть меньше 1e-6.
radiusAlongX: Радиус основания в направлении оси X МСК (WCS). Тип double. Значение не должно быть меньше 1e-6.
radiusAlongY: Радиус основания в направлении оси Y МСК (WCS). Тип double. Значение не должно быть меньше 1e-6.
topRadius: Радиус верхнего основания. Тип double. Значение не должно быть меньше 1e-6.

Teigha.DatabaseServices.Solid3d.CreateLoftedSolid(array,array,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.LoftOptions)
Метод предназначен для создания трехмерного твердого тела методом лофта - вытягиванием по сечениям.
Метод предназначен для создания трехмерного твердого тела методом лофта - вытягиванием по сечениям.
crossSectionCurves: Массив кривых, которые будут использоваться операцией лофта в качестве поперечных сечений. Тип Entity[].
guideCurves: Массив направляющих.  Тип Entity[].
pathCurve: Кривая пути.          Тип Entity.
loftOptions: Опции операции лофта. Тип LoftOptions.

Teigha.DatabaseServices.Solid3d.CreatePyramid(System.Double,System.Int32,System.Double,System.Double)
Метод предназначен для создания твердого тела в виде пирамиды с указанными параметрами.
Метод предназначен для создания твердого тела в виде пирамиды.
Основание пирамиды параллельно плоскости x-y мировой системы координат (WCS).
Направление пирамиды (от основания к вершине) совпадает с положительным направлением оси z.
Середина высоты пирамиды совпадает с началом системы координат WCS.
В случае равенства аргументов radius и topRadius создается призма.
height: Высота пирамиды. Тип double. Высота по модулю не может быть меньше 1e-6.
sides: Количество боковых граней пирамиды. Тип int. Диапазон допустимых значений - от 3 до 64, включительно.
radius: Радиус окружности, вписанной в нижнее основание пирамиды. Тип double. Значение по модулю не может быть меньше 1e-6.
topRadius: Радиус окружности, вписанной в верхнее основание пирамиды. Тип double. Значение по модулю не может быть меньше 1e-6.

Teigha.DatabaseServices.Solid3d.CreateRevolvedSolid(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,Teigha.DatabaseServices.RevolveOptions)
Метод создает трехмерное твердое тело вращением указанной кривой, области или плоской поверхности вокруг заданной оси вращения.
Метод создает трехмерное твердое тело вращением объекта profileEntity (кривая, область или плоская поверхность) вокруг заданной оси вращения.
Ось вращения определяется точкой (axisPoint) и вектором (axisDir).
Вращение объекта ProfileEntity задается начальным углом startAngle и углом поворота angleOfRevolution против часовой стрелки вокруг направления axisDir.
Этот метод реализован только в среде пространственного моделирования.
profileEntity: Профиль в виде кривой, области или плоской поверхности, используемый для получения 3D-тела операцией вращения. Тип Entity.
axisPoint: Точка на оси вращения. Тип Point3d.
axisDir: Направляющий вектор оси вращения. Тип Vector3d.
angleOfRevolution: Угол поворота профиля в операции вращения (в радианах). Тип double.
startAngle: Начальный угол поворота (в радианах). Тип double. Если равен нулю, вращение начинается с текущей позиции объекта profileEntity.
revolveOptions: Опции операции вращения. Тип RevolveOptions.

Teigha.DatabaseServices.Solid3d.CreateRevolvedSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,Teigha.DatabaseServices.RevolveOptions)
Метод создает трехмерное твердое тело вращением указанной грани вокруг заданной оси вращения.
Метод создает трехмерное твердое тело вращением указанной грани вокруг заданной оси вращения.
Вращаемый объект должен представлять собой допустимую плоскую кривую, область или плоскую поверхность.
Этот метод реализован только в среде пространственного моделирования.
profileEntity: Объект чертежа, которому принадлежит вращаемая грань.  Тип Entity.
faceSubEntityId: Идентификатор подобъекта вращаемой грани. Тип SubentityId.
axisPoint: Точка на оси вращения. Тип Point3d.
axisDir: Направляющий вектор оси вращения. Тип Vector3d.
angleOfRevolution: Угол поворота профиля в операции вращения (в радианах). Тип double.
startAngle: Начальный угол поворота (в радианах). Тип double. Если равен нулю, вращение начинается с текущей позиции объекта profileEntity.
revolveOptions: Опции операции вращения. Тип RevolveOptions.

Teigha.DatabaseServices.Solid3d.CreateSphere(System.Double)
Метод создает сферу заданного радиуса с центром в начале мировой системы координат.
Метод создает сферу заданного радиуса с центром в начале мировой системы координат (WCS).
radius: Радиус создаваемой сферы. Тип double. Значение не может быть меньше 1e-6.

Teigha.DatabaseServices.Solid3d.CreateSweptSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SweepOptions)
Метод создает трехмерное твердое тело вытягиванием конкретной грани указанного объекта чертежа по заданной траектории.
Метод создает трехмерное твердое тело вытягиванием конкретной грани указанного объекта чертежа по заданной траектории.
Реализован только в среде пространственного моделирования.
Notes
По умолчанию объект SweepOptions использует для выравнивания опцию SweepOptionsAlignOption.NoAlignment.
Значение выравнивания SweepOptionsAlignOption.kAlignSweepEntityToPath следует задавать до вызова этого метода.
sweepEntity: Объект чертежа, которому принадлежит вытягиваемая грань. Тип Entity.
faceSubEntityId: Идентификатор подобъекта грани. Тип SubentityId.
pathEntity: Объект кривой, которая представляет траекторию вытягивания грани. Тип Entity.
sweepOptions: Настройки операции вытягивания по траектории. Тип SweepOptions.

Teigha.DatabaseServices.Solid3d.CreateSweptSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SweepOptions)
Метод создает трехмерное твердое тело вытягиванием указанной кривой, области или плоской поверхности по заданной траектории.
Метод создает трехмерное твердое тело вытягиванием указанной кривой, области или плоской поверхности по заданной траектории.  Реализован только в среде пространственного моделирования.
Notes
По умолчанию объект SweepOptions использует для выравнивания опцию SweepOptionsAlignOption.NoAlignment.
Значение выравнивания SweepOptionsAlignOption.kAlignSweepEntityToPath следует задать до вызова этого метода.
sweepEntity: Объект чертежа, который служит профилем для операции вытягивания по траектории. Тип Entity.
pathEntity: Объект кривой, которая представляет траекторию вытягивания профиля. Тип Entity.
sweepOptions: Настройки операции вытягивания по траектории. Тип SweepOptions.

Teigha.DatabaseServices.Solid3d.CreateTorus(System.Double,System.Double)
Метод предназначен для создания твердого тела в виде тора в мировой системе координат (WCS) c осью z в качестве оси вращения и с центром в начале координат.
Метод предназначен для создания твердого тела в виде тора.
Осью тора служит ось z мировой системы координат (WCS), центр тора совмещен с началом координат.
Радиусы majorRadius и minorRadius не могут равняться нулю. Если majorRadius меньше нуля, значение minorRadius должно быть больше абсолютного значения majorRadius.
Действуют следующие ограничения:
* minorRadius >= 1e-6;
* |majorRadius| >= 1e-6;
* Если majorRadius , то minorRadius > |majorRadius| + 1e-6.
majorRadius: Радиус тора. Тип double.
minorRadius: Радиус образующей окружности тора. Тип double.

Teigha.DatabaseServices.Solid3d.CreateWedge(System.Double,System.Double,System.Double)
Метод создает трехмерный твердотельный клин, выровненный по осям мировой системы координат (WCS).
Метод создает трехмерный твердотельный клин, выровненный по осям мировой системы координат (WCS).
Направление сужения клина совпадает с положительным направление оси x.
Наклонная грань определяется точками:
( lengthAlongX/2, -lengthAlongY/2, -lengthAlongZ/2)
(-lengthAlongX/2, -lengthAlongY/2,  lengthAlongZ/2)
( lengthAlongX/2,  lengthAlongY/2, -lengthAlongZ/2)
(-lengthAlongX/2,  lengthAlongY/2,  lengthAlongZ/2)
Действуют следующие размерные ограничения:
* lengthAlongX >= 1e-6;
* lengthAlongY >= 1e-6;
* lengthAlongZ >= 1e-6.
lengthAlongX: Размер тела в направлении оси x (WCS). Тип double.
lengthAlongY: Размер тела в направлении оси y (WCS). Тип double.
lengthAlongZ: Размер тела в направлении оси z (WCS). Тип double.

Teigha.DatabaseServices.Solid3d.Extrude(Teigha.DatabaseServices.Region,System.Double,System.Double)
Метод создает трехмерное твердое тело выдавливанием указанной области на заданную высоту и с заданным углом наклона.
Метод создает трехмерное твердое тело выдавливанием указанной области на заданную высоту и с заданным углом наклона.
Выдавливаемая область не должна иметь самопересечений.
Значение высоты может быть отрицательным.
Направление выдавливания (экструзии) всегда параллельно вектору нормали области и совпадает с ним, если значение высоты положительно.
Действуют следующие ограничения:
* |height| >= 1e-6;
* |taperAngle| .
region: Область, используемая операцией выдавливания в качестве профиля выдавливания. Тип Region.
height: Высота выдавливания. Тип double.
taperAngle: Угол наклона при выдавливании (в радианах). Тип double.

Teigha.DatabaseServices.Solid3d.ExtrudeAlongPath(Teigha.DatabaseServices.Region,Teigha.DatabaseServices.Curve,System.Double)
Метод создает трехмерное твердое тело путем выдавливания указанной области вдоль заданной траектории.
Метод создает трехмерное твердое тело путем выдавливания указанной области вдоль заданной траектории.
В качестве траектории выдавливания допускается использование следующих объектов:
* Линия Line,
* Круглая дуга Arc,
* Окружность Circle,
* Эллипс Ellipse,
* Сплайн Spline,
* 2D полилиния,
* 3D-полилиния без сглаживания сплайном (Non-spline fit 3D polyline).
Объект траектории не должен иметь самопересечений и, желательно, участков большой кривизны.
Если |taperAngle| , то угол наклона принимается равным нулю.
В случае замкнутой траектории угол наклона игнорируется.
Этот метод реализован в среде пространственного моделирования и, отчасти, для ModelerGeometry.
region: Область, используемая операцией выдавливания в качестве профиля выдавливания. Тип Region.
path: Объект кривой, который служит траекторией выдавливания. Тип Curve.
taperAngle: Угол наклона при выдавливании (в радианах). Тип double.  Диапазон допустимых значений [-PI/2..PI/2].

Teigha.DatabaseServices.Solid3d.ExtrudeFaces(array,System.Double,System.Double)
Метод позволяет выдавить массив граней твердого тела на указанную длину с заданным углом наклона.
Метод позволяет выдавить массив граней твердого тела на указанную длину с заданным углом наклона.
Длина выдавливания определяется параметром height и углом taper.
Выдавливание каждой из граней выполняется вдоль нормали к ее плоскости, а направление определяется знаком заданной высоты height:
* Если высота положительна, направление совпадает с вектором нормали (выдавливание граней наружу из твердого тела).
* Если высота отрицательна, направление противоположно нормали (выдавливание граней внутрь твердого тела).
subentityIds: Массив идентификаторов подобъекта для выдавливаемых граней. Тип SubentityId[].
height: Высота выдавливания. Тип double.
taper: Угол наклона при выдавливании (в радианах). Тип double.  Диапазон допустимых значений [-PI/2..PI/2].

Teigha.DatabaseServices.Solid3d.ExtrudeFacesAlongPath(array,Teigha.DatabaseServices.Curve)
Метод позволяет выдавить группу указанных граней твердого тела вдоль заданной траектории.
Метод позволяет выдавить группу указанных граней твердого тела вдоль заданной траектории.
Грани для выдавливания должны быть плоскими.
В качестве траектории допустимы следующие объекты:
* Линия
* Дуга
* Эллипс
* Сплайн
* 2D полилиния
* 3D-полилиния без сглаживания сплайном (Non-spline fit 3D polyline).
Траектория выдавливания не должна иметь самопересечений и, желательно, участков большой кривизны.
Если начальная точка траектории не лежит в плоскости, в которой располагается выдавливаемая область, то начало траектории дотягивается до этой плоскости.
subentityIds: Массив идентификаторов подобъектов для выдавливаемых граней. Тип SubentityId[].
path: Объект, определяющий траекторию выдавливания. Тип Curve.

Teigha.DatabaseServices.Solid3d.FilletEdges(array,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection)
Метод предназначен для создания скруглений на ребрах данного твердого тела.
Метод предназначен для создания скруглений на ребрах данного твердого тела.
Реализован только в среде пространственного моделирования.
subentityIds: Массив идентификаторов объектов ребер. К указанным ребрам применяется операция скругления. Тип SubentityId[].
radius: Массив значений радиусов скругления для соответствующих ребер. Тип DoubleCollection.
startSetback: Массив начальных отступов на соответствующих ребрах. Тип DoubleCollection.
endSetback: Массив конечных отступов на соответствующих ребрах. Тип DoubleCollection.

Teigha.DatabaseServices.Solid3d.GetSection(Teigha.Geometry.Plane)
Метод предназначен для построения области Region, являющейся результатом сечения твердого тела указанной плоскостью.
Метод создает объект Region как результат сечения твердого тела указанной плоскостью.
Этот метод реализован только в среде пространственного моделирования.
plane: Секущая плоскость. Тип Plane.
Returns: Возвращает созданную область. Тип Region.

Teigha.DatabaseServices.Solid3d.GetSubentityColor(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить цвет указанного подобъекта данного твердого тела.
Метод позволяет получить цвет указанного подобъекта данного твердого тела.
subEntityId: Идентификатор подобъекта (ребра или грани). Тип SubentityId.
Returns: Возвращает цвет интересующего подобъекта. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.Solid3d.GetSubentityMaterial(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить материал для указанного подобъекта.
Метод позволяет получить материал для указанного подобъекта.
subEntityId: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает идентификатор материала указанного подобъекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Solid3d.GetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId)
Метод позволяет для указанного подобъекта получить объект Mapper, который обеспечивает сопоставление материалов.
Метод позволяет получить для указанного подобъекта объект Mapper, который обеспечивает сопоставление материалов.
subEntityId: Входной идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает объект для сопоставления материалов подобъекта. Тип Mapper.

Teigha.DatabaseServices.Solid3d.ImprintEntity(Teigha.DatabaseServices.Entity)
Метод реализует операцию клеймения данного твердого тела указанным объектом.
Метод позволяет построить пересечение указанного объекта entity с данным твердым телом и добавить в 3D-тело новую фасетную грань путем клеймения.
Типы объектов, клеймение которых на 3D теле допускается данным методом:
* Curve,
* Solid3d,
* Body,
* Region,
* Trace,
* Solid.
* Face.
Этот метод реализован только в среде пространственного моделирования.
entity: Объект для клеймения на данном твердом теле. Тип Entity.

Teigha.DatabaseServices.Solid3d.OffsetBody(System.Double)
Метод реализует смещение всех граней данного твердого тела на указанное расстояние.
Метод реализует смещение всех граней данного твердого тела на указанное расстояние.
Если грань имеет поверхности, которые сместить невозможно, она удаляется. Это означает, что операция смещения может привести к тому, что тело станет недопустимым.
Этот метод реализован только в среде пространственного моделирования.
offsetDistance: Величина смещения. Тип double.

Teigha.DatabaseServices.Solid3d.OffsetFaces(array,System.Double)
Метод позволяет смещать указанные грани твердого тела на заданное расстояние.
Метод позволяет смещать указанные грани твердого тела на заданное расстояние.
Грани с поверхностями, которые невозможно сместить, удаляются, а тело залечивается, если это возможно.
Применяются следующие ограничения:
* Количество граней, указанных в массиве subentityIds должно быть больше нуля.
* offsetDistance >= минус половина максимальной стороны габаритного бокса данного твердого тела.
* |offsetDistance| >= 1e-6.
Этот метод реализован только в среде пространственного моделирования.
subentityIds: Массив идентификаторов подобъектов граней. Тип SubentityId[].
offsetDistance: Величина смещения. Тип double.

Teigha.DatabaseServices.Solid3d.ProjectOnToSolid(Teigha.DatabaseServices.Entity,Teigha.Geometry.Vector3d)
Метод предназначен для создания объектов проецированием указанного объекта в указанном направлении на данное 3D-тело.
Созданные объекты не являются резидентными в базе данных.
Метод предназначен для создания объектов проецированием указанного объекта в указанном направлении на данное 3D-тело.
Созданные объекты не являются резидентными в базе данных.
Если в качестве объекта проецирования указан объект Point, результатом проецирования будет объект Point, представляющий ближайшую точку на твердом теле в направлении проецирования.
Этот метод реализован только в среде пространственного моделирования.
entityToProject: Проецируемый геометрический объект. Тип Entity.
projectionDirection: Направление проецирования. Тип Vector3d.
Returns: Возвращает массив геометрических объектов. Тип Entity[].

Teigha.DatabaseServices.Solid3d.RemoveFaces(array)
Метод предназначен для удаления указанных граней из данного твердого тела.
Метод предназначен для удаления указанных граней из данного твердого тела.
После удаления указанных граней соседние грани увеличиваются, заполняя образовавшиеся пустоты.
Если соседние грани нельзя использовать, метод оставляет тело без изменений.
В ряде случаев удаление граней может привести к тому, что тело станет недопустимым.
Этот метод реализован только в среде пространственного моделирования.
subentityIds: Массив идентификаторов подобъектов удаляемых граней данного 3D-тела. Тип SubentityId[].

Teigha.DatabaseServices.Solid3d.Revolve(Teigha.DatabaseServices.Region,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Метод позволяет создать трехмерное твердое тело вращением указанной области на заданный угол вокруг заданной оси.
Метод позволяет создать трехмерное твердое тело вращением указанной области на заданный угол вокруг оси вращения.
Ось вращения определяется проекцией линии, заданной точкой и вектором, на плоскость области region параллельно ее нормали. Таким образом, вращаемая область и ось вращения всегда компланарны.
Область поворачивается на угол angleOfRevolution по модулю 2*Pi в радианах вокруг оси вращения.
Положительное направление отсчета углов определяется правилом правой руки - по часовой стрелке, если смотреть вдоль оси вращения.
Ось вращения должна быть допустимой для вращения области region:
* Направление axisDir не может быть перпендикулярно плоскости области region,
* Проекция оси вращения не может пересекать переданную в метод область region.
Действуют следующие ограничения:
* Угол поворота, который по модулю меньше 1e-6, считается равным нулю.
Этот метод реализован только в среде пространственного моделирования.
region: Вращаемая область. Тип Region.
axisPoint: Точка на линии, проекция которой дает ось вращения. Тип Point3d.
axisDir: Направляющий вектор линии, проекция которой дает ось вращения. Тип Vector3d.
angleOfRevolution: Угол вращения в радианах по модулю 2*Pi. Тип double.

Teigha.DatabaseServices.Solid3d.SetSubentityColor(Teigha.DatabaseServices.SubentityId,Colors.Color)
Метод позволяет задать цвет указанной подобъекту грани или ребра.
Метод позволяет задать цвет указанной подобъекту грани или ребра.
subEntityId: Идентификатор подобъекта (грани или ребра), которому назначается новый цвет. Тип SubentityId.
color: Новый цвет подобъекта. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.Solid3d.SetSubentityMaterial(Teigha.DatabaseServices.SubentityId,DatabaseServices.ObjectId)
Метод позволяет назначить указанному подобъекту данного 3D-тела новый материал.
Метод позволяет назначить указанному подобъекту данного 3D-тела новый материал.
subEntityId: Идентификатор подобъекта. Тип SubentityId.
materialId: Идентификатор объекта материала. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Solid3d.SetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId,Teigha.GraphicsInterface.Mapper)
Метод позволяет задать указанному подобъекту новый объект Mapper для сопоставления материалов.
Метод позволяет задать указанному подобъекту новый объект Mapper для сопоставления материалов.
subEntityId: Идентификатор подобъекта. Тип SubentityId.
mapper: Объект для сопоставления материалов. Тип Mapper.

Teigha.DatabaseServices.Solid3d.ShellBody(array,System.Double)
Метод позволяет преобразовать твердое тело в тонкостенную твердотельную оболочку путем смещения граней исходного тела.
Метод позволяет преобразовать твердое тело в тонкостенную твердотельную оболочку путем смещения граней исходного тела.
Грани смещаются наружу, если параметр offsetDistance положителен, и внутрь, если отрицателен.
Грани с поверхностью, которая не допускает смещение по толщине, удаляются из твердого тела.
Образовавшаяся несплошность затягивается поверхностями соседних граней.
Ребра и вершины на предоставленных гранях по возможности объединяются слиянием.
Изолированные ребра в измененных гранях и соседних гранях могут вырождаться в точки и, вследствие этого, удаляться.
Однако при удалении контуров (петель) или граней вставка ребер или другие топологические изменения не допускаются.
В некоторых случаях эта операция может привести к тому, что тело окажется недопустимым.
Этот метод реализован только в среде пространственного моделирования.
subentityIds: Идентификаторы подобъектов граней твердого тела. Тип SubentityId[].
offsetDistance: Величина смещения граней. Тип double.

Teigha.DatabaseServices.Solid3d.Slice(DatabaseServices.Surface)
Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали.
Метод позволяет разрезать твердое тело указанной поверхностью.  Исходное твердое тело преобразуется в ту часть, которая осталась с "положительной" стороны режущей поверхности (с положительным направлением нормали).
Этот метод реализован только в среде пространственного моделирования.
surface: Режущая поверхность. Тип DatabaseServices.Surface.

Teigha.DatabaseServices.Solid3d.Slice(DatabaseServices.Surface,System.Boolean)
Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали.  Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали.  Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
Этот метод реализован только в среде пространственного моделирования.
surface: Режущая поверхность. Тип DatabaseServices.Surface.
negativeHalfToo: Флаг, определяющий, должна ли другая ("отрицательная") часть исходного тела создаваться как отдельное тело. Тип bool.
Returns: Возвращает созданное твердое тело, представляющее "отрицательную" половину исходного 3D-тела.
Тип Solid3d.

Teigha.DatabaseServices.Solid3d.Slice(Teigha.Geometry.Plane)
Метод позволяет разрезать плоскостью данное твердое тело и преобразовать его в ту часть, которая осталась с "положительной" стороны от режущей плоскости.
Метод позволяет разрезать плоскостью данное твердое тело и преобразовать его в ту часть, которая осталась с "положительной" стороны от режущей плоскости.
Этот метод реализован только в среде пространственного моделирования.
plane: Режущая плоскость. Тип Plane.

Teigha.DatabaseServices.Solid3d.Slice(Teigha.Geometry.Plane,System.Boolean)
Метод разрезает твердое тело указанной плоскостью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей плоскости с положительным направлением нормали.  Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
Метод разрезает твердое тело указанной плоскостью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей плоскости с положительным направлением нормали.  Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
Этот метод реализован только в среде пространственного моделирования.
plane: Режущая плоскость. Тип Plane.
negativeHalfToo: Флаг, определяющий, должна ли другая ("отрицательная") часть исходного тела создаваться как отдельное твердое тело. Тип bool.
Returns: Возвращает созданное твердое тело, представляющее "отрицательную" половину исходного 3D-тела.
Тип Solid3d.

Teigha.DatabaseServices.Solid3d.StlOut(String,System.Boolean)
Метод предназначен для записи представления данного твердого тела в формате стереолитографии (STL) в файл с указанным именем.
Метод предназначен для записи представления данного твердого тела в формате стереолитографии (STL) в файл с указанным именем.
Если файл с таким именем уже существует, он перезаписывается.
Если аргумент asciiFormat имеет значение true, то формат файла STL будет текстовым ASCII; в противном случае будет записан файл двоичного формата.
Если хотя бы одна из полученных вершин треугольников имеет хотя бы одну координату из интервала (-inf, 0), все вершины смещаются в октант, где все координаты являются положительными числами из интервала [0.01, +inf).
fileName: Имя файла. Тип String.
asciiFormat: Флаг, определяющий, будет ли записан файл в текстовом формате ASCII (значение true), или же будет записан файл в двоичном формате (значение false). Тип bool.

Teigha.DatabaseServices.Solid3d.TaperFaces(array,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Метод реализует сужение указанных граней твердого тела на заданный угол относительно базовой плоскости, определяемой заданными базовой точкой и вектором.
Метод реализует сужение указанных граней твердого тела на заданный угол относительно базовой плоскости, определяемой заданными базовой точкой и вектором.
Грани, лежащие в базовой плоскости сужения, не изменяются.
Следует иметь ввиду, что в некоторых случаях эта операция может привести к созданию недопустимого твердого тела.
Этот метод доступен только в среде пространственного моделирования.
subentityIds: Идентификаторы подобъектов граней данного твердого тела. Тип SubentityId[].
basePoint: Базовая точка плоскости сужения. Тип Point3d.
draftVector: Вектор направления сужения. Тип Vector3d.
draftAngle: Угол сужения в радианах. Тип double.

Teigha.DatabaseServices.Solid3d.TransformFaces(array,Teigha.Geometry.Matrix3d)
Метод предназначен для геометрического преобразования указанных граней данного твердого тела, заданного матрицей преобразования.
Метод предназначен для геометрического преобразования указанных граней данного твердого тела, заданного матрицей преобразования.
В некоторых случаях преобразование граней может привести к тому, что тело станет недопустимым.
Этот метод доступен только в среде пространственного моделирования.
subentityIds: Идентификаторы подобъектов граней данного твердого тела. Тип SubentityId[].
matrix: Матрица геометрического преобразования. Тип Matrix3d.

Teigha.DatabaseServices.Solid3d.Area
Свойство Area представляет площадь данного твердого тела.
Свойство Area представляет площадь данного твердого тела.
Returns: Возвращает площадь поверхности твердого тела. Тип double.

Teigha.DatabaseServices.Solid3d.IsNull
Свойство IsNull позволяет проверить, существует ли модель ACIS, связанная с этим объектом.
Свойство IsNull позволяет проверить, существует ли модель ACIS, связанная с этим объектом.
Returns: Возвращает true, если модель ACIS для данного объекта не существует.
В противном случае возвращает false.

Teigha.DatabaseServices.Solid3d.MassProperties
Свойство MassProperties представляет массо-центровочные характеристики данного твердого тела.
Свойство MassProperties представляет массо-центровочные характеристики данного твердого тела.
Они включают в себя следующую информацию.
* Объем твердого тела.
* Координаты центра тяжести твердого тела.
* Моменты инерции твердого тела.
* Центробежные моменты инерции твердого тела.
* Главные моменты твердого тела.
* Главные оси твердого тела.
* Радиусы инерции твердого тела.
* Габаритная рамка твердого тела.
Returns: Возвращает массо-центровочные характеристики данного объекта. Тип Solid3dMassProperties.

Teigha.DatabaseServices.Solid3d.NumChanges
Свойство NumChanges представляет количество изменений, произошедших с момента создания данного твердого тела.
Свойство NumChanges представляет количество изменений, произошедших с момента создания данного твердого тела.
Returns: Возвращает количество изменений данного объекта. Тип int.

Teigha.DatabaseServices.Solid3d.RecordHistory
Свойство RecordHistory позволяет определить, записывает ли данное твердое тело историю своих операций.
Свойство RecordHistory позволяет определить, записывает ли данное твердое тело историю своих операций.
Returns: Возвращает true, если история операций сохраняется.
В противном случае возвращает false.

Teigha.DatabaseServices.Solid3d.ShowHistory
Свойство ShowHistory позволяет определить, отображаются ли элементы из истории операций тела.
Свойство ShowHistory позволяет определить, отображаются ли элементы из истории операций тела.
Returns: Возвращает true, если элементы из истории операций отображаются.
В противном случае возвращает false.