Teigha.GraphicsInterface.MapChannel
Перечисление MapChannel определяет канал карты материала (map channel), к которому применяются координаты наложения карты.
Перечисление MapChannel определяет канал карты материала (map channel), к которому применяются координаты наложения карты.