Teigha.DatabaseServices.Filters.SpatialFilter.GetVolume
Этот метод позволяет получить описание объема данного пространственного фильтра в виде объекта SpatialFilterVolume.
Этот метод позволяет получить описание объема данного пространственного фильтра в виде объекта SpatialFilterVolume.
Returns: Возвращает объем данного пространственного фильтра. Тип SpatialFilterVolume.