Teigha.DatabaseServices.DxfFiler.ReadScale3d
Метод возвращает значение масштаба из текущего элемента этого объекта Filer.
Метод возвращает значение масштаба Scale3d из текущего элемента этого объекта Filer.
Returns: Возвращает масштаб. Тип Scale3d.