Teigha.DatabaseServices.Viewport.GetFrozenLayers
Метод предоставляет коллекцию всех слоёв, замороженных в данном видовом экране.
Метод предоставляет коллекцию всех слоёв, замороженных в данном видовом экране.
Returns: Возвращает коллекцию идентификаторов замороженных слоёв.
Тип ObjectIdCollection.