Teigha.DatabaseServices.DwgFiler.ReadString
Метод предназначен для получения текстовой строки из текущего элемента данного объекта Filer.
Метод предназначен для получения текстовой строки из текущего элемента данного объекта Filer.
Returns: Возвращает строку. Тип String.