Teigha.DatabaseServices.XrefComandeeredEventArgs
Класс XrefComandeeredEventArgs представляет данные для события XrefComandeered в базе данных.
Класс XrefComandeeredEventArgs представляет данные для события XrefComandeered в базе данных.

Teigha.DatabaseServices.XrefComandeeredEventArgs.From
Свойство From представляет базу данных, на которую осуществляется внешняя ссылка.
Свойство From представляет базу данных, на которую осуществляется внешняя ссылка.
Returns: Возвращает базу данных. Тип Database.

Teigha.DatabaseServices.XrefComandeeredEventArgs.Id
Свойство Id представляет идентификатор объекта, который в данный момент находится под управлением по внешней ссылке.
Свойство Id представляет идентификатор объекта, который в данный момент находится под управлением по внешней ссылке.
Returns: Возвращает идентификатор объекта, на который указывает внешняя ссылка.
Тип ObjectId.