Teigha.GraphicsInterface.TransparencyMode.Transparency8Bit
Значение: 2.
Полная поддержка альфа-каналов для форматов с цветностью 32bpp.
8-битный альфа-канал определяет в каждом пикселе прозрачность цвета в диапазоне от 0 (полная прозрачность) до 255 (полная непрозрачность).