Teigha.GraphicsInterface
Пространство имен Teigha.GraphicsInterface.
Пространство имен Teigha.GraphicsInterface включает классы и перечисления, которые обеспечивают прикладным приложениям доступ к графическому интерфейсу платформы.