Teigha.Geometry.EllipticalCone.GetAngles
Метод предоставляет текущие значения начального и конечного углов данного эллиптического конуса.
Метод предоставляет текущие значения начального и конечного углов данного эллиптического конуса с виде массива из двух элементов.
Первый элемент соответствует начальному углу эллиптического конуса (смещение угла, от которого строятся сегменты эллиптического конуса), а второй элемент соответствует конечному углу эллиптического конуса (смещение угла, до которого строятся сегменты эллиптического конуса).
Returns: Возвращает двухэлементный массив углов. Первый элемент соответствует начальному углу, а второй элемент - конечному углу эллиптического конуса.
Тип double[].