Teigha.DatabaseServices.MlineStyleElement.ToString
Метод формирует эквивалентное представление данного объекта в виде текстовой строки.
Метод формирует эквивалентное представление данного объекта в виде текстовой строки.
Returns: Возвращает текстовою строку, представляющую данный объект. Тип String.