HostMgd.EditorInput.PromptIntegerResult.ToString
Метод возвращает строковое представление целого числа,
введённого пользователем через интерактивную команду.
Метод переопределяет стандартное строковое представление объекта
и возвращает значение типа string, соответствующее введённому целому числу (Value)
и статусу операции. Он используется, например, для отладки, логгирования или
вывода информации в командную строку nanoCAD. Формат вывода зависит от статуса:
если операция завершена успешно — возвращается строковое значение числа,
иначе — сообщение об отмене или ошибке.
Returns: Возвращает значение типа string, представляющее результат ввода целого числа:
* Если статус OK — строка с числом, например: "123".
* Если статус Cancel или Error — строка с описанием отмены или ошибки, например: "Operation cancelled".
Формат и содержание строки может варьироваться в зависимости от реализации и контекста ввода.
Example
C#