Teigha.DatabaseServices.PlotSettingsValidator.GetPlotDeviceList
Метод предоставляет коллекцию всех доступных системных принтеров и файлов PC3 c настройками устройств печати.
Метод предоставляет коллекцию всех доступных системных принтеров и файлов PC3 c настройками устройств печати.  Эта коллекция создается лишь один раз в пределах сеанса nanoCAD, поэтому в случае каких-либо изменений в списке устройств печати следует предусмотреть ее принудительное обновление.
Returns: Возвращает коллекцию всех доступных системных принтеров.
Тип StringCollection.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.