Teigha.GraphicsInterface.EdgeStyle
Класс EdgeStyle определяет набор свойств визуального стиля для отображения ребер графических объектов.
Класс EdgeStyle определяет набор свойств визуального стиля для отображения ребер графических объектов.

Teigha.GraphicsInterface.EdgeStyle.#ctor
Конструктор по умолчанию класса EdgeStyle.
Конструктор по умолчанию класса EdgeStyle.

Teigha.GraphicsInterface.EdgeStyle.Set(Teigha.GraphicsInterface.EdgeStyle)
Метод позволяет переопределить данный стиль, используя в качестве источника данных указанный объект EdgeStyle.
Метод позволяет переопределить данный стиль, используя в качестве источника данных указанный объект EdgeStyle.
style: Стиль отображения ребер, который служит источником данных для переопределения свойств данного объекта. Тип EdgeStyle.

Teigha.GraphicsInterface.EdgeStyle.CreaseAngle
Свойство CreaseAngle определяет пороговый угол между смежными гранями, при превышении которого ребро отображается как "острое" (на изломе).
Свойство CreaseAngle определяет пороговый угол между смежными гранями, при превышении которого ребро отображается как "острое" (на изломе), в противоположность гладкому переходу.
Returns: Возвращает пороговый угол для установления острых ребер при отрисовке полигональных моделей.
Тип double.

Teigha.GraphicsInterface.EdgeStyle.EdgeColor
Свойство EdgeColor определяет цвет отображаемых ребер.
Свойство EdgeColor определяет цвет отображаемых ребер.
Returns: Возвращает цвет рёбер. Тип Colors.Color.

Teigha.GraphicsInterface.EdgeStyle.EdgeModel
Свойство EdgeModel определяет модель для отображения ребер.
Свойство EdgeModel определяет модель для отображения ребер.
Returns: Возвращает вариант отображения рёбер модели из перечисления GraphicsInterface.EdgeModel.

Teigha.GraphicsInterface.EdgeStyle.EdgeModifiers
Свойство EdgeModifiers определяет текущие модификаторы режима отображения рёбер.
Свойство EdgeModifiers определяет текущие модификаторы режима отображения рёбер, используемые для реализации различных визуальных эффектов.
Returns: Возвращает текущие модификаторы режима отображения рёбер как комбинацию битовых полей из перечисления GraphicsInterface.EdgeModifiers.

Teigha.GraphicsInterface.EdgeStyle.EdgeStyleApply
Свойство EdgeStyleApply определяет тип геометрии, к которой следует применять стиль рёбер.
Свойство EdgeStyleApply определяет тип геометрии, к которой следует применять стиль рёбер.
Returns: Возвращает область применения стиля рёбер.
Значение из перечисления GraphicsInterface.EdgeStyleApply.

Teigha.GraphicsInterface.EdgeStyle.EdgeVisibility
Свойство EdgeVisibility определяет текущий режим видимости рёбер модели.
Свойство EdgeVisibility определяет текущий режим видимости при отображении рёбер модели.
Returns: Возвращает текущий режим видимости рёбер модели.
Перечисление EdgeVisibilityModes.

Teigha.GraphicsInterface.EdgeStyle.EdgeWidth
Свойство EdgeWidth определяет толщину отображаемых рёбер.
Свойство EdgeWidth определяет текущее значение толщины отображаемых рёбер.
Returns: Возвращает текущее значение толщины отображаемых рёбер.
Тип int.

Teigha.GraphicsInterface.EdgeStyle.HaloGap
Свойство HaloGap представляет текущее значение коэффициента недовода рёбер (HaloGap) к рёбрам объекта, скрытого другим объектом.
Свойство HaloGap представляет текущее значение коэффициента недовода рёбер (HaloGap) к рёбрам объекта, скрытого другим объектом.
Недотягивание скрытых рёбер до ребер объекта, который их скрывает, определяется в процентах.
Returns: Возвращает текущее значение коэффициента недовода рёбер в процентах (в диапазоне [0..100]).
Тип int.

Teigha.GraphicsInterface.EdgeStyle.HidePrecision
Свойство HidePrecision позволяет определить, допустимо ли в данном стиле снижать точность отображения ребер.
Свойство HidePrecision позволяет определить, допустимо ли в данном стиле снижать точность отображения ребер
(например, не отображать слишком мелкие ребра).
Returns: Возвращает true, если снижать точность отображения ребер допустимо.
В противном случае возвращает false.

Teigha.GraphicsInterface.EdgeStyle.IntersectionColor
Свойство IntersectionColor позволяет определить цвет рёбер на пересечении графических объектов.
Свойство IntersectionColor позволяет определить цвет рёбер на пересечении графических объектов.
Returns: Возвращает текущий цвет рёбер в местах пересечений.
Тип Colors.Color.

Teigha.GraphicsInterface.EdgeStyle.IntersectionLinetype
Свойство IntersectionLinetype определяет тип линий для ребер в области пересечения графических объектов.
Свойство IntersectionLinetype определяет тип линий для ребер в области пересечения графических объектов.
Returns: Возвращает текущий тип линий для ребер в областях пересечений объектов.
Тип Linetype.

Teigha.GraphicsInterface.EdgeStyle.Isolines
Свойство Isolines определяет количество изолиний, отображаемых на поверхностях объектов.
Свойство Isolines определяет количество изолиний, отображаемых на поверхностях объектов
в режиме GraphicsInterface.EdgeModel = EdgeModel.Isolines.
Returns: Возвращает количество отображаемых изолиний.
Тип short.

Teigha.GraphicsInterface.EdgeStyle.Jitter
Свойство Jitter определяет текущую настройку джиттера для получения эффекта легкой неровности при отрисовке рёбер.
Свойство Jitter определяет текущую настройку джиттера для получения эффекта легкой неровности (дрожания) отображаемых рёбер.
Returns: Возвращает текущее значение джиттера.
Перечисление JitterAmount.

Teigha.GraphicsInterface.EdgeStyle.ObscuredColor
Свойство ObscuredColor определяет цвет скрытых рёбер.
Свойство ObscuredColor определяет цвет, используемый при отрисовке скрытых рёбер.
Returns: Возвращает цвет скрытых рёбер.
Тип Colors.Color.

Teigha.GraphicsInterface.EdgeStyle.ObscuredLinetype
Свойство ObscuredLinetype определяет тип линий, используемый при отрисовке скрытых рёбер.
Свойство ObscuredLinetype определяет тип линий, используемый при отрисовке скрытых рёбер.
Returns: Возвращает тип линий для скрытых рёбер.
Тип Linetype.

Teigha.GraphicsInterface.EdgeStyle.Opacity
Свойство Opacity определяет непрозрачность рёбер.
Свойство Opacity определяет непрозрачность рёбер.
Returns: Возвращает непрозрачность рёбер.
Тип double.

Teigha.GraphicsInterface.EdgeStyle.Overhang
Свойство Overhang определяет поддерживаемое данным стилем удлинение рёбер за пределы начальной и конечной точек.
Свойство Overhang определяет поддерживаемое данным стилем удлинение рёбер за пределы начальной и конечной точек.
Обычно используется при создании эффекта карандашного наброска от руки.
Returns: Возвращает величину удлинения рёбер.
Тип int.

Teigha.GraphicsInterface.EdgeStyle.SilhouetteColor
Свойство SilhouetteColor определяет цвет для отрисовки силуэтных рёбер объектов.
Свойство SilhouetteColor определяет цвет, используемый для отрисовки силуэтных рёбер объектов.
Returns: Возвращает цвет силуэтных рёбер.
Тип Colors.Color.

Teigha.GraphicsInterface.EdgeStyle.SilhouetteWidth
Свойство SilhouetteWidth определяет толщину силуэтных рёбер объектов.
Свойство SilhouetteWidth определяет толщину силуэтных рёбер объектов.
Returns: Возвращает толщину силуэтных рёбер.
Тип int.