HostMgd.GraphicsSystem.Manager.ConfigWasModified
Событие ConfigWasModified генерируется после изменения конфигурации.
Событие ConfigWasModified генерируется после изменения конфигурации.
Returns: Возвращает делегат типа ConfigWasModifiedEventHandler.