Teigha.DatabaseServices.OleDvAspect
Данное перечисление определяет желаемые данные или аспект представления объекта при отрисовке или получении данных.
Данное перечисление определяет желаемые данные или аспект представления объекта при отрисовке или получении данных.