Teigha.DatabaseServices.MlineStyle.Reset
Метод предназначен для реинициализации данного объекта.
Метод предназначен для реинициализации данного объекта.
На выходе из метода свойства объекта MlineStyle  имеют следующие значения:
Свойство      Значение
----------------	 -----------------
Name                 Пустая строка
FillColor            0
StartAngle           90°
EndAngle             90°
Elements             Пустой список