Teigha.DatabaseServices.SectionType
Перечисление SectionType задает возможные типы создаваемых сечений, каждый из которых определяет свой собственный комплекс свойств порождаемой геометрии сечения.
Перечисление SectionType задает возможные типы создаваемых сечений, каждый из которых определяет свой собственный комплекс свойств порождаемой геометрии сечения.