Teigha.GraphicsInterface.VisualStyleTraits
Класс VisualStyleTraits представляет атрибуты визуального стиля.
Класс VisualStyleTraits реализует интерфейсы для управления визуальным стилем через настройку его атрибутов.

Teigha.GraphicsInterface.VisualStyleTraits.OdGiVisualStyle
Свойство OdGiVisualStyle предоставляет ссылку на визуальный стиль, с которым связан данный объект.
Свойство OdGiVisualStyle предоставляет ссылку на визуальный стиль, с которым связан данный объект.
Returns: Возвращает объект визуального стиля.
Тип GraphicsInterface.VisualStyle.