Teigha.DatabaseServices.DatabaseSummaryInfo
Класс DatabaseSummaryInfo предназначен для инкапсуляции набора текстовых строк, которые можно использовать для добавления в файл DWG дополнительной информации.

Teigha.DatabaseServices.DatabaseSummaryInfo.Equals(Object)
Метод предназначен для проверки данного объекта на совпадение с указанным объектом.
Метод предназначен для проверки данного объекта на совпадение с указанным объектом obj.
obj: Объект, который проверяется на совпадение с данным объектом DatabaseSummaryInfo. Тип Object.
Returns: Возвращает true, если совместно выполняются все указанные ниже условия:
* Совпадают поля Title;
* Совпадают поля Subject;
* Совпадают поля Author;
* Совпадают поля Keywords;
* Совпадают поля Comments;
* Совпадают поля LastSavedBy;
* Совпадают поля RevisionNumber;
* Совпадают поля HyperlinkBase;
* Совпадают поля CustomProperties.
В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.

Teigha.DatabaseServices.DatabaseSummaryInfo.ToString(IFormatProvider)
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек.
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек, определяемых указанным провайдером.
provider: Заданный провайдер формата региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное представление данного объекта в виде строки. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.==(Teigha.DatabaseServices.DatabaseSummaryInfo,Teigha.DatabaseServices.DatabaseSummaryInfo)
Оператор равенства для класса DatabaseSummaryInfo.
Оператор равенства для класса DatabaseSummaryInfo. Позволяет проверить, равны ли указанные объекты.
a: Левый операнд.  Тип DatabaseSummaryInfo.
b: Правый операнд. Тип DatabaseSummaryInfo.
Returns: Возвращает true, если совместно выполняются все указанные ниже условия:
* Совпадают поля Title;
* Совпадают поля Subject;
* Совпадают поля Author;
* Совпадают поля Keywords;
* Совпадают поля Comments;
* Совпадают поля LastSavedBy;
* Совпадают поля RevisionNumber;
* Совпадают поля HyperlinkBase;
* Совпадают поля CustomProperties.
В противном случае возвращает false.

Teigha.DatabaseServices.DatabaseSummaryInfo.!=(Teigha.DatabaseServices.DatabaseSummaryInfo,Teigha.DatabaseServices.DatabaseSummaryInfo)
Оператор неравенства для класса DatabaseSummaryInfo.
Оператор неравенства для класса DatabaseSummaryInfo. Позволяет проверить, различаются ли указанные объекты.
a: Левый операнд.  Тип DatabaseSummaryInfo.
b: Правый операнд. Тип DatabaseSummaryInfo.
Returns: Возвращает true, если не выполняется хотя бы одно из указанных ниже условий:
* Совпадают поля Title;
* Совпадают поля Subject;
* Совпадают поля Author;
* Совпадают поля Keywords;
* Совпадают поля Comments;
* Совпадают поля LastSavedBy;
* Совпадают поля RevisionNumber;
* Совпадают поля HyperlinkBase;
* Совпадают поля CustomProperties.
В противном случае возвращает false.

Teigha.DatabaseServices.DatabaseSummaryInfo.Author
Свойство предоставляет доступ к имени автора данного объекта DatabaseSummaryInfo.
Свойство предоставляет доступ к имени автора данного объекта DatabaseSummaryInfo.
Returns: Возвращает имя автора. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Comments
Свойство предоставляет доступ к комментарию в данном объекте DatabaseSummaryInfo.
Свойство предоставляет доступ к комментарию в данном объекте DatabaseSummaryInfo.
Returns: Возвращает комментарий. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.CustomProperties
Свойство предоставляет доступ к перечислителю для пользовательских свойств данного объекта DatabaseSummaryInfo.
Свойство предоставляет доступ к перечислителю для пользовательских свойств данного объекта DatabaseSummaryInfo.
Returns: Возвращает перечислитель коллекции пользовательских свойств. Тип System.Collections.IDictionaryEnumerator.

Teigha.DatabaseServices.DatabaseSummaryInfo.HyperlinkBase
Свойство обеспечивает доступ к базовому URL данного объекта.
Свойство обеспечивает доступ к базовому URL данного объекта.
Returns: Возвращает значение поля HyperlinkBase.
Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Keywords
Свойство предоставляет доступ к ключевым словам данного объекта DatabaseSummaryInfo.
Свойство предоставляет доступ к ключевым словам данного объекта DatabaseSummaryInfo.
Returns: Возвращает значение поля Keywords.
Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.LastSavedBy
Свойство предоставляет доступ к данным о пользователе, который внёс в этот объект наиболее поздние изменения.
Свойство предоставляет доступ к данным о пользователе, который внёс в этот объект наиболее поздние изменения.
Returns: Возвращает значение поля LastSavedBy.
Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.RevisionNumber
Свойство предоставляет доступ к номеру ревизии данного объекта DatabaseSummaryInfo.
Свойство предоставляет доступ к номеру ревизии данного объекта DatabaseSummaryInfo.
Returns: Возвращает номер ревизии данного объекта. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Subject
Свойство предоставляет доступ к описанию назначения данного объекта или предметной области, к которой он относится.
Свойство предоставляет доступ к описанию назначения данного объекта или предметной области, к которой он относится.
Returns: Возвращает значение поля Subject. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Title
Свойство предоставляет доступ к заголовку данного объекта DatabaseSummaryInfo.
Свойство предоставляет доступ к заголовку данного объекта DatabaseSummaryInfo.
Returns: Возвращает заголовок. Тип String.