Teigha.DatabaseServices.DwgFiler.ReadVector2d
Метод предназначен для получения двумерного вектора из текущего элемента данного объекта Filer.
Метод предназначен для получения двумерного вектора из текущего элемента данного объекта Filer.
Returns: Возвращает двумерный вектор. Тип Vector2d.