Teigha.DatabaseServices.DBObject.Copied
Событие возникает, когда для объекта был вызван метод копирования/клонирования.
Событие возникает, когда для объекта был вызван метод копирования/клонирования.
Returns: Тип данных ObjectEventHandler, представляющий обработчик события.