Teigha.DatabaseServices.IdMapping.GetEnumerator
Метод позволяет получить перечислитель для данного объекта.
Метод позволяет получить перечислитель для данного объекта.
Returns: Возвращает перечислитель. Тип System.Collections.IEnumerator.