Teigha.Geometry.Curve2d.IsClosed
Метод выполняет проверку, замкнута ли данная кривая.
Метод выполняет проверку, замкнута ли данная кривая.
Кривая считается замкнутой, если в пределах заданной точности начальная и конечная точки кривой совпадают.
Здесь используется вызов Curve2d.IsClosed(Tolerance tolerance) с точностью Tolerance.Global.
Returns: Возвращает true, если начальная и конечная точки кривой совпадают в пределах точности Tolerance.Global.
В противном случае возвращает false.