Teigha.GraphicsInterface.VertexData.GetNormalVectors
Метод предоставляет массив векторов нормалей для вершин сети или оболочки, которые используются в данный момент объектом VertexData.
Метод предоставляет массив векторов нормалей для вершин сети или оболочки, которые используются в данный момент объектом VertexData.
Notes
Метод возвращает либо NULL, либо массив, количество элементов в котором определяется количеством вершин сети или оболочки. В последнем случае каждый из элементов результирующего массива является допустимым вектором в системе координат модели, который используется в качестве нормали для соответствующей вершины в массиве вершин сети или оболочки.
Returns: Возвращает массив векторов нормалей для вершин сети или оболочки.
Тип Vector3d[].