Teigha.DatabaseServices.Helix
Класс Helix представляет спирали в экземпляре базы данных.
Класс Helix является наследником класса Spline и представляет спирали в экземпляре базы данных.

Teigha.DatabaseServices.Helix.#ctor
Конструктор по умолчанию класса Helix.
Конструктор по умолчанию класса Helix.

Teigha.DatabaseServices.Helix.SetAxisPoint(Teigha.Geometry.Point3d,System.Boolean)
Метод предоставляет возможность задать точку начала оси спирали.
Метод предоставляет возможность задать точку начала оси спирали (центр основания).
axisPoint: Новая точка начала оси спирали. Тип Point3d.
moveStartPoint: Флаг, определяющий, следует ли применить к начальной точке спирали такое же смещение, что и у точки начала оси спирали. Тип bool. В случае значения true начальная точка спирали должна сместиться. В противном случае она остается на прежнем месте.

Teigha.DatabaseServices.Helix.AxisVector
Свойство обеспечивает доступ к направляющему вектору оси спирали.
Свойство обеспечивает доступ к направляющему вектору оси спирали.
Этот вектор всегда перпендикулярен линии, соединяющей начальную точку спирали и точку начала оси.
Returns: Возвращает направляющий вектор оси спирали. Тип Vector3d.

Teigha.DatabaseServices.Helix.BaseRadius
Свойство обеспечивает доступ к радиусу в основании этой спирали.
Свойство обеспечивает доступ к радиусу в основании этой спирали
Returns: Возвращает радиус в основании спирали. Тип double.

Teigha.DatabaseServices.Helix.Constrain
Свойство предоставляет возможность определить вариант ограничения геометрии спирали -  по высоте витка, по количеству витков или по общей высоте.
Свойство предоставляет возможность определить вариант ограничения высоты спирали -  по высоте витка, по количеству витков или по общей высоте.
Ограничения используются для того, чтобы сделать переменный параметр геометрической модели равным некоторой наперёд заданной величине. Например, если установить ограничение высоты спирали, то изменения любых других ее параметров на высоту спирали уже не влияют.
При использовании ограничения становится существенным порядок, в котором вы задаёте свойства спирали.
Скажем, чтобы ограничить количество витков в спирали, следует задать количество витков ДО указания высоты спирали или высоты витка.
Returns: Возвращает вариант ограничения высоты спирали из перечисления ConstrainType.

Teigha.DatabaseServices.Helix.Height
Свойство позволяет управлять высотой спирали.
Свойство позволяет управлять высотой спирали.
Returns: Возвращает высоту спирали.  Тип double.

Teigha.DatabaseServices.Helix.StartPoint
Свойство обеспечивает доступ к положению начальной точки спирали.
Свойство обеспечивает доступ к положению начальной точки спирали.
Returns: Возвращает начальную точку спирали. Тип Point3d.

Teigha.DatabaseServices.Helix.TopRadius
Свойство обеспечивает доступ к радиусу верхнего основания спирали.
Свойство обеспечивает доступ к радиусу верхнего основания спирали.
Returns: Возвращает радиус верхнего основания спирали. Тип double.

Teigha.DatabaseServices.Helix.TotalLength
Свойство возвращает текущее значение полной длины спирали.
Свойство возвращает текущее значение полной длины спирали.
Returns: Возвращает полную длину спирали. Тип double.

Teigha.DatabaseServices.Helix.TurnHeight
Свойство обеспечивает доступ к значению высоты витка спирали.
Свойство обеспечивает доступ к значению высоты витка спирали.
Returns: Возвращает высоту витка спирали. Тип double.

Teigha.DatabaseServices.Helix.Turns
Свойство обеспечивает доступ к количеству витков спирали.
Свойство обеспечивает доступ к количеству витков спирали.
Returns: Возвращает текущее количество витков спирали. Тип double.

Teigha.DatabaseServices.Helix.TurnSlope
Свойство возвращает угол наклона витков спирали.
Свойство возвращает угол наклона витков спирали.
Returns: Возвращает угол наклона витков спирали. Тип double.

Teigha.DatabaseServices.Helix.Twist
Свойство обеспечивает доступ к направлению закручивания спирали (по часовой стрелке или против).
Свойство обеспечивает доступ к направлению закручивания спирали (по часовой стрелке или против).
Returns: Возвращает true, если спираль закручивается «против часовой стрелки».
В противном случае возвращает false.