HostMgd.ApplicationServices.InplaceTextEditor.TextUndoType
Данное перечисление определяет все типы отмены текстовых операций, реализованные во встроенном текстовом редакторе.
Перечисление TextUndoType определяет все типы отмены текстовых операций, используемые встроенным текстовым редактором.