Teigha.Runtime.FilerSeekType
Перечисление FilerSeekType определяет поддерживаемые типы точки отсчета при задании смещения файлового указателя в потоковом буфере
Перечисление FilerSeekType определяет поддерживаемые типы точки отсчета для смещения файлового указателя в потоковом буфере (от начала/конца файла, от текущей позиции файлового указателя).