HostMgd.EditorInput.PromptOptions.Message
Приглашающее сообщение.
Возвращает или устанавливает приглашающее сообщение в запросе данных у пользователя.
Returns: Возвращает строку с приглашающим сообщением.