Teigha.DatabaseServices.TableCopyOptions.OverwriteContentModifiedAfterUpdate
Значение: 1048576 = 0x100000.
Если содержимое целевой ячейки претерпело изменения с момента последнего обновления, перезаписать.
Этот параметр применим только для ячеек с внешними ссылками.