Teigha.GraphicsInterface.MaterialMap
Класс MaterialMap реализует карты материалов.
Класс MaterialMap реализует карты материалов.
Notes
Карты материалов определяют растровые изображения, которые проецируются на поверхности геометрических объектов.

Teigha.GraphicsInterface.MaterialMap.#ctor
Конструктор по умолчанию класса MaterialMap.
Создает новый объект без фактических данных.
Конструктор по умолчанию класса MaterialMap.
Создает карту материала без исходного файла и с коэффициентом смешивания 1.0.

Teigha.GraphicsInterface.MaterialMap.#ctor(Teigha.GraphicsInterface.Source,Teigha.GraphicsInterface.MaterialTexture,System.Double,Teigha.GraphicsInterface.Mapper)
Конструктор класса MaterialMap.
Создает новый объект, используя указанные источник, текстуру материала, коэффициент смешивания и маппер.
Конструктор класса MaterialMap.
Создает карту материала, используя указанные источник, текстуру материала, коэффициент смешивания и маппер.
Notes
Коэффициент смешивания определяет, насколько текстура смешивается с материалом.
Если коэффициент смешивания равен 0.0, текстура становится совершенно прозрачной (невидимой), растворяясь в цвете базового материала.
По мере возрастания коэффициента смешивания от нуля до единицы прозрачность текстуры постепенно уменьшается, достигая полностью непрозрачного состояния при значении 1.0.
При значениях свыше 1.0 цвета текстуры смешиваются с цветом базового материала.
source: Источник карты материалов. Тип Source.
pTexture: Текстура материала. Тип MaterialTexture.
blendFactor: Коэффициент смешивания. Тип double.
mapper: Маппер материала. Тип Mapper.

Teigha.GraphicsInterface.MaterialMap.#ctor(Teigha.GraphicsInterface.Source,Teigha.GraphicsInterface.MaterialTexture,System.Double,Teigha.GraphicsInterface.Mapper,Teigha.GraphicsInterface.MapFilter)
Конструктор класса MaterialMap.
Создает новый объект, используя указанные источник, текстуру материала, коэффициент смешивания, маппер и фильтр карты.
Конструктор класса MaterialMap.
Создает карту материала, используя указанные источник, текстуру материала, коэффициент смешивания, маппер и фильтр карты.
Notes
Коэффициент смешивания определяет, насколько текстура смешивается с материалом.
Если коэффициент смешивания равен 0.0, текстура становится совершенно прозрачной (невидимой), растворяясь в цвете базового материала.
По мере возрастания коэффициента смешивания от нуля до единицы прозрачность текстуры постепенно уменьшается, достигая полностью непрозрачного состояния при значении 1.0.
При значениях свыше 1.0 цвета текстуры смешиваются с цветом базового материала.
source: Источник карты материалов. Тип Source.
pTexture: Текстура материала. Тип MaterialTexture.
blendFactor: Коэффициент смешивания. Тип double.
mapper: Маппер материала. Тип Mapper.
filter: Фильтр карты. Тип MapFilter.

Teigha.GraphicsInterface.MaterialMap.#ctor(Teigha.GraphicsInterface.Source,String,Teigha.GraphicsInterface.MaterialTexture,System.Double,Teigha.GraphicsInterface.Mapper)
Конструктор класса MaterialMap.
Создает новый объект, используя указанные источник, путь к файлу (если источником является файл), текстуру материала, коэффициент смешивания и маппер.
Конструктор класса MaterialMap.
Создает новую карту материала, используя указанные источник, путь к файлу (если источником является файл), текстуру материала, коэффициент смешивания и маппер.
Notes
Коэффициент смешивания определяет, насколько текстура смешивается с материалом.
Если коэффициент смешивания равен 0.0, текстура становится совершенно прозрачной (невидимой), растворяясь в цвете базового материала.
По мере возрастания коэффициента смешивания от нуля до единицы прозрачность текстуры постепенно уменьшается, достигая полностью непрозрачного состояния при значении 1.0.
При значениях свыше 1.0 цвета текстуры смешиваются с цветом базового материала.
source: Источник карты материалов. Тип Source.
fileName: Полный путь к файлу для данной карты материала. Тип String.
pTexture: Текстура материала. Тип MaterialTexture.
blendFactor: Коэффициент смешивания. Тип double.
mapper: Маппер материала. Тип Mapper.

Teigha.GraphicsInterface.MaterialMap.Equals(Object)
Метод реализует проверку равенства данного объекта и указанного объекта.
Метод реализует проверку равенства данного объекта и указанного объекта.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialMap.!=(Teigha.GraphicsInterface.MaterialMap,Teigha.GraphicsInterface.MaterialMap)
Оператор неравенства для класса MaterialMap.
Оператор неравенства для класса MaterialMap.
lhs: Левый операнд.  Тип MaterialMap.
rhs: Правый операнд. Тип MaterialMap.
Returns: Возвращает true, если нарушается хотя бы одно из следующих условий:
* Источники карт равны;
* Источники текстур равны;
* Пути исходных файлов равны;
* Коэффициенты смешивания равны;
* Объекты мапперов равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialMap.==(Teigha.GraphicsInterface.MaterialMap,Teigha.GraphicsInterface.MaterialMap)
Оператор равенства для класса MaterialMap.
Оператор равенства для класса MaterialMap.
lhs: Левый операнд.  Тип MaterialMap.
rhs: Правый операнд. Тип MaterialMap.
Returns: Возвращает true, если совместно выполняются все следующие условия:
* Источники карт равны;
* Источники текстур равны;
* Пути исходных файлов равны;
* Коэффициенты смешивания равны;
* Объекты мапперов равны.
Этот метод также возвращает true, если оба операнда равны null.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialMap.BlendFactor
Свойство BlendFactor представляет коэффициент смешивания для данного объекта.
Свойство BlendFactor представляет коэффициент смешивания для данного объекта.
Returns: Возвращает коэффициент смешивания.
Тип double.

Teigha.GraphicsInterface.MaterialMap.Filter
Свойство Filter представляет фильтр карты материала для данного объекта.
Не поддерживается.
Свойство Filter представляет фильтр карты материала для данного объекта.
В текущей версии фильтры карт не поддерживаются.
Returns: Возвращает фильтр карты.
Тип GraphicsInterface.MapFilter.

Teigha.GraphicsInterface.MaterialMap.Mapper
Свойство Mapper представляет маппер, связанный с данным объектом.
Свойство Mapper представляет маппер, связанный с данным объектом.
Returns: Возвращает объект маппера.
Тип GraphicsInterface.Mapper.

Teigha.GraphicsInterface.MaterialMap.Source
Свойство Source представляет источник карты материала.
Свойство Source представляет источник карты материала.
Returns: Возвращает источник карты материала.
Значение из перечисления GraphicsInterface.Source.

Teigha.GraphicsInterface.MaterialMap.SourceFileName
Свойство SourceFileName представляет полный путь к файлу источника карты материала.
Свойство SourceFileName представляет полный путь к файлу источника карты материала.
Returns: Возвращает полный путь к файлу источника.
Тип String.

Teigha.GraphicsInterface.MaterialMap.Texture
Свойство Texture представляет текстуру материала, связанную с данным объектом.
Свойство Texture представляет текстуру материала, связанную с данным объектом.
Returns: Возвращает текстуру материала.
Тип MaterialTexture.