HostMgd.EditorInput.KeywordCollection
Класс представляет необязательные параметры приглашения при
вводе ключевых слов.

HostMgd.EditorInput.KeywordCollection.Add(String)
Метод добавляет ключевое слово в коллекцию по значению
глобального имени ключевого слова.
Глобальное имя никогда не отображается, но может
использоваться программой для обеспечения доступа к ключевому
слову, когда локальный перевод не известен.
globalName: Глобальное имя. Оно никогда не показывается на

HostMgd.EditorInput.KeywordCollection.Add(String,String)
Метод добавляет ключевое слово в коллекцию, задавая значения
глобального и локального имени ключевого слова.
Для определения ключевого слова пользователь вводит именно
локальное имя.
globalName: Глобальное имя. Оно никогда не показывается на
localName: Локальное имя. Это имя вводится пользователем

HostMgd.EditorInput.KeywordCollection.Add(String,String,String)
Метод добавляет ключевое слово в коллекцию, задавая значения
глобального, локального и отображаемого имени ключевого
слова.
Отображаемое имя показывается в командной строке и обычно
совпадает с локальным именем.
globalName: Глобальное имя. Оно никогда не показывается на
localName: Локальное имя. Это имя вводится пользователем
displayName: Отображаемое имя. Это имя отображается в

HostMgd.EditorInput.KeywordCollection.Add(String,String,String,System.Boolean,System.Boolean)
Метод добавляет ключевое слово в коллекцию, задавая значения
глобального, локального и отображаемого имени ключевого
слова, а также значений свойств visible и enable.
visible определяет, может ли ключевое слово быть показано
пользователю.
globalName: Глобальное имя. Оно никогда не показывается на
localName: Локальное имя. Это имя вводится пользователем
displayName: Отображаемое имя. Это имя отображается в
visible: Свойство, определяющее, будет ли ключевое слово
enabled: Свойство, определяющее, может ли ключевое слово

HostMgd.EditorInput.KeywordCollection.CopyTo(Array,System.Int32)
a: Массив, куда копируются элементы коллекции. Индекс
index: Значение индекса в массиве, начиная с котрого в него

HostMgd.EditorInput.KeywordCollection.Count
Возвращает количество элементов, содержащихся в коллекции.

HostMgd.EditorInput.KeywordCollection.Default
Возвращает и устанавливает значение ключевого слова,
подставляемого при нажатии пользователем ENTER без
какого-либо ввода.

HostMgd.EditorInput.KeywordCollection.GetDisplayString(System.Boolean)
Метод возвращает строку, представляющую ключевое слово, как
оно отображается пользователю.
showNoDefault: При значении true в результирующую строку не

HostMgd.EditorInput.KeywordCollection.IsReadOnly
Возвращает или устанавливает значение, указывающее,
используется ли коллекция в режиме "только для чтения".
Значение true означает, что коллекция используется в режиме
"только для чтения", в противном случае свойство имеет
значение false.

HostMgd.EditorInput.KeywordCollection.#ctor
Конструктор.