HostMgd.EditorInput.PromptAngleOptionsEventHandler
Делегат уведомления в начале метода указания угла (GetAngle) класса Edit

HostMgd.EditorInput.PromptAngleOptionsEventHandler
Делегат предназначен для обработки события,
возникающего при начале операции ввода угла,
и позволяет динамически настраивать параметры ввода.
Делегат используется как сигнатура метода-обработчика для события PromptingForAngle,
которое возникает перед началом интерактивного ввода угла.
Он позволяет разработчикам надстроек nanoCAD модифицировать параметры команды ввода
— такие как начальное значение, сообщение, допустимый диапазон угла и другие.
Это обеспечивает гибкую настройку команды в зависимости от контекста, например,
при построении объектов, вращении или других операциях, требующих ввода угла.
sender: Источник события, обычно представляет экземпляр редактора (Editor), в котором происходит ввод угла.
e: Объект, содержащий данные о параметрах ввода угла