Teigha.LayerManager.AndExpression.GetRelationalExpressions
Метод позволяет получать выражения для отношений, использующие логический оператор AND.
Метод позволяет получать выражения для отношений, использующие логический оператор AND.
Returns: Возвращает массив логических выражений для отношений.
Тип RelationalExpression[].