HostMgd.PlottingServices.PlotConfigManager.CurrentConfig
Используемая конфигурация печати.
Данная ссылка сохраняется только в текущей сессии после успешного выполнения метода SetCurrentConfig.
В противном случае свойство возвращает null
Только для чтения