Teigha.DatabaseServices.FieldEvaluator.EvaluatorId
Метод предоставляет идентификаторы вычислителя, поддерживаемые данным объектом.
Метод предоставляет идентификаторы вычислителя, поддерживаемые данным вычислителем FieldEvaluator.
Notes
Может возвращать более одного идентификатора вычислителя, если вычислитель поддерживает несколько идентификаторов.
Если возвращается более одного идентификатора, они перечисляются через запятую.
Returns: Возвращает идентификатор вычислителя. Если их несколько, идентификаторы разделяются запятыми.
Тип String.