Teigha.DatabaseServices.Solid3dMassProperties
Структура Solid3dMassProperties представляет массо-центровочные свойства трехмерного твёрдого тела.
Структура Solid3dMassProperties представляет массо-центровочные свойства трехмерного твёрдого тела.
Экземпляр этой структуры возвращает свойство Solid3d.MassProperties.

Teigha.DatabaseServices.Solid3dMassProperties.#ctor(System.Int32)
Конструктор класса Solid3dMassProperties.
Конструктор класса Solid3dMassProperties.
dummy: Не используется. Тип int.

Teigha.DatabaseServices.Solid3dMassProperties.Centroid
Свойство Centroid представляет центр тяжести твердого тела.
Свойство Centroid представляет центр тяжести твердого тела.
Returns: Возвращает координатную точку центра тяжести твердого тела.
Тип Point3d.

Teigha.DatabaseServices.Solid3dMassProperties.Extents
Свойство Extents представляет габаритную рамку твердого тела.
Свойство Extents представляет габаритную рамку твердого тела.
Габаритная рамка представляет собой ориентированный по осям системы координат прямоугольный параллелепипед минимального размера, в который вписано твердое тело.
Returns: Возвращает габаритную рамку твердого тела. Тип Extents3d.

Teigha.DatabaseServices.Solid3dMassProperties.PrincipalAxes
Свойство PrincipalAxes представляет главную ось твердого тела по ее индексу.
Свойство PrincipalAxes представляет главную ось твердого тела по ее индексу.
Returns: Возвращает главную ось тела по ее индексу. Тип Vector3d.

Teigha.DatabaseServices.Solid3dMassProperties.MomentsOfIntertia
Свойство MomentsOfIntertia представляет моменты инерции твердого тела относительно осей X, Y и Z.
Свойство MomentsOfIntertia представляет моменты инерции твердого тела относительно осей X, Y и Z.
Returns: Возвращает моменты инерции твердого тела. Тип Vector3d.

Teigha.DatabaseServices.Solid3dMassProperties.PrincipalMoments
Свойство PrincipalMoments представляет главные моменты инерции твердого тела относительно осей X, Y и Z.
Свойство PrincipalMoments представляет главные моменты инерции твердого тела относительно осей X, Y и Z.
Returns: Возвращает главные моменты инерции. Тип Vector3d.

Teigha.DatabaseServices.Solid3dMassProperties.ProductsOfIntertia
Свойство ProductsOfIntertia представляет центробежные моменты инерции твердого тела относительно осей X, Y и Z.
Свойство ProductsOfIntertia представляет центробежные моменты инерции твердого тела относительно осей X, Y и Z.
Returns: Возвращает центробежные моменты инерции. Тип Vector3d.

Teigha.DatabaseServices.Solid3dMassProperties.RadiiOfGyration
Свойство RadiiOfGyration представляет радиусы инерции твердого тела относительно осей X, Y и Z.
Свойство RadiiOfGyration представляет радиусы инерции твердого тела относительно осей X, Y и Z.
Returns: Возвращает радиусы инерции. Тип Vector3d.

Teigha.DatabaseServices.Solid3dMassProperties.Volume
Свойство Volume представляет текущий объем твердого тела.
Свойство Volume представляет текущий объем твердого тела.
Returns: Возвращает объем твердого тела. Тип double.