Teigha.DatabaseServices.ImageQuality
Данное перечисление определяет режимы качества отображения растровых изображений.
Данное перечисление определяет режимы качества отображения растровых изображений.
Эти режимы позволяют выбирать между скоростью отображения и качеством отображаемого растрового изображения.
В черновом режиме используются алгоритмы дискретизации и обработки, выигрывающие в скорости ценой снижения качества изображения.
В режиме высокого качества используются более ресурсоемкие алгоритмы, которые как правило генерируют более точные и визуально приемлемые результаты.