Teigha.Geometry.Vector3dCollection.ToArray
Метод создает массив объектов Vector3d, содержащий копии всех элементов данной коллекции.
Метод создает массив объектов Vector3d, содержащий копии всех элементов данной коллекции.
Returns: Возвращает массив, содержащий копии всех элементов данной коллекции.
Тип Vector3d[].