Teigha.GraphicsInterface.ExposureType
Перечисление ExposureType определяет поддерживаемые типы экспозиции при отрисовке изображения.
Перечисление ExposureType определяет поддерживаемые типы экспозиции при отрисовке изображения.