Teigha.GraphicsInterface.LightingQuality
Перечисление LightingQuality определяет методы расчёта эффектов освещения для граней.
Перечисление LightingQuality определяет методы расчёта эффектов освещения для граней.