Teigha.DatabaseServices.DimAssoc
Класс DimAssoc используется для создания ассоциативных размеров, которые обеспечивают ассоциативную связь объекта размера с соответствующей геометрией чертежа.
Класс DimAssoc используется для создания ассоциативных размеров, которые обеспечивают ассоциативную связь объекта размера с соответствующей геометрией чертежа.

Teigha.DatabaseServices.DimAssoc.#ctor
Конструктор по умолчанию класса DimAssoc.
Конструктор по умолчанию класса DimAssoc.
Создает размер с параллельным выравниванием.

Teigha.DatabaseServices.DimAssoc.AddToDimensionReactor(System.Boolean)
Метод добавляет или удаляет реактор между размером и объектом DimAssoc.
Метод позволяет добавить или удалить реактор между размером и объектом DimAssoc.
Выбор между этими действиями определяет входной логический аргумент isAdd.
isAdd: Флаг, который определяет, следует ли добавить или удалить реактор. Тип bool. Если передается значение false, реактор удаляется.

Teigha.DatabaseServices.DimAssoc.Copied(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.DBObject)
Метод уведомления, который вызывается в случае создания копии указанного объекта.
Метод уведомления, который вызывается в случае создания копии объекта, представленного указателем pObj.
pObj: Указатель на копируемый объект базы данных. Тип DBObject.
pNewObj: Указатель на вновь созданную копию объекта pObj в базе данных. Тип DBObject.

Teigha.DatabaseServices.DimAssoc.Erased(Teigha.DatabaseServices.DBObject)
Метод уведомления, который вызывается в случае удаления указанного объекта в базе данных.
Метод уведомления, который вызывается в случае удаления в базе данных объекта, представленного указателем pObj.
pObj: Указатель на удаляемый объект в базе данных.  Тип DBObject.

Teigha.DatabaseServices.DimAssoc.Erased(Teigha.DatabaseServices.DBObject,System.Boolean)
Метод уведомления, который вызывается в случае удаления или восстановления указанного объекта в базе данных.
Метод уведомления, который вызывается в случае удаления или восстановления указанного объекта в базе данных.
Вид операции определяется входным флагом erasing.
pObj: Указатель на объект, который должен быть стёрт или восстановлен. Тип DBObject.
erasing: Флаг, определяющий тип операции с объектом pObj - удаление (значение true) или восстановление (значение false). Тип bool.

Teigha.DatabaseServices.DimAssoc.GetDimAssocGeomIds(Teigha.DatabaseServices.ObjectIdCollection)
Метод предоставляет список всех связанных с данным объектом геометрических объектов во всех опорных точках.
Метод предоставляет список всех связанных с данным объектом DimAssoc геометрических объектов во всех его опорных точках.
geomIds: Список идентификаторов всех связанных геометрических объектов во всех опорных точках. Тип ObjectIdCollection.

Teigha.DatabaseServices.DimAssoc.ModifiedGraphics(Teigha.DatabaseServices.DBObject)
Метод уведомления, который вызывается при открытии на изменение объекта, производного от Entity.
Метод уведомления, который вызывается, когда объект, производный от Entity, открывается на изменение, и один из его методов вызывает DbObject.AssertWriteEnabled() или Entity.RecordGraphicsModified(), а затем объект закрывается с помощью метода DbObject.Close().
pObj: Входной указатель на изменяемый объект. Тип DBObject.

Teigha.DatabaseServices.DimAssoc.OpenedForModify(Teigha.DatabaseServices.DBObject)
Метод уведомления, который вызывается, когда объект, представленный указателем pObject, открывается на изменение, и какой-либо из его методов вызывает метод AssertWriteEnabled().
Метод уведомления, который вызывается, когда объект, представленный указателем pObject, открывается на изменение, и какой-либо из его методов вызывает метод AssertWriteEnabled().
pObject: Указатель на объект, который открывается на изменение. Тип DBObject.

Teigha.DatabaseServices.DimAssoc.PointRef(Teigha.DatabaseServices.DimAssocPointType)
Метод предоставляет указатель на опорную точку заданного типа.
Метод предоставляет указатель на опорную точку с заданным индексом типа.
pointIndex: Входной индекс типа опорной точки. Значение из перечисления DimAssocPointType.
Returns: Возвращает объект OsnapPointRef для опорной точки указанного типа.

Teigha.DatabaseServices.DimAssoc.Post(DatabaseServices.ObjectId,DatabaseServices.ObjectId)
Метод публикует данный объект DimAssoc в базе данных и устанавливает реактор между ним и соответствующим размером.
Метод публикует данный объект DimAssoc в базе данных и устанавливает реактор между ним и соответствующим размером.
dimId: Входной идентификатор объекта размера, который будет связан с данным объектом DimAssoc. Тип DatabaseServices.ObjectId.
dimAssocId: Получаемый идентификатор объекта DimAssoc после его добавления в базу данных. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DimAssoc.Post(DatabaseServices.ObjectId,DatabaseServices.ObjectId,System.Boolean)
Метод публикует данный объект DimAssoc в базе данных и устанавливает реактор между ним и соответствующим размером.
Опционально включается отслеживание изменений в опорной геометрии.
Метод публикует данный объект DimAssoc в базе данных и устанавливает реактор между ним и соответствующим размером.
Опционально включается отслеживание изменений в опорной геометрии.
dimId: Входной идентификатор объекта размера, который будет связан с данным объектом DimAssoc. Тип DatabaseServices.ObjectId.
dimAssocId: Получаемый идентификатор объекта DimAssoc после его добавления в базу данных. Тип DatabaseServices.ObjectId.
isActive: Флаг, указывающий, следует ли включить отслеживание изменений в связанной опорной геометрии. Тип bool.

Teigha.DatabaseServices.DimAssoc.RemoveAssociativity(System.Boolean)
Метод позволяет удалить все связи между размером, объектом DimAssoc и всеми опорными точками, включая опцию сделать это принудительно.
Метод позволяет удалить все связи между размером, объектом DimAssoc и всеми опорными точками, включая опцию сделать это принудительно.
force: Входной флаг, определяющий, следует ли принудительно удалять ассоциативность.  Тип bool.

Teigha.DatabaseServices.DimAssoc.RemovePointRef(System.Boolean)
Метод удаляет (возможно, принудительно), указатель на опорную точку, которая связывает размер с соответствующей геометрией.
Метод удаляет (возможно, принудительно), указатель на опорную точку, которая связывает размер с соответствующей геометрией.
force: Входной флаг, определяющий, следует ли принудительно удалять точки привязки.  Тип bool.

Teigha.DatabaseServices.DimAssoc.SetPointRef(Teigha.DatabaseServices.DimAssocPointType,Teigha.DatabaseServices.OsnapPointRef)
Метод позволяет задать опорную точку заданного типа, используя предоставленный указатель на точку привязки OsnapPointRef.
Метод позволяет задать опорную точку заданного типа, используя предоставленный указатель на точку привязки OsnapPointRef.
pointIndex: Входной индекс типа опорной точки. Значение из перечисления DimAssocPointType.
pOsnapPointRef: Объект точки привязки. Тип OsnapPointRef.

Teigha.DatabaseServices.DimAssoc.UpdateDimension(System.Boolean)
Метод позволяет обновить размер, связанный с данным объектом, либо разорвать ассоциативную связь с ним.
Метод позволяет обновить размер, связанный с данным объектом, либо разорвать ассоциативную связь с ним.
update: Входной флаг, который определяет, следует ли обновить размер (значение true) или разорвать ассоциативную связь с ним (значение false). Тип bool.

Teigha.DatabaseServices.DimAssoc.UpdateDimension(System.Boolean,System.Boolean)
Метод позволяет обновить размер, связанный с данным объектом, или разорвать ассоциативную связь с ним.
Опционально можно настроить удаление или сохранение реакторов.
Метод позволяет обновить размер, связанный с данным объектом, или разорвать ассоциативную связь с ним.
Опционально можно настроить удаление или сохранение реакторов.
update: Входной флаг, который определяет, следует ли обновить размер (значение true), или  удалить ассоциативную связь с ним (значение false). Тип bool.
skipReactors: Входной флаг, который определяет, следует ли пропускать реакторы. Тип bool.

Teigha.DatabaseServices.DimAssoc.AssocFlag
Свойство AssocFlag возвращает индекс используемой опорной точки как комбинацию значений из перечисления AssocFlags.
Свойство AssocFlag возвращает индекс (тип) используемой опорной точки  как комбинацию значений из перечисления AssocFlags.
Returns: Возвращает индекс используемой привязки. Комбинация значений из перечисления AssocFlags.

Teigha.DatabaseServices.DimAssoc.DimObjId
Свойство DimObjId предоставляет доступ к ObjectId размера, управляемого данным объектом.
Свойство DimObjId предоставляет доступ к ObjectId размера, управляемого данным объектом.
Returns: Возвращает идентификатор объекта ассоциативного размера.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DimAssoc.RotatedType
Свойство RotatedType определяет тип выравнивания для данного ассоциативного размера.
Свойство RotatedType определяет тип выравнивания для данного ассоциативного размера (параллельный, перпендикулярный).
Returns: Возвращает тип выравнивания связанного ассоциативного размера.
Значение из перечисления RotatedDimType.

Teigha.DatabaseServices.DimAssoc.TransSpatial
Свойство TransSpatial позволяет определить, распространяется ли ассоциативность данного объекта на все пространства (код DXF 70).
Свойство TransSpatial позволяет определить, распространяется ли ассоциативность данного объекта на все пространства (код DXF 70).
Returns: Возвращает true, если ассоциативность данного объекта распространяется на все пространства.
В противном случае возвращает false.