HostMgd.PlottingServices.PlotConfig
Класс PlotConfig представляет описание установленного в системе устройства или РС3 файла.
Не реализован.
Класс PlotConfig представляет описание установленного в системе устройства или РС3 файла.
Класс предоставляет методы и свойства для описания размеров листа и полей.
Экземпляр этого класса возвращается свойством PlotConfig класса.
В текущей версии не реализован.

HostMgd.PlottingServices.PlotConfig.GetLocalMediaName(System.String)
Метод предоставляет локализованное имя листа, которое соответствует указанному каноническому имени листа.
Не реализован.
Метод предоставляет локализованное имя листа, которое соответствует указанному каноническому имени листа.
В текущей версии не реализован.
canonicalMediaName: Входное каноническое имя листа. Тип System.String.
Returns: Возвращает локализованное имя листа.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.GetMediaBounds(System.String)
Метод предоставляет границы листа (размер страницы и печатные границы) для заданного канонического имени носителя.
Не реализован.
Метод предоставляет границы листа (размер страницы и печатные границы) для заданного канонического имени носителя.
В текущей версии не реализован.
canonicalMediaName: Входное каноническое имя листа. Тип System.String.
Returns: Возвращает границы для листа canonicalMediaName.
Тип HostMgd.PlottingServices.MediaBounds.

HostMgd.PlottingServices.PlotConfig.SaveToPC3(System.String)
Метод сохраняет текущую конфигурацию плоттера в указанный файл PC3.
Не реализован.
Метод сохраняет текущую конфигурацию плоттера в указанный файл PC3.
В текущей версии не реализован.
Notes
Этот метод сохраняет файл PC3, но не загружает его в память.
Любая операция, выполняемая над объектом PlotConfig, будет применяться к старой конфигурации.
name: Входное имя файла PC3. Тип System.String.

HostMgd.PlottingServices.PlotConfig.CanonicalMediaNames
Свойство CanonicalMediaNames возвращает список размеров листа, которые поддерживает текущее устройство.
Не реализовано.
Свойство CanonicalMediaNames возвращает список размеров листа, которые поддерживает текущее устройство.
В текущей версии не реализовано.
Returns: Возвращает список поддерживаемых размеров листов.
Тип System.Collections.Specialized.StringCollection.

HostMgd.PlottingServices.PlotConfig.Comment
Свойство Comment возвращает комментарий к текущему устройству.
Не реализовано.
Свойство Comment возвращает комментарий, сохраненный для текущего устройства.
В текущей версии не реализовано.
Returns: Возвращает комментарий для текущего устройства.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.DefaultFileExtension
Свойство DefaultFileExtension представляет установленное по умолчанию расширение имени для файла печати, который создается текущим устройством. Не реализовано.
Свойство возвращает установленное по умолчанию расширение имени для файла печати, который создается текущим устройством (например, ".DWF").
В текущей версии не реализовано.
Notes
Точка в первом знаке присутствует в обязательном порядке.
Returns: Возвращает расширение имени для файла печати по умолчанию (с точкой в первом знаке).
Тип System.String.

HostMgd.PlottingServices.PlotConfig.DeviceName
Свойство DeviceName возвращает имя устройства вывода.
Не реализовано.
Свойство DeviceName возвращает имя текущего устройства вывода или имя PC3-файла.
В текущей версии не реализовано.
Notes
Это свойство всегда возвращает короткое имя PC3-файла.
Чтобы получить полный путь к PC3-файлу, используйте свойство FullPath.
Returns: Возвращает имя устройства вывода.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.DeviceType
Свойство DeviceType возвращает тип текущего выходного устройства.
Не реализовано.
Свойство DeviceType возвращает тип текущего выходного устройства.
См. перечисление HostMgd.PlottingServices.DeviceType.
В текущей версии не реализовано.
Returns: Возвращает тип выходного устройства.
Тип int.

HostMgd.PlottingServices.PlotConfig.DriverName
Свойство DriverName возвращает имя драйвера устройства вывода.
Не реализовано.
Свойство DriverName возвращает имя драйвера устройства вывода.
В текущей версии не реализовано.
Returns: Возвращает имя драйвера устройства.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.FullPath
Свойство FullPath возвращает полный путь доступа к устройству.
Не реализовано.
Свойство FullPath возвращает полный путь доступа к устройству.
В случае файла PC3 свойство возвращает полный путь к файлу, а для системных принтеров - полный UNC путь.
В текущей версии не реализовано.
Returns: Возвращает полное имя текущего устройства или файла PC3.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.IsPlotToFile
Свойство IsPlotToFile позволяет проверить, сконфигурировано ли устройство для печати в файл.
Не реализовано.
Свойство IsPlotToFile позволяет проверить, сконфигурировано ли устройство для печати в файл.
В текущей версии не реализовано.
Returns: Возвращает true, если устройство в данный момент настроено на печать в файл.
В противном случае возвращает false.

HostMgd.PlottingServices.PlotConfig.LocationName
Свойство LocationName возвращает локализованное имя листа для текущего канонического имени листа.
Не реализовано.
Свойство LocationName возвращает локализованное имя листа для текущего канонического имени листа.
В текущей версии не реализовано.
Returns: Возвращает локализованное имя листа.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.MaximumDeviceDotsPerInch
Свойство MaximumDeviceDotsPerInch возвращает максимальное разрешение устройства (в точках на дюйм).
Не реализовано.
Свойство MaximumDeviceDotsPerInch возвращает максимальное разрешение устройства (в точках на дюйм).
В текущей версии не реализовано.
Returns: Возвращает максимальное разрешение устройства (в точках на дюйм).
Тип int.

HostMgd.PlottingServices.PlotConfig.PlotToFileCapability
Свойство PlotToFileCapability позволяет проверить возможность печати в файл на данном устройстве.
Не реализовано.
Свойство PlotToFileCapability позволяет проверить возможность печати в файл на данном устройстве.
Возможные варианты определены в перечислении PlotToFileCapability (только в файл / возможна / не предусмотрена).
В текущей версии не реализовано.
Returns: Возвращает значение из перечисления HostMgd.PlottingServices.PlotToFileCapability, которое отражает возможность печати в файл на данном устройстве.

HostMgd.PlottingServices.PlotConfig.PortName
Свойство PortName возвращает имя порта устройства.
Не реализовано.
Свойство PortName возвращает имя порта устройства.
В текущей версии не реализовано.
Returns: Возвращает имя порта устройства.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.ServerName
Свойство ServerName представляет имя сервера устройства.
Не реализовано.
Свойство ServerName представляет имя сервера устройства.
В текущей версии не реализовано.
Returns: Возвращает имя сервера.
Тип System.String.

HostMgd.PlottingServices.PlotConfig.TagLine
Свойство TagLine представляет тег устройства.
Не реализовано.
Свойство TagLine представляет тег устройства.
В текущей версии не реализовано.
Returns: Возвращает тег устройства.
Тип System.String.