Teigha.Geometry.KnotCollection.GetDistinctKnots
Метод позволяет получить последовательность уникальных узлов в данной коллекции.
Метод позволяет получить последовательность уникальных (несовпадающих) узлов в данной коллекции.
Returns: Возвращает коллекцию уникальных узлов.
Тип DoubleCollection.