Teigha.DatabaseServices.DwgFiler.ReadDouble
Метод предназначен для получения значения типа double из текущего элемента данного объекта Filer.
Метод предназначен для получения значения типа double из текущего элемента данного объекта Filer.
Returns: Возвращает значения типа double из текущего элемента данного объекта Filer.