HostMgd.PlottingServices.MatchingPolicy.MatchEnabledCustom
Значение: 3.
Сопоставление носителей включено.
Если носитель соответствующего размера не найден, создается пользовательский размер с последующим сохранением на диске.