Teigha.GraphicsInterface.FontDescriptor.ToString
Метод формирует эквивалентное строковое представление данного объекта.
Метод формирует эквивалентное строковое представление данного объекта.
Результирующая строка содержит описание дескриптора шрифта в следующем порядке:
1. Флаг полужирного шрифта,
2. Набор символов,
3. Флаг курсивного шрифта,
4. Пропорции и семейство,
5. Наименование гарнитуры шрифта.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.