Teigha.DatabaseServices.ViewportTableRecord
Класс предназначен для хранения определения видового экрана в
таблице видовых экранов пространства модели ViewportTable.
Класс предназначен для хранения определения видового экрана в
таблице видовых экранов ViewportTable. Определение видового
экрана представляет из себя набор его настроек. В
пространстве модели может быть несколько видовых экранов
одновременно. Видовые экраны пространства модели всегда
квадратные или прямоугольные и заполняют собой всё
пространство модели. Каждый видовой экран пространства модели
может иметь свои настройки отображения модели: система
координат, направление взгляда, стиль отображения и пр.
Управление настройками видового экрана возможно как через
API, так и через пользовательский интерфейс. Все настройки,
доступные через пользовательский интерфейс, также доступны и
через API.
Example
В качестве примера приведена команда ADDHORIZONTALVP_MS,
которая делит активный видовой экран пространства модели на
два горизонтальных.
C#

Teigha.DatabaseServices.ViewportTableRecord.#ctor
Конструктор класса
Конструктор класса.

Teigha.DatabaseServices.ViewportTableRecord.#ctor(IntPtr,System.Boolean)
Конструктор класса
Конструктор класса.

Teigha.DatabaseServices.ViewportTableRecord.GetPreviousBackground(GraphicsInterface.DrawableType)
Метод не реализован.

Teigha.DatabaseServices.ViewportTableRecord.SetPreviousBackground(DatabaseServices.ObjectId,GraphicsInterface.DrawableType)
Метод не реализован.

Teigha.DatabaseServices.ViewportTableRecord.GridAdaptive
Свойство предназначено для включения/выключения
автоматического масштабирования сетки.
Свойство предназначено для управления автоматическим
масштабированием сетки. Если автоматическое масштабирование
отключено, то на экране будет отображаться сетка со всеми
линиями. Если автоматическое масштабирование сетки включено,
то слишком мелкие ячейки не будут отображаться на экране и
появятся только при приближении.
В интерфейсе свойство настраивается через диалоговое окно
«Режимы черчения» для каждого видового экрана отдельно. Окно
«Режимы черчения» можно открыть либо командой DDRMODES,
DDSETTINGS, либо через меню Сервис -gt; Режимы черчения…
Returns: Возвращает тип данных bool:
* true – автоматическое масштабирование сетки включено;
* false – автоматическое масштабирование сетки выключено.

Teigha.DatabaseServices.ViewportTableRecord.GridBoundToLimits
Свойство предназначено для управления отображением сетки за
пределами установленных границ чертежа в пространстве модели.
Свойство позволяет включать/отключать отображение сетки за
пределами установленных границ чертежа в пространстве модели.
В интерфейсе свойство настраивается через диалоговое окно
«Режимы черчения» для каждого видового экрана отдельно. Окно
«Режимы черчения» можно открыть либо командой DDRMODES,
DDSETTINGS, либо через меню Сервис -gt; Режимы черчения…
Returns: Возвращает тип данных bool:
* true – отображение сетки только внутри границ чертежа
включено;
* false – отображение сетки только внутри границ чертежа
выключено.

Teigha.DatabaseServices.ViewportTableRecord.GridEnabled
Свойство предназначено для включения/отключения отображения
сетки в пространстве модели.
Свойство позволяет включать/отключать отображение сетки в
пространстве модели.
В интерфейсе свойство настраивается через диалоговое окно
«Режимы черчения» для каждого видового экрана отдельно. Окно
«Режимы черчения» можно открыть либо командой DDRMODES,
DDSETTINGS, либо через меню Сервис -gt; Режимы черчения…
Returns: Возвращает тип данных bool:
* true – отображение сетки включено;
* false – отображение сетки выключено.

Teigha.DatabaseServices.ViewportTableRecord.GridFollow
Свойство предназначено для управления следованием сетки за
динамической системой координат.
С помощью свойства можно отключить или включить следование
сетки за динамической системой координат. В интерфейсе
свойство настраивается через диалоговое окно «Режимы
черчения» для каждого видового экрана отдельно. Окно «Режимы
черчения» можно открыть либо командой DDRMODES, DDSETTINGS,
либо через меню Сервис -gt; Режимы черчения…
Returns: Возвращает тип данных bool:
* true – следование сетки ПСК включено;
* false – следование сетки ПСК отключено.

Teigha.DatabaseServices.ViewportTableRecord.GridIncrements
Свойство предназначено для настройки размера ячейки сетки.
С помощью свойства можно изменять размер ячейки сетки. В
интерфейсе свойство настраивается через диалоговое окно
«Режимы черчения» для каждого видового экрана отдельно. Окно
«Режимы черчения» можно открыть либо командой DDRMODES,
DDSETTINGS, либо через меню Сервис -gt; Режимы черчения…
Returns: Возвращает тип данных Point2d.

Teigha.DatabaseServices.ViewportTableRecord.GridMajor
Свойство предназначено для настройки количества ячеек внутри
основной ячейки.
С помощью свойства можно изменять количество маленьких ячеек
сетки, входящих в более крупную ячейку. Размер маленьких
ячеек определяется свойством GridIncrements. Свойство
возвращает количество линий, определяющих маленькие ячейки,
которое расположено внутри более крупной ячейки. Количество
линий по горизонтали и вертикали одинаковое. В интерфейсе
свойство настраивается через диалоговое окно «Режимы
черчения» для каждого видового экрана отдельно. Окно «Режимы
черчения» можно открыть либо командой DDRMODES, DDSETTINGS,
либо через меню Сервис -gt; Режимы черчения…
Returns: Возвращает тип данных short.

Teigha.DatabaseServices.ViewportTableRecord.GridSubdivisionRestricted
Свойство предназначено для настройки разбиения ячеек на более
мелкие, чем настроено в свойстве GridIncrements.
C помощью свойства можно настраивать разбиение сетки на более
мелкие ячейки, чем настроено в GridIncrements. Если
GridSubdivisionRestricted=true, разбиение ячеек будет
происходить при условии, что GridAdaptive=true. Кода
GridAdaptive=false, значение GridSubdivisionRestricted
игнорируется. В интерфейсе свойство настраивается через
диалоговое окно «Режимы черчения» для каждого видового экрана
отдельно. Окно «Режимы черчения» можно открыть либо командой
DDRMODES, DDSETTINGS, либо через меню Сервис -gt; Режимы
черчения…
Returns: Возвращает тип данных bool:
* true – дробление сетки меньше шага включено при условии,
что свойство GridAdaptive = true;
* false – дробление сетки меньше шага выключено.

Teigha.DatabaseServices.ViewportTableRecord.IconAtOrigin
Свойство предназначено для управления расположением значка
системы координат в пространстве модели.
Свойство предназначено для управления положением значка
системы координат в пространстве модели. Значок системы
координат может быть привязан к левому нижнему углу окна,
либо при панорамировании и зумировании передвигаться вместе с
точкой привязки. Через интерфейс значением свойства можно
управлять либо системной переменной UCSICON, либо с помощью
команды UCSICON.
Returns: Возвращает тип данных bool:
* true – значок системы координат всегда отображается в
нижнем левом углу видового экрана;
* false – значок системы координат привязан к точке начала
координат в пространстве
модели и перемещается вместе с этой точкой при
панорамировании и зумировании чертежа.

Teigha.DatabaseServices.ViewportTableRecord.IconEnabled
Свойство предназначено для изменения видимости значка системы
координат в пространстве модели.
Свойство предназначено для изменения видимости значка системы
координат в пространстве модели. Через интерфейс значение
свойства можно изменить либо с помощью системной переменной
UCSICON, либо с помощью команды UCSICON.
Returns: Возвращает тип данных bool:
* true – значок системы координат отображается;
* false – значок системы координат не отображается.

Teigha.DatabaseServices.ViewportTableRecord.UpperRightCorner
Свойство предназначено для хранения координат правой верхней
точки видового экрана пространства модели.
Свойство предназначено для хранения координат правой верхней
точки видового экрана пространства модели. По умолчанию,
пространство модели имеет один видовой экран, правый верхний
угол которого имеет значение этого свойства (1,1). Если
разбить пространство модели на несколько видовых экранов по
горизонтали, то координаты этой точки у каждого из видовых
экранов будут отличаться координатой Y.
Свойство в основном используется при программном разбиении
пространства модели на несколько видовых экранов.
Returns: Возвращает тип данных .

Teigha.DatabaseServices.ViewportTableRecord.LowerLeftCorner
Свойство предназначено для хранения координат левой нижней
точки видового экрана пространства модели.
Свойство предназначено для хранения координат левой нижней
точки видового экрана пространства модели. По умолчанию,
пространство модели имеет один видовой экран, левый нижний
угол которого имеет значение этого свойства (0,0). Если
разбить пространство модели на несколько видовых экранов по
горизонтали, то координаты этой точки у каждого из видовых
экранов будут отличаться координатой Y.
Свойство в основном используется при программном разбиении
пространства модели на несколько видовых экранов.
Returns: Возвращает тип данных .

Teigha.DatabaseServices.ViewportTableRecord.IsometricSnapEnabled
Свойство предназначено для включения/отключения режима
изометрической привязки.
Свойство предназначено для включения/отключения режима
изометрической шаговой привязки. При включении режима
изометрической шаговой привязки активируется режим
изометрического черчения и курсор начинает перемещаться по
углам изометрической сетки. В интерфейсе свойство
настраивается через диалоговое окно «Режимы черчения» для
каждого видового экрана отдельно. Окно «Режимы черчения»
можно открыть либо командой DDRMODES, DDSETTINGS, либо через
меню Сервис -gt; Режимы черчения…
Также свойство можно настроить с помощью системной переменной
SNAPSTYL.
Returns: Возвращает тип данных bool:
* true – ортогональная шаговая привязка;
* false – изометрическая шаговая привязка.

Teigha.DatabaseServices.ViewportTableRecord.SnapAngle
Свойство предназначено для управления углом поворота сетки и
шаговой привязки для текущего видового экрана относительно текущей ПСК.
Свойство предназначено для управления углом поворота сетки и шаговой привязки
для текущего видового экрана относительно текущей ПСК.
Угол привязки изменяется в пределах плоскости XY с осью вращения по оси Z
против часовой стрелки, если смотреть вниз по оси Z в начало координат.
Угол измеряется в радианах.
Returns: Возвращает тип данных double.

Teigha.DatabaseServices.ViewportTableRecord.SnapBase
Свойство предназначено для управления положением начальной
точки сетки и привязки для текущего видового экрана и текущей
ПСК.
Свойство предназначено для управления положением начальной
точки сетки и привязки для текущего видового экрана и текущей
ПСК.
Returns: Возвращает тип данных .

Teigha.DatabaseServices.ViewportTableRecord.SnapEnabled
Свойство предназначено для управления режимом привязки.
С помощью свойства можно включать/выключать режим привязки.
Returns: Возвращает тип данных bool:
* true – режим привязки включен;
* false – режим привязки выключен.

Teigha.DatabaseServices.ViewportTableRecord.SnapIncrements
Свойство предназначено для настройки шага привязки.
Свойство предназначено для настройки шага привязки по осям X
и Y. Значение X означает интервал сетки привязки по оси X,
значение Y – интервал сетки привязки по оси Y. Значения сетки
привязки соответствуют единицам измерения чертежа.
Returns: Возвращает тип данных .

Teigha.DatabaseServices.ViewportTableRecord.SnapPair
Свойство предназначено для изменения плоскости черчения
в изометрическом режиме.
С помощью свойства можно переключать плоскость черчения
видового экрана в изометрическом режиме. Значение свойства
совпадает со значением системной переменной SNAPISOPAIR
для данного видового экрана.
Returns: Возвращает тип данных short (Int16):
* 0 – слева (по умолчанию);
* 1 – сверху;
* 2 – слева.

Teigha.DatabaseServices.ViewportTableRecord.UcsSavedWithViewport
Свойство предназначено для управления взаимосвязью ПСК
текущего видового экрана с ПСК остальных видовых экранов
пространства модели.
Свойство предназначено для управления значением системной
переменной UCSVP видового экрана. Если эта функция возвращает
значение true, то ucs, сохраненный с этим видовым экраном,
станет активным всякий раз, когда видовой экран становится
активным.
Returns: Возвращает тип данных bool:
* true – ПСК, сохраненная с этим видовым экраном,
становится активной во всех видовых экранах пространства
модели каждый раз, когда этот видовой экран становится
активным;
* false – ПСК, сохраненная в этом видовом экране, активна
только в нём.

Teigha.DatabaseServices.ViewportTableRecord.UcsFollowMode
Свойство предназначено для управления видом при переключении
между ПСК в видовом экране пространства модели.
С помощью свойства можно включать/выключать сохранение вида,
установленного в видовом экране пространства модели при
переключении между различными ПСК. Значение свойства также
управляется с помощью системной переменной UCSFOLLOW,
значение которой может быть различным для каждого видового
экрана пространства модели.
Returns: Возвращает тип данных bool:
* true – режим следования включен: при переключении между
различными ПСК в видовом экране будет отображаться
сохраненный вид;
* false – режим следования отключен: при переключении между
различными ПСК вид будет меняться.

Teigha.DatabaseServices.ViewportTableRecord.FastZoomsEnabled
Устаревшее свойство, всегда возвращает true.
Returns: Возвращает тип данных bool.

Teigha.DatabaseServices.ViewportTableRecord.CircleSides
Свойство предназначено для управления коэффициентом
сглаживания кривых.
С помощью свойства можно управлять коэффициентом сглаживания
кривых. Значение по умолчанию 1000. Диапазон возможных
значений – от 0 до 20000.
Returns: Возвращает тип данных short.