Teigha.GraphicsInterface.JitterAmount
Перечисление JitterAmount определяет набор значений джиттера для получения эффекта дрожания рёбер.
Перечисление JitterAmount определяет набор значений джиттера для получения эффекта дрожания рёбер.
Notes
Джиттер используется модификатором режима отображения рёбер при создании эффекта карандашного наброска от руки.
Легкая неровность (дрожание) ребра порождается отрисовкой дополнительных линий вблизи, но с определенным отклонением от исходной линии.