HostMgd.EditorInput.PromptPointOptions
Класс предоставляет параметры для настройки интерактивного ввода точки в nanoCAD,
такие как сообщение, базовая точка и режимы привязки.
Класс наследуется от PromptCornerOptions и используется для настройки параметров,
передаваемых в методы ввода точки, такие как GetPoint() или GetCorner().
Он позволяет задать:
* текст приглашения , отображаемый пользователю,
* базовую точку , относительно которой будет происходить ввод,
* режимы привязки и отображения (например, штриховая линия),
* допустимость пропуска ввода с помощью клавиши Enter .
Эти параметры дают разработчикам надстроек возможность гибко управлять поведением команды ввода точки,
улучшая пользовательский интерфейс и взаимодействие с чертежом.
Example
C#

HostMgd.EditorInput.PromptPointOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением приглашения для ввода точки.
Конструктор создаёт объект класса PromptPointOptions и устанавливает текст приглашения,
отображаемый пользователю в командной строке при интерактивном вводе точки —
например, через метод GetPoint() или GetCorner(). Сообщение может содержать инструкции
или подсказки для пользователя, например: "Укажите точку вставки:".
После создания объекта можно дополнительно настроить такие параметры, как:
* базовая точка (BasePoint),
* режимы привязки (UseBasePoint, UseDashedLine),
* допустимость пропуска ввода (AllowNone).
message: Текст приглашения, выводимый в командной строке перед вводом точки.

HostMgd.EditorInput.PromptPointOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением,
локальными ключевыми словами и глобальными ключевыми словами.
Конструктор создаёт объект PromptPointOptions, который используется для настройки
интерактивного ввода точки с поддержкой ключевых слов.
Он позволяет задать:
* сообщение приглашения , в которое можно включить локальные ключевые слова в формате [Ключ1/Ключ2/Ключ3] (например, "Укажите точку [по сетке/по объекту]:"),
* глобальные ключевые слова , которые доступны в любой момент ввода и не зависят от контекста.
Этот конструктор особенно полезен при реализации команд, где пользователь может выбрать
между несколькими режимами ввода точки или прервать операцию, используя заранее заданные команды.
messageAndKeywords: Сообщение приглашения, которое может содержать встроенные локальные ключевые слова в квадратных скобках.
Пример: "Укажите точку [по центру/по краю]
globalKeywords: Строка, содержащая глобальные ключевые слова, которые доступны на протяжении всей команды.
Пример: "Center Left Right"

HostMgd.EditorInput.PromptPointOptions.UseBasePoint
Свойство определяет, будет ли использоваться базовая точка при интерактивном вводе новой точки в nanoCAD.
Свойство используется для указания, следует ли учитывать базовую точку (BasePoint)
при вводе новой точки. Если свойство установлено в true, вводимая пользователем точка
отсчитывается относительно базовой, и может отображаться штриховая линия между ними,
если включено UseDashedLine. Если false — пользователь вводит точку независимо от базовой.
Это свойство особенно полезно при построении направлений,
привязке к предыдущей точке или при работе с геометрическими построениями,
где требуется визуальная или числовая привязка к начальной позиции.
Returns: Возвращает значение типа bool:
* true — базовая точка используется при вводе новой точки.
* false — базовая точка не учитывается.
Example
C#