Teigha.DatabaseServices.ObjectContext
Абстрактный базовый класс ObjectContext предназначен для представления контекста, который может влиять на свойства и поведение пользовательских объектов.
Абстрактный базовый класс ObjectContext предназначен для представления контекста, который может влиять на свойства и поведение пользовательских объектов.
Производные от него классы используются для представления конкретных типов контекста. В качестве примера можно привести контекст масштаба аннотации, который определяет доступные параметры и поведение этого объекта чертежа.

Teigha.DatabaseServices.ObjectContext.CollectionName
Свойство представляет имя коллекции контекстов, которой принадлежит данный контекст.
Свойство представляет имя коллекции контекстов, которой принадлежит данный контекст.
Этот метод позволяет клиенту идентифицировать тип контекста через имя коллекции, чтобы выяснить, разрешено ли использование конкретного контекста в экземпляре коллекции.
Returns: Возвращает имя коллекции контекстов. Тип String.

Teigha.DatabaseServices.ObjectContext.Name
Свойство представляет имя данного контекста.
Свойство представляет имя данного контекста.
Имя контекста объекта может появляться в доступных пользователю компонентах пользовательского интерфейса  и может изменяться, если контекст поддерживает переименование.
По этой причине приложениям не следует использовать ссылки на контексты по именам контекстов.
Для этого рекомендуется свойство UniqueIdentifier, предоставляющее гарантированно уникальный и неизменный идентификатор контекста.
Returns: Возвращает имя контекста. Тип String.

Teigha.DatabaseServices.ObjectContext.UniqueIdentifier
Свойство представляет уникальный и неизменный идентификатор контекста.
Свойство представляет уникальный и неизменный идентификатор контекста.
Используется для ссылки на объект контекста. Применять для этой цели имя контекста небезопасно, поскольку это имя может быть изменено.
Данный идентификатор является неизменным в течение всего жизненного цикла контекста и уникальным в пределах коллекции контекстов ObjectContextCollection.  Если конкретный экземпляр ObjectContext в настоящее время не находится в коллекции, уникальность  возвращаемого идентификатора не гарантируется.
Returns: Возвращает идентификатор контекста. Тип IntPtr.