HostMgd.EditorInput.PromptNestedEntityOptionsEventHandler
Делегат предназначен для обработки события, возникающего перед началом выбора
вложенного геометрического объекта, и позволяет настроить параметры операции.
Делегат используется как сигнатура метода-обработчика для события PromptingForNestedEntity,
которое генерируется перед началом интерактивного выбора объекта, находящегося внутри блока
или внешней ссылки. Он позволяет разработчику изменить параметры команды выбора до её запуска
— такие как сообщение приглашения, режимы выбора и другие настройки.
Этот делегат применяется при работе с методом GetNestedEntity(), когда требуется получить доступ
к элементам, вложенным в составные объекты чертежа. Он обеспечивает гибкость при реализации команд
редактирования, анализа или преобразования объектов внутри блоков.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий параметры операции выбора.