Teigha.DatabaseServices.GradientColor.get_Value
Метод предоставляет интерполированное значение данного цвета в градиенте.
Метод предоставляет интерполированное значение данного цвета в градиенте.
Returns: Возвращает интерполированное значение данного цвета. Тип float.