Teigha.DatabaseServices.RevolveOptionsBuilder.ToRevolveOptions
Метод формирует объект RevolveOptions, используя сформированные в данном объекте параметры операции вращения.
Метод формирует объект RevolveOptions на базе сформированных в данном объекте параметров операции вращения.
RevolveOptions используются для управления формой поверхностей или тел вращения.
Returns: Возвращает настройки операции вращения. Тип RevolveOptions.