Teigha.GraphicsInterface.AttributesFlags.DrawableIsCompoundObject
Значение: 4.
Отображаемый объект является составным и должен рассматриваться как блок.
Флаг действителен только в сочетании с флагом DrawableIsAnEntity.
Если выставлен, должен быть переопределён метод Entity.GetCompoundObjectTransform().