HostMgd.ApplicationServices.InplaceTextEditorSettings.EntityType.MultiAttribute
Значение: 2. Исходным объектом является многострочный атрибут.
Текущий объект MTEXT  является копией содержимого многострочного атрибута.