Teigha.DatabaseServices.DataCellCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для коллекции. Тип Collections.IEnumerator.