Teigha.DatabaseServices.ResultBuffer
Этот класс реализует объект буфера результатов, который представляет собой структуру для хранения и передачи размеченных данных всех основных типов между разнообразными объектами с использованием различных технологий.
Этот класс реализует объект буфера результатов, который представляет собой структуру для хранения и передачи размеченных данных всех основных типов между разнообразными объектами с использованием различных технологий.

Teigha.DatabaseServices.ResultBuffer.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.ResultBuffer.#ctor(... array)
Конструктор. Создает буфер с заданным массивом типизированных значений.
Конструктор. Создает буфер с заданным массивом типизированных значений.
values: Массив типизированных значений TypedValue[].

Teigha.DatabaseServices.ResultBuffer.Add(Object)
Добавляет значение в конец списка этого буфера результатов.
Добавляет значение в конец списка этого буфера результатов.
value: Добавляемый объект, тип Object.

Teigha.DatabaseServices.ResultBuffer.Add(Teigha.DatabaseServices.TypedValue)
Добавляет значение в конец списка этого буфера результатов.
Добавляет значение в конец списка этого буфера результатов.
value: Добавляемый объект, тип TypedValue.

Teigha.DatabaseServices.ResultBuffer.Create(IntPtr,System.Boolean)
Этот метод создает управляемый объект ResultBuffer на основе объекта, переданного неуправляемым указателем buffer.
Этот метод создает управляемый объект ResultBuffer на основе объекта, переданного неуправляемым указателем buffer.
buffer: Указатель типа IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает экземпляр ResultBuffer.

Teigha.DatabaseServices.ResultBuffer.Equals(Object)
Метод предназначен для сравнения на идентичность с объектом obj, который передан в аргументе.
Возвращает значение true, если объекты идентичны.
Метод предназначен для сравнения на идентичность с объектом obj, который передан в аргументе.
Возвращает значение true, если объекты идентичны.
obj: Объект, с которым выполняется сравнение.  Тип Object.
Returns: Возвращает true в случае, если оба объекта идентичны, и false в противном случае.

Teigha.DatabaseServices.ResultBuffer.ToString(IFormatProvider)
Метод предназначен для получения эквивалентного строкового представления этого объекта с использованием языковых и региональных настроек, определяемых заданным провайдером.
Метод предназначен для получения эквивалентного строкового представления этого объекта с использованием языковых и региональных настроек, определяемых заданным провайдером.
Подробнее см. в документации Microsoft .NET API.
provider: Провайдер языковых и региональных настроек, тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление этого объекта, тип String.

Teigha.DatabaseServices.ResultBuffer.ToString(String,IFormatProvider)
Метод предназначен для получения эквивалентного строкового представления этого объекта в указанном формате и с использованием языковых и региональных настроек, определяемых заданным провайдером.
Метод предназначен для получения эквивалентного строкового представления этого объекта в указанном формате и с использованием языковых и региональных настроек, определяемых заданным провайдером.
Подробнее см. в документации Microsoft .NET API.
format: Формат строкового представления этого объекта, тип String.
provider: Провайдер языковых и региональных настроек, тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление этого объекта, тип String.

Teigha.DatabaseServices.ResultBuffer.==(Teigha.DatabaseServices.ResultBuffer,Teigha.DatabaseServices.ResultBuffer)
Оператор выполняет сравнение операндов на равенство.
Оператор выполняет сравнение операндов на равенство.  Возвращает true, если a равно b, и false в противном случае.
a: Левый операнд, тип ResultBuffer.
b: Правый операнд, тип ResultBuffer.
Returns: Возвращает true, если a равно b, иначе - false.

Teigha.DatabaseServices.ResultBuffer.!=(Teigha.DatabaseServices.ResultBuffer,Teigha.DatabaseServices.ResultBuffer)
Оператор выполняет сравнение операндов на неравенство.
Оператор выполняет сравнение операндов на равенство.  Возвращает true, если a не равно b, и false в противном случае.
a: Левый операнд, тип ResultBuffer.
b: Правый операнд, тип ResultBuffer.
Returns: Возвращает true, если a не равно b, и false в противном случае.