Teigha.Colors.TransparencyCollection.Clear
Метод очищает коллекцию, удаляя из нее все элементы.
Метод очищает коллекцию, удаляя из нее все элементы.
После завершения метода свойство Count коллекции возвращает значение 0.