Teigha.GraphicsInterface.AttenuationType
Данное перечисление определяет тип затухания излучения источника света.
Относится только к точечным источникам и прожекторам.
Данное перечисление определяет тип затухания излучения источника света.
Относится только к точечным источникам и прожекторам.
Затуханием для удаленных источников света пренебрегаем (считаем, что затухания нет).