Teigha.DatabaseServices.LoftOptionsBuilder
Этот вспомогательный класс используется для формирования настроек для операции вытягивания поверхности по сечениям (лофт).
Этот вспомогательный класс используется для наполнения объекта DatabaseServices.LoftOptions параметрами на основе значений системных переменных, относящихся к формообразующей операции вытягивания поверхности по сечениям (лофт).

Teigha.DatabaseServices.LoftOptionsBuilder.#ctor
Конструктор по умолчанию класса LoftOptionsBuilder.
Конструктор по умолчанию класса LoftOptionsBuilder.

Teigha.DatabaseServices.LoftOptionsBuilder.#ctor(Teigha.DatabaseServices.LoftOptions)
Конструктор класса LoftOptionsBuilder.
Создает новый экземпляр класса LoftOptionsBuilder на основе существующего объекта LoftOptions.
Конструктор класса LoftOptionsBuilder.
Создает новый экземпляр класса LoftOptionsBuilder на основе существующего объекта LoftOptions.
value: Входной объект типа LoftOptions.

Teigha.DatabaseServices.LoftOptionsBuilder.SetOptionsFromSysvars(Teigha.DatabaseServices.Database)
Метод предназначен для задания параметров лофта в соответствии со значениями системных переменных в указанной базе данных.
Метод предназначен для задания параметров лофта в соответствии со значениями системных переменных в указанной базе данных.
pDb: База данных, которая служит источником значений параметров. Тип Database.

Teigha.DatabaseServices.LoftOptionsBuilder.AlignDirection
Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации нормалей заданных поперечных сечений.
Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации заданных поперечных сечений. Они должны быть ориентированы так, чтобы вектор нормали каждого сечения указывал на следующее сечение. Нарушение этого правила может приводить к нежелательным искривлениям или самопересечениям получаемой поверхности.
Returns: Возвращает true в случае корректной взаимной ориентации поперечных сечений.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsBuilder.ArcLengthParam
Свойство позволяет проверить, применяется ли параметризация по длине дуги.
Свойство позволяет проверить, применяется ли параметризация по длине дуги.
Returns: Возвращает true, если параметризация применяется.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsBuilder.Closed
Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
Если для этого флага установлено значение true, созданная лофтом поверхность начинается и заканчивается в первом поперечном сечении (таким образом, получается замкнутой). В этом случае поперечных сечений должно быть задано не менее трех.
Если все контуры поперечных сечений являются замкнутыми кривыми, результирующая поверхность имеет топологию тора.
Если для этого флага установлено значение false, получаемая поверхность начинается и заканчивается плоскими поверхностями, образованными первым и последним сечениями.
Returns: Возвращает true, если результирующая поверхность является замкнутой.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftEnd
Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение).
Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение).
Значение по умолчанию — 0, которое означает, что конкретное значение угла не задано, и система автоматически вычислит оптимальный угол для последнего поперечного сечения.
Returns: Возвращает угол сопряжения поверхности с последним поперечным сечением (в радианах). Тип double.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftEndMag
Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
Параметр управляет модулем вектора касательной к поверхности в последнем поперечном сечении.
Значение по умолчанию — 0, т.е. на последнем поперечном сечении автоматически рассчитывается оптимальная величина.
Returns: Возвращает величину вытягивания. Тип double.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftStart
Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения).
Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения).
Значение по умолчанию — 0, что означает, что конкретное значение угла не задано, и система автоматически вычислит оптимальный угол для первого поперечного сечения.
Returns: Возвращает угол сопряжения поверхности с первым поперечным сечением (в радианах). Тип double.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftStartMag
Свойство возвращает величину вытягивания для поверхности у первого поперечного сечения (start draft magnitude).
Свойство возвращает величину вытягивания для поверхности у первого поперечного сечения (start draft magnitude).
Она управляет модулем вектора касательной к поверхности в первом поперечном сечении.
Значение по умолчанию — 0, т.е. система автоматически вычислит оптимальную величину для первого поперечного сечения.
Returns: Возвращает величину вытягивания поверхности из первого поперечного сечения. Тип double.

Teigha.DatabaseServices.LoftOptionsBuilder.NormalOption
Свойство возвращает настройку для нормали к плоскости в данном объекте из перечисления LoftOptionsNormalOption.
Свойство возвращает настройку для нормали к плоскости в данном объекте из перечисления LoftOptionsNormalOption.
Значение по умолчанию — NoNormal.
Returns: Возвращает значение из перечисления LoftOptionsNormalOption.

Teigha.DatabaseServices.LoftOptionsBuilder.NoTwist
Свойство возвращает значение опции noTwist (нет кручения).
Свойство возвращает значение опции noTwist (нет кручения).
Эту опцию можно использовать для минимизации скручивания поверхности, когда все поперечные сечения являются замкнутыми.
Значение по умолчанию — true. В этом случае начальная точка каждого замкнутого сечения выравнивается по другим сечениям для минимизации скручивания всей поверхности.
Returns: Возвращает true, если установлена опция "нет кручения".
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsBuilder.Ruled
Свойство возвращает состояние флага ruled (кусочно-линейная поверхность).
Свойство возвращает состояние флага ruled (кусочно-линейная поверхность).
Если флаг установлен в значение true, то между каждой парой поперечных сечений создается кусочно-линейная поверхность, что порождает более грубую угловатую форму.
Если флаг установлен в значение false, создается общая гладкая поверхность.
Значение по умолчанию false.
Returns: Возвращает true, если строится кусочно-линейная поверхность.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsBuilder.Simplify
Свойство возвращает состояние флага simplify (упрощение), который определяет возможность использования простых типов поверхностей вместо общего там, где это возможно.
Свойство возвращает состояние флага simplify (упрощение).
Если для флага simplify установлено значение true, простые типы поверхностей (плоскость, цилиндр, конус, сфера и тор) создаются всякий раз, когда поперечные сечения допускают такую возможность.
Если для флага simplify установлено значение false, создается общий тип поверхности.
Значение по умолчанию - true.
Returns: Возвращает true, если предписывается использовать простые типы поверхностей.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftOptionsBuilder.VirtualGuide
Свойство позволяет определить, используется ли при создании лофт-поверхностей опция virtual guide (виртуальная направляющая).
Свойство позволяет определить, используется ли при создании лофт-поверхностей опция virtual guide (виртуальная направляющая).
Returns: Возвращает true, если опция virtual guide используется.
В противном случае возвращает false.