Teigha.GraphicsInterface.GIRasterImageDesc
Класс GIRasterImageDesc представляет фиктивную реализацию интерфейса GIRasterImage.
Класс GIRasterImageDesc представляет фиктивную реализацию интерфейса GIRasterImage.

Teigha.GraphicsInterface.GIRasterImageDesc.#ctor(UInt32,UInt32)
Конструктор класса GIRasterImageDesc.
Создает растровое изображение с указанными размерами.
Конструктор класса GIRasterImageDesc.
Создает растровое изображение с указанными шириной и высотой.
pixelWidth: Ширина изображения в пикселях. Тип UInt32.
pixelHeight: Высота изображения в пикселях. Тип UInt32.

Teigha.GraphicsInterface.GIRasterImageDesc.#ctor(UInt32,UInt32,Teigha.GraphicsInterface.Units)
Конструктор класса GIRasterImageDesc.
Создает растровое изображение с заданными размерами в указанных единицах измерения.
Конструктор класса GIRasterImageDesc.
Создает растровое изображение с заданными размерами в указанных единицах измерения.
pixelWidth: Ширина изображения в пикселях. Тип UInt32.
pixelHeight: Высота изображения в пикселях. Тип UInt32.
units: Единица измерения размеров изображения в расчете на один пиксель. Тип Units.

Teigha.GraphicsInterface.GIRasterImageDesc.#ctor(UInt32,UInt32,Teigha.GraphicsInterface.Units,System.Double,System.Double)
Конструктор класса GIRasterImageDesc.
Создает растровое изображение с указанными размерами, единицами измерения, а также количеством пикселей на единицу измерения в каждом из направлений x и y.
Конструктор класса GIRasterImageDesc.
Создает растровое изображение с указанными размерами, единицами измерения, а также количеством пикселей на единицу измерения в каждом из направлений x и y.
pixelWidth: Ширина изображения в пикселях. Тип UInt32.
pixelHeight: Высота изображения в пикселях. Тип UInt32.
units: Единица измерения для размеров изображения. Тип Units.
xPelsPerUnit: Количество пикселей на единицу измерения в направлении x. Тип double.
yPelsPerUnit: Количество пикселей на единицу измерения в направлении y. Тип double.

Teigha.GraphicsInterface.GIRasterImageDesc.SetColorDepth(unsigned int)
Метод позволяет переопределить глубину цветности для данного растрового изображения.
Метод позволяет переопределить глубину цветности для данного растрового изображения как количество бит на пиксель, используемых для представления цвета в каждой точке.
colorDepth: Количество бит на пиксель, используемых для представления цвета в каждой точке изображения. Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImageDesc.SetImageSource(Teigha.GraphicsInterface.RasterImageSource)
Метод позволяет переопределить источник данного растрового изображения.
Метод позволяет переопределить источник данного растрового изображения (файл изображения, документ DWG, подложка PDF и т.п.).
source: Новый источник растрового изображения. Значение из перечисления RasterImageSource.

Teigha.GraphicsInterface.GIRasterImageDesc.SetPalette(unsigned int,array)
Метод позволяет переопределить цветовую палитру данного растрового изображения.
Метод позволяет переопределить цветовую палитру в формате BMP для данного растрового изображения.
paletteSize: Размер палитры в байтах. Тип unsigned int.
paletteData: Данные палитры. Тип unsigned char[].

Teigha.GraphicsInterface.GIRasterImageDesc.SetPixelHeight(unsigned int)
Метод позволяет переопределить высоту данного растрового изображения в пикселях.
Метод позволяет переопределить высоту данного растрового изображения в пикселях.
pixelHeight: Новая высота изображения (в пикселях). Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImageDesc.SetPixelWidth(unsigned int)
Метод позволяет переопределить ширину данного растрового изображения в пикселях.
Метод позволяет переопределить ширину в пикселях данного растрового изображения.
pixelWidth: Новая ширина изображения (в пикселях).  Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImageDesc.SetScanLinesAlignment(unsigned int)
Метод позволяет переопределить выравнивание строк развертки для данного растрового изображения (в байтах).
Метод позволяет переопределить выравнивание строк развертки для данного растрового изображения (в байтах).
Notes
В случае Windows BMP выравнивание равно 4 байтам.
alignment: Выравнивание строк развертки для данного растрового изображения (в байтах).  Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImageDesc.SetTransparencyMode(Teigha.GraphicsInterface.TransparencyMode)
Метод позволяет переопределить режим прозрачности для данного растрового изображения.
Метод позволяет переопределить режим прозрачности для данного растрового изображения.
mode: Новый режим прозрачности. Значение из перечисления TransparencyMode.