Teigha.DatabaseServices.ImageOrg
Перечисление ImageOrg определяет схему организации пикселей в исходном файле изображения.
Перечисление ImageOrg определяет схему организации пикселей в исходном файле изображения.