Teigha.DatabaseServices.ScaleEstimationMethod.ScaleEstMethodPrismoidal
Значение: 4.
Этот алгоритм корректирует искажение масштаба сетки, оценивая искажение масштаба сетки в каждой точке локальной системы координат.
Важно: использование этого алгоритма подразумевает, что проекционное отображение, на котором основана указанная сетка, является конформным.