Teigha.DatabaseServices.DBObjectReferenceCollection
Класс DBObjectReferenceCollection представляет коллекцию объектов DBObjectReference.
Класс DBObjectReferenceCollection представляет коллекцию ссылок DBObjectReference на объекты базы данных.

Teigha.DatabaseServices.DBObjectReferenceCollection.Add(Teigha.DatabaseServices.DBObjectReference)
Метод добавляет в коллекцию объектную ссылку DBObjectReference.
Метод добавляет в коллекцию объектную ссылку DBObjectReference.
value: Входная объектная ссылка. Тип DBObjectReference.
Returns: Возвращает индекс вновь созданного элемента коллекции.
Тип int.

Teigha.DatabaseServices.DBObjectReferenceCollection.Contains(Teigha.DatabaseServices.DBObjectReference)
Метод позволяет проверить, содержится ли в данной коллекции элемент, соответствующий указанной объектной ссылке DBObjectReference.
Метод позволяет проверить, содержится ли в данной коллекции элемент, соответствующий указанной объектной ссылке DBObjectReference.
value: Входная объектная ссылка. Тип DBObjectReference.
Returns: Возвращает true, если в коллекции содержится элемент, соответствующий объектной ссылке value.
В противном случае возвращает false.

Teigha.DatabaseServices.DBObjectReferenceCollection.CopyTo(array,System.Int32)
Метод копирует все элементы коллекции в указанный массив по указанному индексу.
Метод копирует все элементы данной коллекции в указанный массив, начиная с позиции в массиве с указанным индексом.
array: Целевой массив, в который копируются элементы коллекции. Тип DBObjectReference[].
index: Индекс позиции в массиве array, начиная с которой в массив последовательно копируются все элементы данной коллекции. Тип int.

Teigha.DatabaseServices.DBObjectReferenceCollection.IndexOf(Teigha.DatabaseServices.DBObjectReference)
Метод позволяет выяснить индекс элемента коллекции, который соответствует указанной объектной ссылке.
Метод позволяет выяснить индекс элемента коллекции, который соответствует указанной объектной ссылке value.
value: Входная объектная ссылка. Тип DBObjectReference.
Returns: Возвращает индекс найденного элемента коллекции. Тип int.
В случае отсутствия искомого элемента метод возвращает значение -1.

Teigha.DatabaseServices.DBObjectReferenceCollection.Insert(System.Int32,Teigha.DatabaseServices.DBObjectReference)
Метод вставляет в коллекцию указанную объектную ссылку в позицию с заданным индексом.
Метод вставляет в коллекцию указанную объектную ссылку в позицию с заданным индексом.
Notes
Если переданный в метод индекс оказывается недействительным, выбрасывается исключение ArgumentOutOfRangeException.
index: Входное значение индекса места вставки. Тип int.
value: Вставляемая в коллекцию объектная ссылка. Тип DBObjectReference.

Teigha.DatabaseServices.DBObjectReferenceCollection.Remove(Teigha.DatabaseServices.DBObjectReference)
Метод удаляет из коллекции элемент, соответствующий указанной объектной ссылке.
Метод удаляет из коллекции элемент, соответствующий указанной объектной ссылке value.
value: Входная объектная ссылка, которая определяет удаляемый из коллекции элемент. Тип DBObjectReference.

Teigha.DatabaseServices.DBObjectReferenceCollection.Item
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Notes
В случае недействительного значения iIndex выбрасывается исключение ArgumentOutOfRangeException.
iIndex: Индекс искомого элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции с индексом iIndex.
Тип DBObjectReference.