Teigha.DatabaseServices.Spline.PurgeFitData
Метод предназначен для удаления из данного объекта данных аппроксимации, если сплайн построен методом определяющих точек.
Метод предназначен для удаления из данного объекта данных аппроксимации, если сплайн построен методом определяющих точек.
После удаления этих данных сплайн использует свои управляющие вершины или данные NURBS.