Teigha.DatabaseServices.RasterImage
Класс представляет объект "изображение" на чертеже.
Геометрический объект RasterImage (или "объект -
изображение"), работает вместе с объектом RasterImageDef (или
"объектом - определением изображения") для использования
растровых изображений внутри nanoCAD. Отношение между двумя
этими классами наиболее похоже на отношение между
определением блока nanoCAD и геометрическим объектом,
вставленным в блок.
Объект - изображение представляет собой рисуемый и выбираемый
геометрический объект nanoCAD, который представляет растровое
изображение в пространстве модели или листа в определенном
месте и с определенной ориентацией. Объект – изображение
связывается точно с одним определением изображения объекта,
в который он посылает
запросы на операции обработки изображений, требуемые при
отражении и черчении объектов. Поскольку определение
изображения управляет всей графической информацией, объект -
изображение относительно небольшой. Помимо расположения и
ориентации изображения, он содержит границы, градиент,
контраст, яркость и другие типовые свойства
геометрического объекта, такие как слой и цвет.
Два или более геометрических объектов могут быть связаны с
одним определением объекта-изображения. Т.к. каждый
объект-изображение имеет свои собственные границы, это
эффективный способ отображать различные части одного
растрового изображения в разных точках чертежа.
Геометрический объект RasterImage должен иногда выполнять
преобразования между двумя координатными системами —
трехмерными координатами модели, в которой функционируют
геометрические объекты и координаты на плоскости, которые
понимает объект RasterImageDef. Для этих целей,
объект-изображение содержит внутри себя прямоугольник границ
на плоскости, определенный в 3D мировых координатах, который
приблизительно ограничивает границы изображения, как они
размещены в пространстве. Некоторые функции nanoCAD API в
состоянии помочь преобразованию между координатами модели и
2D точек на плоскости.
Объект - определение изображения играет "закулисную" роль
определения блока, управляет связями с исходным изображением
и управляет операциями низкого уровня с изображением,
требуемыми для отображения и прорисовки изображения.
Объекты - определения изображения хранятся в специальном
словаре nanoCAD. Они не являются геометрическими объектами
nanoCAD, поэтому они не могут отображаться или выбираться
конечными пользователями. Они понимают только 2D координаты,
поэтому все запросы на обработку изображений отображаются как
2D операции.
Операции обработки изображений, так же как масштабирование
и поворот изображений при отображений, выполняются
специальной компонентой nanoCAD (Image Engine). Эта
компонента имеет свое собственное API , в котором могут быть
реализованы сложные приложения редактирования изображений.
Note
Геометрический объект RasterImage не может использоваться
самостоятельно. Он должен быть связан с объектом
RasterImageDef для отображения изображений с использованием
RasterImage.ImageDefId. Более того, RasterImageDefReactor
должен быть создан и связан с объектами RasterImageDef и
RasterImageDefReactor.

Teigha.DatabaseServices.RasterImage.#ctor
Конструктор данного класса объявлен как protected, поэтому он
не может быть непосредственно вызван из других приложений.

Teigha.DatabaseServices.RasterImage.AssociateRasterDef(Teigha.DatabaseServices.RasterImageDef)
Связывает определение растрового изображения с объектом.
definition: Определение растрового изображения

Teigha.DatabaseServices.RasterImage.EnableReactors(System.Boolean)
Устанавливает, должен или нет быть реактор доступен.
enable: Признак установки доступности (или ее отключения)

Teigha.DatabaseServices.RasterImage.ImageSize(System.Boolean)
Размер исходного изображения в точках (эта величина может
также быть получена прямо из объекта RasterImageDef).
При определенных редких условиях полученное значение может
отличаться от значения, которое находится в объекте
RasterImageDef (например, сразу после изменения размера в
операции редактирования растрового изображения, но перед тем,
как геометрический объект RasterImage будет изменен).
Если параметр bGetCachedValue равен false (это значение по
умолчанию), то размер изображения запрашивается у связанного
объекта RasterImageDef. Если этот объект не может быть
открыт, то используется значение, которое хранится в данном
объекте. Если bGetCachedValue равен true, то функция требует
вернуть значение из данного объекта.
getCachedValue: признак, указывающий, будет ли значение из

Teigha.DatabaseServices.RasterImage.SetClipBoundary(DatabaseServices.ClipBoundaryType,Teigha.Geometry.Point2dCollection)
Определяет многоугольные границы контура изображения. Контур
изображения должен быть замкнут, т.е. его последняя точка
должна совпадать с первой точкой. Значение type должно
соответствовать форме точек в массиве.
type: Тип контура изображения
clipBoundaryVertices: Коллекция вершин контура изображения

Teigha.DatabaseServices.RasterImage.SetClipBoundary(Teigha.Geometry.Vector2d)
Определяет многоугольный контур изображения. Контур
изображения должен быть замкнут, т.е. его последняя точка
должна совпадать с первой точкой. Значение type должно
соответствовать форме точек в массиве.
size: Вектор контура

Teigha.DatabaseServices.RasterImage.Transparency
Возвращает или устанавливает признак того, является ли
изображение прозрачным или нет.

Teigha.DatabaseServices.RasterImage.Brightness
Обеспечивает доступ к текущему значению яркости.

Teigha.DatabaseServices.RasterImage.ClipBoundaryType
Возвращает тип текущего контура изображения.

Teigha.DatabaseServices.RasterImage.Contrast
Обеспечивает доступ к текущему значению контраста.

Teigha.DatabaseServices.RasterImage.DisplayOptions
Обеспечивает доступ к текущему значению свойств отображения.

Teigha.DatabaseServices.RasterImage.Fade
Обеспечивает доступ к текущему значению постепенного
изменения отображения.

Teigha.DatabaseServices.RasterImage.Height
Обеспечивает доступ к высоте растрового изображения в
единицах измерения чертежа.

Teigha.DatabaseServices.RasterImage.ImageDefId
Обеспечивает доступ к Id изображения для определения
изображения геометрического объекта.

Teigha.DatabaseServices.RasterImage.ImageHeight
Обеспечивает доступ к высоте изображения.

Teigha.DatabaseServices.RasterImage.ImageTransparency
Обеспечивает доступ к признаку того, является ли изображение
прозрачным.

Teigha.DatabaseServices.RasterImage.ImageWidth
Обеспечивает доступ к ширине изображения.

Teigha.DatabaseServices.RasterImage.IsClipped
Возвращает признак того, что изображение является клипом.

Teigha.DatabaseServices.RasterImage.Name
Обеспечивает доступ к имени изображения.

Teigha.DatabaseServices.RasterImage.Orientation
Обеспечивает доступ к положению и ориентации изображения
геометрического объекта. Эти вектора располагаются вдоль
внешних ребер изображения. Если изображение является клипом,
то оно может быть меньше, чем прямоугольник, образованный
этими векторами.

Teigha.DatabaseServices.RasterImage.Path
Возвращает имя файла изображения.

Teigha.DatabaseServices.RasterImage.PixelToModelTransform
Возвращает аффинное преобразование точек исходного
изображения в координатные значения пространства модели.

Teigha.DatabaseServices.RasterImage.Position
Возвращает точку вставки.

Teigha.DatabaseServices.RasterImage.ReactorId
Обеспечивает доступ к Id реактора изображения геометрического
объекта.

Teigha.DatabaseServices.RasterImage.Rotation
Обеспечивает доступ к углу поворота в радианах.

Teigha.DatabaseServices.RasterImage.Scale
Возвращает эффективный масштаб по XY для изображения
геометрического объекта, вычисляемый как размер изображения в
пользовательских единицах (как он вставлен и масштабирован в
пространстве модели) деленный на исходный размер изображения
(полученный из разрешения изображения, заданного в файле).
Например, если изображение на листе бумаги — 8.5"*11", но
было вставлено в чертеж nanoCAD так, что его размеры были
8.50"*110", то масштаб равен 10.
Исключение.
Если нет информации о разрешении в файле, или пользователь не
определил, что значат единицы измерения nanoCAD (дюймы, метры
и т.д., как они определены в RasterVariables.UserScale), то
ширина изображения будет принята равной одной единице nanoCAD
для целей расчета масштаба.

Teigha.DatabaseServices.RasterImage.ShowImage
Возвращает доступ к признаку "показать" в параметрах
отображения.

Teigha.DatabaseServices.RasterImage.Width
Возвращает ширину растрового изображения.