HostMgd.PlottingServices.PreviewEndPlotInfo.DeleteUnmanagedObject
Метод удаляет неуправляемый объект.
Не реализован.
Метод предназначен для удаления неуправляемого объекта.
В текущей версии не реализован.