Teigha.Geometry.Torus
Класс Torus представляет тороидальные сегменты.
Класс Torus представляет тороидальные сегменты.
Поверхность тора формируется вращением дуги образующей окружности вокруг оси симметрии (оси вращения), лежащей в плоскости этой окружности.
Положение тора в пространстве определяется точкой его центра на оси симметрии тора.
Центр образующей окружности находится на расстоянии majorRadius от центра тора, располагаясь при вращении на направляющей окружности радиуса majorRadius.
Радиус образующей окружности равен minorRadius.
Notes
Параметр U играет роль долготы, определяя меридианы, которые располагаются в плоскостях, проходящих через ось вращения тора.
В случае замкнутого тора параметр U по умолчанию определен в диапазоне [-PI, PI).
Начало отсчета U задается вектором refAxis, ортогональным оси симметрии тора.
Положительное направление изменения параметра U определяется правилом правой руки при вращении вокруг оси симметрии тора.
Параметр V параметризует круглую трубу тора, играя роль широты, и для замкнутой образующей окружности по умолчанию определен в диапазоне [-PI, PI).  Положительное направление изменения параметра V определяется по правилу правой руки при вращении вокруг направления (axisOfSymmetry x refAxis).
В пространстве параметров U,V тор является периодическим с периодом 2*PI.
Параметрический прямоугольник [umin, umax] x [vmin, vmax] определяет четырехсторонний тороидальный участок, сторонами которого являются четыре круглых дуги.  В определении такого тороидального участка приняты следующие ограничения:
* umin  и |umin - umax| .
* vmin  и |vmin - vmax| .

Teigha.Geometry.Torus.#ctor
Конструктор по умолчанию класса Torus. Создает действительный тор по умолчанию.
Конструктор по умолчанию класса Torus.
Создает тор по умолчанию со следующими свойствами:
* minorRadius = 0.5.
* Начальный угол для параметра U = -PI.
* Конечный  угол для параметра U = PI.
* Начальный угол для параметра V = -PI.
* Конечный  угол для параметра V = PI.

Teigha.Geometry.Torus.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса Torus.
Создает экземпляр класса с указанными центром, осью симметрии и двумя радиусами.
Конструктор класса Torus.
Создает экземпляр класса с указанными центром, осью симметрии и двумя радиусами.
majorRadius: Большой радиус тора (радиус направляющей окружности тора).  Тип double.
minorRadius: Малый радиус тора (радиус образующей окружности тора).  Тип double.
origin: Точка центра тора (начало координат тора). Тип Point3d.
axisOfSymmetry: Ось симметрии тора (ось вращения тора). Тип Vector3d.

Teigha.Geometry.Torus.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса Torus.
Создает экземпляр класса с указанными параметрами.
Конструктор класса Torus.
Создает экземпляр класса с указанными параметрами.
Notes
Все углы задаются в радианах.
majorRadius: Большой радиус тора (радиус направляющей окружности тора).  Тип double.
minorRadius: Малый радиус тора (радиус образующей окружности тора).  Тип double.
origin: Точка центра тора (начало координат тора). Тип Point3d.
axisOfSymmetry: Ось симметрии тора (ось вращения тора). Тип Vector3d.
referenceAxis: Вектор, определяющий начало отсчета угла поворота образующей окружности тора.  Тип Vector3d.
startAngleU: Нижняя  граница интервала параметра U. Начальный угол относительно оси симметрии тора. Тип double.
endAngleU: Верхняя граница интервала параметра U. Конечный  угол относительно оси симметрии тора. Тип double.
startAngleV: Нижняя  граница интервала параметра V. Начальный угол относительно трубы тора. Тип double.
endAngleV: Верхняя граница интервала параметра V. Конечный угол относительно трубы тора. Тип double.

Teigha.Geometry.Torus.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Torus.

Teigha.Geometry.Torus.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точки пересечения данного тора с указанным линейным объектом с использованием точности по умолчанию.
Метод вычисляет точки пересечения данного тора с указанным линейным объектом.
Используется вызов метода Torus.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
Notes
Возвращаемый массив может состоять из четырех элементов. Индексы возвращаемого массива:
* 0 — Первая точка пересечения (если существует).
* 1 — Вторая точка пересечения (если существует).
* 2 — Третья точка пересечения (если существует).
* 3 — Четвертая точка пересечения (если существует).
linearEntity: Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
Returns: Возвращает массив точек пересечения данного тора с линейным объектом linearEntity.
Тип Point3d[]. Если метод не смог найти точки пересечения или точек пересечения не существует, этот метод возвращает null.

Teigha.Geometry.Torus.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данного тора с указанным линейным объектом в пределах указанной точности.
Метод вычисляет точки пересечения данного тора с указанным линейным объектом в пределах указанной точности.
linearEntity: Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
tolerance: Входная геометрическая точность.  Тип Tolerance.
Returns: Возвращает массив точек пересечения данного тора с линейным объектом linearEntity.
Тип Point3d[]. Если метод не смог найти точки пересечения или точек пересечения не существует, этот метод возвращает null.

Teigha.Geometry.Torus.Set(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить у данного объекта точку центра, ось симметрии и оба радиуса.
Метод позволяет переопределить у данного объекта точку центра, ось симметрии и оба радиуса.
majorRadius: Большой радиус тора (радиус направляющей окружности тора).  Тип double.
minorRadius: Малый радиус тора (радиус образующей окружности тора).  Тип double.
origin: Точка центра тора (начало координат тора). Тип Point3d.
axisOfSymmetry: Ось симметрии тора (ось вращения тора). Тип Vector3d.

Teigha.Geometry.Torus.Set(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Метод позволяет переопределить все параметры данного объекта указанными в аргументах значениями.
Метод позволяет переопределить все параметры данного объекта указанными в аргументах значениями.
Notes
Все углы задаются в радианах.
majorRadius: Большой радиус тора (радиус направляющей окружности тора).  Тип double.
minorRadius: Малый радиус тора (радиус образующей окружности тора).  Тип double.
origin: Точка центра тора (начало координат тора). Тип Point3d.
axisOfSymmetry: Ось симметрии тора (ось вращения тора). Тип Vector3d.
refAxis: Вектор, определяющий начало отсчета угла поворота образующей окружности тора.  Тип Vector3d.
startAngleU: Нижняя  граница интервала параметра U. Начальный угол относительно оси симметрии тора. Тип double.
endAngleU: Верхняя граница интервала параметра U. Конечный  угол относительно оси симметрии тора. Тип double.
startAngleV: Нижняя  граница интервала параметра V. Начальный угол относительно трубы тора. Тип double.
endAngleV: Верхняя граница интервала параметра V. Конечный  угол относительно трубы тора. Тип double.

Teigha.Geometry.Torus.SetAnglesInU(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы вращения относительно оси симметрии.
Метод позволяет переопределить начальный и конечный углы вращения относительно оси симметрии.
Notes
Для вариантов формы тора "Vortex", "Apple" и "Lemon" углы задаются как результат пересечения естественного интервала с переданным в метод.
startAngle: Начальная долгота U. Тип double.
endAngle: Конечная  долгота U. Тип double.

Teigha.Geometry.Torus.SetAnglesInV(System.Double,System.Double)
Метод позволяет переопределить начальную и конечную широту для данного тора.
Метод позволяет переопределить начальный и конечный углы дуги на образующей окружности (начальную и конечную широту) для данного тора.
startAngle: Начальная широта V. Тип double.
endAngle: Конечная  широта V. Тип double.

Teigha.Geometry.Torus.AxisOfSymmetry
Свойство AxisOfSymmetry представляет направление оси симметрии (оси вращения) тора.
Свойство AxisOfSymmetry представляет направление оси симметрии (оси вращения) тора.
Returns: Возвращает направление оси симметрии тора.
Тип Vector3d.

Teigha.Geometry.Torus.Center
Свойство Center представляет центр данного тора.
Свойство Center представляет центр данного тора.
Returns: Возвращает текущее положение центра тора.
Тип Point3d.

Teigha.Geometry.Torus.IsApple
Свойство IsApple позволяет проверить, имеет ли данный тор форму "яблока", когда большой радиус меньше малого радиуса, но больше нуля, что дает тело с углублением посередине.
Свойство IsApple позволяет проверить, имеет ли данный тор форму "яблока", когда большой радиус меньше малого радиуса, но больше нуля, что дает тело с углублением посередине.
Notes
Только одно из свойств IsLemon, IsApple, IsVortex и IsDoughnut всякого конкретного тора может возвращать значение true.
Returns: Возвращает true, если данный тор имеет форму "яблока" с углублением посередине.
В противном случае возвращает false.

Teigha.Geometry.Torus.IsDegenerate
Свойство IsDegenerate позволяет проверить, не является ли данный объект вырожденным.
Свойство IsDegenerate позволяет проверить, не является ли данный объект вырожденным.
Notes
Тор становится вырожденным, если малый радиус меньше или равен нулю, или если большой радиус меньше или равен отрицательному значению малого радиуса.
Returns: Возвращает true, если данный объект является вырожденным.
В противном случае возвращает false.

Teigha.Geometry.Torus.IsDoughnut
Свойство IsDoughnut позволяет проверить, имеет ли данный тор форму тора-бублика с отверстием посередине.
Свойство IsDoughnut позволяет проверить, имеет ли данный тор форму тора-бублика с отверстием посередине.
Тор приобретает форму "бублика", когда большой радиус становится больше малого радиуса.
Notes
Только одно из свойств IsLemon, IsApple, IsVortex и IsDoughnut всякого конкретного тора может возвращать значение true.
Returns: Возвращает true, если данный тор имеет форму "бублика" с отверстием посередине.
В противном случае возвращает false.

Teigha.Geometry.Torus.IsHollow
Свойство IsHollow позволяет проверить, что данный тор имеет форму с отверстием посередине.
Свойство IsHollow позволяет проверить, что данный тор имеет форму с отверстием посередине.
Такая форма означает, что большой радиус превышает малый радиус.
Returns: Возвращает true, если большой радиус тора превышает его малый радиус, что приводит к образованию отверстия посередине тора.
В противном случае возвращает false.

Teigha.Geometry.Torus.IsLemon
Свойство IsLemon позволяет проверить, что данный тор имеет форму "лимона".
Свойство IsLemon позволяет проверить, что данный тор имеет форму "лимона", когда большой радиус отрицателен, но по модулю не превышает малый радиус.
Returns: Возвращает true, если большой радиус тора отрицателен, но по модулю не превышает величину малого радиуса.
В противном случае возвращает false.

Teigha.Geometry.Torus.IsOuterNormal
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль поверхности замкнутого тора наружу.
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль поверхности замкнутого тора наружу.
Returns: Возвращает true, если нормаль поверхности замкнутого тора направлена наружу.
В противном случае возвращает false.

Teigha.Geometry.Torus.IsVortex
Свойство IsVortex позволяет проверить, равен ли большой радиус данного тора его малому радиусу.
Свойство IsVortex позволяет проверить, равен ли большой радиус данного тора его малому радиусу.
Returns: Возвращает true, если большой радиус данного тора равен его малому радиусу.
В противном случае возвращает false.

Teigha.Geometry.Torus.MajorRadius
Свойство MajorRadius возвращает значение большого радиуса данного тора.
Свойство MajorRadius возвращает значение большого радиуса данного тора.
Returns: Возвращает большой радиус данного тора.
Тип double.

Teigha.Geometry.Torus.MinorRadius
Свойство MinorRadius возвращает значение малого радиуса данного тора.
Свойство MinorRadius возвращает значение малого радиуса данного тора.
Returns: Возвращает малый радиус данного тора.
Тип double.

Teigha.Geometry.Torus.ReferenceAxis
Свойство ReferenceAxis возвращает направление на нулевой меридиан данного тора.
Свойство ReferenceAxis возвращает направление на нулевой меридиан данного тора.
Returns: Возвращает направление на нулевой меридиан данного тора.
Тип Vector3d.