Teigha.DatabaseServices.ObjectContextCollection
Класс ObjectContextCollection представляет интерфейс к определяемой приложением коллекции объектов ObjectContext.
Класс ObjectContextCollection представляет интерфейс к определяемой приложением коллекции объектов ObjectContext. Приложения реализуют этот интерфейс, чтобы определять пользовательские контексты для собственных контекстно-зависимых объектов.
Приложения должны создать экземпляр коллекции (обычно один экземпляр в каждой базе данных) и зарегистрировать его средствами ObjectContextManager в базе данных, в которой предполагается поддержка требуемого типа контекста.
Каждая коллекция контекстов имеет состояние. Оно представлено списком предусмотренных контекстов, "текущим" контекстом и возможностью блокировать или разблокировать экземпляры контекста.

Teigha.DatabaseServices.ObjectContextCollection.AddContext(Teigha.DatabaseServices.ObjectContext)
Метод добавляет в коллекцию копию указанного контекста.
Добавленный контекст получает новый уникальный идентификатор.
Метод добавляет в коллекцию копию указанного контекста.
Добавленный контекст получает новый уникальный идентификатор.
В общем случае этот идентификатор отличается от идентификатора исходного контекста.
ctx: Контекст, копия которого добавляется в коллекцию, получив новый уникальный идентификатор.

Teigha.DatabaseServices.ObjectContextCollection.GetContext(String)
Метод предназначен для получения копии именованного контекста из коллекции.
Метод предназначен для получения копии именованного контекста из коллекции.
contextName: Имя контекста. Тип String.
Returns: Возвращает копию именованного контекста. Тип ObjectContext.
Если контекст с указанным именем в коллекции отсутствует, возвращается nullptr.

Teigha.DatabaseServices.ObjectContextCollection.HasContext(String)
Метод позволяет проверить, существует ли в коллекции контекст с указанным именем.
Метод позволяет проверить, существует ли в коллекции контекст с указанным именем.
contextName: Имя контекста. Тип String.
Returns: Возвращает true, если контекст с именем contextName присутствует в коллекции.
В противном случае возвращает false.

Teigha.DatabaseServices.ObjectContextCollection.RemoveContext(String)
Метод предназначен для удаления контекста из коллекции.
Метод предназначен для удаления контекста из коллекции.
Активный контекст удалить нельзя.
Чтобы удалить из коллекции текущий контекст, следует сначала сделать текущим другой контекст, а только потом можно удалить требуемый контекст.
contextName: Имя удаляемого контекста. Тип String.

Teigha.DatabaseServices.ObjectContextCollection.CurrentContext
Свойство представляет текущий контекст в коллекции контекстов.
Свойство представляет текущий контекст в коллекции контекстов.
Returns: Возвращает текущий контекст. Тип ObjectContext.

Teigha.DatabaseServices.ObjectContextCollection.Name
Свойство представляет имя данной коллекции контекстов.
Свойство представляет имя данной коллекции контекстов.
Returns: Возвращает имя коллекции. Тип String.