Teigha.DatabaseServices.HatchLoop
Этот класс представляет данные для определения контура границы штриховки.
Этот класс представляет данные для определения контура границы штриховки.

Teigha.DatabaseServices.HatchLoop.#ctor(DatabaseServices.HatchLoopTypes)
Конструктор класса HatchLoop.
Конструктор класса HatchLoop.
loopType: Тип контура штриховки. Перечисление DatabaseServices.HatchLoopTypes.

Teigha.DatabaseServices.HatchLoop.Curves
Свойство возвращает коллекцию кривых, составляющих данный контур штриховки.
Свойство возвращает коллекцию кривых, составляющих данный контур штриховки.
Returns: Возвращает коллекцию кривых, составляющих данный контур штриховки. Тип Curve2dCollection.

Teigha.DatabaseServices.HatchLoop.IsPolyline
Свойство позволяет определить, имеет ли этот контур штриховки тип HatchLoopTypes.Polyline.
Свойство позволяет определить, имеет ли этот контур штриховки тип HatchLoopTypes.Polyline.
Returns: Возвращает true, если данный контур штриховки представлен полилинией и, соответственно, имеет тип HatchLoopTypes.Polyline. В противном случае возвращает false.

Teigha.DatabaseServices.HatchLoop.LoopType
Свойство возвращает тип этого контура штриховки.
Свойство возвращает тип этого контура штриховки.
Returns: Возвращает тип контура штриховки. Перечисление HatchLoopTypes.

Teigha.DatabaseServices.HatchLoop.Polyline
Свойство возвращает полилинию, которая образует данный контур штриховки.
Свойство возвращает полилинию, которая образует данный контур штриховки.
Returns: Возвращает полилинию в виде коллекции типа BulgeVertexCollection.