Teigha.DatabaseServices.DxfFiler.ReadAngle
Метод возвращает значение угла из текущего элемента этого объекта Filer.
Метод возвращает значение угла из текущего элемента этого объекта Filer.
Returns: Возвращает значение угла. Тип double.