Teigha.Geometry.CoordinateSystem3d
Структура CoordinateSystem3d представляет трехмерную систему координат, которая определяется точкой начала и направлениями осей X, Y и Z.
Структура CoordinateSystem3d представляет трехмерную систему координат, которая определяется точкой начала и направлениями осей X, Y и Z.

Teigha.Geometry.CoordinateSystem3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса CoordinateSystem3d. Создает экземпляр класса с указанными параметрами.
Конструктор класса CoordinateSystem3d. Создает экземпляр класса с указанными параметрами.
o: Точка начала системы координат.   Тип Point3d.
x: Направляющий вектор оси X. Тип Vector3d.
y: Направляющий вектор оси Y. Тип Vector3d.

Teigha.Geometry.CoordinateSystem3d.Equals(Object)
Метод предназначен для проверки равенства объектов.
Метод предназначен для проверки равенства объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() из этого класса, в то время как метод Equals() может быть переопределен в производном классе.
obj: Объект, с которым проверяется равенство.
Returns: Возвращает true, если переданная система координат obj не является нулевой и имеет те же начальную точку и направляющие векторы осей X, Y и Z.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem3d.IsEqualTo(Teigha.Geometry.CoordinateSystem3d)
Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d.
Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d.
Используется вызов метода CoordinateSystem3d.IsEqualTo(CoordinateSystem3d a, Tolerance tolerance) с точностью, равной Tolerance.Global.
a: Входная система координат, которая сравнивается с данной.
Returns: Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X, Y и Z.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem3d.IsEqualTo(Teigha.Geometry.CoordinateSystem3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d в пределах заданной точности.
Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система CoordinateSystem3d в пределах заданной точности.
a: Проверяемая система координат. Тип CoordinateSystem3d.
tolerance: Заданная точность вычислений.  Тип Tolerance.
Returns: Возвращает true, если переданная система координат a не является нулевой и имеет те же начальную точку и направляющие векторы осей X, Y и Z.  В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
Возвращаемая строка включает начало этой системы координат и направления её осей X, Y и Z
provider: Заданный провайдер региональных и языковых настроек.  Тип IFormatProvider.
Returns: Возвращает строковое представление данного объекта.  Тип String.

Teigha.Geometry.CoordinateSystem3d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.  Возвращаемая строка включает начало этой системы координат и направления её осей X, Y и Z
format: Предписанный формат строки. Тип String.
provider: Входной провайдер региональных и языковых настроек.  Тип IFormatProvider.
Returns: Возвращает строковое представление данного объекта.
Тип String.

Teigha.Geometry.CoordinateSystem3d.!=(Teigha.Geometry.CoordinateSystem3d,Teigha.Geometry.CoordinateSystem3d)
Оператор неравенства структуры CoordinateSystem3d.
Оператор неравенства структуры CoordinateSystem3d.
a: Левый  операнд. Тип CoordinateSystem3d.
b: Правый операнд. Тип CoordinateSystem3d.
Returns: Возвращает true, если не выполняется хотя бы одно из следующих условий:
1. совпадают начальные точки;
2. совпадают направляющие векторы осей X;
3. совпадают направляющие векторы осей Y;
4. совпадают направляющие векторы осей Z.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem3d.==(Teigha.Geometry.CoordinateSystem3d,Teigha.Geometry.CoordinateSystem3d)
Оператор равенства структуры CoordinateSystem3d.
Оператор равенства структуры CoordinateSystem3d.
a: Левый  операнд. Тип CoordinateSystem3d.
b: Правый операнд. Тип CoordinateSystem3d.
Returns: Возвращает true, если одновременно выполняются все перечисленные ниже условия:
1. совпадают начальные точки;
2. совпадают направляющие векторы осей X;
3. совпадают направляющие векторы осей Y;
4. совпадают направляющие векторы осей Z.
В противном случае возвращает false.

Teigha.Geometry.CoordinateSystem3d.Origin
Свойство Origin представляет точку начала данной системы координат.
Свойство Origin представляет точку начала данной системы координат.
Returns: Возвращает точку начала данной системы координат.
Тип Point3d.

Teigha.Geometry.CoordinateSystem3d.Xaxis
Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
Свойство Xaxis представляет направляющий вектор оси X данной системы координат.
Returns: Возвращает направляющий вектор оси X.
Тип Vector3d.

Teigha.Geometry.CoordinateSystem3d.Yaxis
Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
Свойство Yaxis представляет направляющий вектор оси Y данной системы координат.
Returns: Возвращает направляющий вектор оси Y данной системы координат.
Тип Vector3d.

Teigha.Geometry.CoordinateSystem3d.Zaxis
Свойство Zaxis представляет направляющий вектор оси Z данной системы координат.
Свойство Zaxis представляет направляющий вектор оси Z данной системы координат.
Returns: Возвращает направляющий вектор оси Z данной системы координат.
Тип Vector3d.