Teigha.DatabaseServices.LineJoinStyle
Перечисление LineJoinStyle определяет поддерживаемые стили соединения сегментов полилиний и иных составных объектов.
Перечисление LineJoinStyle определяет поддерживаемые стили соединения расположенных под углом сегментов полилиний и иных составных объектов.