Teigha.Colors.Transparency.ToString
Метод формирует строковое представление данного объекта.
Метод формирует строковое представление данного объекта.
Returns: Возвращает представление данного объекта в виде строки. Тип String.