HostMgd.EditorInput.PromptStringResultEventArgs
Класс предоставляет данные для события, возникающего после завершения
операции ввода строки или ключевого слова в редакторе nanoCAD.
Класс наследуется от EventArgs и используется в .NET API nanoCAD
для передачи информации о результате ввода строки пользователем.
Он применяется совместно с событиями, такими как PromptedForKeyword
и PromptedForString, и предоставляет доступ к:
* введённой строке (Value),
* статусу операции (Status — OK, Cancel, Error и др.),
* исходному вводу (StringResult, если пользователь ввёл значение вручную),
* параметрам приглашения (Options, если были заданы).
Этот класс играет важную роль при обработке текстового ввода в плагинах и надстройках,
позволяя реагировать на выбор пользователя из списка ключевых слов или ручной ввод строки.
Example
C#

HostMgd.EditorInput.PromptStringResultEventArgs.Result
Свойство возвращает результат операции интерактивного ввода строки,
включая статус и значение, введённое пользователем.
Свойство предоставляет доступ к объекту типа PromptResult,
который содержит информацию о завершении операции ввода строки
или ключевого слова — например, после вызова метода GetString()
или обработки события PromptedForKeyword.
Оно позволяет получить:
* статус операции (PromptStatus.OK, PromptStatus.Cancel, PromptStatus.Error и др.),
* введённую строку через Value (если доступно),
* исходный текстовый ввод , если пользователь ввёл значение вручную.
Свойство доступно только для чтения и автоматически обновляется при завершении интерактивной команды ввода строки.
Returns: Возвращает экземпляр класса PromptResult, содержащий:
* Status — статус завершения операции ввода (OK, Cancel, Error и др.).
* StringResult — строковое значение, введённое пользователем.
* InputString — исходная строка, если она была изменена или введена с клавиатуры.
Если операция не завершена успешно, результат может содержать
пустую строку или сообщение об отмене/ошибке.
Example
C#