HostMgd.GraphicsSystem.Manager.GetGUIDevice
Метод позволяет получить устройство, связанное с окном графического интерфейса nanoCAD.
Метод позволяет получить объект устройства, связанного с окном графического интерфейса nanoCAD, в котором отображается чертеж.
Returns: Возвращает объект графического устройства.
Тип Teigha.GraphicsSystem.Device.