Teigha.DatabaseServices.RasterVariables
Класс RasterVariables представляет объекты RasterVariables в базе данных.
Класс RasterVariables представляет объекты RasterVariables в базе данных.
В каждом файле чертежа, содержащем объекты изображений, имеется единственный объект этого типа.
Он определяет все переменные чертежа, связанные с управлением и отображением растровых изображений.

Teigha.DatabaseServices.RasterVariables.#ctor
Конструктор по умолчанию класса RasterVariables.
Конструктор по умолчанию класса RasterVariables.

Teigha.DatabaseServices.RasterVariables.ImageFrame
Свойство ImageFrame представляет переменную, которая определяет тип отображения рамки изображения.
Свойство ImageFrame представляет переменную, которая определяет тип отображения рамки изображения.
Returns: Возвращает тип отображения рамки. Значение из перечисления FrameSetting.

Teigha.DatabaseServices.RasterVariables.ImageQuality
Свойство ImageQuality представляет качество отображения растрового изображения.
Свойство ImageQuality представляет текущую настройку качества отображения растрового изображения.
Это свойство позволяет управлять балансом (скорость отображения - качество отображаемого изображения).
В черновом режиме используются алгоритмы дискретизации и обработки, выигрывающие в скорости ценой снижения качества изображения.
В режиме высокого качества используются более ресурсоемкие алгоритмы, которые как правило генерируют более точные и визуально приемлемые результаты.
Returns: Возвращает настройку качества изображения. Значение из перечисления DatabaseServices.ImageQuality.

Teigha.DatabaseServices.RasterVariables.UserScale
Свойство UserScale представляет единицы измерения в реальном пространстве, соответствующие единицам чертежа.
Свойство UserScale представляет единицы измерения в реальном пространстве, соответствующие единицам чертежа.
Returns: Возвращает единицы измерения в реальном пространстве. Значение из перечисления Unit.