Teigha.DatabaseServices.DataLink.GetTargets
Метод позволяет получить коллекцию идентификаторов резидентных объектов базы данных, которые используют эту ссылку на данные.
Метод позволяет получить коллекцию идентификаторов резидентных объектов базы данных, которые используют эту ссылку на данные.
Returns: Возвращает коллекцию идентификаторов объектов. Тип ObjectIdCollection.