HostMgd.PlottingServices.PlotMessageIndex
Перечисление определяет текстовые элементы оформления диалогового окна, предназначенного для отображения хода выполнения задания на печать.
Перечисление PlotMessageIndex определяет текстовые элементы оформления диалогового окна, предназначенного для отображения хода выполнения задания на печать.