Teigha.DatabaseServices.RotationAngle
Перечисление RotationAngle определяет допустимые углы поворота текста в ячейках таблицы.
Перечисление RotationAngle определяет допустимые углы поворота текста в ячейках таблицы.