Teigha.GraphicsInterface.CommonDraw
Класс CommonDraw абстрагирует общность классов ViewportDraw и WorldDraw.
CommonDraw позволяет разрабатывать код графических процедур, который будет работать в обоих случаях.
Класс CommonDraw абстрагирует общность классов ViewportDraw и WorldDraw.
Это позволяет разрабатывать код графических процедур с использованием CommonDraw, который будет работать в обоих случаях.
Чтобы сохранить свои исходные сигнатуры, классы WorldDraw и ViewportDraw являются производными от класса CommonDraw.

Teigha.GraphicsInterface.CommonDraw.Deviation(Teigha.GraphicsInterface.DeviationType,Teigha.Geometry.Point3d)
Метод позволяет получить рекомендуемое максимальное отклонение для типа тесселяции, переданного в метод в аргументе deviationType.
Метод позволяет получить рекомендуемое максимальное отклонение для типа тесселяции, переданного в метод в аргументе deviationType.
deviationType: Входной тип тесселяции. Тип DeviationType.
pointOnCurve: Входная точка, определяющая кривую или поверхность для тесселяции.	Тип Point3d.
Returns: Возвращает максимальное отклонение при тесселяции.
Тип double.

Teigha.GraphicsInterface.CommonDraw.Context
Свойство возвращает управляющий контекст.  Указатель гарантированно не равен NULL.
Свойство возвращает управляющий контекст.  Указатель гарантированно не равен NULL.
Returns: Возвращает управляющий контекст. Тип GraphicsInterface.Context.

Teigha.GraphicsInterface.CommonDraw.IsDragging
Свойство позволяет выяснить, перетаскивается ли объект в данный момент.
Свойство позволяет выяснить, перетаскивается ли объект в данный момент.
Возвращает true, если объект в данный момент перетаскивается; в противном случае возвращает false.
В случае графически сложных объектов использование их упрощенного графического представления во время перетаскивания повышает производительность лишь с незначительной потерей функциональности или вовсе без нее.
Returns: Возвращает true, если объект в данный момент перетаскивается. В противном случае возвращает false.

Teigha.GraphicsInterface.CommonDraw.NumberOfIsolines
Свойство возвращает предлагаемое количество изолиний, которые будут использоваться для представления объекта.
Свойство возвращает предлагаемое количество изолиний, которые будут использоваться для представления объекта.
Изолинии — это простые линии или кривые, используемые для представления объекта при стандартном отображении.
Например, если в случае объекта в виде сферы NumberOfIsolines возвращает значение 3, то, возможно, сфера должна графически отображаться как три окружности в перпендикулярных плоскостях с центрами, совпадающими с центром сферы.  С увеличением количества изолиний представление сферы становится похожим на сетку параллелей и меридианов на глобусе.
Возвращаемое значение является лишь предполагаемой оценкой и предназначено только для удобства конечного пользователя. Оно соответствует значению системной переменной для изолиний.
Returns: Возвращает количество изолиний. Тип Int32.

Teigha.GraphicsInterface.CommonDraw.RawGeometry
Свойство возвращает текущий класс геометрии как Geometry.
Указатель гарантированно не равен NULL.
Свойство возвращает текущий класс геометрии как Geometry.
Указатель гарантированно не равен NULL.
Позволяет процедурам работать с геометрией как в контексте worldDraw, так и в контексте viewportDraw.
Returns: Возвращает текущий класс геометрии как класс Geometry.

Teigha.GraphicsInterface.CommonDraw.RegenAbort
Свойство предоставляет возможность узнать, запрашивает ли система немедленное прекращение регенерации графики.
Свойство предоставляет возможность узнать, запрашивает ли система немедленное прекращение регенерации графики.
Если возвращаемое значение равно false, то все в порядке.
Но если возвращаемое значение равно true, то следует незамедлительно прекратить обновление графики, выполнить очистку и осуществить возврат.
Returns: Возвращает состояние флага немедленного прекращения регенерации графики. Тип bool.
Если возвращаемое значение равно true, следует незамедлительно прекратить обновление графики, выполнить очистку и возврат.

Teigha.GraphicsInterface.CommonDraw.RegenType
Свойство возвращает текущий режим регенерации графики.
Свойство возвращает текущий режим регенерации графики.
Возможные состояния представлены перечислением GraphicsInterface.RegenType.
Returns: Возвращает текущий режим регенерации. Значение из перечисления GraphicsInterface.RegenType.

Teigha.GraphicsInterface.CommonDraw.SubEntityTraits
Свойство возвращает объект SubEntityTraits, который предоставляет доступ к значениями атрибутов текущей геометрии (цвет, слой, тип линий и т.п.).
Свойство возвращает объект SubEntityTraits.
Этот объект предоставляет разработчику доступ и управление к значениями атрибутов (цвет, слой, тип линий и т.п.) текущей геометрии.
Returns: Возвращает объект GraphicsInterface.SubEntityTraits.