Teigha.DatabaseServices.LayoutRenamedEventArgs
Этот класс представляет данные для событий переименования листа в диспетчере листов.
Этот класс представляет данные для событий переименования листа в диспетчере листов (AbortLayoutRename, LayoutRenamed, LayoutCreated и LayoutToBeRenamed).

Teigha.DatabaseServices.LayoutRenamedEventArgs.Id
Свойство представляет идентификатор объекта измененного листа.
Свойство представляет идентификатор объекта измененного листа.
Returns: Возвращает идентификатор объекта измененного листа.
Тип ObjectId.

Teigha.DatabaseServices.LayoutRenamedEventArgs.Name
Свойство представляет имя измененного листа.
Свойство представляет имя измененного листа.
Returns: Возвращает  имя измененного листа. Тип String.

Teigha.DatabaseServices.LayoutRenamedEventArgs.NewName
Свойство представляет новое имя измененного листа.
Свойство представляет новое имя измененного листа.
Returns: Возвращает новое имя измененного листа. Тип String.