HostMgd.EditorInput.Editor.PromptedForEntity
Событие возникает после завершения операции выбора геометрического объекта пользователем в редакторе nanoCAD.
Событие не реализовано.
Событие инициируется системой .NET API nanoCAD при завершении интерактивного выбора объекта
— например, после вызова метода GetEntity(), когда пользователь указывает на объект с помощью мыши
или выбирает его другим способом. Оно предоставляет результат выборки в виде объекта PromptEntityResult,
который содержит статус операции (OK, Cancel, Error) и данные о выбранном объекте: его ObjectId и точку выбора PickedPoint.
Это событие позволяет разработчикам надстроек и плагинов реагировать на завершение выбора объекта,
выполнять дополнительные действия, проверять допустимость выбора или изменять состояние чертежа на основе выбранного элемента.
Событие реализуется через делегат PromptEntityResultEventHandler, передающий источник события и аргументы типа PromptEntityResultEventArgs.
Example
C#