Teigha.GraphicsInterface.ViewportGeometry
Данный класс определяет методы, которые позволяют объектам себя векторизовать.
Данный класс определяет методы, которые позволяют объектам себя векторизовать.
Векторизация методами этого класса зависит от видового экрана.
Для векторизации, не зависящей от области просмотра, следует использовать метод WorldDraw() вместо ViewportDraw().
Объект ViewportGeometry передается в метод ViewportDraw() объекта чертежа.
Координаты пространства модели применяются ко всей геометрии в этом классе.

Teigha.GraphicsInterface.ViewportGeometry.DeviceContextPolygon(Teigha.Geometry.Point3dCollection)
Метод предназначен для отрисовки заполненного многоугольника с вершинами, заданными в нормализованных координатах устройства.
Метод предназначен для отрисовки заполненного многоугольника с вершинами, заданными в нормализованных координатах устройства.
points: Коллекция 3D-точек, представляющих вершины многоугольника. Тип Point3dCollection.
Returns: Возвращает true.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение false (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.DeviceContextPolyline(Teigha.Geometry.Point3dCollection)
Метод предназначен для отрисовки полилинии с вершинами, заданными в нормализованных координатах устройства.
Метод предназначен для отрисовки полилинии с вершинами, заданными в нормализованных координатах устройства.
points: Коллекция 3D-точек вершин полилинии.  Тип Point3dCollection.
Returns: Возвращает true.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение false (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.DeviceContextRasterImage(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Matrix2d,DatabaseServices.ObjectId,GraphicsInterface.ImageOrg,System.Int32,System.Int32,short,System.Boolean,GraphicsInterface.ImageSource,Teigha.Geometry.Vector3d,GraphicsInterface.ImageOrg,Teigha.Geometry.Matrix2d,System.Int32,System.Int32)
Метод предназначен для отрисовки растрового изображения.
Метод предназначен для отрисовки растрового изображения.
origin: Точка привязки изображения. Тип Point3d.
u: Направление ширины изображения. Тип Vector3d.
v: Направление высоты изображения. Тип Vector3d.
pixel: Матрица геометрического преобразования координат (2D).  Тип Matrix2d.
entityId: Постоянный идентификатор объекта изображения.  Тип DatabaseServices.ObjectId.
imageOrg: Тип организации формата изображения. Перечисление GraphicsInterface.ImageOrg.
imageWidth: Ширина изображения в пикселях. Тип int.
imageHeight: Высота изображения в пикселях. Тип int.
imageColorDepth: Глубина цветности изображения (биты на пиксель).  Тип short.
transparency: Флаг, указывающий, имеет ли изображение прозрачные области. Тип bool.
source: Источник изображения. Перечисление GraphicsInterface.ImageSource.
unRotated: Начало неповернутого изображения. Тип Vector3d.
originalImage: Организация исходного изображения. Перечисление GraphicsInterface.ImageOrg.
unRotatedPixel: Матрица преобразования пикселей неповернутого изображения в координаты контекста устройства. Тип Matrix2d.
unRotatedImageWidth: Ширина неповернутого исходного изображения, указанная в пикселях. Тип int.
unRotatedImageHeight: Высота неповернутого исходного изображения, указанная в пикселях. Тип int.
Returns: Возвращает true.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение false (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.PolygonEye(Teigha.Geometry.Point3dCollection)
Метод реализует отрисовку заполненного многоугольника с вершинами, указанными в координатах EyeSpace.
Метод реализует отрисовку заполненного многоугольника с вершинами, указанными в координатах EyeSpace.
Этот многоугольник похож на обычный многоугольник Geometry.Polygon, но его вершины определены в координатах EyeSpace.
Этот многоугольник не может быть связан ни с каким типом линий.
points: Коллекция 3D-точек, которые представляют вершины многоугольника. Тип Point3dCollection.
Returns: Возвращает true.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение false (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.PolylineEye(Teigha.Geometry.Point3dCollection)
Метод реализует отрисовку полилинии с координатами точек, указанными в координатах EyeSpace.
Метод реализует отрисовку полилинии с координатами точек, указанными в координатах EyeSpace.
Эта полилиния похожа на обычную полилинию Geometry.Polyline, но ее вершины заданы в координатах EyeSpace.
Такая полилиния не может быть связана ни с каким типом линий.
points: Входная коллекция точек полилинии, определенных в координатах EyeSpace.  Тип Point3dCollection.
Returns: Возвращает true.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение false (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.