Teigha.GraphicsInterface.Geometry.PopModelTransform
Этот метод должен быть вызван для восстановления преобразования модели после вызова метода PushModelTransform().
Этот метод должен быть вызван для восстановления преобразования модели после вызова метода PushModelTransform().
Returns: Возвращает true в случае успешного завершения. В противном случае возвращает false.