Teigha.GraphicsInterface.ClipBoundary
Класс ClipBoundary используется для передачи описаний границ обрезки отображаемых объектов в базовую систему.
Класс ClipBoundary используется для передачи описаний границ обрезки отображаемых объектов в базовую систему.

Teigha.GraphicsInterface.ClipBoundary.#ctor
Конструктор по умолчанию класса ClipBoundary.
Конструктор по умолчанию класса ClipBoundary.
Создает пустую границу обрезки (без фактических данных).

Teigha.GraphicsInterface.ClipBoundary.BackClipZ
Свойство BackClipZ представляет расстояние от целевой точки до задней плоскости отсечения.
Свойство BackClipZ представляет расстояние от целевой точки до задней плоскости отсечения, если она активна.
Returns: Возвращает глубину Z задней плоскости отсечения.
Тип double.

Teigha.GraphicsInterface.ClipBoundary.ClippingBack
Свойство ClippingBack позволяет определить, активна ли задняя плоскость отсечения.
Свойство ClippingBack позволяет определить, активна ли задняя плоскость отсечения (включено отсечение по этой плоскости).
Returns: Возвращает true, если задняя плоскость отсечения активна.
В противном случае возвращает false.

Teigha.GraphicsInterface.ClipBoundary.ClippingFront
Свойство ClippingFront позволяет определить, активна ли передняя плоскость отсечения.
Свойство ClippingFront позволяет определить, активна ли передняя плоскость отсечения (включено отсечение по этой плоскости).
Returns: Возвращает true, если передняя плоскость отсечения активна.
В противном случае возвращает false.

Teigha.GraphicsInterface.ClipBoundary.DrawBoundary
Свойство DrawBoundary позволяет определить, включено ли отображение границы обрезки.
Свойство DrawBoundary позволяет определить, включено ли отображение границы обрезки.
Returns: Возвращает true, если отображение границы обрезки включено.
В противном случае возвращает false.

Teigha.GraphicsInterface.ClipBoundary.FrontClipZ
Свойство FrontClipZ представляет расстояние от целевой точки до передней плоскости отсечения.
Свойство FrontClipZ представляет расстояние от целевой точки до передней плоскости отсечения, если она активна.
Returns: Возвращает глубину Z передней плоскости отсечения.
Тип double.

Teigha.GraphicsInterface.ClipBoundary.NormalVector
Свойство NormalVector представляет вектор нормали плоскости границы обрезки.
Свойство NormalVector представляет вектор нормали плоскости, в которой лежит граница обрезки.
Совпадает с направлением оси Z в системе координат составного объекта.
Returns: Возвращает вектор нормали плоскости границы обрезки.
Тип Vector3d.

Teigha.GraphicsInterface.ClipBoundary.Point
Свойство Point представляет начало пространства границы отсечения.
Свойство Point представляет начало пространства границы отсечения в системе координат составного объекта.
Returns: Возвращает точку начала пространства границы отсечения.
Тип Point3d.

Teigha.GraphicsInterface.ClipBoundary.TransformInverseBlockRefXForm
Свойство TransformInverseBlockRefXForm представляет матрицу графического преобразования из пространства блока BlockSpace в пространство WorldSpace.
Свойство TransformInverseBlockRefXForm представляет матрицу графического преобразования из пространства блока BlockSpace в пространство моделирования WorldSpace.
Notes
Составной объект использует это обратное преобразование для преобразования своего контента.
В случае вхождения блока используется преобразование вставки блока в записи таблицы блоков.
Returns: Возвращает матрицу графического преобразования.
Тип Matrix3d.

Teigha.GraphicsInterface.ClipBoundary.TransformToClipSpace
Свойство TransformToClipSpace представляет геометрическое преобразование из пространства модели в пространство обрезки.
Свойство TransformToClipSpace представляет геометрическое преобразование из пространства модели ModelSpace в пространство обрезки ClipSpace.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix3d.