HostMgd.ApplicationServices.DocumentWindowCollection.TileVertically
Метод позволяет разместить дочерние окна MDI вертикально.
В текущей версии не реализован.
Метод позволяет разместить дочерние окна MDI данной коллекции вертикально.
В текущей версии не реализован.