HostMgd.EditorInput.PromptNumericalOptions
Это базовый класс для ввода, который представляет
необязательные параметры приглашения для числовых типов.

HostMgd.EditorInput.PromptNumericalOptions.AllowNegative
Возвращает или устанавливает разрешение ввода отрицательного
значения. Значение true означает, что отрицательные значения
разрешены.

HostMgd.EditorInput.PromptNumericalOptions.AllowNone
Возвращает или устанавливает признак того, разрешен ли ввод
только Enter.
Значение true означает, что ввод только Enter разрешен, и
false в противном случае.

HostMgd.EditorInput.PromptNumericalOptions.AllowZero
Возвращает или устанавливает признак того, разрешен ли ввод
нулевого значения.
Значение true означает, что ввод нулевого значения разрешен,
и false в противном случае.

HostMgd.EditorInput.PromptNumericalOptions.UseDefaultValue
Возвращает и выставляет признак того, будет ли использоваться
значение по умолчанию в случае, если пользователь вводит
Enter без какого-либо другого ввода. Это свойство позволяет
использовать программный код для задания значения по
умолчанию, определенного в производных классах.