Teigha.Geometry.Curve2d
Класс Curve2d является базовым классом для всех двумерных кривых.
Класс Curve2d является базовым классом для всех двумерных кривых.
Всякий класс, производный от этого класса, представляет 2D-кривую.

Teigha.Geometry.Curve2d.Create(IntPtr,System.Boolean)
Метод создает объект Curve2d на основе переданного указателя.
Метод создает объект Curve2d на основе переданного указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданную трехмерную кривую.
Тип Curve2d.

Teigha.Geometry.Curve2d.EvaluatePoint(System.Double)
Метод позволяет получить на кривой точку, соответствующую указанному значению параметра.
Метод позволяет получить на кривой точку, соответствующую указанному значению параметра.
parameter: Входное значение параметра. Тип double.
Returns: Возвращает точку на кривой, соответствующую заданному значению параметра.
Тип Point2d.

Teigha.Geometry.Curve2d.Explode(Teigha.Geometry.Interval)
Метод позволяет разбить данную кривую на составляющие ее подкривые.
Метод позволяет разбить данную кривую на составляющие ее подкривые.
interval: Параметрический интервал, на котором выполняется разбиение на подкривые.
Returns: Возвращает массив подкривых.
Тип Curve2d[].

Teigha.Geometry.Curve2d.GetArea(System.Double,System.Double)
Метод вычисляет площадь под кривой на указанном параметрическом интервале.
Метод предназначен для вычисления площади под кривой на параметрическом интервале, который определяется указанными значениями параметра.
Используется вызов метода Curve2d.GetArea(Double startParameter, Double endParameter, Tolerance tolerance) с точностью Tolerance.Global.
startParameter: Входное значение параметра для начала интервала. Тип double.
endParameter: Входное значение параметра для конца интервала. Должно превышать значение startParameter. Тип double. +
Returns: Возвращает значение площади под кривой на указанном параметрическом интервале.
Тип double.

Teigha.Geometry.Curve2d.GetArea(System.Double,System.Double,Teigha.Geometry.Tolerance)
Метод вычисляет площадь под кривой с заданной точностью на указанном параметрическом интервале.
Метод предназначен для вычисления площади под кривой с заданной точностью на параметрическом интервале, который определяется указанными значениями параметра.
startParameter: Входное значение параметра для начала интервала. Тип double.
endParameter: Входное значение параметра для конца интервала. Должно превышать значение startParameter. Тип double.
tolerance: Заданная точность вычисления площади.  Тип Tolerance.
Returns: Возвращает значение площади под кривой на указанном параметрическом интервале.
Тип double.

Teigha.Geometry.Curve2d.GetBoundBlockOf(Teigha.Geometry.Interval)
Метод позволяет получить двумерную граничную рамку для этой кривой на указанном параметрическом подынтервале.
Граничная рамка ориентирована по осям системы координат.
Метод позволяет получить двумерную граничную рамку для этой кривой на указанном параметрическом подынтервале.
Граничная рамка ориентирована по осям системы координат.
range: Входной параметрический интервал.
Returns: Возвращает двумерную граничную рамку.
Тип BoundBlock2d.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Point2d)
Метод позволяет получить точку на этой кривой, ближайшую к заданной точке.
Метод позволяет получить точку на этой кривой, ближайшую к заданной точке.
Используется вызов метода Curve2d.GetClosestPointTo(Point2d point, Tolerance tolerance) с точностью Tolerance.Global.
point: Входная точка, для которой требуется найти ближайшую точку на кривой.
Returns: Возвращает точку на кривой, которая является ближайшей к заданной точке point.
Тип PointOnCurve2d.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью получить точку на этой кривой, ближайшую к указанной точке.
Метод позволяет с заданной точностью получить точку на этой кривой, ближайшую к указанной точке.
point: Входная точка, для которой требуется найти ближайшую точку на кривой.  Тип Point2d.
tolerance: Входная точность вычислений.  Тип Tolerance.
Returns: Возвращает точку на кривой, которая является ближайшей к заданной точке point.
Тип PointOnCurve2d.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Curve2d)
Метод позволяет получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимальным.
Метод позволяет получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимальным.  Используется вызов метода Curve2d.GetClosestPointTo(Curve2d curve, Tolerance tolerance) с точностью Tolerance.Global.
curve: Входная кривая, на которой требуется найти точку, ближайшую к данной кривой.
Returns: Возвращает массив из двух ближайших точек на каждой из кривых. Тип PointOnCurve2d[].
Точка с индексом 0 принадлежит данной кривой, а точка с индексом 1 принадлежит переданной кривой curve.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Curve2d,Teigha.Geometry.Tolerance)
Метод позволяет с указанной точностью получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимально возможным.
Метод позволяет с указанной точностью получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимально возможным.
curve: Входная кривая, на которой требуется найти точку, ближайшую к данной кривой. Тип Curve2d.
tolerance: Входная точность вычислений. Тип Tolerance.
Returns: Возвращает массив из двух ближайших точек на каждой из кривых. Тип PointOnCurve2d[].
Точка с индексом 0 принадлежит данной кривой, а точка с индексом 1 принадлежит переданной кривой curve.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Point2d)
Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой.
Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой.
Используется вызов метода Curve2d.GetDistanceTo(Point2d point, Tolerance tolerance) с точностью Tolerance.Global.
point: Входная двумерная точка, до которой вычисляется расстояние.
Returns: Возвращает расстояние от точки point до ближайшей точки на данной кривой.
Тип double.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой с предписанной точностью.
Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой с предписанной точностью.
point: Входная двумерная точка, до которой вычисляется расстояние. Тип Point2d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает расстояние от точки point до ближайшей точки на данной кривой.
Тип double.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Curve2d)
Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой.
Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой.
Используется вызов метода Curve2d.GetDistanceTo(Curve2d curve, Tolerance tolerance) со значением точности по умолчанию, равным Tolerance.Global.
curve: Входная кривая.  Тип Curve2d.
Returns: Возвращает минимальное расстояние между точками на обеих кривых.
Тип double.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Curve2d,Teigha.Geometry.Tolerance)
Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой с заданной точностью.
Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой с заданной точностью.
curve: Входная кривая.  Тип Curve2d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает минимальное расстояние между точками на обеих кривых.
Тип double.

Teigha.Geometry.Curve2d.GetLength(System.Double,System.Double)
Метод вычисляет длину кривой на заданном параметрическом интервале с точностью по умолчанию.
Метод вычисляет длину вдоль кривой между двумя точками, которые определяются заданным параметрическим интервалом.
Используется вызов метода Curve2d.GetLength(Double fromParameter, Double toParameter, Tolerance tolerance) со значением точности по умолчанию, равным Tolerance.Global.
fromParameter: Значение параметра в начальной точке интервала. Тип double.
toParameter: Значение параметра в конечной  точке интервала. Тип double.
Returns: Возвращает длину кривой на заданном параметрическом интервале.
Тип double.

Teigha.Geometry.Curve2d.GetLength(System.Double,System.Double,Teigha.Geometry.Tolerance)
Метод вычисляет длину кривой на заданном параметрическом интервале с заданной точностью.
Метод вычисляет длину кривой на заданном параметрическом интервале с заданной точностью.
fromParameter: Значение параметра в начальной точке интервала. Тип double.
toParameter: Значение параметра в конечной  точке интервала. Тип double.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает длину кривой на заданном параметрическом интервале.
Тип double.

Teigha.Geometry.Curve2d.GetNormalPoint(Teigha.Geometry.Point2d)
Метод находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку.
Метод находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку.
Используется вызов Curve2d.GetNormalPoint(Point2d point, Tolerance tolerance) со значением точности, равным Tolerance.Global.
Если на кривой окажется более одной такой точки, возвращается точка с наименьшим значением параметра.
Notes
Нормаль к кривой в точке на кривой представляет собой линию, проходящую через эту точку и перпендикулярную касательному вектору в этой точке.
point: Произвольная двумерная точка, через которую должна пройти нормаль к кривой. Тип Point2d.
Returns: Возвращает точку на кривой, в которой нормаль к кривой пройдет через входную точку point.
Тип PointOnCurve2d.

Teigha.Geometry.Curve2d.GetNormalPoint(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод с заданной точностью находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку.
Метод позволяет с заданной точностью найти на данной кривой такую точку, в которой нормаль к кривой пройдет через переданную в метод точку.
Если на кривой окажется более одной такой точки, возвращается точка с наименьшим значением параметра.
Notes
Нормаль к кривой в точке на кривой представляет собой линию, проходящую через эту точку и перпендикулярную касательному вектору в этой точке.
point: Входная точка, через которую должна пройти нормаль к кривой.  Тип Point2d.
tolerance: Заданная геометрическая точность.  Тип Tolerance.
Returns: Возвращает точку на кривой, в которой нормаль к кривой пройдет через входную точку point.
Тип PointOnCurve2d.

Teigha.Geometry.Curve2d.GetOrthoBoundBlockOf(Teigha.Geometry.Interval)
Метод предоставляет граничную рамку для участка данной кривой, который соответствует заданному параметрическому подынтервалу.
Метод предоставляет граничную рамку для участка данной кривой, который соответствует заданному параметрическому подынтервалу.
Стороны граничной рамки ориентированы по осям системы координат.
range: Входной параметрический подынтервал.  Тип Interval.
Returns: Возвращает граничную рамку для указанного участка кривой.
Тип BoundBlock2d.

Teigha.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean)
Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки равна заданному значению.
Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки равна заданному значению.
Используется вызов Curve2d.GetParameterAtLength(Double datumParameter, Double length, Boolean parameterDirection, Tolerance tolerance) со значением точности, равным Tolerance.Global.
Положение на кривой точки отсчета длины задается входным параметром datumParameter.
Направление вдоль кривой указывается входным флагом parameterDirection.
datumParameter: Входное значение параметра для точки отсчета длины. Тип double.
length: Входная длина вдоль кривой.       Тип double.
parameterDirection: Направление изменения параметра.  Тип bool.
Returns: Возвращает значение параметра для искомой точки на кривой.
Тип double.

Teigha.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean,Teigha.Geometry.Tolerance)
Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки с указанной точностью равна заданному значению.
Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки с указанной точностью равна заданному значению.
Положение на кривой точки отсчета длины задается входным параметром datumParameter.
Направление вдоль кривой указывается входным флагом parameterDirection.
datumParameter: Входное значение параметра для точки отсчета длины. Тип double.
length: Входная длина вдоль кривой.         Тип double.
parameterDirection: Направление изменения параметра.    Тип bool.
tolerance: Заданная точность вычисления длины. Тип Tolerance.
Returns: Возвращает значение параметра для искомой точки на кривой.
Тип double.

Teigha.Geometry.Curve2d.GetParameterOf(Teigha.Geometry.Point2d)
Метод вычисляет значение параметра для заданной точки на кривой.
Метод вычисляет значение параметра для заданной точки на кривой.
Используется вызов Curve2d.GetParameterOf(Point2d point, Tolerance tolerance) со значением точности, равным Tolerance.Global.
Если точка не находится на кривой, результат будет непредсказуем.
Чтобы убедиться, что входная точка находится на кривой, используйте метод Curve2d.IsOn(Point2d point).
point: Входная точка на кривой. Тип Point2d.
Returns: Возвращает значение параметра для точки point.
Тип double.

Teigha.Geometry.Curve2d.GetParameterOf(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод вычисляет с указанной точностью значение параметра для заданной точки на кривой.
Метод вычисляет с указанной точностью значение параметра для заданной точки на кривой.
Реализация без проверки предполагает, что точка лежит на кривой.
Если точка не лежит на кривой, метод возвращает непредсказуемый результат.
Чтобы убедиться, что входная точка находится на кривой, используйте метод Curve2d.IsOn(Point2d point).
point: Входная точка на кривой.      Тип Point2d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает значение параметра для точки point.
Тип double.

Teigha.Geometry.Curve2d.GetSamplePoints(System.Double,System.Double,System.Double)
Метод позволяет получить массив точек на кривой на заданном параметрическом подынтервале.
Шаг между любыми двумя последовательными точками ограничен сверху указанным предельным прогибом кривой над соединяющим точки линейным сегментом.
Метод позволяет получить массив точек на кривой на параметрическом подынтервале от fromParameter до toParameter.
Шаг между любыми двумя последовательными точками ограничен сверху предельным прогибом approxEps кривой над соединяющим точки линейным сегментом.
fromParameter: Начало параметрического подынтервала. Тип double.
toParameter: Конец параметрического подынтервала. Тип double.
approxEps: Предельный прогиб кривой между любыми двумя последовательными точками массива. Тип double.
Returns: Возвращает массив точек на кривой.
Тип PointOnCurve2d[].

Teigha.Geometry.Curve2d.GetSamplePoints(System.Int32)
Метод позволяет получить указанное количество точек на кривой, равномерно распределенных в параметрическом пространстве кривой.
Метод позволяет получить указанное количество точек на кривой, равномерно распределенных в параметрическом пространстве кривой.  Например, если параметрический интервал кривой равен [0, 2], а аргумент numSample равен 5, полученные точки будут соответствовать следующим параметрическим значениям: 0, 0.5, 1, 1.5, 2.
numSample: Заказанное количество точек. Тип int.
Returns: Возвращает массив точек на кривой.
Тип Point2d[].

Teigha.Geometry.Curve2d.GetSplitCurves(System.Double)
Метод позволяет получить два сегмента этой кривой, делящие данную кривую в точке с указанным значением параметра.
Метод позволяет получить два сегмента этой кривой, делящие данную кривую в точке с указанным значением параметра.
value: Входное значение параметра для точки разделения кривой на два сегмента.
Returns: Возвращает массив из двух кривых, полученных разбиением данной кривой в заданной точке.
Тип Curve2d[].

Teigha.Geometry.Curve2d.GetTrimmedOffset(System.Double,Teigha.Geometry.OffsetCurveExtensionType)
Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
Положительное направление смещения определяется правилом правой руки с учетом направления касательной к кривой.
Если при смещении сегментов исходной кривой образуются разрывы, используется вариант сопряжения смещенных сегментов, заданный аргументом extensionType.
Используется вызов метода Curve2d.GetTrimmedOffset(Double distance, OffsetCurveExtensionType extensionType, Tolerance tolerance) с точностью tolerance, равной Tolerance.Global.
distance: Величина смещения. Тип double.
extensionType: Вариант сопряжения смещаемых сегментов кривой. Тип OffsetCurveExtensionType.
Returns: Возвращает массив кривых, полученных в результате операции смещения данной кривой.
Тип Curve2d[].

Teigha.Geometry.Curve2d.GetTrimmedOffset(System.Double,Teigha.Geometry.OffsetCurveExtensionType,Teigha.Geometry.Tolerance)
Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
В вычислениях используется заданная точность.
Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
В вычислениях используется заданная точность.
Положительное направление смещения определяется правилом правой руки с учетом направления касательной к кривой.
Если при смещении сегментов исходной кривой образуются разрывы, используется вариант сопряжения смещенных сегментов, заданный аргументом extensionType.
distance: Величина смещения. Тип double.
extensionType: Вариант сопряжения смещаемых сегментов кривой. Тип OffsetCurveExtensionType.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив кривых, полученных в результате операции смещения данной кривой.
Тип Curve2d[].

Teigha.Geometry.Curve2d.IsClosed(Teigha.Geometry.Tolerance)
Метод выполняет проверку, замкнута ли данная кривая с учетом заданной точности.
Метод проверяет замкнутость данной кривой с учетом заданной точности.
Кривая считается замкнутой, если в пределах указанной точности начальная и конечная точки кривой совпадают.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если начальная и конечная точки кривой совпадают с точностью tolerance.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsDegenerate([Out]Entity2d%)
Метод проверяет, является ли данная кривая вырожденной.
Метод проверяет, является ли данная кривая вырожденной.
В случае вырождения возвращает тип объекта, в которой вырождается кривая.
Используется вызов IsDegenerate(out Entity2d result, Tolerance tolerance) со значением точности, равным Tolerance.Global.
Returns: Возвращает true, если вырождение имеет место.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsDegenerate([Out]Entity2d%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая вырожденной в пределах заданной геометрической точности.
Метод проверяет, является ли данная кривая вырожденной в пределах заданной геометрической точности.
В случае вырождения возвращает тип объекта, в которой вырождается кривая.
Returns: Возвращает true, если вырождение имеет место.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsLinear([Out]Line2d%)
Метод проверяет линейность данной кривой.
Метод проверяет, можно ли считать данную кривую линейной.
В случае линейности кривой метод возвращает совпадающую с кривой линию.
Используется вызов метода Curve2d.IsLinear(out Line2d line, Tolerance tolerance) со значением точности, равным Tolerance.Global.
line: Выходная линия, совпадающая с данной кривой. Тип Line2d. Содержит значимый объект, только если метод возвращает true.
Returns: Возвращает true, если данную кривую можно считать линейной.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsLinear([Out]Line2d%,Teigha.Geometry.Tolerance)
Метод проверяет линейность данной кривой с указанной геометрической точностью.
Метод проверяет, можно ли считать данную кривую линейной в пределах указанной геометрической точности.
В случае линейности кривой метод возвращает совпадающую с кривой линию.
line: Выходная линия, совпадающая с данной кривой. Тип Line2d. Содержит значимый объект, только если метод возвращает true.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах указанной точности tolerance данную кривую можно считать линейной.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsOn(System.Double)
Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой.
Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой.
Используется вызов метода Curve2d.IsOn(Double parameter, Tolerance tolerance) со значением точности, равным Tolerance.Global.
parameter: Входное проверяемое значение параметра. Тип double.
Returns: Возвращает true, если переданное значение аргумента parameter находится в пределах параметрического интервала данной кривой.  В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsOn(System.Double,Teigha.Geometry.Tolerance)
Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой в пределах заданной точности.
Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой в пределах заданной точности.
parameter: Входное проверяемое значение параметра.  Тип double.
tolerance: Входная точность.  Тип Tolerance.
Returns: Возвращает true, если переданное значение аргумента parameter находится в пределах параметрического интервала данной кривой.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d)
Метод позволяет проверить, лежит ли указанная точка на данной кривой.
Метод позволяет проверить, лежит ли указанная точка на данной кривой.
Используется вызов метода Curve2d.IsOn(Point2d point, Tolerance tolerance) со значением точности, равным Tolerance.Global.
point: Проверяемая точка.  Тип Point2d.
Returns: Возвращает true, если точка point лежит на данной кривой.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах заданной точности.
Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах заданной точности.
point: Проверяемая точка. Тип Point2d.
tolerance: Заданная точность проверки. Тип Tolerance.
Returns: Возвращает true, если точка point лежит на данной кривой в пределах точности tolerance.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d,[Out]double%)
Метод позволяет проверить, лежит ли указанная точка на данной кривой, и если это так, определяет соответствующее этой точке значение параметра.
Метод позволяет проверить, лежит ли указанная точка на данной кривой, и если это так, определяет соответствующее этой точке значение параметра.
Используется вызов метода Curve2d.IsOn(Point2d point, out double value, Tolerance tolerance) со значением точности, равным Tolerance.Global.
point: Проверяемая точка. Тип Point2d.
value: Выходное значение параметра, соответствующее проверяемой точке. Тип double. Это значение действительно только в том случае, если метод возвращает значение true.
Returns: Возвращает true, если точка point лежит на данной кривой.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d,[Out]double%,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах указанной точности, и если это так, определяет соответствующее этой точке значение параметра.
Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах указанной точности, и если это так, определяет соответствующее этой точке значение параметра.
point: Проверяемая точка. Тип Point2d.
value: Выходное значение параметра, соответствующее проверяемой точке. Тип double. Это значение действительно только в том случае, если метод возвращает значение true.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если точка point лежит на данной кривой.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.IsPeriodic([Out]double%)
Метод позволяет проверить, является ли данная кривая периодической.
Метод позволяет проверить, является ли данная кривая периодической.
Notes
Кривая является периодической с периодом period тогда и только тогда, когда она замкнута и для любого вещественного значения t точки Curve2d.EvaluatePoint(t) и Curve2d.EvaluatePoint(t + period) всегда совпадают.
period: Выходной параметр, содержащий период данной кривой. Тип double.  Это значение действительно только в том случае, если метод возвращает значение true.
Returns: Возвращает true, если кривая является периодической.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.SetInterval(Teigha.Geometry.Interval)
Метод позволяет переопределить параметрический интервал данной кривой.
Метод позволяет переопределить параметрический интервал данной кривой.
value: Новый параметрический интервал кривой.

Teigha.Geometry.Curve2d.BoundBlock
Свойство BoundBlock представляет ориентированную двумерную граничную рамку для данной кривой.
Стороны такой граничной рамки не обязаны быть параллельными осям системы координат.
Свойство BoundBlock представляет ориентированную двумерную граничную рамку для данной кривой.
Стороны такой граничной рамки не обязаны быть параллельными осям системы координат.
Returns: Возвращает двумерную граничную рамку для данной кривой.
Тип BoundBlock2d.

Teigha.Geometry.Curve2d.EndPoint
Свойство EndPoint представляет конечную точку данной кривой.
Свойство EndPoint представляет конечную точку данной кривой.
Returns: Возвращает конечную точку данной кривой.
Тип Point2d.

Teigha.Geometry.Curve2d.HasEndPoint
Свойство HasEndPoint позволяет проверить, существует ли у данной кривой конечная точка.
Свойство HasEndPoint позволяет проверить, существует ли у данной кривой конечная точка.
Значение false означает, что параметрический интервал кривой не ограничен сверху.
Returns: Возвращает true, если кривая имеет конечную точку.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.HasStartPoint
Свойство HasStartPoint позволяет проверить, существует ли у данной кривой начальная точка.
Свойство HasStartPoint позволяет проверить, существует ли у данной кривой начальная точка.
Значение false означает, что параметрический интервал кривой не ограничен снизу.
Returns: Возвращает true, если у данной кривой начальная точка существует.
В противном случае возвращает false.

Teigha.Geometry.Curve2d.OrthoBoundBlock
Свойство OrthoBoundBlock представляет двумерную граничную рамку для данной кривой.
Граничная рамка ориентирована по осям системы координат.
Свойство OrthoBoundBlock представляет двумерную граничную рамку для данной кривой.
Граничная рамка ориентирована по осям системы координат.
Returns: Возвращает двумерную граничную рамку для данной кривой.
Тип BoundBlock2d.

Teigha.Geometry.Curve2d.StartPoint
Свойство StartPoint представляет начальную точку данной кривой.
Свойство StartPoint представляет начальную точку данной кривой.
Returns: Возвращает начальную точку кривой.
Тип Point2d.