Teigha.DatabaseServices.DimStyleTableRecord
\ \
Класс предназначен для хранения определения размерного стиля.
\ \
Класс предназначен для хранения определения размерного стиля.
Определение размерного стиля представляет из себя набор
данных о том, как должна выглядеть размерная линия и текст,
относящийся к ней. Размерные стили часто используются, как
вариации одного и того же стиля для различных видов размеров:
угловых, линейных и т.д.
На рисунке приведено окно редактирования размерного стиля,
которое вызывается из окна размерных стилей кнопкой
«Редактировать..».
Все настройки, которые есть в этом окне также доступны и
через API в виде свойств класса DimStyleTableRecord. Также
все настройки размерных стилей доступны через системные
переменные, которые тоже можно изменять через .NET API. При
изменении системных переменных, которые являются настройками
размерных стилей, создаются новые размерные стили на основе
текущих с новыми значениями настроек размерных стилей,
которые были изменены через системные переменные.
Для создания нового размерного стиля необходимо указывать
размерный стиль, на котором будет основан новый. Также для
размерного стиля можно создать подстиль определенного
элемента оформления, например подстиль для выносок. Чтобы
создать такой подстиль, нужно создать копию стиля, на котором
будет основан подстиль и в названии этого подстиля (свойство
DimStyleTableRecord.Name) добавить специальные символы,
приведенные в таблице:
Специальные символы   Значение        Пример
«$0»                  Линейный        «СПДС$0»
«$2»                  Угловой         «СПДС$2»
«$3»                  Диаметральный   «СПДС$3»
«$4»                  Радиус          «СПДС$4»
«$6»                  Ординатный      «СПДС$6»
«$7»                  Выноска         «СПДС$7»
Example
\ \
В качестве примера работы с классом DimStyleTableRecord
приведена команда quot;AddNewDimStylequot;, которая
добавляет в dwg-документ новый размерный стиль.
C#

Teigha.DatabaseServices.DimStyleTableRecord.#ctor
Конструктор класса
Конструктор класса.

Teigha.DatabaseServices.DimStyleTableRecord.Dimclrd
Свойство отвечает за цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр).
В свойстве хранится цвет размерных линий, стрелок и размерных линий-выносок в виде типа данных Teigha.Colors.Color. Помимо различных цветов для этого свойства доступны значения «BYBLOCK» и «BYLAYER». Значение по умолчанию – «BYBLOCK».
Свойство также доступно через системную переменную DIMCLRD и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMCLRD будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMCLRD.
Соответствия значений свойства Dimclrd в пользовательском интерфейсе и при работе с ним через .NET API:
Наименование   Наименование цвета   Как изменить через API
цвета в UI	    при считывании
через API
------------   ------------------   --------------------------------------------------------------------------
«По блоку»     BYBLOCK              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByBlock, 0)
«По слою»      BYLAYER              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByLayer, 256)
красный        red                  Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1)
желтый         yellow               Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 2)
зеленый        green                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 3)
голубой        cyan                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 4)
синий          blue                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5)
фиолетовый     magenta              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 6)
белый          white                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 7)
Returns: Возвращает тип данных Teigha.Colors.Color.
Return Value List
BYBLOCK : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ПО БЛОКУ
BYLAYER : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ПО СЛОЮ
red : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) КРАСНЫЙ
yellow : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ЖЕЛТЫЙ
green : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ЗЕЛЕНЫЙ
cyan : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ГОЛУБОЙ
blue : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) СИНИЙ
magenta : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) ФИОЛЕТОВЫЙ
white : цвет размерных линий, стрелок и размерных линий-выносок (радиус, диаметр) БЕЛЫЙ
Example
Пример изменения цвета размерных линий (значения свойства Dimclrd) в размерном стиле "Standard":
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimltype
Свойство отвечает за настройку типа размерных линий.
В свойстве хранится ObjectId установленного типа линии для размерных линий. Значение по умолчанию - «По слою».
Свойство также доступно через системную переменную DIMLTYPE и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLTYPE будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLTYPE.
Returns: Возвращает тип данных ObjectId.
Example
Пример изменения типа размерных линий (значения свойства Dimltype) в размерном стиле "Standard":
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimlwd
Свойство отвечает за настройку веса размерных линий.
В свойстве хранится текущая настройка веса размерных линий. Значение по умолчанию «По блоку». Свойство принимает значения перечисления Teigha.DatabaseServices.LineWeight.
Свойство также доступно через системную переменную DIMLWD и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLWD будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLWD.
Returns: Возвращает тип данных Teigha.DatabaseServices.LineWeight.
Example
Пример изменения веса размерных линий (значения свойства Dimlwd) в размерном стиле "Standard":
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimdle
Свойство отвечает за удлинение размерных линий за выносные, когда стрелки архитектурные, цельные, косой, галочка или нет.
В свойстве хранится длина выноса размерных линий за выносные в виде числа double. Значение по умолчанию 0.
Свойство также доступно через системную переменную DIMDLE и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMDLE будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMDLE.
Returns: Возвращает тип данных double.
Example
Пример изменения удлинения размерных линий за выносные (значения свойства Dimdle) в размерном стиле "Standard":
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimdli
Свойство отвечает расстояние между размерными линиями в базовых размерах.
В свойстве хранится расстояние между размерными линиями в базовых размерах в виде числа double. Свойство может принимать только положительные числа. Значение по умолчанию 6.
Свойство также доступно через системную переменную DIMDLI и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMDLI будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMDLI.
Returns: Возвращает тип данных double.
Example
Пример изменения расстояния между размерными линиями в базовых размерах (значения свойства Dimdli) в размерном стиле "Standard":
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimsd1
Свойство предназначено для контроля подавления первой размерной линии и окончания левой стрелки в размерах.
В свойстве хранится настройка подавления первой размерной линии и окончания левой стрелки в размерах.
Свойство принимает в качестве значения тип данных bool:
* false – не подавляется (по умолчанию);
* true – подавляется.
Свойство также доступно через системную переменную DIMSD1 и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMSD1 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMSD1.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки подавления первой размерной линии и окончания левой стрелки в размерах (значения свойства Dimsd1) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimsd2
Свойство предназначено для контроля подавления второй размерной линии и окончания правой стрелки в размерах.
В свойстве хранится настройка подавления второй размерной линии и окончания правой стрелки в размерах.
Свойство принимает в качестве значения тип данных bool:
* false – не подавляется (по умолчанию);
* true – подавляется.
Свойство также доступно через системную переменную DIMSD2 и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMSD2 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMSD2.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки подавления второй размерной линии и окончания правой стрелки в размерах (значения свойства Dimsd2) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimclre
Свойство отвечает за цвет выносных линий, маркеров центра и центровых/ осевых линий.
В свойстве хранится цвет выносных линий, маркеров центра и центровых/осевых линий в виде типа данных Teigha.Colors.Color. Помимо различных цветов для этого свойства доступны значения «BYBLOCK» и «BYLAYER». Значение по умолчанию – «BYBLOCK».
Свойство также доступно через системную переменную DIMCLRE и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMCLRE будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMCLRE.
Соответствия значений свойства Dimclre в пользовательском интерфейсе и при работе с ним через .NET API:
Наименование   Наименование цвета   Как изменить через API
цвета в UI	    при считывании
через API
------------   ------------------   --------------------------------------------------------------------------
«По блоку»     BYBLOCK              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByBlock, 0)
«По слою»      BYLAYER              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByLayer, 256)
красный        red                  Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1)
желтый         yellow               Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 2)
зеленый        green                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 3)
голубой        cyan                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 4)
синий          blue                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5)
фиолетовый     magenta              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 6)
белый          white                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 7)
Returns: Возвращает тип данных Teigha.Colors.Color.
Return Value List
BYBLOCK : цвет выносных линий, маркеров центра и центровых/ осевых линий ПО БЛОКУ
BYLAYER : цвет выносных линий, маркеров центра и центровых/ осевых линий ПО СЛОЮ
red : цвет выносных линий, маркеров центра и центровых/ осевых линий КРАСНЫЙ
yellow : цвет выносных линий, маркеров центра и центровых/ осевых линий ЖЕЛТЫЙ
green : цвет выносных линий, маркеров центра и центровых/ осевых линий ЗЕЛЕНЫЙ
cyan : цвет выносных линий, маркеров центра и центровых/ осевых линий ГОЛУБОЙ
blue : цвет выносных линий, маркеров центра и центровых/ осевых линий СИНИЙ
magenta : цвет выносных линий, маркеров центра и центровых/ осевых линий ФИОЛЕТОВЫЙ
white : цвет выносных линий, маркеров центра и центровых/ осевых линий БЕЛЫЙ
Example
Пример изменения цвета выносных линий, маркеров центра и центровых/осевых линий (значения свойства Dimclre) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimltex1
Свойство отвечает за настройку типа линии первых выносных линий линейных размеров.
В свойстве хранится ObjectId установленного типа линии для первых выносных линий линейных размеров. Значение по умолчанию - «По слою».
Свойство также доступно через системную переменную DIMLTEX1 и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLTEX1 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLTEX1.
Returns: Возвращает тип данных ObjectId.
Example
Пример изменения типа линии первых выносных линий линейных размеров (значения свойства Dimltex1) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimltex2
Свойство отвечает за настройку типа линии вторых выносных линий линейных размеров.
В свойстве хранится ObjectId установленного типа линии для вторых выносных линий линейных размеров. Значение по умолчанию - «По слою».
Свойство также доступно через системную переменную DIMLTEX2 и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLTEX2 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLTEX2.
Returns: Возвращает тип данных ObjectId.
Example
Пример изменения типа линии вторых выносных линий линейных размеров (значения свойства Dimltex2) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimlwe
Свойство отвечает за настройку веса выносных линий.
В свойстве хранится текущая настройка веса выносных линий. Значение по умолчанию «По блоку». Свойство принимает значения перечисления Teigha.DatabaseServices.LineWeight.
Свойство также доступно через системную переменную DIMLWE и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLWE будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLWE.
Returns: Возвращает тип данных Teigha.DatabaseServices.LineWeight.
Example
Пример изменения веса выносных линий (значения свойства Dimlwe) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimse1
Свойство предназначено для контроля подавления первой выносной линии.
В свойстве хранится настройка подавления первой выносной линии.
Свойство принимает в качестве значения тип данных bool:
* false – не подавляется (по умолчанию);
* true – подавляется.
Свойство также доступно через системную переменную DIMSE1 и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMSE1 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMSE1.
Returns: Возвращает тип данных bool.
Example
Пример подавления первой выносной линии (изменения значения свойства Dimse1) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimse2
Свойство предназначено для контроля подавления второй выносной линии.
В свойстве хранится настройка подавления второй выносной линии.
Свойство принимает в качестве значения тип данных bool:
* false – не подавляется (по умолчанию);
* true – подавляется.
Свойство также доступно через системную переменную DIMSE2 и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMSE2 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMSE2.
Returns: Возвращает тип данных bool.
Example
Пример подавления второй выносной линии (изменения значения свойства Dimse2) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimexe
Свойство отвечает величину удлинения выносных линий за размерные.
В свойстве хранится величина удлинения выносных линий за размерные в виде числа double. Свойство может принимать только положительные числа. Значение по умолчанию 2.0.
Свойство также доступно через системную переменную DIMEXE и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMEXE будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMEXE.
Returns: Возвращает тип данных double.
Example
Пример изменения удлинения выносных линий за размерные (значения свойства Dimexe) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimexo
Свойство отвечает величину отступа выносных линий от объекта.
В свойстве хранится величина отступа выносных линий от объекта в виде числа double. Свойство может принимать только положительные числа. Значение по умолчанию 0.5.
Свойство также доступно через системную переменную DIMEXO и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMEXO будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMEXO.
Returns: Возвращает тип данных double.
Example
Пример изменения отступа выносных линий от объекта (значения свойства Dimexo) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.DimfxlenOn
Свойство отвечает за переключение между выносными линиями фиксированной и нефиксированной длины.
В свойстве хранится признак использования фиксированной длины выносных линий в виде типа данных bool. Возможны следующие значения:
* true – выносные линии фиксированной длины;
* false – выносные линии нефиксированной длины.
Свойство также доступно через системную переменную DIMFXLON и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMFXLON будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMFXLON.
Returns: Возвращает тип данных bool:
* true – выносные линии фиксированной длины;
* false – выносные линии нефиксированной длины.
Example
Пример изменения признака использования фиксированной длины выносных линий (значения свойства DimfxlenOn) через .NET API приведен в примере к описанию свойства Dimfxlen.

Teigha.DatabaseServices.DimStyleTableRecord.Dimfxlen
Свойство отвечает за длину выносных линий размеров когда DimfxlenOn = true.
В свойстве хранится длина выносных линий фиксированной длины в виде числа double. Значение по умолчанию 1. Это число учитывается в отображении размеров, когда DimfxlenOn = true.
Свойство также доступно через системную переменную DIMFXL и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMFXL будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMFXL.
Returns: Возвращает тип данных double.
Example
Пример изменения фиксированной длины выносных линий (значения свойства Dimfxlen) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimsah
Свойство предназначено для контроля генерации отдельных окончаний размерных линий.
В свойстве хранится настройка генерации отдельных окончаний размерных линий. Значение свойства связано со значением одноименной системной переменной DIMSAH, в которой хранится текущая настройка генерации отдельных окончаний размерных линий.
Возможны следующие значения:
* false – по Dimblk (по умолчанию). Для генерации обоих окончаний размерных линий линейных размеров берется значение свойства Dimblk, то есть оба окончания всегда будут одинаковыми;
* true – по Dimblk1 и Dimblk2. Для генерации первого окончания размерной линии линейных размеров берется значение свойства Dimblk1, для генерации второго окончания размерной линии линейных размеров берется значение свойства Dimblk2, то есть вид окончаний может быть разным.
При изменении системной переменной DIMSAH будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMSAH.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки генерации отдельных окончаний размерных линий (значения свойства Dimsah) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimblks
Свойство отвечает за вид окончаний размерных линий, когда Dimsah = False (окончания размерных линий по Dimblks).
В свойстве хранится настройка внешнего вида окончаний размерной линии в формате string. В строке записано название того вида окончания, который установлен в настоящий момент.
Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
При изменении системной переменной DIMBLKS будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMBLKS.
Также изменение вида окончания размерной линии возможно через системную переменную DIMBLK.
Таблица соответствия названий вида окончания и названий в настройках размерных стилей:
Значение       Значение
string	        в пользовательском интерфейсе
------------   --------------------------------------------------------------------------------------------
.              Значение по умолчанию, или  - "Закрашенная замкнутая"
ClosedBlank     - "Пустая замкнутая"
Closed          - "Замкнутая"
DOT             - "Точка"
ARCHTICK        - "Двойная засечка"
Oblique         - "Наклон"
Open            - "Разомкнутая"
Origin          - "Указатель начала"
Origin2         - "Указатель начала 2"
Open90          - "Прямой угол"
OPEN30          - "Разомкнутая 30"
DotSmall        - "Малая точка"
DotBlank        - "Контурная точка"
Small           - "Контурная малая точка"
BoxBlank        - "Прямоугольник"
BoxFilled       - "Закрашенный прямоугольник"
DatumBlank      - "Треугольник"
DatumFilled     - "Закрашенный треугольник"
Integral        - "Интеграл"
NONE            - "Нет"
Returns: Возвращает тип данных string.
Example
Пример изменения вида окончаний размерных линий, когда Dimsah = False (значения свойства Dimblks) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimblk
Свойство связано с Dimblks и хранит в себе настройку вида окончаний размерных линий.
В свойстве хранится текущая настройка внешнего вида окончаний размерной линии.
Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
При изменении системной переменной DIMBLK будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMBLK.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.DimStyleTableRecord.Dimblk1s
Свойство отвечает за вид первого окончания размерной линии, когда свойство Dimsah = True (окончания размерных линий по Dimblk1s и Dimblk2s).
В свойстве хранится настройка внешнего вида первого окончания линейного размера в формате строки (string). В строке записано название того окончания, которое установлено в настоящий момент.
Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
При изменении системной переменной DIMBLK1 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMBLK1.
Также изменение вида окончания размерной линии возможно через системную переменную DIMBLK1.
Таблица соответствия названий вида окончания и названий в настройках размерных стилей:
Значение       Значение
string	        в пользовательском интерфейсе
------------   --------------------------------------------------------------------------------------------
.              Значение по умолчанию, или  - "Закрашенная замкнутая"
ClosedBlank     - "Пустая замкнутая"
Closed          - "Замкнутая"
DOT             - "Точка"
ARCHTICK        - "Двойная засечка"
Oblique         - "Наклон"
Open            - "Разомкнутая"
Origin          - "Указатель начала"
Origin2         - "Указатель начала 2"
Open90          - "Прямой угол"
OPEN30          - "Разомкнутая 30"
DotSmall        - "Малая точка"
DotBlank        - "Контурная точка"
Small           - "Контурная малая точка"
BoxBlank        - "Прямоугольник"
BoxFilled       - "Закрашенный прямоугольник"
DatumBlank      - "Треугольник"
DatumFilled     - "Закрашенный треугольник"
Integral        - "Интеграл"
NONE            - "Нет"
Returns: Возвращает тип данных string.
Example
В качестве примера можно рассмотреть пример из описания свойства Dimblks. Принцип изменения Dimblk1s аналогичен. Перед тем, как работать со свойством Dimblk1s необходимо установить свойство Dimsah в значение true.

Teigha.DatabaseServices.DimStyleTableRecord.Dimblk1
Свойство связано со значением свойства Dimblk1s и хранит настройку внешнего вида первого окончания размерной линии в виде ObjectId блока окончания.
В свойстве хранится настройка внешнего вида первого окончания линейного размера в формате ObjectId. Свойство связано со значением свойства Dimblk1s. Оба свойства хранят настройку вида первого окончания размерной линии: Dimblk1s хранит название, Dimblk1 хранит ObjectId этого окончания.
Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
При изменении системной переменной DIMBLK1 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMBLK1.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.DimStyleTableRecord.Dimblk2s
Свойство отвечает за вид второго окончания размерной линии, когда свойство Dimsah = True (окончания размерных линий по Dimblk1s и Dimblk2s).
В свойстве хранится настройка внешнего вида второго окончания линейного размера в формате строки (string). В строке записано название того окончания, которое установлено в настоящий момент.
Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
При изменении системной переменной DIMBLK2 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMBLK2.
Также изменение вида окончания размерной линии возможно через системную переменную DIMBLK2.
Таблица соответствия названий вида окончания и названий в настройках размерных стилей:
Значение       Значение
string	        в пользовательском интерфейсе
------------   --------------------------------------------------------------------------------------------
.              Значение по умолчанию, или  - "Закрашенная замкнутая"
ClosedBlank     - "Пустая замкнутая"
Closed          - "Замкнутая"
DOT             - "Точка"
ARCHTICK        - "Двойная засечка"
Oblique         - "Наклон"
Open            - "Разомкнутая"
Origin          - "Указатель начала"
Origin2         - "Указатель начала 2"
Open90          - "Прямой угол"
OPEN30          - "Разомкнутая 30"
DotSmall        - "Малая точка"
DotBlank        - "Контурная точка"
Small           - "Контурная малая точка"
BoxBlank        - "Прямоугольник"
BoxFilled       - "Закрашенный прямоугольник"
DatumBlank      - "Треугольник"
DatumFilled     - "Закрашенный треугольник"
Integral        - "Интеграл"
NONE            - "Нет"
Returns: Возвращает тип данных string.
Example
В качестве примера можно рассмотреть пример из описания свойства Dimblks. Принцип изменения Dimblk2s аналогичен. Перед тем, как работать со свойством Dimblk2s необходимо установить свойство Dimsah в значение true.

Teigha.DatabaseServices.DimStyleTableRecord.Dimblk2
Свойство связано со значением свойства Dimblk2s и хранит настройку внешнего вида второго окончания размерной линии в виде ObjectId блока окончания.
В свойстве хранится настройка внешнего вида второго окончания линейного размера в формате ObjectId. Свойство связано со значением свойства Dimblk2s. Оба свойства хранят настройку вида второго окончания размерной линии: Dimblk2s хранит название, Dimblk2 хранит ObjectId этого окончания.
Каждый вид окончания является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний размерных линий хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через свойство Dimblks/Dimblk1s/Dimblk2s или через пользовательский интерфейс:
При изменении системной переменной DIMBLK2 будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMBLK2.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.DimStyleTableRecord.Dimldrblks
Свойство отвечает за вид окончания выноски.
В свойстве хранится настройка внешнего вида окончания выноски в виде строки string. В строке записано название того вида выноски, который в настоящий момент установлен.
Каждый вид окончания выноски является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний выносок хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через системную переменную DIMLDRBLK или через пользовательский интерфейс:
При изменении системной переменной DIMLDRBLK будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLDRBLK.
Также изменение вида окончания размерной линии возможно через системную переменную DIMLDRBLK.
Таблица соответствия названий вида окончания и названий в настройках размерных стилей:
Значение       Значение
string	        в пользовательском интерфейсе
------------   --------------------------------------------------------------------------------------------
.              Значение по умолчанию, или  - "Закрашенная замкнутая"
ClosedBlank     - "Пустая замкнутая"
Closed          - "Замкнутая"
DOT             - "Точка"
ARCHTICK        - "Двойная засечка"
Oblique         - "Наклон"
Open            - "Разомкнутая"
Origin          - "Указатель начала"
Origin2         - "Указатель начала 2"
Open90          - "Прямой угол"
OPEN30          - "Разомкнутая 30"
DotSmall        - "Малая точка"
DotBlank        - "Контурная точка"
Small           - "Контурная малая точка"
BoxBlank        - "Прямоугольник"
BoxFilled       - "Закрашенный прямоугольник"
DatumBlank      - "Треугольник"
DatumFilled     - "Закрашенный треугольник"
Integral        - "Интеграл"
NONE            - "Нет"
Returns: Возвращает тип данных string.
Example
Пример изменения значения свойства Dimldrblks в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimldrblk
Свойство отвечает за вид окончания выноски и зависит от значения свойства Dimldrblks.
В свойстве хранится ObjectId внешнего вида окончания выноски, который в настоящий момент установлен.
Каждый вид окончания выноски является блоком и в чертеже хранится, как тип данных BlockTableRecord в таблице блоков BlockTable.
Коллекция блоков - окончаний выносок хранится в шаблоне чертежа и через API недоступна. Отдельные блоки из этой коллекции появляются в таблице блоков чертежа после того, как к ним обратились через системную переменную DIMLDRBLK или через пользовательский интерфейс:
При изменении системной переменной DIMLDRBLK будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLDRBLK.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.DimStyleTableRecord.Dimasz
Свойство отвечает за размер стрелок в размерных линиях и выносках.
В свойстве хранится величина стрелок в размерных линиях и выносках в формате double. В качестве значений доступны положительные вещественные числа. Значение по умолчанию 2.5.
Свойство также доступно через системную переменную DIMASZ и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMASZ будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMASZ.
Returns: Возвращает тип данных double.
Example
Пример изменения величины стрелок в размерных линиях и выносках (значения свойства Dimasz) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimcen
Свойство отвечает за настройку меток и линий центра дуг и окружностей при нанесении на них размера.
В свойстве хранится число double, которое определяет размер маркера центра при нанесении на окружность размера-диаметра. Возможны следующие значения:
* 0 – нет центральных меток и линий;
(Dimcen = 0)
* lt;0 – центральные метки и линии, число указывает их размер;
(Dimcen = -3)
* gt;0 – только центральные линии, число указывает их размер.
(Dimcen = 3)
Свойство также доступно через системную переменную DIMCEN и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMCEN будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMCEN.
Returns: Возвращает тип данных double.
Return Value List
0 : при нанесении на окружность размера-диаметра или радиуса центральной метки и линий нет
lt;0 : при нанесении на окружность размера - диаметра или радиуса видны центральные метки и линии, число указывает их размер
gt;0 : при нанесении на окружность размера - диметра или радиуса видны только центральные линии, число указывает их размер
Example
Пример изменения настройки меток и линий центра дуг и окружностей (значения свойства Dimcen) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimarcsym
Свойство отвечает за размещение символов дуги в размерах длины дуги.
В свойстве хранится настройка размещения символов дуги в размерах длины дуги. В качестве значения свойства доступны следующие целые числа:
* 0 – перед текстом размера (по умолчанию);
* 1 – над текстом размера;
* 2 – не отображается.
Свойство также доступно через системную переменную DIMARCSYM и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMARCSYM будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMARCSYM.
Returns: Возвращает тип данных int.
Return Value List
0 : символ дуги размещен перед текстом размера в размерах длины дуги
1 : символ дуги размещен над текстом размера в размерах длины дуги
2 : символ дуги не отображается в размерах длины дуги
Example
Пример изменения настройки размещения символа дуги в размерах длины дуги (значения свойства Dimarcsym) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimjogang
Свойство отвечает за угол излома размерной линии радиуса.
В свойстве хранится величина угла излома (в радианах) размерной линии радиуса в виде числа double. Возможные значения – углы в радианах от п/36 до п/2 (от 0,08726646 до 1,57079632). Значение по умолчанию - п/4 (0,785).
Свойство также доступно через системную переменную DIMJOGANG и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMJOGANG будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMJOGANG.
Returns: Возвращает тип данных double.
Example
Пример изменения угла излома размерной линии радиуса (значения свойства Dimjogang) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtxsty
Свойство отвечает за настройку стиля размерного текста.
В свойстве хранится ObjectId текущего стиля размерного текста.
Свойство также доступно через системную переменную DIMTXSTY и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTXSTY будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTXSTY.
Returns: Возвращает тип данных ObjectId.
Example
Пример изменения стиля размерного текста (значения свойства Dimtxsty) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimclrt
Свойство отвечает за цвет текста, относящегося к размерам.
В свойстве хранится цвет текста, относящегося к размерам, в виде типа данных Teigha.Colors.Color. Помимо различных цветов для этого свойства доступны значения «BYBLOCK» и «BYLAYER». Значение по умолчанию – «BYBLOCK».
Свойство также доступно через системную переменную DIMCLRT и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMCLRT будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMCLRT.
Соответствия значений свойства Dimclrt в пользовательском интерфейсе и при работе с ним через .NET API:
Наименование   Наименование цвета   Как изменить через API
цвета в UI	    при считывании
через API
------------   ------------------   --------------------------------------------------------------------------
«По блоку»     BYBLOCK              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByBlock, 0)
«По слою»      BYLAYER              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByLayer, 256)
красный        red                  Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1)
желтый         yellow               Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 2)
зеленый        green                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 3)
голубой        cyan                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 4)
синий          blue                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5)
фиолетовый     magenta              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 6)
белый          white                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 7)
Returns: Возвращает тип данных Teigha.Colors.Color.
Return Value List
BYBLOCK : цвет текста, относящегося к размерам ПО БЛОКУ
BYLAYER : цвет текста, относящегося к размерам ПО СЛОЮ
red : цвет текста, относящегося к размерам КРАСНЫЙ
yellow : цвет текста, относящегося к размерам ЖЕЛТЫЙ
green : цвет текста, относящегося к размерам ЗЕЛЕНЫЙ
cyan : цвет текста, относящегося к размерам ГОЛУБОЙ
blue : цвет текста, относящегося к размерам СИНИЙ
magenta : цвет текста, относящегося к размерам ФИОЛЕТОВЫЙ
white : цвет текста, относящегося к размерам БЕЛЫЙ
Example
Пример изменения цвета текста, относящегося к размерам (значения свойства Dimclrt) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtfill
Свойство отвечает за настройку фоновой заливки размерного текста.
В свойстве хранится настройка фоновой заливки размерного текста. Свойство принимает в качестве значения целое число. Возможны следующие значения:
* 0 – без заливки (по умолчанию);
* 1 – цвета фона рисования;
* 2 – цвет указан в Dimtfillclr.
Свойство также доступно через системную переменную DIMTFILL и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTFILL будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTFILL.
Returns: Возвращает тип данных int.
Example
Пример изменения фоновой заливки размерного текста (значения свойства Dimtfill) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtfillclr
Свойство отвечает за цвет заливки фона размерного текста при Dimtfill = 2 ("By DIMTFILLCLR").
В свойстве хранится цвет заливки фона размерного текста в виде типа данных Teigha.Colors.Color. Значение свойства учитывается, когда свойство Dimtfill равно 2 («By DIMTFILLCLR»).
Соответствия значений свойства Dimtfillclr в пользовательском интерфейсе и при работе с ним через .NET API:
Наименование   Наименование цвета   Как изменить через API
цвета в UI	    при считывании
через API
------------   ------------------   --------------------------------------------------------------------------
«По блоку»     BYBLOCK              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByBlock, 0)
«По слою»      BYLAYER              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByLayer, 256)
красный        red                  Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 1)
желтый         yellow               Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 2)
зеленый        green                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 3)
голубой        cyan                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 4)
синий          blue                 Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 5)
фиолетовый     magenta              Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 6)
белый          white                Teigha.Colors.Color.FromColorIndex(Teigha.Colors.ColorMethod.ByColor, 7)
В таблице приведены стандартные цвета. При необходимости, можно создать цвет, не включенный в таблицу, используя RGB-модель и изменить цвет заливки текста на этот цвет. Значение Dimtfillclr по умолчанию – «По блоку».
Свойство Dimtfillclr также доступно через системную переменную DIMTFILLCLR и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTFILLCLR будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTFILLCLR.
Returns: Возвращает тип данных Teigha.Colors.Color.
Example
Пример изменения цвета заливки фона размерного текста (значения свойства Dimtfillclr) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtxt
Свойство отвечает за настройку величины размерного текста.
В свойстве хранится величина размерного текста.
Свойство также доступно через системную переменную DIMTXT и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTXT будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTXT.
Returns: Возвращает тип данных double.
Example
Пример изменения величины размерного текста (значения свойства Dimtxt) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtad
Свойство предназначено для контроля вертикальной позиции размерного текста.
В свойстве хранится настройка вертикальной позиции размерного текста.
Возможны следующие значения:
* 0 – центрирована – центрирован над размерной линией (по умолчанию);
* 1 – над размерной линией;
* 2 – наиболее удаленная – сторона размерной линии, наиболее удаленная от определяющих точек;
* 3 – стандарт JIS;
* 4 – под – текст под размерной линией.
Примечание: Если установлено «Над размерной линией», тогда этот параметр будет применен, если для Dimtih не установлено значение «Горизонтально» и размерная линия не горизонтальная.
Свойство также доступно через системную переменную DIMTAD и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTAD будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTAD.
Returns: Возвращает тип данных int.
Example
Пример изменения настройки вертикальной позиции размерного текста (значения свойства Dimtad) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimjust
Свойство отвечает за горизонтальную позицию размерного текста.
В свойстве хранится настройка размещения размерного текста по горизонтали в виде числа int. Возможны следующие значения:
* 0 – по центру над размерной линией (по умолчанию);
* 1 – у 1-й выносной линии;
* 2 – у 2-й выносной линии;
* 3 – над 1-й выносной линией;
* 4 – над 2-й выносной линией.
Свойство также доступно через системную переменную DIMJUST и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMJUST будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMJUST.
Returns: Возвращает тип данных int.
Return Value List
0 : размещение размерного текста по горизонтали - по центру над размерной линией (по умолчанию);
1 : размещение размерного текста по горизонтали - у 1-й выносной линии;
2 : размещение размерного текста по горизонтали - у 2-й выносной линии;
3 : размещение размерного текста по горизонтали - над 1-й выносной линией;
4 : размещение размерного текста по горизонтали - над 2-й выносной линией.
Example
Пример изменения горизонтальной позиции размерного текста (значения свойства Dimjust) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimgap
Свойство отвечает за величину отступа текста от размерной линии.
В свойстве хранится величина отступа текста от размерной линии в виде числа double. Доступные значения – положительные числа. Значение по умолчанию 1.0. Текст помещается внутри выносных линий, только если длина текста вместе с величиной Dimgap справа и слева, либо сверху и снизу не выходят за пределы выносных линий.
Свойство также доступно через системную переменную DIMGAP и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMGAP будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMGAP.
Returns: Возвращает тип данных double.
Example
Пример изменения величины отступа текста от размерной линии (значения свойства Dimgap) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtih
Свойство отвечает за настройку ориентации размерного текста для всех типов размеров, кроме ординатных, если текст вписывается внутри выносных линий.
В свойстве хранится текущая настройка ориентации размерного текста для всех типов размеров, кроме ординатных, если размерный текст вписывается внутри выносных линий. В качестве значения свойства доступны следующие:
* false – выравнивание по линии измерения, вдоль размерной линии;
* true – горизонтально (по умолчанию).
Свойство также доступно через системную переменную DIMTIH и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTIH будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTIH.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки ориентации размерного текста (значения свойства Dimtih) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtoh
Свойство отвечает за настройку ориентации размерного текста вне выносных линий.
В свойстве хранится текущая настройка ориентации размерного текста, который находится вне выносных линий. В качестве значения свойства доступны следующие:
* false – выравнивание по линии измерения;
* true – горизонтально (по умолчанию).
Свойство также доступно через системную переменную DIMTOH и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTOH будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTOH.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки ориентации размерного текста вне выносных линий (значения свойства Dimtoh) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimatfit
Свойство отвечает за размещение стрелок размерных линий и текста размера, когда на размерной линии не хватает места.
В свойстве хранится настройка размещения стрелок размерных линий и текста размера, когда на размерной линии не хватает места. В качестве значения свойства доступны следующие целые числа:
* 0 – текст и стрелки: размещение текста и стрелок за пределами выносных линий;
* 1 – стрелки, затем текст (стрелки): сначала перемещают стрелки, затем текст;
* 2 – текст, затем стрелки (текст): сначала перемещают текст, затем стрелки;
* 3 (значение по умолчанию) – либо текст, либо стрелки (оптимальное размещение): перемещение либо текста, либо стрелок.
Свойство также доступно через системную переменную DIMATFIT и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMATFIT будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMATFIT.
Returns: Возвращает тип данных int.
Return Value List
0 : когда на размерной линии не хватает места для текста или для стрелок,
текст и стрелки автоматически будут размещены за пределами выносных линий
1 : когда на размерной линии не хватает места для текста или для стрелок,
сначала за пределы вывносных линий перемещаются стрелки. Если после этого и для текста не хватает места,
то потом за пределы выносных линий перемещается текст. Если после перемещения стрелок за пределы
выносных линий для текста достаточно места, то текст не перемещается.
2 : когда на размерной линии не хватает места для текста или для стрелок,
сначала за пределы вывносных линий перемещаются текст. Если после этого и для стрелок не хватает места,
то потом за пределы выносных линий перемещаются стрелки. Если после перемещения текста за пределы
выносных линий для стрелок достаточно места, то стрелки не перемещаются.
3 : когда на размерной линии не хватает места для текста или для стрелок, то автоматически выбирается оптимальный вариант
и за пределы выносных линий перемещаются либо стрелки, либо текст.
Example
Пример изменения настройки размещения стрелок размерных линий и текста размера, когда на размерной линии не хватает места (значения свойства Dimatfit) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtix
Свойство отвечает за настройку размещения размерного текста внутри выносных линий.
В свойстве хранится текущая настройка размещения размерного текста внутри выносных линий. В качестве значения свойства доступны следующие варианты:
* false – если есть место, текст разместить внутри выносных линий (по умолчанию);
* true – всегда размещать размерный текст внутри выносных линий.
Свойство также доступно через системную переменную DIMTIX и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTIX будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTIX.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки размещения размерного текста внутри выносных линий (значения свойства Dimtix) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimsoxd
Свойство предназначено для контроля подавления размерных линий вне выносных линий.
В свойстве хранится настройка подавления размерных линий вне выносных линий.
Возможны следующие значения типа bool:
* false – не подавляется (по умолчанию);
* true – подавляется.
Свойство также доступно через системную переменную DIMSOXD и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMSOXD будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMSOXD.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки подавления размерных линий вне выносных линий (значения свойства Dimsoxd) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtmove
Свойство отвечает за настройку перемещения текста с позиции по умолчанию.
В свойстве хранится текущая настройка перемещения размерного текста с позиции по умолчанию. В качестве значения свойства доступны следующие целые числа:
* 0 – перемещать размерную линию с помощью размерного текста (по умолчанию);
* 1 – добавлять выноску к перемещенному размерному тексту;
* 2 – свободное перемещение текста без создания выноски.
Свойство также доступно через системную переменную DIMTMOVE и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTMOVE будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTMOVE.
Returns: Возвращает тип данных int.
Example
Пример изменения настройки перемещения текста с позиции по умолчанию (значения свойства Dimtmove) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimscale
Свойство предназначено для настройки масштаба размерных элементов.
В свойстве хранится масштаб размерных элементов – масштабный коэффициент, применяемый ко всем переменным измерения, которые регулируют размеры, смещения и расстояния.
Свойство принимает в качестве значения положительные числа. Значение по умолчанию 1. Значение 0 – «Разумное» значение, вычисляется для областей просмотра пространства модели.
Примечание: если задано отрицательное значение масштаба печати, указанные размеры будут соответствовать указанным размерам другими переменными измерения.
Свойство также доступно через системную переменную DIMSCALE и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMSCALE будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMSCALE.
Returns: Возвращает тип данных double.
Example
Пример изменения масштаба размерных элементов (значения свойства Dimscale) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimupt
Свойство отвечает за настройку перемещения размерного текста при перемещении размерных линий.
В свойстве хранится текущая настройка перемещения размерного текста при перемещении размерных линий. В качестве значения свойства доступны следующие:
* false – только размерная линия (по умолчанию);
* true – размерная линия и текст.
Свойство также доступно через системную переменную DIMUPT и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMUPT будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMUPT.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки перемещения размерного текста при перемещении размерных линий (значения свойства Dimupt) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtofl
Свойство отвечает за настройку отрисовки размерных линий между выносными, когда размерный текст находится за пределами выносных линий.
В свойстве хранится текущая настройка отрисовки размерных линий между выносными, когда размерный текст находится за пределами выносных линий. В качестве значения свойства доступны следующие:
* false – не отображать размерную линию между выносными, когда размерный текст расположен за пределами выносных линий (по умолчанию);
* true – отображать размерную линию между выносными, когда размерный текст расположен за пределами выносных линий.
Свойство также доступно через системную переменную DIMTOFL и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTOFL будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTOFL.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки отрисовки размерных линий между выносными, когда размерный текст находится за пределами выносных линий (значения свойства Dimtofl) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimlunit
Свойство отвечает за настройку формата единиц измерения в неугловых размерах.
В свойстве хранится текущая настройка формата единиц измерения в неугловых размерах в формате числа int.
Возможны следующие значения:
* 1 – Научные;
* 2 – Десятичные (по умолчанию);
* 3 – Дюймовые десятичные;
* 4 – Дюймовые дробные;
* 5 – Дробные;
* 6 – Microsoft Windows.
Свойство также доступно через системную переменную DIMLUNIT и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLUNIT будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLUNIT.
Returns: Возвращает тип данных int.
Return Value List
1 – формат единиц измерения в неугловых размерах - научный
2 – формат единиц измерения в неугловых размерах - десятичный (по умолчанию)
3 – формат единиц измерения в неугловых размерах - дюймовый десятичный
4 – формат единиц измерения в неугловых размерах - дюймовый дробный
5 – формат единиц измерения в неугловых размерах - дробный;
6 – формат единиц измерения в неугловых размерах - установленный в Microsoft Windows.
Example
Пример изменения формата единиц измерения в неугловых размерах (значения свойства Dimlunit) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimdec
Свойство отвечает за количество знаков после запятой в цифрах линейных размеров.
В свойстве хранится количество знаков после запятой или точность цифр линейных размеров в виде целого числа int. Значение по умолчанию 4.
Свойство также доступно через системную переменную DIMDEC и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMDEC будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMDEC.
Returns: Возвращает тип данных int. Возможный диапазон значений от 0 до 8.
Example
Пример изменения точности цифр линейных размеров (значения свойства Dimdec) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimfrac
Свойство отвечает за формат дроби, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные».
В свойстве хранится формат отображения дроби в виде числа int. Возможно несколько значений:
* 0 – горизонтальный разделитель (по умолчанию);
* 1 – косая черта;
* 2 – в одну строку.
Свойство также доступно через системную переменную DIMFRAC и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMFRAC будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMFRAC.
Returns: Возвращает тип данных int.
Return Value List
0 : дробь отображается с горизонтальным разделителем, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные»
1 : дробь отображается с косой чертой, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные»
2 : дробь отображается в одну строку, когда для линейных размеров выбран формат «Дюймовые дробные» или «Дробные»
Example
Пример изменения формата отображения дроби (значения свойства Dimfrac) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimrnd
Свойство отвечает за настройку округления измерений в размерах.
В свойстве хранится настройка измерений в размерах. Свойство принимает в качестве значения положительное число. Значение по умолчанию 0.0.
Свойство также доступно через системную переменную DIMRND и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMRND будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMRND.
Returns: Возвращает тип данных double.
Example
Пример изменения настройки округления измерений в размерах (значения свойства Dimrnd) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimpost
Свойство отвечает за настройку префикса и суффикса текста измерений в размерах.
В свойстве хранятся префикс и\или суффикс текста измерений в размерах в виде строки (string) в формате префиксlt;gt;суффикс. Значение по умолчанию – пустая строка.
Свойство также доступно через системную переменную DIMPOST и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMPOST будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMPOST.
Returns: Возвращает тип данных string.
Example
Пример изменения префикса и суффикса текста измерений (значения свойства Dimpost) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimlfac
Свойство отвечает за настройку множителя расстояния для измерений в линейных размерах.
В свойстве хранится множитель расстояния для измерений в линейных размерах. В качестве значения свойства доступны вещественные числа. Значение по умолчанию 1.0.
Свойство также доступно через системную переменную DIMLFAC и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLFAC будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLFAC.
Returns: Возвращает тип данных double.
Example
Пример изменения множителя расстояния в линейных размерах (значения свойства Dimlfac) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimzin
Свойство предназначено для настройки подавления нулей в линейных размерах.
В свойстве хранится настройка подавления нулей в линейных размерах. В качестве значений свойства доступны следующие целые числа:
* 0 – подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию);
* 1 – включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 2 – включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 3 – подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 4 – подавление ведущих десятичных нулей;
* 8 – подавление конечных десятичных нулей;
* 12 – подавление начальных и конечных десятичных нулей.
Первые три значения свойства влияют только если в чертеже установлены измерения в дюймах, последние три – если в чертеже установлены измерения в миллиметрах.
Примеры:
* «Подавление ведущих десятичных нулей»: было без подавления 0,005 – стало ,005;
* «Подавление конечных десятичных нулей»: было без подавления 0,5000 – стало 0,5;
* «Подавление начальных и конечных десятичных нулей»: было без подавления 0,5000 – стало ,5.
Свойство также доступно через системную переменную DIMZIN и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMZIN будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMZIN.
Returns: Возвращает тип данных int.
Example
Пример изменения настройки подавления нулей в линейных размерах (значения свойства Dimzin) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimaunit
Свойство отвечает за настройку формата единиц измерения в угловых размерах.
В свойстве хранится настройка формата единиц измерения в угловых размерах. В качестве значения свойства доступны следующие целые числа:
* 0 – десятичные градусы (по умолчанию);
* 1 – градусы-минуты-секунды;
* 2 – градианы;
* 3 – радианы;
* 4 – топографические.
Свойство также доступно через системную переменную DIMAUNIT и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMAUNIT будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMAUNIT.
Returns: Возвращает тип данных int.
Return Value List
0 : угловые размеры измеряются в десятичных градусах
1 : угловые размеры измеряются в градусах-минутах-секундах
2 : угловые размеры измеряются в градианах
3 : угловые размеры измеряются в радианах
4 : угловые размеры измеряются в топографическом формате
Example
Пример изменения формата единиц измерения в угловых размерах (значения свойства Dimaunit) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimadec
Свойство предназначено для настройки количества десятичных
знаков в угловых размерах.
В свойстве хранится количество десятичных знаков в угловых размерах. Значение свойства связано со значением одноименной системной переменной DIMADEC, в которой хранится текущее количество десятичных знаков в угловых размерах.
Возможны следующие значения свойства:
* -1 – по Dimdec (свойство принимает такое значение только через изменение системной переменной DIMADEC. Напрямую из класса DimStyleTableRecord оно недоступно);
* целочисленные значения в диапазоне от 0 до 8.
Свойство также доступно через пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMADEC будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMADEC.
Returns: Возвращает тип данных int.
Return Value List
0-8 : от 0 до 8 десятичных знаков после целой части значения углового размера.
Example
Пример изменения количества десятичных знаков в угловых размерах (значения свойства Dimadec) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimazin
Свойство отвечает за подавление десятичных нулей в угловых размерах.
В свойстве хранится настройка подавления десятичных нулей в угловых размерах. В качестве значения свойства доступны следующие целые числа:
* 0 – включены все нули (по умолчанию) – включены все ведущие и конечные нули;
* 1 – подавление ведущих нулей – подавление ведущих десятичных нулей (например, 0.005 с подавлением становится .005);
* 2 – подавление конечных нулей – подавление конечных десятичных нулей (например, 0.5000 с подавлением становится 0.5);
* 3 – подавление всех нулей – подавление начальных и конечных десятичных нулей (например, 0.5000 становится .5).
Свойство также доступно через системную переменную DIMAZIN и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMAZIN будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMAZIN.
Returns: Возвращает тип данных int.
Return Value List
0 : включены все нули (по умолчанию) – включены все ведущие и конечные нули
1 : подавление ведущих нулей – подавление ведущих десятичных нулей
2 : подавление конечных нулей – подавление конечных десятичных нулей
3 : подавление всех нулей – подавление начальных и конечных десятичных нулей
Example
Пример изменения настройки подавления десятичных нулей в угловых размерах (значения свойства Dimazin) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimalt
Свойство отвечает за настройку отображения альтернативных измерений в размерах.
В свойстве хранится текущая настройка отображения альтернативных измерений в размерах. В качестве значения свойства доступны следующие:
* false – отключено (по умолчанию);
* true – включено.
Свойство также доступно через системную переменную DIMALT и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALT будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALT.
Returns: Возвращает тип данных bool:
* true - отображение альтернативных измерений в размерах включено;
* false - отображение альтернативных измерений в размерах выключено.
Example
Пример изменения настройки отображения альтернативных измерений в размерах (значения свойства Dimalt) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimaltu
Свойство предназначено для настройки формата альтернативных единиц в размерах.
В свойстве хранится формат альтернативных единиц в размерах. В качестве значений свойства доступны следующие целые числа:
* 1 – научные;
* 2 – десятичные (по умолчанию);
* 3 – дюймовые десятичные;
* 4 – дюймовые дробные (--);
* 5 – дробные (--);
* 6 – дюймовые дробные;
* 7 – дробные;
* 8 – установленные в Windows.
Там, где в названии дробного формата есть символы (--), дробь отображается с горизонтальным разделителем числителя и знаменателя, в противном случае дробь отображается с косой чертой.
Свойство также доступно через системную переменную DIMALTU и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALTU будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALTU.
Returns: Возвращает тип данных int.
Return Value List
1 : научный формат альтернативных единиц в размерах
2 : десятичный формат альтернативных единиц в рамерах
3 : дюймовый десятичный формат альтернативных единиц в размерах
4 : дюймовый дробный формат (--) альтернативных единиц в размерах
5 : дробный формат (--) альтернативных единиц в размерах
6 : дюймовый дробный формат альтернативных единиц в размерах
7 : дробный формат альтернативных единиц в размерах
8 : формат альтернативных единиц в размерах, установленный в Windows
Example
Пример изменения формата альтернативных единиц в размерах (значения свойства Dimaltu) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimaltd
Свойство предназначено для настройки количества десятичных знаков в альтернативных измерениях в размерах.
В свойстве хранится настройка количества десятичных знаков в альтернативных измерениях в размерах. Доступно от 0 до 8 десятичных знаков. Значение по умолчанию 2.
Свойство также доступно через системную переменную DIMALTD и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALTD будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALTD.
Returns: Возвращает тип данных int.
Example
Пример изменения количества десятичных знаков в альтернативных измерениях в размерах (значения свойства Dimaltd) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimaltf
Свойство предназначено для настройки множителя расстояния альтернативных измерений в размерах.
В свойстве хранится множитель расстояния для альтернативных измерений в размерах. В свойстве могут храниться только положительные вещественные числа, кроме нуля. Значение по умолчанию 25,4.
Свойство также доступно через системную переменную DIMALTF и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALTF будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALTF.
Returns: Возвращает тип данных double.
Example
Пример изменения множителя расстояния альтернативных измерений в размерах (значения свойства Dimaltf) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimaltrnd
Свойство предназначено для настройки округления альтернативных измерений в размерах.
В свойстве хранится значение точности округления альтернативных измерений в размерах. В свойстве могут храниться только положительные вещественные числа. Значение по умолчанию 0 означает, что округления нет.
Свойство также доступно через системную переменную DIMALTRND и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALTRND будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALTRND.
Returns: Возвращает тип данных double.
Example
В качестве примера работы со свойством Dimaltrnd можно рассмотреть пример, приведенный в описании свойства Dimrnd, заменив в нем Dimrnd на Dimaltrnd и добавив проверку признака отображения альтернативных измерений (значения свойства Dimalt) с изменением его на true (включить отображение альтернативных измерений), если оно равно false (отображение альтернативных измерений отключено).

Teigha.DatabaseServices.DimStyleTableRecord.Dimapost
Свойство отвечает за префикс и суффикс в альтернативных измерениях в размерах.
В свойстве хранится префикс и/или суффикс, которые должны быть добавлены к тексту альтернативных измерений в размерах, в виде строки string. Запись хранится в формате «префикс[]суффикс». Если есть суффикс и нет префикса, то в записи вместо суффикса ничего не пишется: «префикс[]» и наоборот.
Свойство также доступно через системную переменную DIMAPOST и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMAPOST будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMAPOST.
Returns: Возвращает тип данных string.
Example
В качестве примера работы со свойством Dimapost можно рассмотреть пример, приведенный в описании свойства Dimpost, заменив в нем Dimpost на Dimapost и добавив проверку признака отображения альтернативных измерений (значения свойства Dimalt) с изменением его на true (включить отображение альтернативных измерений), если оно равно false (отображение альтернативных измерений отключено).

Teigha.DatabaseServices.DimStyleTableRecord.Dimaltz
Свойство предназначено для настройки подавления нулей в альтернативных измерениях в размерах.
В свойстве хранится настройка подавления нулей в альтернативных измерениях в размерах. В качестве значений свойства доступны следующие целые числа:
* 0 – подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию);
* 1 – включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 2 – включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 3 – подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 4 – подавление ведущих десятичных нулей;
* 8 – подавление конечных десятичных нулей;
* 12 – подавление начальных и конечных десятичных нулей.
Первые три значения свойства влияют только если в чертеже установлены измерения в дюймах, последние три – если в чертеже установлены измерения в миллиметрах.
Примеры:
* «Подавление ведущих десятичных нулей»: было без подавления 0,005 – стало ,005;
* «Подавление конечных десятичных нулей»: было без подавления 0,5000 – стало 0,5;
* «Подавление начальных и конечных десятичных нулей»: было без подавления 0,5000 – стало ,5.
Свойство также доступно через системную переменную DIMALTZ и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALTZ будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALTZ.
Returns: Возвращает тип данных int.
Return Value List
0 : подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию)
1 : включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
2 : включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
3 : подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
4 : подавление ведущих десятичных нулей
8 : подавление конечных десятичных нулей
12 : подавление начальных и конечных десятичных нулей
Example
В качестве примера работы со свойством Dimaltz можно рассмотреть пример, приведенный в описании свойства Dimzin, заменив в нем Dimzin на Dimaltz и добавив проверку признака отображения альтернативных измерений (значения свойства Dimalt) с изменением его на true (включить отображение альтернативных измерений), если оно равно false (отображение альтернативных измерений отключено).

Teigha.DatabaseServices.DimStyleTableRecord.Dimtol
Свойство отвечает за отображение текста допуска в измерениях.
В свойстве хранится текущая настройка отображения текста допуска в измерениях. В качестве значения свойства доступны следующие:
* false – не отображать текст допуска (по умолчанию);
* true – отображать текст допуска (симметричный).
Свойство также доступно через системную переменную DIMTOL и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTOL будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTOL.
Returns: Возвращает тип данных bool.
Example
Пример изменения настройки отображения текста допуска в измерениях (значения свойства Dimtol) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimlim
Свойство отвечает за настройку отображения предельных допусков размеров.
В свойстве хранится настройка отображения предельных допусков размеров. В качестве значения свойства доступны следующие:
* true – отображение пределов размеров включено;
* false – отображение пределов размеров выключено.
Свойство также доступно через системную переменную DIMLIM и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMLIM будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMLIM.
Returns: Возвращает тип данных bool:
* true – отображение пределов размеров включено;
* false – отображение пределов размеров выключено.
Example
Пример изменения настройки отображения предельных допусков размеров (значения свойства Dimlim) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtdec
Свойство предназначено для настройки количества десятичных знаков в значениях допуска основных единиц измерения.
В свойстве хранится настройка количества десятичных знаков в значениях допуска основных единиц измерения в виде целого числа. Возможны значения в диапазоне от 0 до 8.
Свойство также доступно через системную переменную DIMTDEC и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTDEC будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTDEC.
Returns: Возвращает тип данных int.
Example
В качестве примера работы со свойством Dimtdec можно рассмотреть пример, приведенный в описании свойства Dimdec. В примере нужно заменить Dimdec на Dimtdec и убедиться, что включено отображение допусков в размерах, добавив проверку значения свойства Dimtol(отображение симметричных допусков) или Dimlim (отображение максимального и мнимального допуска) с изменением его на true, если оно равно false.

Teigha.DatabaseServices.DimStyleTableRecord.Dimtp
Свойство отвечает за настройку верхнего предела допуска для размеров.
В свойстве хранится текущее значение верхнего предела допуска. В качестве значения свойства доступны вещественные числа.
Свойство также доступно через системную переменную DIMTP и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTP будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTP.
Returns: Возвращает тип данных double.
Example
Пример изменения верхнего предела допуска (значения свойства Dimtp) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtm
Свойство отвечает за настройку минимального (нижнего) значения предела допуска.
В свойстве хранится текущая настройка минимального (нижнего) значения предела допуска. В качестве значения свойства доступны вещественные числа.
Свойство также доступно через системную переменную DIMTM и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTM будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTM.
Returns: Возвращает тип данных double.
Example
Пример изменения минимального (нижнего) значения предела допуска (значения свойства Dimtm) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtfac
Свойство отвечает за настройку высоты текста допуска и дробей в размерах.
В свойстве хранится коэффициент масштабирования высоты текста допуска и дробей относительно величины основного размерного текста. В качестве значения свойства допускаются положительные вещественные числа больше 0. Значение по умолчанию 1.
Свойство также доступно через системную переменную DIMTFAC и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTFAC будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTFAC.
Также значение свойства Dimtfac можно увидеть в пользовательском интерфейсе в настройках размерного текста, но там оно не доступно для изменений:
Returns: Возвращает тип данных double.
Example
Пример изменения высоты текста допуска и дробей в размерах (значения свойства Dimtfac) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimtolj
Свойство отвечает за вертикальное выравнивание текста допуска по отношению к тексту размера.
В свойстве хранится текущая настройка вертикального выравнивания текста допуска по отношению к тексту размера. В качестве значения свойства доступны следующие:
* 0 – внизу;
* 1 – по середине (по умолчанию)
* 2 – вверху.
Свойство также доступно через системную переменную DIMTOLJ и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTOLJ будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTOLJ.
Returns: Возвращает тип данных int.

Teigha.DatabaseServices.DimStyleTableRecord.Dimtzin
Свойство предназначено для настройки подавления нулей в значениях допуска линейных размеров.
В свойстве хранится настройка подавления нулей в линейных размерах. В качестве значений свойства доступны следующие целые числа:
* 0 – подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию);
* 1 – включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 2 – включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 3 – подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 4 – подавление ведущих десятичных нулей;
* 8 – подавление конечных десятичных нулей;
* 12 – подавление начальных и конечных десятичных нулей.
Первые три значения свойства влияют только если в чертеже установлены измерения в дюймах, последние три – если в чертеже установлены измерения в миллиметрах.
Примеры:
* «Подавление ведущих десятичных нулей»: было без подавления 0,005 – стало ,005;
* «Подавление конечных десятичных нулей»: было без подавления 0,5000 – стало 0,5;
* «Подавление начальных и конечных десятичных нулей»: было без подавления 0,5000 – стало ,5.
Свойство также доступно через системную переменную DIMTZIN и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMTZIN будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTZIN.
Returns: Возвращает тип данных int.
Example
В качестве примера работы со свойством Dimaltz можно рассмотреть пример, приведенный в описании свойства Dimzin, заменив в нем Dimzin на Dimtzin и добавив проверку, включено ли отображение допусков (для этого нужно проверить значение свойства Dimtol/Dimlim с изменением его на true (включить отображение), если оно равно false).

Teigha.DatabaseServices.DimStyleTableRecord.Dimtvp
Свойство отвечает за настройку расстояния между размерной линией и серединой размерного текста.
В свойстве хранится текущее значение расстояния между размерной линией и серединой размерного текста. В качестве значения свойства доступны вещественные числа. Значение по умолчанию 0.0.
Свойство также доступно через системную переменную DIMTVP.
При изменении системной переменной DIMTVP будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTVP.
Returns: Возвращает тип данных double.
Example
Пример изменения расстояния между размерной линией и серединой размерного текста (значения свойства Dimtvp) в размерном стиле Standard:
C#

Teigha.DatabaseServices.DimStyleTableRecord.Dimalttd
Свойство предназначено для настройки количества десятичных знаков в значениях допуска в альтернативных измерениях в размерах.
В свойстве хранится количество разрядов после запятой в значениях допуска альтернативных измерений в размерах. В качестве значений свойства доступны целые числа в диапазоне от 0 до 8.
Свойство также доступно через системную переменную DIMALTTD и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALTTD будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALTTD.
Returns: Возвращает тип данных int.
Example
В качестве примера работы со свойством Dimalttd можно рассмотреть пример, приведенный в описании свойства Dimaltd, заменив в нем Dimaltd на Dimalttd.

Teigha.DatabaseServices.DimStyleTableRecord.Dimalttz
Свойство предназначено для настройки подавления нулей в значениях допуска в альтернативных измерениях в размерах.
В свойстве хранится настройка подавления нулей в значениях допуска альтернативных измерений в размерах. В качестве значений свойства доступны следующие целые числа:
* 0 – подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию);
* 1 – включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 2 – включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 3 – подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются;
* 4 – подавление ведущих десятичных нулей;
* 8 – подавление конечных десятичных нулей;
* 12 – подавление начальных и конечных десятичных нулей.
Первые три значения свойства влияют только если в чертеже установлены измерения в дюймах, последние три – если в чертеже установлены измерения в миллиметрах.
Примеры:
* «Подавление ведущих десятичных нулей»: было без подавления 0,005 – стало ,005;
* «Подавление конечных десятичных нулей»: было без подавления 0,5000 – стало 0,5;
* «Подавление начальных и конечных десятичных нулей»: было без подавления 0,5000 – стало ,5.
Свойство также доступно через системную переменную DIMALTTZ и пользовательское меню в окне изменения/создания размерного стиля:
При изменении системной переменной DIMALTTZ будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMALTTZ.
Returns: Возвращает тип данных int.
Return Value List
0 : подавление ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются (значение по умолчанию)
1 : включение ноль футов и ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
2 : включение ноль футов и подавление ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
3 : подавление ноль футов и включение ровно ноль дюймов, ведущие и конечные десятичные нули не подавляются
4 : подавление ведущих десятичных нулей
8 : подавление конечных десятичных нулей
12 : подавление начальных и конечных десятичных нулей
Example
В качестве примера работы со свойством Dimalttz можно рассмотреть пример, приведенный в описании свойства Dimaltz, заменив в нем Dimaltz на Dimalttz.

Teigha.DatabaseServices.DimStyleTableRecord.IsModifiedForRecompute
Свойство предназначено для получения состояния размерного стиля для обновления всех объектов, ссылающихся на этот стиль.
Свойство предназначено для быстрого получения состояния размерного стиля для обновления всех объектов, которые ссылаются на него. В качестве значений свойства доступны следующие варианты:
* true - размерный стиль был изменен, нужно обновить все объекты, которые ссылаются на него;
* false – размерный стиль не был изменен.
Returns: Возвращает тип данных bool.

Teigha.DatabaseServices.DimStyleTableRecord.Dimtsz
Свойство отвечает за настройку размеров архитектурных тиков, отрисованных вместо стрелок для линейных, радиальных и диаметральных размеров.
В свойстве хранится текущая настройка размеров архитектурных тиков. Если значение этого свойства 0, то в качестве окончаний размерных линий берется значение свойств Dimblk, Dimldrblk, Dimblk1, Dimblk1, Dimblk2, Dimblk2. Если значение этого свойства больше 0, то на окончаниях размерных линий отрисовываются архитектурные тики и их размер равен значению свойства.
Свойство также доступно через системную переменную DIMTSZ.
При изменении системной переменной DIMTSZ будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMTSZ.
Returns: Возвращает тип данных double.

Teigha.DatabaseServices.DimStyleTableRecord.Dimdsep
Свойство отвечает за настройку разделителя в десятичных дробях измерений.
В свойстве хранится текущая настройка разделителя в десятичных дробях измерений в виде символа char. Возможны следующие значения:
* ‘.’ – точка (по умолчанию);
* ‘,’ – запятая;
* ‘ ’ – пробел.
Свойство также доступно через системную переменную DIMDSEP.
При изменении системной переменной DIMDSEP будет создан новый размерный стиль под названием lt;переопределениеgt; на основе текущего с новым значением DIMDSEP.
Returns: Возвращает тип данных char.
Return Value List
. : разделитель в десятичных дробях между целой и дробной частью - точка
, : разделитель в десятичных дробях между целой и дробной частью - запятая
: разделитель в десятичных дробях между целой и дробной частью - пробел