HostMgd.ApplicationServices.TabbedDialogAction
Делегат используется для определения действий в диалоговых окнах с вкладками.
Делегат TabbedDialogAction используется классом TabbedDialogExtension для определения действий в диалоговых окнах с вкладками.