HostMgd.EditorInput.Editor.PromptedForInteger
Событие возникает после завершения операции ввода целого числа пользователем в редакторе nanoCAD.
Событие не реализовано.
Событие инициируется, когда пользователь завершает ввод целочисленного значения
через интерактивную команду — например, с помощью метода GetInteger().
Оно предоставляет результат ввода, включая значение, статус (OK, Cancel, Error)
и строковое представление введённых данных. Это событие используется для обработки
или анализа введённого числа, а также для выполнения действий на основе ввода пользователя.
Событие реализуется через делегат PromptIntegerResultEventHandler,
который передаёт данные о вводе в виде объекта PromptIntegerResultEventArgs.
Example
C#