Teigha.DatabaseServices.BlockScaling
Перечисление BlockScaling определяет тип масштабирования для вхождений блока, связанного с записью таблицы блоков.
Перечисление BlockScaling определяет тип масштабирования для вхождений блока, связанного с записью таблицы блоков (произвольное или равномерное).