Teigha.GraphicsInterface.Linetype
Перечисление Linetype определяет типы линий, которые применяются при отрисовке рёбер.
Перечисление Linetype определяет типы линий, которые применяются при отрисовке рёбер.