Teigha.DatabaseServices.DgnReference
Этот класс представляет в чертеже ссылки подложек DGN.
Этот класс представляет в чертеже ссылки подложек DGN.
Подложки аналогичны растровым изображениям, за исключением того, что их контент допускает привязки.

Teigha.DatabaseServices.DgnReference.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DgnReference.#ctor(IntPtr,System.Boolean)
Конструктор класса DgnReference.
Конструктор класса DgnReference.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.