Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties
Метод позволяет получить массо-центровочные характеристики данного объекта топологии. Предполагается равномерная единичная плотность, а точность определяется глобальными настройками.
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с полной цепочкой преобразований из пути подобъекта, применяемых там, где это уместно. Предполагается равномерная единичная плотность.
Требуемая и достигаемая точности определяются глобальными настройками.
Notes
Массо-центровочные характеристики определены лишь для тех объектов, для которых определено свойство объема.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип MassProperties.