Teigha.DatabaseServices.OleDvAspect.DocPrint
Значение: 8. Представление объекта на экране так, как если бы он был распечатан на принтере с помощью команды "Печать" из меню "Файл".
Отображаемые данные могут представлять собой последовательность страниц.