Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.ToDatabaseSummaryInfo
Метод предназначен для получения объекта DatabaseSummaryInfo, содержащий все подготовленные для него данные.
Метод предназначен для получения объекта DatabaseSummaryInfo, содержащий все подготовленные для него данные.
Returns: Возвращает объект DatabaseSummaryInfo.