Teigha.DatabaseServices.RegAppTableRecord
Экземпляры этого класса представляют записи в таблице RegAppTable (известной как таблица символов APPID в DXF).
Каждая из этих записей представляет собой ID приложения, используемый для идентификации группы расширенных данных, прикрепленных к объектам в базе данных чертежа.
Экземпляры этого класса представляют записи в таблице RegAppTable (известной как таблица символов APPID в DXF).
Каждая из этих записей представляет собой ID приложения, используемый для идентификации группы расширенных данных, прикрепленных к объектам в базе данных чертежа.

Teigha.DatabaseServices.RegAppTableRecord.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.