HostMgd.PlottingServices.PlotToFileCapability
Данное перечисление определяет возможность печати в файл для объекта PlotConfig.
Перечисление PlotToFileCapability определяет возможность печати в файл для объекта PlotConfig.