Teigha.DatabaseServices.Spline.ToPolyline
Метод позволяет получить полилинию, которая аппроксимирует данный сплайн.
Метод позволяет получить полилинию, которая аппроксимирует данный сплайн.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип Curve.