Teigha.DatabaseServices.PolylineVertex3d
Класс PolylineVertex3d представляет вершины 3D полилинии в nanoCAD.
Класс PolylineVertex3d представляет вершины 3D полилинии в nanoCAD.

Teigha.DatabaseServices.PolylineVertex3d.#ctor
Конструктор по умолчанию. Задает для вершины положение (0,0,0) и тип SimpleVertex.
Конструктор по умолчанию. Задает для вершины положение (0,0,0) и тип SimpleVertex.

Teigha.DatabaseServices.PolylineVertex3d.#ctor(Teigha.Geometry.Point3d)
Этот конструктор создает объект PolylineVertex3d с заданным положением в пространстве и типом SimpleVertex.
Этот конструктор создает объект PolylineVertex3d с заданным положением в пространстве и типом SimpleVertex.
param: Объект Point3d, задающий координаты создаваемой вершины в мировой системе координат (WCS).

Teigha.DatabaseServices.PolylineVertex3d.Position
Свойство обеспечивает доступ к положению вершины в виде объекта Point3d.
Свойство обеспечивает доступ к положению вершины в виде объекта Point3d.
Returns: Возвращает положение вершины в виде объекта Point3d.

Teigha.DatabaseServices.PolylineVertex3d.VertexType
Свойство предоставляет доступ к типу вершины из перечисления Vertex3dType.
Свойство предоставляет доступ к типу вершины из перечисления Vertex3dType.
Returns: Возвращает тип вершины из перечисления Vertex3dType.