Teigha.GraphicsInterface.DrawableType
Данное перечисление определяет тип объекта с точки зрения условий отрисовки.
Данное перечисление определяет тип отрисовываемого объекта.
По умолчанию тип отрисовки всех чертежей — Geometry.