Teigha.DatabaseServices.DwgFiler.ReadInt64
Метод предназначен для получения значения Int64 из текущего элемента данного объекта Filer.
Метод предназначен для получения значения Int64 из текущего элемента данного объекта Filer.
Returns: Возвращает значение текущего элемента данного объекта Filer. Тип long.