Teigha.DatabaseServices.ObjectId.&gt;
Возвращает true, если value1 больше value2.
Возвращает true, если value1 больше value2.
value1: Левый операнд, тип ObjectId.
value2: Правый операнд, тип ObjectId.
Returns: Возвращает true, если value1 больше value2, иначе - false.