Teigha.BoundaryRepresentation.EdgeLoopEnumerator
Класс EdgeLoopEnumerator представляет перечислитель циклов, связанных с ребром BREP.
Класс EdgeLoopEnumerator представляет перечислитель циклов, связанных с ребром BREP.

Teigha.BoundaryRepresentation.EdgeLoopEnumerator.Current
Свойство Current представляет текущий элемент данного перечислителя.
Свойство Current представляет текущий элемент данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип BoundaryLoop.