Teigha.Geometry.Vector3dCollection.DefaultSize
Поле DefaultSize представляет начальную ёмкость новой коллекции Vector3dCollection, создаваемой конструктором по умолчанию.
Поле DefaultSize представляет начальную ёмкость новой коллекции Vector3dCollection, создаваемой конструктором по умолчанию.
Returns: Возвращает ёмкость по умолчанию для новой коллекции. Тип int.