Teigha.DatabaseServices.Transaction
Класс реализует поддержку транзакций. Транзакции помогают расширить спектр связанных с объектом операций и избежать нежелательных конфликтных ситуаций. Кроме того, они повышают производительность, позволяя отложить операции закрытия всех открытых объектов до момента завершения транзакции.
Класс реализует поддержку транзакций.
Транзакции помогают расширить спектр связанных с объектом операций и избежать нежелательных конфликтных ситуаций. Кроме того, они повышают производительность, позволяя отложить операции закрытия всех открытых объектов до момента завершения транзакции.

Teigha.DatabaseServices.Transaction.#ctor(IntPtr,System.Boolean)
Конструктор.
Конструктор.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.Transaction.AddNewlyCreatedDBObject(Teigha.DatabaseServices.DBObject,System.Boolean)
Метод добавляет в транзакцию объект из вновь созданной записи в базе данных.
Метод добавляет в транзакцию объект из вновь созданной записи в базе данных.
Объект должен быть резидентным в базе данных (другими словами, он уже добавлен в базу данных и получил идентификатор ObjectId).
Операции добавления и удаления объектов выполняются в верхней транзакции.
obj: Добавляемый или удаляемый объект. Тип DBObject.
add: Флаг, указывающий, следует ли добавлять (значение true) или же удалять (значение false) объект.

Teigha.DatabaseServices.Transaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode)
Этот метод вызывает метод Open() верхней в стеке транзакции с передачей ему всех полученных аргументов, что избавляет от необходимости явным образом использовать указатель на эту транзакцию.
Этот метод вызывает метод Open() верхней транзакции с передачей ему всех полученных  аргументов.
Объекты могут быть получены только в рамках текущей, верхней в стеке транзакции, поэтому данный метод избавляет от необходимости как-то сохранять указатель на эту транзакцию, либо использовать TransactionManager.TopTransaction для его получения.
id: Идентификатор объекта, тип ObjectId.
mode: Режим доступа к объекту из перечисления OpenMode.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.Transaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean)
Этот метод вызывает метод Open() верхней транзакции.
Аргументы метода позволяют задать режим открытия объектов, а также включить доступ к удаленным объектам.
Для доступа к объектам этот метод вызывает метод Open() верхней транзакции с передачей ему всех полученных аргументов.
Поскольку объекты могут быть получены только в рамках верхней транзакции, данный метод избавляет от необходимости как-то сохранять указатель на эту транзакцию, либо использовать для его получения свойство  TransactionManager.TopTransaction.
Если логическое значение openErased равно true, то может быть получен даже удаленный объект.
Если openErased имеет значение false, то попытка получить удаленный объект приводит к ошибке.
id: Идентификатор объекта, тип ObjectId.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Флаг, указывающий, следует ли получать удаленные объекты.  Значение true позволяет открыть удаленный объект.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.Transaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Этот метод вызывает метод Open() верхней транзакции.
Аргументы метода позволяют задать режим открытия объектов, а также включить доступ к удаленным объектам и заблокированным слоям.
Для доступа к объектам этот метод вызывает метод Open() верхней транзакции с передачей ему всех полученных  аргументов.
Объекты могут быть получены только в рамках верхней транзакции, поэтому данный метод избавляет от необходимости как-то сохранять указатель на эту транзакцию, либо использовать для его получения свойство  TransactionManager.TopTransaction.
Если логическое значение openErased равно true, то может быть получен даже удаленный объект.
Если openErased имеет значение false, то попытка получить удаленный объект приводит к ошибке.
Если значение логического аргумента forceOpenOnLockedLayer равно true, то возможно использовать заблокированный слой. В случае значения false попытка обращения к заблокированному слою приведет к ошибке.
id: Идентификатор объекта, тип ObjectId.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Флаг, указывающий, следует ли получать удаленные объекты.  Значение true позволяет открыть удаленный объект.
forceOpenOnLockedLayer: Флаг, указывающий, следует ли открывать заблокированные слои.  Значение true позволяет открыть объект на заблокированном слое.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.Transaction.TransactionManager
Свойство предоставляет доступ к менеджеру транзакций, с которым связана данная транзакция.
Свойство предоставляет доступ к менеджеру транзакций, с которым связана данная транзакция.
Returns: Возвращает объект DatabaseServices.TransactionManager.