Teigha.DatabaseServices.RenderEnvironment
Класс RenderEnvironment представляет собой класс-контейнер для свойств, связанных с окружающей средой, таких как туман или общее изображение окружающей среды.
Класс RenderEnvironment представляет собой класс-контейнер для свойств, связанных с окружающей средой, таких как туман или общее изображение окружающей среды.

Teigha.DatabaseServices.RenderEnvironment.#ctor
Конструктор по умолчанию класса RenderEnvironment.
Конструктор по умолчанию класса RenderEnvironment.

Teigha.DatabaseServices.RenderEnvironment.Distances
Свойство Distances представляет расстояния для ближнего и дальнего тумана.
Свойство Distances представляет расстояния для ближнего и дальнего тумана.
Returns: Возвращает дальности для тумана. Тип DoubleRangeParameter.

Teigha.DatabaseServices.RenderEnvironment.EnvironmentImageEnabled
Свойство EnvironmentImageEnabled позволяет управлять режимом отображения окружающей среды.
Свойство EnvironmentImageEnabled позволяет управлять режимом отображения окружающей среды.
Returns: Возвращает true, если отображение окружающей среды включено.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderEnvironment.EnvironmentImageFileName
Свойство EnvironmentImageFileName представляет полное имя файла с изображением окружающей среды.
Свойство EnvironmentImageFileName представляет полное имя файла (включая путь) с изображением окружающей среды.
Returns: Возвращает полное имя файла изображения. Тип String.

Teigha.DatabaseServices.RenderEnvironment.FogBackgroundEnabled
Свойство FogBackgroundEnabled позволяет управлять учетом влияния тумана на фон.
Свойство FogBackgroundEnabled позволяет управлять учетом влияния тумана на фон.
Returns: Возвращает true, если режим влияния тумана на фон активен.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderEnvironment.FogColor
Свойство FogColor представляет цвет тумана.
Свойство FogColor представляет цвет тумана.
Returns: Возвращает цвет тумана. Тип Colors.EntityColor.

Teigha.DatabaseServices.RenderEnvironment.FogDensity
Свойство FogDensity представляет плотность ближнего и дальнего тумана.
Свойство FogDensity представляет плотность ближнего и дальнего тумана.
Returns: Возвращает плотность тумана.
Тип DoubleRangeParameter.

Teigha.DatabaseServices.RenderEnvironment.FogEnabled
Свойство FogEnabled управляет включением и выключением влияния тумана.
Свойство FogEnabled управляет включением и выключением влияния тумана.
Returns: Возвращает true, если влияние тумана учитывается.
В противном случае возвращает false.