Teigha.DatabaseServices.TransactionManager.StartOpenCloseTransaction
Этот метод создает должным образом инициализированный объект OpenCloseTransaction.
Этот метод создает должным образом инициализированный объект OpenCloseTransaction.