Teigha.DatabaseServices.FieldEngine
Класс FieldEngine управляет вычислением полей.
Класс FieldEngine управляет вычислением полей.
Notes
Объект FieldEngine является глобальным и в пределах сеанса создается лишь в единственном экземпляре.
Вычислители полей должны регистрировать свой загрузчик в этом движке на этапе старта приложения.

Teigha.DatabaseServices.FieldEngine.EvaluateFields(Teigha.DatabaseServices.Database,System.Int32,Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.ObjectIdCollection,String,Teigha.DatabaseServices.EvalFields)
Метод вычисляет поля в указанной базе данных.
Метод выполняет вычисление полей в указанной базе данных.
Notes
Параметр nContext может быть предопределенным флагом из перечисления FieldEvaluationOptions или определяемым пользователем флагом контекста; этот флаг контекста передается в вычислитель.
Вычисляются поля для объектов, которые соответствуют ненулевым идентификаторам из массива objIds.
Вычисляются поля с ненулевыми идентификаторами в массиве pFieldsToEvaluate.
Если этот параметр равен null, в указанных объектах вычисляются все поля.
Вычисляются только те поля, которые соответствуют ненулевым идентификаторам вычислителя pszEvaluatorId.
Если этот параметр равен null, в указанных объектах вычисляются все поля.
pDb: База данных, в которой вычисляются поля. Тип Database.
nContext: Контекст, в котором вычисляется поле. Тип int.
objIds: Массив идентификаторов объектов, поля которых вычисляются. Тип ObjectIdCollection.
pFieldsToEvaluate: Массив идентификаторов объектов полей, которые должны быть вычислены. Тип ObjectIdCollection.
pszEvaluatorId: Идентификатор вычислителя. Тип String.
nEvalFlag: Один или более флагов EvalFields. Тип EvalFields.
Returns: Возвращает объект с информацией о том, сколько полей найдено во время вычисления и сколько из них было вычислено.
Тип FieldUpdateResult.

Teigha.DatabaseServices.FieldEngine.FindEvaluator(Teigha.DatabaseServices.Field,String%)
Метод предоставляет вычислитель для указанного поля из набора зарегистрированных вычислителей, если поле не имеет идентификатора вычислителя.
Метод предоставляет вычислитель для указанного поля из набора зарегистрированных вычислителей, если поле не имеет идентификатора вычислителя.
pField: Поле, для которого требуется найти вычислитель. Тип Field.
pszEvalId: Возвращаемый идентификатор найденного вычислителя поля. Тип String.
Returns: Возвращает найденный вычислитель поля FieldEvaluator или null, если соответствующий вычислитель поля не найден.

Teigha.DatabaseServices.FieldEngine.GetEvaluator(String)
Метод предоставляет вычислитель поля FieldEvaluator по идентификатору вычислителя.
Метод предоставляет вычислитель поля FieldEvaluator по идентификатору вычислителя.
pszEvalId: Идентификатор вычислителя, по которому можно найти вычислитель поля. Тип String.
Returns: Возвращает найденный вычислитель поля FieldEvaluator или null, если соответствующий вычислитель поля не найден.

Teigha.DatabaseServices.FieldEngine.GetEvaluatorLoader(System.Int32)
Метод предоставляет загрузчик вычислителя поля с указанным индексом.
Метод предоставляет загрузчик вычислителя поля с указанным индексом.
В сочетании со свойством EvaluatorLoaderCount позволяет реализовать перечисление всех зарегистрированных загрузчиков вычислителей полей.
inputIndex: Входной индекс требуемого загрузчика вычислителя поля. Тип int.  Индекс отсчитывается от нуля, соответственно, должен быть меньше количества зарегистрированных загрузчиков вычислителей.
Returns: Возвращает загрузчик вычислителя поля, зарегистрированный под индексом inputIndex.
Тип FieldEvaluatorLoader.

Teigha.DatabaseServices.FieldEngine.RegisterEvaluatorLoader(Teigha.DatabaseServices.FieldEvaluatorLoader)
Метод регистрирует загрузчик вычислителя полей в движке FieldEngine.
Метод выполняет регистрацию загрузчика вычислителя полей в движке FieldEngine.
Notes
Вычислители полей должны регистрировать свой загрузчик в этом движке на этапе старта приложения.
Движок предоставляет подходящий вычислитель полей, просматривая список зарегистрированных загрузчиков вычислителей.
pLoader: Загрузчик вычислителя, который требуется зарегистрировать. Тип FieldEvaluatorLoader.

Teigha.DatabaseServices.FieldEngine.UnregisterEvaluatorLoader(Teigha.DatabaseServices.FieldEvaluatorLoader)
Метод отменяет в движке FieldEngine регистрацию загрузчика вычислителя полей.
Метод отменяет в движке FieldEngine регистрацию загрузчика вычислителя полей.
Notes
Модули вычислителей полей должны отменять регистрацию загрузчика вычислителя на этапе выгрузки модуля перед удалением объекта загрузчика.
pLoader: Загрузчик вычислителя, регистрация которого отменяется. Тип FieldEvaluatorLoader.

Teigha.DatabaseServices.FieldEngine.EvaluatorLoaderCount
Свойство EvaluatorLoaderCount возвращает количество зарегистрированных загрузчиков вычислителей полей.
Свойство EvaluatorLoaderCount возвращает количество зарегистрированных загрузчиков вычислителей полей.
Returns: Возвращает количество зарегистрированных загрузчиков вычислителей.
Тип int.

Teigha.DatabaseServices.FieldEngine.Global
Свойство Global предоставляет доступ к глобальному и единственному в текущем сеансе движку вычисления полей FieldEngine.
Свойство Global предоставляет доступ к глобальному и единственному в текущем сеансе движку вычисления полей FieldEngine.
Returns: Возвращает ссылку на глобальный в текущем сеансе движок вычисления полей.
Тип FieldEngine.