Teigha.DatabaseServices.PolygonMesh.MakeMClosed
Метод реализует замыкание сети PolygonMesh в направлении M.
Метод реализует замыкание сети PolygonMesh в направлении M.
Это означает, что сеть будет рассматриваться как непрерывная при переходе от последней строки к первой.