Teigha.DatabaseServices.FitData.GetHashCode
Метод предоставляет хеш-код данного объекта.
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает уникальный для каждого экземпляра класса целочисленный идентификатор. Тип int.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику - если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.