Teigha.Geometry.CompositeCurve2d
Класс CompositeCurve2d представляет двумерные составные кривые, которые состоят из произвольного количества подкривых, соединенных конец в конец.
Класс CompositeCurve2d представляет двумерную составную кривую, которая рассматривается как одна кривая, но состоящая из произвольного количества составляющих её подкривых, соединенных конец в конец.
Например, составная кривая может состоять из четырех прямолинейных сегментов, образующих квадрат.
Notes
Каждая из составляющих подкривых должна быть ограниченной кривой.
Это означает, что бесконечные линии и лучи не могут использоваться в качестве элементов составной кривой.
Объект CompositeCurve2d хранит список указателей на подкривые.  Начальный параметр составной кривой равен 0.0.  Значение параметра в конечной точке первой подкривой приблизительно равно длине первой подкривой (пусть это будет L1).  Значение параметра в конечной точке второй подкривой будет равно L1 плюс приблизительная длина второй подкривой и т.д.

Teigha.Geometry.CompositeCurve2d.#ctor(array)
Конструктор класса CompositeCurve2d.
Создает составную кривую из кривых в предоставленном списке.
Конструктор класса CompositeCurve2d.
Создает составную кривую из кривых в предоставленном массиве.
Notes
Кривые из этого массива должны быть соединены конец в конец.
Это означает, что начальная точка каждой кривой в массиве (кроме первой) должна совпадать с конечной точкой предыдущей кривой в массиве.
Проверка выполнения этого условия в конструкторе не предусмотрена.
curves: Массив кривых, из которых будет создана составная кривая.

Teigha.Geometry.CompositeCurve2d.Create(IntPtr,System.Boolean)
Метод предназначен для создания составной кривой на основе переданного указателя.
Метод предназначен для создания составной кривой на основе переданного указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора.  Тип bool.
Returns: Возвращает созданную составную кривую.
Тип CompositeCurve2d.

Teigha.Geometry.CompositeCurve2d.GlobalToLocalParameter(System.Double)
Метод позволяет получить локальное значение параметра подкривой, которое соответствует переданному глобальному параметрическому значению составной кривой.
Метод принимает значение параметра точки на составной кривой (global parameter) и возвращает значение локального параметра той же точки на соответствующей подкривой (local parameter).
Возвращаемый "составной параметр" хранит параметр на подкривой и индекс этой подкривой, соответствующий заданному глобальному параметру составной кривой.
value: Значение параметра точки на составной кривой.
Returns: Возвращает составной параметр, который включает значение параметра подкривой и индекс этой подкривой.
Тип CompositeParameter.

Teigha.Geometry.CompositeCurve2d.LocalToGlobalParameter(Teigha.Geometry.CompositeParameter)
Метод позволяет получить значение глобального параметра составной кривой, которое соответствует переданному локальному значению параметра подкривой.
Метод позволяет получить значение глобального параметра составной кривой, которое соответствует переданному локальному значению параметра подкривой.
value: Значение локального параметра подкривой.
Returns: Возвращает значение параметра точки на составной кривой.
Тип double.

Teigha.Geometry.CompositeCurve2d.SetCurves(array)
Метод позволяет переопределить массив подкривых, которые образуют данную составную кривую.
Метод позволяет переопределить массив подкривых, которые образуют данную составную кривую.
Notes
Кривые из массива curves при удалении составной кривой не удаляются.
curves: Входной массив новых составляющих подкривых.