HostMgd.EditorInput.SelectionSetDelayMarshalled.GetObjectIds
Возвращает массив Id выбранных объектов.

HostMgd.EditorInput.SelectionSetDelayMarshalled.GetObjectIds
Метод предоставляет массив идентификаторов объектов для всех элементов данного набора.
Не реализован.
Метод предоставляет массив идентификаторов объектов для всех элементов данного набора.
В текущей версии не реализован.
Returns: Возвращает массив идентификаторов объектов.
Тип Teigha.DatabaseServices.ObjectId[].