HostMgd.EditorInput.Editor.GetCommandVersion
Метод предоставляет номер версии текущей команды, используемой в стеке версий команд документа.
Метод используется для получения идентификатора версии команды,
которая в данный момент выполняется в контексте текущего документа.
Версия команды позволяет определить, какая реализация или модификация
команды активна, что может быть полезно при совместимости с разными
версиями nanoCAD или при отладке сложных командных последовательностей.
Returns: Возвращает значение типа int, представляющее номер версии текущей выполняемой команды.
Если команда не выполняется или версия не определена,
возвращается значение по умолчанию (например, 0).
Example
C#