Teigha.DatabaseServices.OsnapPointRef
Класс OsnapPointRef позволяет использовать объектную привязку для получения данных о связанной с размером геометрии.
Класс OsnapPointRef позволяет использовать объектную привязку для получения данных о связанной с размером геометрии.

Teigha.DatabaseServices.OsnapPointRef.#ctor
Конструктор по умолчанию класса OsnapPointRef.
Конструктор по умолчанию класса OsnapPointRef.

Teigha.DatabaseServices.OsnapPointRef.GetEntities(System.Boolean)
Метод предоставляет полные пути подобъектов, с которыми ассоциативно связан данный объект OsnapPointRef.
Метод предоставляет полные пути подобъектов, с которыми ассоциативно связан данный объект OsnapPointRef.
getLastPtRef: Входной флаг, который определяет, следует ли учитывать последнюю точку привязки, которая использовалась для перпендикулярного или касательного типа объектной привязки.
Returns: Возвращает массив полных путей подобъектов связанной геометрии.
Тип FullSubentityPath[].

Teigha.DatabaseServices.OsnapPointRef.IsXrefObj(Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.ObjectIdCollection,System.Boolean)
Метод проверяет, не является ли связанная геометрия внешней ссылкой (Xref).
Метод позволяет проверить, не является ли связанная с точкой привязки геометрия внешней ссылкой (Xref).
ids1: Первая коллекция идентификаторов объектов. Тип ObjectIdCollection.
ids2: Вторая коллекция идентификаторов объектов. Тип ObjectIdCollection.
isMainObj: Флаг, определяющий, является ли проверяемый объект основным. Тип bool.
Returns: Возвращает true, если связанная геометрия является внешней ссылкой.
В противном случае возвращает false.

Teigha.DatabaseServices.OsnapPointRef.UpdateDueToMirror(System.Boolean)
Метод обновляет состояние данного объекта при зеркальном отражении.
Метод обновляет состояние данного объекта при зеркальном отражении.
inMirror: Флаг, определяющий, находится ли данный объект в зеркально отраженном состоянии.  Тип bool.

Teigha.DatabaseServices.OsnapPointRef.UpdateSubentPath(Teigha.DatabaseServices.IdMapping)
Метод обновляет пути подобъектов, используя предоставленную карту идентификаторов.
Метод обновляет пути подобъектов, используя предоставленную карту сопоставления идентификаторов.
idMap: Входная карта идентификаторов для обновления путей подобъектов. Тип IdMapping.

Teigha.DatabaseServices.OsnapPointRef.IdPath
Свойство IdPath представляет полный путь подобъекта основной геометрии, связанной с данной точки привязки.
Свойство IdPath представляет полный путь подобъекта основной геометрии, связанной с данной точки привязки.
Returns: Возвращает полный путь подобъекта основной геометрии.
Тип FullSubentityPath.

Teigha.DatabaseServices.OsnapPointRef.IntIdPath
Свойство IntIdPath представляет полный путь подобъекта вторичной геометрии, связанной с данной точкой привязки.
Свойство IntIdPath представляет полный путь подобъекта вторичной геометрии, связанной с данным объектом OsnapPointRef.
Returns: Возвращает полный путь подобъекта вторичной геометрии для данной точки привязки.
Тип FullSubentityPath.

Teigha.DatabaseServices.OsnapPointRef.LastPointRef
Свойство LastPointRef обеспечивает доступ к последней точке привязки, которая использовалась
для перпендикулярного или касательного типа объектной привязки.
Свойство LastPointRef обеспечивает доступ к последней точке привязки, которая использовалась
для перпендикулярного или касательного типа объектной привязки.
Returns: Возвращает указатель на интересующую точку объектной привязки.
Тип OsnapPointRef.

Teigha.DatabaseServices.OsnapPointRef.NearPointParam
Свойство NearPointParam представляет параметр ближайшей точки связанной геометрии.
Свойство NearPointParam представляет параметр ближайшей точки связанной геометрии.
Returns: Возвращает параметр ближайшей точки.
Тип double.

Teigha.DatabaseServices.OsnapPointRef.OsnapType
Свойство OsnapType представляет тип объектной привязки (Osnap) для связанной геометрии.
Свойство OsnapType представляет тип объектной привязки (Osnap) для связанной геометрии.
Returns: Возвращает тип объектной привязки. Перечисление ObjectSnapModes.

Teigha.DatabaseServices.OsnapPointRef.Point
Свойство Point представляет текущие координаты данной точки привязки.
Свойство Point представляет текущие координаты данной точки привязки.
Returns: Возвращает координаты точки привязки.
Тип Point3d.

Teigha.DatabaseServices.OsnapPointRef.XrefHandles
Свойство XrefHandles представляет массив дескрипторов для основного геометрического объекта внешней ссылки.
Свойство XrefHandles представляет массив дескрипторов для основного геометрического объекта внешней ссылки.
Returns: Возвращает массив дескрипторов для основного геометрического объекта внешней ссылки.
Тип Handle[].

Teigha.DatabaseServices.OsnapPointRef.XrefIntHandles
Свойство XrefIntHandles представляет массив дескрипторов для вторичного геометрического объекта внешней ссылки.
Свойство XrefIntHandles представляет массив дескрипторов для вторичного геометрического объекта внешней ссылки.
Returns: Возвращает массив дескрипторов для вторичного геометрического объекта внешней ссылки.
Тип Handle[].