Teigha.GraphicsInterface.FaceData.GetTrueColors
Метод предоставляет массив цветов для граней, используемых этим объектом FaceData.
Метод предоставляет массив объектов EntityColor, по одному для каждой грани сети или оболочки, с которой используется этот объект FaceData.
Returns: Возвращает массив цветов для граней.
Тип EntityColor[].
Возвращает NULL, если массив цветов граней не был задан.