Teigha.DatabaseServices.AuditInfo.IncNumEntities
Метод увеличивает на единицу количество ошибок, которые в данном объекте AuditInfo учтены как обработанные.
Метод увеличивает на единицу количество ошибок, которые в данном объекте AuditInfo учтены как обработанные.