Teigha.DatabaseServices.Transaction.Commit
Этот метод фиксирует изменения, внесенные во все открытые во время транзакции объекты DBObjects, а затем закрывает эти объекты.
Этот метод фиксирует изменения, внесенные во все открытые во время транзакции объекты DBObjects, а затем закрывает эти объекты.