Teigha.DatabaseServices.XrefGraph.MarkUnresolvedTrees
Метод позволяет пометить флагом GraphNode.UnresTree все неразрешимые внешние ссылки и их вложенные внешние ссылки.
Не реализован.
Метод позволяет пометить флагом GraphNode.UnresTree все неразрешимые внешние ссылки и их вложенные внешние ссылки.
Возвращает значение true, если граф содержит неразрешимые внешние ссылки.
В текущей версии не реализован.
Returns: Возвращает true, если граф содержит неразрешимые внешние ссылки.
В противном случае возвращает false (значение по умолчанию).