HostMgd.ApplicationServices.SystemVariableChangedEventArgs
Содержит параметры, относящиеся к событиям изменения
системной переменной.

HostMgd.ApplicationServices.SystemVariableChangedEventArgs.Changed
Указывает, успешно ли выполнено изменение системной
переменной.

HostMgd.ApplicationServices.SystemVariableChangedEventArgs.Name
Возвращает имя измененной системной переменной.