Teigha.DatabaseServices.RenderGlobal
Класс RenderGlobal служит контейнером для всех глобальных свойств рендеринга.
Класс RenderGlobal служит контейнером для всех глобальных свойств рендеринга.
Резидентные объекты RenderGlobal базы данных хранятся в словаре NamedObjectsDictionary в разделе ACAD_RENDER_GLOBAL.

Teigha.DatabaseServices.RenderGlobal.#ctor
Конструктор по умолчанию класса RenderGlobal.
Конструктор по умолчанию класса RenderGlobal.

Teigha.DatabaseServices.RenderGlobal.Dimensions
Свойство Dimensions представляет размеры изображения для рендеринга.
Свойство Dimensions представляет размеры изображения для рендеринга.
Returns: Возвращает размеры изображения. Тип DimensionsParameter.

Teigha.DatabaseServices.RenderGlobal.ExposureType
Свойство ExposureType представляет текущий тип управления экспозицией в данном объекте.
Свойство ExposureType представляет текущий тип управления экспозицией в данном объекте (автоматический, логарифмический).
Returns: Возвращает тип управления экспозицией. Значение из перечисления DatabaseServices.ExposureType.

Teigha.DatabaseServices.RenderGlobal.HighInfoLevel
Свойство HighInfoLevel позволяет проверить, отображаются ли настройки в пользовательском интерфейсе с высоким уровнем детализации.
Свойство HighInfoLevel позволяет проверить, отображаются ли настройки в пользовательском интерфейсе с высоким уровнем детализации.
Returns: Возвращает true, если настройки отображаются с высоким уровнем детализации.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderGlobal.PredefinedPresetsFirst
Свойство PredefinedPresetsFirst позволяет определить, расположены ли предопределенные наборы настроек перед пользовательскими наборами настроек в пользовательском интерфейсе.
Свойство PredefinedPresetsFirst позволяет определить, расположены ли предопределенные наборы настроек перед пользовательскими наборами настроек в пользовательском интерфейсе.
Returns: Возвращает true, если предопределенные наборы настроек располагаются перед пользовательскими наборами.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestination
Свойство ProcedureAndDestination представляет тип контента и направление вывода для рендеринга.
Свойство ProcedureAndDestination представляет тип контента и направление вывода для рендеринга.
Returns: Возвращает текущее значение свойства как объект типа ProcedureAndDestinationParameter.

Teigha.DatabaseServices.RenderGlobal.SaveEnabled
Свойство SaveEnabled позволяет определить, следует ли сохранять визуализированное изображение в файле на диске.
Свойство SaveEnabled позволяет определить, следует ли сохранять визуализированное изображение в файле на диске.
Returns: Возвращает true, если сохранение результата рендеринга включено.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderGlobal.SaveFileName
Свойство SaveFileName представляет полный путь и имя файла изображения.
Свойство SaveFileName представляет полный путь и имя файла изображения.
Returns: Возвращает полное имя файла изображения (путь и имя). Тип String.