Teigha.DatabaseServices.Entity.IsContentSnappable
Метод проверяет, должен ли блок-контейнер участвовать в поиске точек объектной привязки (osnaps).
Данный метод определяет, будет ли выполняться поиск точек объектной привязки (osnaps) внутри содержащего блока.
Если метод возвращает true, это означает, что система должна исследовать блок на наличие точек привязки.
Если возвращается false, блок игнорируется при выполнении операций, связанных с объектной привязкой.
Returns: Возвращает тип данных bool:
*true - если блок должен участвовать в поиске точек osnaps;
*false - если блок должен быть проигнорирован.