Teigha.DatabaseServices.Handle.GetHashCode
Возвращает хэш-код для данного объекта.
Возвращает хэш-код для данного объекта. Подробности см. в документации Microsoft по .NET API.
Returns: Возвращает хэш-код для данного объекта, тип Int32.