Teigha.DatabaseServices.LayerTable.GenerateUsageData
Метод предназначен для обновления информации об использовании
слоёв в чертеже.
С помощью метода можно обновить информацию о задействовании
слоёв в чертеже. После отработки метода обновляется значение
свойства IsUsed каждой записи (LayerTableRecord)
таблицы слоёв LayerTable.