Teigha.GraphicsSystem.RenderType
Перечисление RenderType определяет типы рендеринга геометрии модели, поддерживаемые графической системой.
Перечисление RenderType определяет основные предопределенные и пользовательские типы рендеринга геометрии модели, поддерживаемые графической системой.