HostMgd.EditorInput.PromptSaveFileOptions
Этот класс содержит опции конфигурации окна диалога выбора
имени файла, которые передаются в метод
Editor.GetFileNameForSave().

HostMgd.EditorInput.PromptSaveFileOptions.DeriveInitialFilenameFromDrawingName
Используется для оценки, может ли имя файла по умолчанию быть
именем файла чертежа.

HostMgd.EditorInput.PromptSaveFileOptions.DisplaySaveOptionsMenuItem
Используется для оценки, должны ли быть параметры сохранения
отображены при выборе пункта меню.

HostMgd.EditorInput.PromptSaveFileOptions.ForceOverwriteWarningForScriptsAndLisp
Возвращает или устанавливает признак того, должно ли
переписанное предупреждающее сообщение быть отображено, даже
когда исполняется команда LISP или скрипта. Если он не
установлен, при исполнении команды LISP или скрипта
переписанное предупреждающее сообщение подавляется.

HostMgd.EditorInput.PromptSaveFileOptions.#ctor(System.String)
Конструктор.
message: Приглашающее сообщение