Teigha.DatabaseServices.FieldEvaluationResult
Данный класс представляет результат вычисления поля.
Данный класс представляет результат вычисления поля.

Teigha.DatabaseServices.FieldEvaluationResult.Evaluated
Свойство Evaluated возвращает количество вычисленных полей.
Свойство Evaluated возвращает количество вычисленных полей.
Returns: Возвращает количество вычисленных полей.  Тип int.

Teigha.DatabaseServices.FieldEvaluationResult.Found
Свойство Found возвращает количество найденных полей.
Свойство Found возвращает количество найденных полей.
Returns: Возвращает количество найденных полей. Тип int.