Teigha.GraphicsInterface.LuminanceMode.Luminance
Значение: 1.
Режим яркости, который будет использоваться для задания коэффициента физического масштабирования для источников света, которые не имеют физической основы.