Teigha.Geometry.EllipticalCylinder.GetAngles
Метод предоставляет текущие значения начального и конечного углов данного эллиптического цилиндра.
Метод предоставляет текущие значения начального и конечного углов данного эллиптического цилиндра с виде массива из двух элементов.
Первый элемент соответствует начальному углу эллиптического цилиндра (смещение угла, от которого строятся сегменты эллиптического цилиндра), а второй элемент соответствует конечному углу эллиптического цилиндра (смещение угла, до которого строятся сегменты эллиптического цилиндра).
Returns: Возвращает двухэлементный массив углов.
Первый элемент соответствует начальному углу, а второй элемент - конечному углу эллиптического цилиндра.
Тип double[].