Teigha.DatabaseServices.HatchPatternType.UserDefined
Значение: 0. Образец штриховки, созданный пользователем из линий. Определяется с использованием типа линий с указанными интервалом, углом наклона, цветом и прочими свойствами.