Teigha.DatabaseServices.DxfFiler.ReadResultBuffer
Метод считывает следующий элемент этого объекта Filer и возвращает буфер результатов.
Метод считывает следующий элемент этого объекта Filer и возвращает буфер результатов.
Returns: Возвращает буфер результатов. Тип ResultBuffer.