HostMgd.ApplicationServices.TabbedDialogExtension
Класс содержит информацию, необходимую для расширения
информации о диалоговом окне с вкладками.
Класс добавлен для совместимости.

HostMgd.ApplicationServices.TabbedDialogExtension.Control
Возвращает элемент управления, который заполняет диалоговое
окно.

HostMgd.ApplicationServices.TabbedDialogExtension.OnApply
Возвращает обработчик события, который вызывается, когда
пользователь нажимает на кнопку Apply в главном диалоге для
того, чтобы применить изменения.

HostMgd.ApplicationServices.TabbedDialogExtension.OnCancel
Возвращает обработчик события, который вызывается, когда в
главном диалоге производится отмена.

HostMgd.ApplicationServices.TabbedDialogExtension.OnHelp
Возвращает обработчик события, который вызывается, когда в
главном диалоге пользователь нажимает на кнопку Help.

HostMgd.ApplicationServices.TabbedDialogExtension.OnOk
Возвращает обработчик события, который вызывается, когда в
главном диалоге пользователь нажимает на кнопку OK, чтобы
применить изменения и закрыть диалог.

HostMgd.ApplicationServices.TabbedDialogExtension.SetDirty(System.Windows.Forms.Control,System.Boolean)
Устанавливает "грязный" бит (признак того, что объект был
изменен после последнего сохранения).
control: Объект, для которого устанавливается признак
dirty: Значение устанавливаемого признака

HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,HostMgd.ApplicationServices.TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут

HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,HostMgd.ApplicationServices.TabbedDialogAction,HostMgd.ApplicationServices.TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
Он также назначает обработчик события, определенный как
onCancel, выполняемый при нажатии на кнопку Cancel в
диалоговом окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут
onCancel: Объект, определяющий действия, которые будут

HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,HostMgd.ApplicationServices.TabbedDialogAction,HostMgd.ApplicationServices.TabbedDialogAction,HostMgd.ApplicationServices.TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
Назначает обработчик события, определенный как onCancel,
выполняемый при нажатии на кнопку Cancel в диалоговом окне.
Он также назначает обработчик события, определенный как
onHelp, выполняемый при нажатии на кнопку Help в диалоговом
окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут
onCancel: Объект, определяющий действия, которые будут
onHelp: Объект, определяющий действия, которые будут

HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,HostMgd.ApplicationServices.TabbedDialogAction,HostMgd.ApplicationServices.TabbedDialogAction,HostMgd.ApplicationServices.TabbedDialogAction,HostMgd.ApplicationServices.TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
Назначает обработчик события, определенный как onCancel,
выполняемый при нажатии на кнопку Cancel в диалоговом окне.
Назначает обработчик события, определенный как onHelp,
выполняемый при нажатии на кнопку Help в диалоговом окне. Он
также назначает обработчик события, определенный как onApply,
выполняемый при нажатии на кнопку Apply в диалоговом окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут
onCancel: Объект, определяющий действия, которые будут
onHelp: Объект, определяющий действия, которые будут
onApply: Объект, определяющий действия, которые будут