Teigha.DatabaseServices.TableCopyOptions.SkipDissimilarContentFormat
Значение: 16384 = 0x4000.
Не копировать формат содержимого, если типы содержимого различаются.
Игнорируется, если установлены флаги TableCopySkipFormat или TableCopySkipContentFormat.