Teigha.DatabaseServices.VertexRef
Класс VertexRef представляет ссылку на вершину объекта чертежа.
Класс VertexRef представляет ссылку на вершину объекта чертежа.

Teigha.DatabaseServices.VertexRef.#ctor
Конструктор по умолчанию класса VertexRef.
Конструктор по умолчанию класса VertexRef.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.FullSubentityPath)
Конструктор класса VertexRef. Создает ссылку на вершину объекта, для которого задан полный путь к подобъекту.
Конструктор класса VertexRef. Создает ссылку на вершину объекта, для которого задан полный путь к подобъекту.
path: Полный путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.Geometry.Point3d)
Конструктор класса VertexRef.
Создает ссылку на вершину, расположенную в указанной точке.
Конструктор класса VertexRef.
Создает ссылку на вершину, расположенную в указанной точке.
point: Входная точка. Тип Point3d.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.CompoundObjectId)
Конструктор класса VertexRef.
Создает ссылку на вершину на основе указанного составного объекта.
Конструктор класса VertexRef.
Создает ссылку на вершину на основе указанного составного объекта.
compoundObjectId: Входной идентификатор составного объекта.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId)
Конструктор класса VertexRef.
Создает ссылку на вершину на основе подобъекта указанного составного объекта.
Конструктор класса VertexRef.
Создает ссылку на вершину на основе подобъекта указанного составного объекта.
compoundObjectId: Входной идентификатор составного объекта. Тип CompoundObjectId.
subentId: Входной идентификатор подобъекта. Тип SubentityId.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Point3d)
Конструктор класса VertexRef.
Создает ссылку на вершину в заданной точке конкретного подобъекта заданного составного объекта.
Конструктор класса VertexRef.
Создает ссылку на вершину в заданной точке конкретного подобъекта заданного составного объекта.
compoundObjectId: Входной идентификатор составного объекта. Тип CompoundObjectId.
subentId: Входной идентификатор подобъекта. Тип SubentityId.
point: Входная точка. Тип Point3d.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.Entity)
Конструктор класса VertexRef.
Создает ссылку на вершину на основе указанного объекта чертежа.
Конструктор класса VertexRef.
Создает ссылку на вершину на основе указанного объекта чертежа.
entity: Входной объект чертежа, 3D-точка. Тип Teigha.DatabaseServices.Entity.

Teigha.DatabaseServices.VertexRef.Point
Свойство Point представляет координатную точку данной ссылки на вершину.
Свойство Point представляет координатную 3D-точку данной ссылки на вершину.
Returns: Возвращает координатную 3D-точку вершины. Тип Point3d.