Teigha.BoundaryRepresentation.Vertex
Класс Vertex является интерфейсным классом для вершин BREP.
Класс Vertex является интерфейсным классом для вершин BREP.
Вершины являются первичными элементами BREP с ассоциированной геометрией - 3D-точками.

Teigha.BoundaryRepresentation.Vertex.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса Vertex. Создает экземпляр класса, используя переданный путь подобъекта.
Конструктор класса Vertex. Создает экземпляр класса, используя переданный путь подобъекта.
fullSubentPath: Полный путь подобъекта.

Teigha.BoundaryRepresentation.Vertex.GetEdgesStartingFrom(Teigha.BoundaryRepresentation.Edge)
Метод позволяет получить коллекцию ребер, начиная с указанного стартового ребра.
Метод позволяет получить коллекцию ребер, начиная с указанного стартового ребра.
startFrom: Входное стартовое ребро.  Тип Edge.
Returns: Возвращает коллекцию ребер.  Тип VertexEdgeCollection.

Teigha.BoundaryRepresentation.Vertex.GetLoopsStartingFrom(Teigha.BoundaryRepresentation.BoundaryLoop)
Метод позволяет получить коллекцию циклов грани, начиная с указанного стартового цикла.
Метод позволяет получить коллекцию циклов грани, начиная с указанного стартового цикла.
startFrom: Стартовый цикл грани.  Тип BoundaryLoop.
Returns: Возвращает коллекцию циклов грани.  Тип VertexLoopCollection.

Teigha.BoundaryRepresentation.Vertex.Edges
Свойство Edges предоставляет доступ ко всем ребрам, связанным с данной вершиной.
Свойство Edges предоставляет доступ ко всем ребрам, связанным с данной вершиной.
Returns: Возвращает коллекцию ребер.  Тип VertexEdgeCollection.

Teigha.BoundaryRepresentation.Vertex.Loops
Свойство Loops предоставляет доступ ко всем циклам, связанным с данной вершиной.
Свойство Loops предоставляет доступ ко всем циклам, связанным с данной вершиной.
Returns: Возвращает коллекцию циклов.  Тип VertexLoopCollection.

Teigha.BoundaryRepresentation.Vertex.Point
Свойство Point предоставляет доступ к базовой точке данной вершины как к объекту Point3d.
Свойство Point предоставляет доступ к базовой точке данной вершины как к объекту Point3d.
К точке применяется вся цепочка преобразований из пути подобъекта соответствующего топологического объекта.
Returns: Возвращает базовую точку данной вершины.  Тип Point3d.