HostMgd.PlottingServices.PreviewEndPlotStatus.Next
Значение: 3.
Пользователь вышел из режима предварительного просмотра, нажав на панели инструментов
кнопку "Следующая страница" для предварительного просмотра следующего листа.