Teigha.DatabaseServices.CellRange.IEnumerableGetEnumerator
Метод позволяет получить перечислитель для этого диапазона ячеек.
Метод позволяет получить перечислитель для этого диапазона ячеек.
Returns: Возвращает перечислитель для диапазона ячеек. Тип IEnumerator.