Teigha.GraphicsInterface.DrawableOverrule
Класс предназначен для создания переопределения графического представления стандартных примитивов nanoCAD.
Класс предназначен для создания переопределения графического представления стандартных примитивов nanoCAD.
С помощью класса можно фактически рисовать окружность на чертеже, но она будет отображаться так, как задано в переопределении, например, линией.
Класс является абстрактным. Чтобы его использовать, необходимо унаследовать его другим классом. Далее, внутри этого класса можно переопределить методы
* SetAttributes(Drawable drawable, DrawableTraits traits), чтобы переопределить атрибуты отрисовки;
* ViewportDraw(Drawable drawable, ViewportDraw vd), чтобы переопределить геометрию, зависящую от видового экрана;
* ViewportDrawLogicalFlags(Drawable drawable, ViewportDraw vd), чтобы переопределить флаги отрисовки текущего видового экрана;
* WorldDraw(Drawable drawable, WorldDraw wd), чтобы переопределить геометрию, не зависящую от видового экрана.

Teigha.GraphicsInterface.DrawableOverrule.SetAttributes(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.DrawableTraits)
Данный метод переопределяет метод Drawable.SetAttributes.
Реализация по умолчанию вызывает метод Drawable.setAttributes.
Данный метод переопределяет метод Drawable.SetAttributes.
Реализация по умолчанию вызывает метод Drawable.setAttributes.
drawable: Объект Drawable, к которому применяется переопределение. Тип Drawable.
traits: Входной объект GraphicsInterface.DrawableTraits, который необходимо заполнить атрибутами. Тип GraphicsInterface.DrawableTraits.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributeFlags. Тип int.

Teigha.GraphicsInterface.DrawableOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD искал в словаре расширений запись с именем entryName.  Переопределения не будут вызываться, если запись с entryName не будет найдена в словаре расширений.
entryName: Входное имя записи. Тип String.

Teigha.GraphicsInterface.DrawableOverrule.SetIdFilter(array)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
ids: Входной массив идентификаторов объектов. Тип DatabaseServices.ObjectId[].

Teigha.GraphicsInterface.DrawableOverrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
registeredApplicationName: Входное имя зарегистрированного приложения.  Тип String.

Teigha.GraphicsInterface.DrawableOverrule.ViewportDraw(Teigha.GraphicsInterface.Drawable,GraphicsInterface.ViewportDraw)
Данный метод переопределяет метод Drawable.ViewportDraw.
Данный метод переопределяет метод Drawable.ViewportDraw.
Реализация по умолчанию вызывает метод Drawable.ViewportDraw.
drawable: Входной объект, к которому применяется переопределение. Тип Drawable.
vd: Входной интерфейс GraphicsInterface.ViewportDraw.

Teigha.GraphicsInterface.DrawableOverrule.ViewportDrawLogicalFlags(Teigha.GraphicsInterface.Drawable,GraphicsInterface.ViewportDraw)
Данный метод переопределяет метод Drawable.ViewportDrawLogicalFlags.
Реализация по умолчанию вызывает метод Drawable.ViewportDrawLogicalFlags.
Данный метод переопределяет метод Drawable.ViewportDrawLogicalFlags.
Реализация по умолчанию вызывает метод Drawable.ViewportDrawLogicalFlags.
drawable: Входной объект Drawable, к которому применяется переопределение. Тип Drawable.
vd: Входной интерфейс ViewportDraw. Тип GraphicsInterface.ViewportDraw.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributeFlags. Тип int.

Teigha.GraphicsInterface.DrawableOverrule.WorldDraw(Teigha.GraphicsInterface.Drawable,GraphicsInterface.WorldDraw)
Переопределяет метод Drawable.WorldDraw.
Реализация по умолчанию вызывает метод Drawable.WorldDraw.
Переопределяет метод Drawable.WorldDraw.
Реализация по умолчанию вызывает метод Drawable.WorldDraw.
drawable: Входной объект Drawable, к которому применяется переопределение. Тип Drawable.
wd: Входной интерфейс WorldDraw.  Тип GraphicsInterface.WorldDraw.
Returns: Возвращает true, только если геометрическое представление объекта не зависит от видового экрана.
Возвращаемое значение false указывает, что какая-то часть графики объекта зависит от видового представления, поэтому 3D GS должна дополнительно вызвать ViewportDraw(), чтобы для такого объекта получить законченную геометрию и полный набор атрибутов.