Teigha.DatabaseServices.UpdateOption.OverwriteContentModifiedAfterUpdate
Значение: 0x400000.
Выполняется перезапись всех изменений контента, внесенных в связанные данные с момента последнего обновления данных из источника.
Этот параметр действителен только при обновлении данных из источника (т.е. когда направление обновления принимает значение UpdateDirection.SourceToData).