HostMgd.EditorInput.CrossingOrWindowSelectedObject
Класс описывает объект, выбранный с помощью окна или многоугольника,
при этом учитывается, был ли выбор выполнен как "окно пересечения"
или "окно включения".
Класс является производным от SelectedObject и используется для представления объектов,
выбранных графическим способом — с помощью прямоугольного окна или полигональной рамки.
Он расширяет базовую информацию о выбранном объекте, добавляя данные о режиме выбора:
* окно включения — выбираются только объекты, полностью находящиеся внутри окна.
* окно пересечения — выбираются объекты, которые пересекаются или полностью
находятся внутри окна.
Этот класс позволяет точно определить тип операции выбора, что важно при реализации команд,
где поведение зависит от режима: например, при фильтрации, анализе или визуальном выделении.
Example
C#

HostMgd.EditorInput.CrossingOrWindowSelectedObject.#ctor(Teigha.DatabaseServices.ObjectId,HostMgd.EditorInput.SelectionMethod,System.Int32)
Конструктор инициализирует новый экземпляр класса с указанием
объекта, метода выбора и графического маркера.
Конструктор создаёт объект типа
CrossingOrWindowSelectedObject, который представляет собой
выбранный геометрический элемент, включённый в выборку через
окно или полигон. Он используется при программной или
интерактивной обработке выборки, когда необходимо сохранить
информацию о том, как именно был выбран объект — например, с
помощью окна включения или режима пересечения.
Этот конструктор позволяет задать:
* идентификатор выбранного объекта,
* метод выбора (окно, пересечение и др.),
* графический маркер (gsMarker), используемый системой
визуализации для отслеживания объекта.
Он применяется в сложных сценариях выборки, особенно при
реализации пользовательских фильтров, команд анализа или
инструментов редактирования, где важно различать способ
выделения.
id: Идентификатор объекта в базе данных чертежа. Тип
method: Метод, использованный для выбора объекта.Возможные
значения\:
gsMarker: Графический маркер (Graphics System Marker) —

HostMgd.EditorInput.CrossingOrWindowSelectedObject.ToString(IFormatProvider)
Возвращает строковое представление данного объекта в формате
(с учетом локализации), определенном параметром метода.
provider: Формат (с учетом локализации)