Teigha.DatabaseServices.ResultBuffer.ToString
Метод предназначен для получения эквивалентного строкового представления этого объекта.
Метод предназначен для получения эквивалентного строкового представления этого объекта.
Подробнее см. в документации Microsoft .NET API.
Returns: Возвращает эквивалентное строковое представление этого объекта, тип String.