Teigha.Geometry.EllipticalCone
Класс EllipticalCone представляет прямые эллиптические конусы.
Класс EllipticalCone представляет прямые эллиптические конусы.
Эллиптический конус определяется его:
* осью симметрии,
* высотой,
* синусом и косинусом половинного угла,
* началом координат (точкой на оси симметрии),
* большим и малым радиусами в начале координат,
* большой осью,
* масштабом параметра U.
Notes
Основание конуса - поперечное сечение конуса плоскостью, перпендикулярной оси конуса, в которой располагается начало координат конуса.
Радиусы эллипса в основании не могут равняться нулю.
Вершина данного эллиптического конуса может располагаться по любую сторону от основания, но конус не может быть двойным конусом.
Половинный угол измеряется от оси симметрии конуса до точки эллипса в основании, располагающейся на большой оси.
Если косинус половинного угла положительный, эллиптический конус является выпуклым, если отрицательный, то конус - вогнутый.
Если косинус и синус половинного угла имеют одинаковый знак, вершина конуса смещена от основания в направлении, противоположном оси симметрии конуса, таким образом, при движении вдоль оси симметрии радиус увеличивается.
Если же косинус и синус половинного угла имеют разные знаки, вершина конуса смещена от основания в направлении оси симметрии конуса, таким образом, при движении вдоль оси симметрии радиус уменьшается.
Как косинус, так и синус половинного угла не могут равняться нулю.
Параметр V определяет угол вращения вокруг оси симметрии конуса, измеряемый от большой оси.
Для замкнутого эллиптического конуса он равен [-PI, +PI).
Положительное направление изменения параметра V определяется правилом правой руки при движении вдоль оси симметрии конуса.
Боковая поверхность конуса периодична по V с периодом 2PI.
Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, лежащую в той же плоскости, центр которой совпадает с центром  эллипса, а радиус равен большому радиусу этого эллипса.
Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
Интервал высот эллиптического конуса определяется относительно начала координат конуса.
Высота увеличивается в направлении оси симметрии.
Интервал высот должен быть ограничен.
Параметр U изменяется вдоль образующей конуса.
U является безразмерным, измеряется в масштабе параметра U (который по умолчанию равен большому радиусу), умноженном на абсолютное значение косинуса половинного угла.
Значение параметра U увеличивается в направлении оси симметрии, если масштаб положительный.
Однако, если масштаб параметра U отрицателен, U уменьшается в направлении оси симметрии.
Нулевое значение U соответствует основанию эллиптического конуса.
Если косинус и синус половинного угла имеют одинаковые знаки, в вершине конуса значения параметра U и высоты отрицательны.
Если же косинус и синус половинного угла имеют разные знаки, то в вершине конуса значения параметра U и высоты положительны.
Параметрическая область [umin, umax] x [vmin, vmax] определяет четырехсторонний участок конической поверхности, ограниченный двумя прямыми линиями (под углами vmin и vmax) и двумя дугами  (для значений umin и umax).
При определении эллиптического конуса необходимо соблюдать следующие условия:
* umin ;
* |vmax - vmin| ;
* majorRadius > 0.0;
* minorRadius > 0.0.

Teigha.Geometry.EllipticalCone.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,System.Double,Teigha.Geometry.Vector3d)
Конструктор класса EllipticalCone.
Создает экземпляр класса с указанными косинусом и синусом половинного угла, точкой начала координат, малым и большим радиусами и направляющим вектором оси конуса.
Конструктор класса EllipticalCone.
Создает экземпляр класса с указанными косинусом и синусом половинного угла, точкой начала координат, малым и большим радиусами и направляющим вектором оси (симметрии) конуса.
cosineAngle: Косинус половинного угла.  Тип double.
sineAngle: Синус половинного угла.  Тип double.
baseOrigin: Начало координат в основании конуса. Тип Point3d.
minorRadius: Малый радиус эллиптического конуса.  Тип double.
majorRadius: Большой радиус эллиптического конуса.  Тип double.
axisOfSymmetry: Направляющий вектор оси (симметрии) конуса. Тип Vector3d.

Teigha.Geometry.EllipticalCone.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Конструктор класса EllipticalCone.
Создает экземпляр класса с указанными косинусом и синусом половинного угла, положением начала координат, малым и большим радиусами, направляющим вектором оси конуса, интервалом высоты, а также начальным и конечным углами.
Конструктор класса EllipticalCone.
Создает экземпляр класса с указанными косинусом и синусом половинного угла, точкой начала координат, малым и большим радиусами, направляющим вектором оси (симметрии) конуса, интервалом высоты, а также начальным и конечным углами.
cosineAngle: Косинус половинного угла.  Тип double.
sineAngle: Синус половинного угла.  Тип double.
baseOrigin: Начало координат в основании конуса. Тип Point3d.
minorRadius: Малый радиус эллиптического конуса.  Тип double.
majorRadius: Большой радиус эллиптического конуса.  Тип double.
axisOfSymmetry: Направляющий вектор оси (симметрии) конуса. Тип Vector3d.
referenceAxis: Направляющий вектор большой оси эллиптического конуса. Тип Vector3d.
height: Интервал высоты конуса. Тип Interval.
startAngle: Начальный угол конуса.  Тип double.
endAngle: Конечный угол конуса.  Тип double.

Teigha.Geometry.EllipticalCone.Create(IntPtr,System.Boolean)
Метод создает объект EllipticalCone на основе переданного неуправляемого указателя.
Метод создает объект EllipticalCone на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип EllipticalCone.

Teigha.Geometry.EllipticalCone.GetHeightAt(System.Double)
Метод предоставляет высоту данного эллиптического конуса, соответствующую указанному значению параметра U.
Метод предоставляет высоту данного эллиптического конуса, соответствующую указанному значению параметра U (указанному положению на параметрической оси U конуса).
parameter: Значение параметра U эллиптического конуса. Тип double.
Returns: Возвращает высоту эллиптического конуса для переданного в метод значения параметра U.
Тип double.

Teigha.Geometry.EllipticalCone.IsClosed(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли основание этого эллиптического конуса полным эллипсом в рамках заданной точности.
Метод позволяет проверить, можно ли считать основание этого эллиптического конуса полным эллипсом в рамках заданной точности tolerance.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если основание данного эллиптического конуса можно считать полным эллипсом в пределах точности tolerance.
В противном случае возвращает false.

Teigha.Geometry.EllipticalCone.Set(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,System.Double,Teigha.Geometry.Vector3d)
Метод переопределяет у данного объекта косинус и синус половинного угла, точку начала координат, малый и большой радиусы и направляющий вектор оси (симметрии) конуса.
Метод позволяет переопределить у данного объекта косинус и синус половинного угла, точку начала координат, малый и большой радиусы и направляющий вектор оси (симметрии) конуса.
cosineAngle: Косинус половинного угла.  Тип double.
sineAngle: Синус половинного угла.  Тип double.
baseCenter: Начало координат конуса. Тип Point3d.
minorRadius: Малый радиус эллиптического конуса.  Тип double.
majorRadius: Большой радиус эллиптического конуса.  Тип double.
axisOfSymmetry: Направляющий вектор оси (симметрии) конуса. Тип Vector3d.

Teigha.Geometry.EllipticalCone.Set(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Метод переопределяет у данного объекта косинус и синус половинного угла, точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии и большой оси конуса, интервал высоты, а также начальный и конечный углы.
Метод позволяет переопределить у данного объекта косинус и синус половинного угла, точку начала координат, малый и большой радиусы, направляющие векторы оси симметрии и большой оси конуса, интервал высоты, а также начальный и конечный углы.
cosineAngle: Косинус половинного угла.  Тип double.
sineAngle: Синус половинного угла.  Тип double.
baseCenter: Начало координат в основании конуса. Тип Point3d.
minorRadius: Малый радиус эллиптического конуса.  Тип double.
majorRadius: Большой радиус эллиптического конуса.  Тип double.
axisOfSymmetry: Направляющий вектор оси (симметрии) конуса. Тип Vector3d.
refAxis: Направляющий вектор большой оси эллиптического конуса. Тип Vector3d.
height: Интервал высоты конуса. Тип Interval.
startAngle: Начальный угол конуса.  Тип double.
endAngle: Конечный угол конуса.  Тип double.

Teigha.Geometry.EllipticalCone.SetAngles(System.Double,System.Double)
Метод переопределяет начальный и конечный углы данного эллиптического конуса.
Метод позволяет переопределить начальный и конечный углы данного эллиптического конуса.
startAngle: Начальный угол конуса. Тип double.
endAngle: Конечный угол конуса. Тип double.

Teigha.Geometry.EllipticalCone.Apex
Свойство Apex представляет положение вершины данного эллиптического конуса.
Свойство Apex представляет положение вершины данного эллиптического конуса.
Returns: Возвращает точку в вершине данного эллиптического конуса.
Тип Point3d.

Teigha.Geometry.EllipticalCone.AxisOfSymmetry
Свойство AxisOfSymmetry представляет направление оси симметрии данного конуса.
Свойство AxisOfSymmetry представляет направление оси симметрии данного эллиптического конуса.
Returns: Возвращает направляющий вектор оси симметрии конуса.
Тип Vector3d.

Teigha.Geometry.EllipticalCone.BaseCenter
Свойство BaseCenter представляет положение начала координат данного конуса.
Свойство BaseCenter представляет положение начала координат данного эллиптического конуса.
Returns: Возвращает точку начала координат данного эллиптического конуса.
Тип Point3d.

Teigha.Geometry.EllipticalCone.HalfAngle
Свойство HalfAngle представляет текущее значение половинного угла данного конуса.
Свойство HalfAngle представляет текущее значение половинного угла данного эллиптического конуса.
Returns: Возвращает значение половинного угла данного эллиптического конуса.
Тип double.

Teigha.Geometry.EllipticalCone.Height
Свойство Height представляет интервал для значений высоты данного конуса.
Свойство Height представляет интервал для значений высоты данного конуса.
Returns: Возвращает интервал высоты данного конуса.
Тип Interval.

Teigha.Geometry.EllipticalCone.IsOuterNormal
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль конической поверхности наружу от тела конуса.
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль конической поверхности наружу от тела конуса.
Returns: Возвращает true, если нормаль направлена наружу от тела конуса.
В противном случае возвращает false.

Teigha.Geometry.EllipticalCone.MajorAxis
Свойство MajorAxis представляет направление большой оси данного эллиптического конуса.
Свойство MajorAxis представляет направление большой оси данного эллиптического конуса.
Returns: Возвращает направляющий вектор большой оси эллиптического конуса.
Тип Vector3d.

Teigha.Geometry.EllipticalCone.MajorRadius
Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического конуса.
Свойство MajorRadius представляет текущее значение большого радиуса данного эллиптического конуса.
Returns: Возвращает значение большого радиуса эллиптического конуса.
Тип double.

Teigha.Geometry.EllipticalCone.MinorAxis
Свойство MinorAxis представляет направление малой оси данного эллиптического конуса.
Свойство MinorAxis представляет направление малой оси данного эллиптического конуса.
Returns: Возвращает направляющий вектор малой оси эллиптического конуса.
Тип Vector3d.

Teigha.Geometry.EllipticalCone.MinorRadius
Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического конуса.
Свойство MinorRadius представляет текущее значение малого радиуса данного эллиптического конуса.
Returns: Возвращает значение малого радиуса эллиптического конуса.
Тип double.

Teigha.Geometry.EllipticalCone.RadiusRatio
Свойство RadiusRatio управляет соотношением длин полуосей эллипса в основании данного эллиптического конуса.
Свойство RadiusRatio управляет соотношением длин полуосей эллипса в основании данного эллиптического конуса.
Чем это отношение ближе к единице, тем эллиптическое основание конуса ближе к окружности.
Returns: Возвращает отношение длин полуосей эллипса в основании данного эллиптического конуса.
Тип double.