Teigha.GraphicsInterface.ShadowMode.Segments
Значение: 2. Режим сегментированных теней.
Предназначен для сцен с объектами сложной геометрии и множественными источниками света.
Сегментация теней обеспечивает наиболее точный расчет теней ценой повышенной вычислительной нагрузки.