Teigha.DatabaseServices.DwgFiler.ReadByte
Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
Returns: Возвращает значение типа UInt8 из текущего элемента этого объекта Filer.