Teigha.DatabaseServices.UpdateOption.ForceFullSourceUpdate
Значение: 0x200000. В источник перезаписываются все данные.
Если этот параметр не установлен, в источник записываются только изменённые данные.
Этот параметр действителен только при обновлении источника из данных (т.е. когда направление обновления принимает значение UpdateDirection.DataToSource).