Teigha.DatabaseServices.DBObject.SetObjectIdsInFlux
Метод вызывается для вновь созданного клонированного объекта, чтобы указать,
что его идентификатор объекта недействителен.
Этот метод должен быть вызван для любого только созданного в
методах DBObject.DeepClone или DBObject.WblockClone объекта.
В этом случае Id ссылочных объектов еще не указывает на
корректные объекты. Ссылки должны быть преобразованы, только
когда операция DeepClone полностью завершится.