Teigha.GraphicsInterface.PositionBehavior.WorldWithScreenOffset
Значение: 4.
Положение геометрии определяется в мировой системе координат, но с заданным смещением пикселей в координатах экрана.
Этот вариант используется, например, для аннотаций или меток, положение которых привязано к координатам некоторой точки, заданной в мировой системе координат.