Teigha.GraphicsInterface.Geometry.PopClipBoundary
Метод удаляет из стека самую верхнюю границу обрезки.
Метод удаляет из стека самую верхнюю границу обрезки.
Этот метод можно вызвать только после успешного вызова PushClipBoundary() из WorldDraw или ViewportDraw объекта Drawable.