Teigha.GraphicsInterface.MaterialMap.GetHashCode
Метод предоставляет хеш-код данного объекта.
Метод предоставляет хеш-код данного объекта.
Он представляет собой целочисленный идентификатор, уникальный для каждого экземпляра этой структуры.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
Returns: Возвращает хеш-код объекта.
Тип int.