Teigha.GraphicsSystem.View.EndInteractivity
Метод отменяет интерактивный режим для данного объекта View.
Метод отменяет интерактивный режим для данного объекта View, переводя его в неинтерактивное состояние.