Teigha.Geometry.CircularArc2d
Класс CircularArc2d представляет окружности и круглые дуги в двумерном пространстве.
Класс CircularArc2d представляет окружности и круглые дуги в двумерном пространстве.

Teigha.Geometry.CircularArc2d.#ctor
Конструктор по умолчанию класса CircularArc2d.
Создает единичную окружность с центром (0,0).
Конструктор по умолчанию класса CircularArc2d.
Создает единичную окружность с центром (0,0).

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,System.Double)
Конструктор класса CircularArc2d. Создает окружность с заданными центром и радиусом.
Конструктор класса CircularArc2d.
Создает окружность с заданными центром center и радиусом radius.
center: Входной центр  окружности.  Тип Point2d.
radius: Входной радиус окружности.  Тип double.

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,System.Double,System.Double,System.Double,Teigha.Geometry.Vector2d,System.Boolean)
Конструктор класса CircularArc2d.
Создает круглую дугу с указанными центром, радиусом, начальным и конечным углами.
Конструктор класса CircularArc2d.
Создает круглую дугу с указанными центром, радиусом, начальным и конечным углами.
Кроме того, можно настроить направление, от которого будут отсчитываться углы, а также задать направление самой дуги (по часовой стрелке или против).
Notes
Все углы выражены в радианах.
Если задать endAng = startAng + 2*PI, будет построена полная окружность.
Начальный угол должен быть меньше конечного угла.
center: Центр дуги.  Тип Point2d.
radius: Радиус дуги. Тип double.
startAngle: Начальный угол дуги. Тип double.
endAngle: Конечный угол дуги.  Тип double.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла).  Тип Vector2d.
isClockWise: Флаг, определяющий, что дуга строится по часовой стрелке. Тип bool.

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,System.Double,System.Boolean)
Конструктор класса CircularArc2d.
Создает круглую дугу с заданными концами и величиной прогиба.
Конструктор класса CircularArc2d.
Создает круглую дугу с заданными концами и величиной прогиба.
Notes
Этот конструктор всегда создает дугу и не может использоваться для построения окружности.
Дуга строится против часовой стрелки.
Прогиб определяется расстоянием от средней точки дуги до стягивающей дугу хорды.
Если аргумент bulgeFlag равен true, прогиб интерпретируется в единицах длины как максимальное расстояние между дугой и хордой.
Если аргумент bulgeFlag имеет значение false, прогиб интерпретируется в относительных единицах как отношение высоты сегмента дуги к половине длины хорды, стягивающей эту дугу. В этом случае прогиб численно равен тангенсу одной четвертой центрального угла дуги.
startPoint: Начальная точка дуги.  Тип Point2d.
endPoint: Конечная точка дуги.   Тип Point2d.
bulge: Величина прогиба дуги. Тип double.
bulgeFlag: Флаг интерпретации прогиба. Тип bool.

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса CircularArc2d. Создает круглую дугу по трем точкам.
Конструктор класса CircularArc2d. Создает круглую дугу по трем точкам.
Никакие две точки из этих трех не должны совпадать, и все три не должны лежать на одной прямой.
Данный конструктор всегда строит ограниченную дугу и не может использоваться для построения полной окружности.
startPoint: Начальная точка дуги. Тип Point2d.
point: Точка на дуге.        Тип Point2d.
endPoint: Конечная точка дуги.  Тип Point2d.

Teigha.Geometry.CircularArc2d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта CircularArc2d на основе переданного  указателя.
Метод предназначен для создания объекта CircularArc2d на основе переданного  указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на основе которого создается данный объект. Тип IntPtr.
autoDelete: Входной флаг, который указывает, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип CircularArc2d.

Teigha.Geometry.CircularArc2d.GetTangent(Teigha.Geometry.Point2d)
Метод позволяет получить линию касательной к дуге в указанной точке.
Метод позволяет получить линию касательной к дуге в указанной точке.
point: Входная точка, в которой требуется построить касательную к дуге.
Returns: Возвращает линию касательной к дуге.
Тип Line2d.

Teigha.Geometry.CircularArc2d.GetTangent(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет получить линию касательной к дуге в указанной точке, вычисленную с указанной точностью.
Метод позволяет получить линию касательной к дуге в указанной точке, вычисленную с указанной точностью.
point: Входная точка, в которой требуется построить касательную к дуге.  Тип Point2d.
tolerance: Входная точность геометрических вычислений. Тип Tolerance.
Returns: Возвращает линию касательной к дуге.
Тип Line2d.

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.CircularArc2d)
Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности.
Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности arc.
arc: Входная круглая дуга, пересечение с которой требуется вычислить. Тип CircularArc2d.
Returns: Возвращает массив точек пересечения двух дуг. Тип Point2d[].

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.CircularArc2d,Teigha.Geometry.Tolerance)
Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности, вычисленные с заданной точностью.
Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности, вычисленные с заданной точностью.
arc: Входная круглая дуга, пересечение с которой требуется вычислить. Тип CircularArc2d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает массив точек пересечения двух дуг. Тип Point2d[].

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d)
Метод позволяет получить точки пересечения данного объекта с указанной 2D-линией.
Метод позволяет получить точки пересечения данного объекта с указанной 2D-линией.
line: Входная 2D-линия, точки пересечения с которой требуется вычислить.  Тип LinearEntity2d.
Returns: Возвращает массив точек пересечения. Тип Point2d[].

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет получить точки пересечения данной дуги с указанной линией, вычисленные с заданной точностью.
Метод позволяет получить точки пересечения данной дуги с указанной линией, вычисленные с заданной точностью.
line: Входная 2D-линия, точки пересечения с которой требуется вычислить. Тип LinearEntity2d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает массив точек пересечения. Тип Point2d[].

Teigha.Geometry.CircularArc2d.IsInside(Teigha.Geometry.Point2d)
Метод позволяет проверить, находится ли указанная точка в пределах полной окружности данной дуги.
Метод позволяет проверить, находится ли указанная точка в пределах полной окружности данной дуги.
point: Проверяемая 2D-точка.  Тип Point2d.
Returns: Возвращает true, только если точка point располагается в пределах полной окружности данной дуги.
В противном случае возвращает false.

Teigha.Geometry.CircularArc2d.IsInside(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить с заданной точностью, находится ли указанная точка в пределах полной окружности данной дуги.
Метод позволяет проверить с заданной точностью tolerance, находится ли указанная точка point в пределах полной окружности данной дуги.
point: Проверяемая 2D-точка.  Тип Point2d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает true, если точка point располагается в пределах полной окружности данной дуги с точностью tolerance.
В противном случае возвращает false.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,System.Double)
Метод позволяет переопределить центр и радиус данной дуги.
Метод позволяет переопределить центр и радиус данной дуги.
center: Новое положение центра дуги. Тип Point2d.
radius: Новый радиус дуги. Тип double.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,System.Double,System.Double,System.Double,Teigha.Geometry.Vector2d,System.Boolean)
Метод позволяет переопределить все параметры данной дуги.
Метод позволяет переопределить все параметры данной дуги - центр, радиус, начальный и конечный углы, а также направление самой дуги и направление нулевого угла.
Notes
Все углы представляются в радианах.
Начальный угол angle1 должен быть меньше конечного угла angle2.
center: Центр дуги.   Тип Point2d.
radius: Радиус дуги. Тип double.
angle1: Начальный угол дуги. Тип double.
angle2: Конечный угол дуги.  Тип double.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла).  Тип Vector2d.
isClockWise: Флаг, определяющий, что дуга строится по часовой стрелке. Тип bool.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,System.Double,System.Boolean)
Метод позволяет переопределить данную дугу, задавая концы дуги и величину ее прогиба.
Метод позволяет переопределить данную дугу, задавая концы дуги и величину ее прогиба.
Notes
Этот метод всегда создает дугу и не может использоваться для построения полной окружности.
Дуга строится против часовой стрелки.
Прогиб определяется расстоянием от средней точки дуги до стягивающей дугу хорды.
Если аргумент bulgeFlag равен true, прогиб интерпретируется в единицах длины как максимальное расстояние между дугой и хордой.
Если аргумент bulgeFlag имеет значение false, прогиб интерпретируется в относительных единицах как отношение высоты сегмента дуги к половине длины хорды, стягивающей эту дугу. В этом случае прогиб численно равен тангенсу одной четвертой центрального угла дуги.
startPoint: Начальная точка дуги.  Тип Point2d.
endPoint: Конечная точка дуги.   Тип Point2d.
bulge: Величина прогиба дуги. Тип double.
bulgeFlag: Флаг интерпретации прогиба. Тип bool.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод позволяет переопределить данную дугу по трем точкам.
Метод позволяет переопределить данную дугу по трем точкам.
startPoint: Начальная точка дуги. Тип Point2d.
point: Точка на дуге.        Тип Point2d.
endPoint: Конечная точка дуги.  Тип Point2d.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу так, чтобы она касалась двух указанных кривых и имела заданный радиус.
Метод позволяет переопределить данную дугу так, чтобы она касалась двух указанных кривых и имела заданный радиус.
Notes
Если круглую дугу с указанными параметрами построить не удаётся, то данная дуга будет оставлена без изменений.
curve1: Первая 2D-кривая, задающая условие касательности в начале дуги. Тип Curve2d.
curve2: Вторая 2D-кривая, задающая условие касательности на конце дуги. Тип Curve2d.
radius: Радиус дуги. Тип double.
parameter1: Возвращает параметр, соответствующий точке касания на кривой curve1.  Тип double.
parameter2: Возвращает параметр, соответствующий точке касания на кривой curve2.  Тип double.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 2D-кривым.
Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 2D-кривым.
Notes
Если круглую дугу с указанными параметрами построить не удаётся, то данная дуга будет оставлена без изменений.
curve1: Первая 2D-кривая, задающая условие касательности дуги. Тип Curve2d.
curve2: Вторая 2D-кривая, задающая условие касательности дуги. Тип Curve2d.
curve3: Третья 2D-кривая, задающая условие касательности дуги. Тип Curve2d.
parameter1: Возвращает параметр, соответствующий точке касания на кривой curve1. Тип double.
parameter2: Возвращает параметр, соответствующий точке касания на кривой curve2. Тип double.
parameter3: Возвращает параметр, соответствующий точке касания на кривой curve3. Тип double.

Teigha.Geometry.CircularArc2d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить углы начальной и конечной точек данной дуги.
Метод позволяет переопределить углы начальной и конечной точек данной дуги.
startAngle: Новое значение начального угла. Тип double.
endAngle: Новое значение конечного угла.  Тип double.

Teigha.Geometry.CircularArc2d.Center
Свойство Center представляет центр данной дуги.
Свойство Center представляет центр данной дуги.
Returns: Возвращает 2D-точку центра дуги. Тип Point2d.

Teigha.Geometry.CircularArc2d.EndAngle
Свойство EndAngle представляет угол конечной точки дуги относительно опорного вектора.
Свойство EndAngle представляет угол конечной точки дуги относительно опорного вектора.
Returns: Возвращает конечный угол дуги. Тип double.

Teigha.Geometry.CircularArc2d.EndPoint
Свойство EndPoint представляет конечную точку дуги.
Свойство EndPoint представляет конечную точку дуги.
Returns: Возвращает конечную точку дуги. Тип Point2d.

Teigha.Geometry.CircularArc2d.IsClockWise
Свойство IsClockWise позволяет проверить, ориентирована ли данная дуга по часовой стрелке.
Свойство IsClockWise позволяет проверить, ориентирована ли данная дуга по часовой стрелке.
Returns: Возвращает true, если дуга ориентирована по часовой стрелке.
В противном случае возвращает false.

Teigha.Geometry.CircularArc2d.Radius
Свойство Radius представляет радиус дуги.
Свойство Radius представляет радиус дуги.
Returns: Возвращает радиус дуги. Тип double.

Teigha.Geometry.CircularArc2d.ReferenceVector
Свойство ReferenceVector предоставляет доступ к опорному вектору данной дуги.
Свойство ReferenceVector позволяет управлять опорным вектором данной дуги.
Поскольку начальный и конечный углы дуги задаются относительно этого вектора, изменение опорного вектора производит эффект вращения дуги вокруг ее центральной точки.
Returns: Возвращает опорный вектор дуги. Тип Vector2d.

Teigha.Geometry.CircularArc2d.StartAngle
Свойство StartAngle представляет начальный угол дуги.
Свойство StartAngle представляет начальный угол дуги.
Returns: Возвращает начальный угол дуги. Тип double.

Teigha.Geometry.CircularArc2d.StartPoint
Свойство StartPoint представляет начальную точку дуги.
Свойство StartPoint представляет начальную точку дуги.
Returns: Возвращает начальную точку дуги. Тип Point2d.