Teigha.Geometry.Vector2d.GetNormal
Метод предоставляет единичный вектор, сонаправленный данному вектору.
Метод позволяет получить единичный вектор, сонаправленный данному вектору.
Реализация использует вызов метода Vector2d.GetNormal(Tolerance tolerance) с точностью по умолчанию Tolerance.EqualVector.
Returns: Возвращает единичный вектор, сонаправленный данному вектору.
Тип Vector2d.