Teigha.Geometry.CurveCurveIntersector3d.OverlapCount
Метод OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
Метод OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
Returns: Возвращает количество интервалов перекрытия двух кривых. Тип int.