Teigha.GraphicsSystem.View.CloneView
Метод позволяет получить новый объект View, являющийся полной копией данного вида.
Метод позволяет получить новый объект View, являющийся полной копией данного вида.
Returns: Возвращает объект-клон данного вида.
Тип View.