HostMgd.EditorInput.DragCursor
Перечисление типов курсора, которые могут быть использованы
при перетаскивании.
Члены          Описание
перечисления
-------------  --------------------------------------------------
Normal         Обычный вид куросра при перетаскивании
None           Не указан тип курсора
Selection      Тип курсора при перетаскивании выбранного объекта