Teigha.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo1
Метод сортирует точки пересечения по возрастанию значений параметра первой кривой.
Метод сортирует точки пересечения по возрастанию значений параметра первой кривой.