Teigha.GraphicsInterface.VariantType
Перечисление VariantType определяет текущий тип, установленный для объекта Variant.
Перечисление VariantType определяет текущий тип, установленный для объекта Variant.