Teigha.DatabaseServices.PlotStyleDescriptor.ToString
Данный класс предназначен для формирования эквивалентного строкового представления объекта.
Данный класс предназначен для формирования эквивалентного строкового представления объекта.
Подробнее см. в документации Microsoft .NET API.
Returns: Возвращает строку String.