Teigha.DatabaseServices.RotatedDimension
Класс RotatedDimension представляет тип размера между двумя точками в пространстве, которые располагаются на линии,  ориентированной под определенным углом к горизонту в плоскости размера (угол поворота).
Класс RotatedDimension представляет тип размера между двумя точками в пространстве, которые располагаются на линии,  ориентированной под определенным углом к горизонту в плоскости размера (угол поворота).
«Горизонтальный» размер представляет размер с углом поворота, равным углу между осью X OCS размера и осью X UCS, определяющей «горизонтальное» направление.
«Вертикальный» размер — это размер с углом поворота, котрый на pi/2 рад (90 градусов) больше угла поворота «горизонтального» размера.

Teigha.DatabaseServices.RotatedDimension.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.RotatedDimension.#ctor(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Данный конструктор создает новый объект RotatedDimension с указанными в аргументах параметрами.
Данный конструктор создает новый объект RotatedDimension с указанными в аргументах параметрами.
rotation: Угол поворота размера в радианах, тип double.
line1Point: Первая выносная точка - точка, от которой строится размер и где начинается первая выносная линия. Тип Point3d.
line2Point: Вторая выносная точка - точка, до которой строится размер и где начинается вторая  выносная линия. Тип Point3d.
dimensionLinePoint: Точка на размерной линии, тип Point3d.
dimensionText: Размерный текст, которым заменяется текст с измеренным значением. Тип String.
dimensionStyle: ID размерного стиля, который используется для отображения размера. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.RotatedDimension.dimLinePoint
Свойство предоставляет доступ к точке определения (в мировой системе координат WCS), которая указывает, где будет находиться размерная линия (т.е. эта точка будет располагаться где-то на размерной линии).
Свойство предоставляет доступ к точке определения (в мировой системе координат WCS), которая указывает, где будет находиться размерная линия (т.е. эта точка будет располагаться где-то на размерной линии).
Returns: Возвращает точку Point3d, которая располагается где-то на размерной линии.
Система координат - мировая (WCS).

Teigha.DatabaseServices.RotatedDimension.Oblique
Свойство предоставляет доступ к углу наклона выносной линии (в радианах) данного размера.
Returns: Возвращает или задает угол наклона выносных линий в радианах, тип double.

Teigha.DatabaseServices.RotatedDimension.Rotation
Свойство задает или получает угол поворота (в радианах) для повернутого размера.
Свойство задает или получает угол поворота (в радианах) для повернутого размера.
Угол поворота измеряется от оси X OCS до размерной линии объекта-размера .
Положительное направление отсчета углов - против часовой стрелки, если смотреть в сторону начала вектора нормали плоскости размера.
Returns: Возвращает или получает угол поворота (в радианах) для повернутого размера.

Teigha.DatabaseServices.RotatedDimension.xLine1Point
Свойство задает и получает начальную трехмерную точку первой выносной линии размера. Система координат - мировая (WCS).
Свойство задает и получает начальную трехмерную точку первой выносной линии размера. Система координат - мировая (WCS).
Отображение выносной линии относительно этой точки определяется значением системной переменной DIMEXO.
Returns: Возвращает или задает начальную трехмерную точку первой выносной линии размера, тип Point3d.

Teigha.DatabaseServices.RotatedDimension.xLine2Point
Свойство задает и получает начальную трехмерную точку второй выносной линии размера. Система координат - мировая (WCS).
Свойство задает и получает начальную трехмерную точку второй выносной линии размера. Система координат - мировая (WCS).
Отображение выносной линии относительно этой точки определяется значением системной переменной DIMEXO.
Returns: Возвращает или задает начальную трехмерную точку второй выносной линии размера, тип Point3d.