HostMgd.EditorInput.PromptCornerOptions
Класс, представляющий необязательные параметры для
приглашения ввода угловой точки.

HostMgd.EditorInput.PromptCornerOptions.AllowArbitraryInput
Разрешить произвольный ввод.

HostMgd.EditorInput.PromptCornerOptions.AllowNone
Возвращает или устанавливает признак того, разрешен ли ввод
только Enter.
Значение true означает, что ввод только Enter разрешен, и
false в противном случае.

HostMgd.EditorInput.PromptCornerOptions.BasePoint
Возвращает или устанавливает базовую точку, используемую в
приглашении.

HostMgd.EditorInput.PromptCornerOptions.LimitsChecked
Устанавилвает или возвращает признак наличия проверки
ограничений при вводе значения.

HostMgd.EditorInput.PromptCornerOptions.#ctor(String,String,Teigha.Geometry.Point3d)
Конструктор.
messageAndKeywords: Приглашающая строка с ключевыми словами
globalKeywords: Ключевые слова (глобальные имена)
basePoint: Базовая точка

HostMgd.EditorInput.PromptCornerOptions.#ctor(String,Teigha.Geometry.Point3d)
Конструктор.
message: Приглашающее сообщение
basePoint: Базовая точка

HostMgd.EditorInput.PromptCornerOptions.UseDashedLine
Включает и выключает штриховую "резиновую" линию, которая
рисуется между базовой точкой и текущим положением курсора
при вводе.