Teigha.DatabaseServices.SubentRef.CreateEntity
Метод создает новый объект чертежа на основе данной ссылки на подобъект.
Метод создает новый объект чертежа на основе данной ссылки на подобъект.
Returns: Возвращает новый объект чертежа. Тип Teigha.DatabaseServices.Entity.