Teigha.DatabaseServices.DBObject.Unappended
Событие происходит каждый раз, когда обрабатывается отмена добавления объекта в базу данных.
Событие происходит каждый раз, когда обрабатывается отмена добавления объекта в базу данных.
Returns: Тип данных EventHandler, представляющий обработчик события.