HostMgd.ApplicationServices.DocumentLockMode.ExclusiveWrite
Значение: 64 (0x40).
Этот тип блокировки устанавливает блокировку на монопольную запись (ExclusiveWrite).
Такая блокировка взаимно исключает все иные типы блокировок другими исполняемыми контекстами.
Это позволяет исполняемому контексту проверять и изменять содержимое указанного документа.