Teigha.DatabaseServices.ColumnsCollection
Класс ColumnsCollection представляет коллекцию столбцов таблицы.
Класс ColumnsCollection представляет коллекцию объектов Column.

Teigha.DatabaseServices.ColumnsCollection.Count
Свойство Count представляет фактическое количество элементов в данной коллекции.
Свойство Count представляет фактическое количество элементов в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.DatabaseServices.ColumnsCollection.Item
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Notes
Если значение аргумента index окажется недействительным, выбрасывается исключение ArgumentOutOfRangeException.
index: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип Column.