Teigha.DatabaseServices.CellType
Перечисление CellType представляет типы данных, которые могут использоваться объектом DataCell.
Перечисление CellType представляет типы данных, которые могут использоваться объектом DataCell.