Teigha.BoundaryRepresentation.Mesh2d
Класс Mesh2d представляет интерфейсный класс для 2D-сетей.
Класс Mesh2d представляет интерфейсный класс для 2D-сетей.
Этот класс определяет функционал, который относится к двумерной (или фасетированной) сети либо всего твердого тела целиком, либо отдельной поверхности.
2D-сеть — это сеть, которая соответствует некоторому множеству 3D-граней и, таким образом, имеет связанную геометрию.
Собственно геометрия и ссылки на исходные топологические объекты BREP хранятся в отдельных элементах и узлах сети.
2D-сеть также можно рассматривать как каркас, множество элементов которого определяет каркасную модель поверхности.
Многосвязные ребра и вершины множества 3D-граней игнорируются и в сети не отображаются.
Вырожденные элементы отбрасываются вместе с их уникальными узлами.
Notes
Класс Mesh2d  реализован только в среде пространственного моделирования.

Teigha.BoundaryRepresentation.Mesh2d.#ctor(Teigha.BoundaryRepresentation.Mesh2dFilter)
Конструктор класса Mesh2d. Создает экземпляр класса с указанными параметрами.
Конструктор класса Mesh2d. Создает экземпляр класса, инициализированный с использованием указанного фильтра Mesh2dFilter.
meshFilter: Входной фильтр.  Тип Mesh2dFilter.

Teigha.BoundaryRepresentation.Mesh2d.GetElement2dsStartingFrom(Teigha.BoundaryRepresentation.Element2d)
Метод позволяет получить коллекцию элементов сети Mesh2d, начиная с указанного начального элемента.
Метод позволяет получить коллекцию элементов сети Mesh2d, начиная с указанного начального элемента Element2d.
startFrom: Начальный элемент сети.  Тип Element2d.
Returns: Возвращает коллекцию элементов двумерной сети Mesh2d.
Тип Mesh2dElement2dCollection.

Teigha.BoundaryRepresentation.Mesh2d.Element2ds
Свойство Element2ds предоставляет доступ ко всем элементам сети Mesh2d.
Свойство Element2ds предоставляет доступ к множеству всех элементов сети Mesh2d.
Returns: Возвращает коллекцию всех элементов данной сети.
Тип Mesh2dElement2dCollection.