HostMgd.EditorInput.SelectionAddedEventArgs
Класс предоставляет данные для события SelectionAdded,
возникающего при добавлении объектов в набор выделенных.
Класс используется для передачи информации о добавленных объектах
при срабатывании события SelectionAdded. Класс предоставляет доступ
к набору объектов, которые были добавлены в текущее выделение — например,
при щелчке мышью, выделении рамкой или использовании режима добавления.
Example
C#

HostMgd.EditorInput.SelectionAddedEventArgs.Add(HostMgd.EditorInput.SelectedObject)
Метод добавляет объект в набор выбранных объектов,
предварительно проверяя, отсутствует ли он в наборе
по идентификатору.
Метод используется для добавления объекта типа SelectedObject
в коллекцию выбранных объектов — например, вручную формируемую
SelectionSet или при программной модификации текущего выделения.
Перед вставкой метод проверяет, существует ли уже объект с таким же
ObjectId в коллекции. Если объект с таким идентификатором уже присутствует,
он не добавляется повторно, что предотвращает дублирование в выборке.
value: Объект, который необходимо добавить в набор.

HostMgd.EditorInput.SelectionAddedEventArgs.AddSubEntity(HostMgd.EditorInput.SelectedSubObject)
Метод добавляет геометрический подобъект (например, сегмент, ребро или грань)
к составному выбранному объекту.
Метод используется для расширения выборки на уровне подобъектов
— отдельных элементов сложных объектов, таких как сегменты полилинии,
рёбра 3D-тела или грани многогранника. Он добавляет экземпляр SelectedSubObject,
содержащий информацию о конкретной части объекта, в состав текущего выбора.
value: Подобъект, который необходимо добавить.
Должен содержать:

HostMgd.EditorInput.SelectionAddedEventArgs.Highlight(System.Int32,Teigha.DatabaseServices.FullSubentityPath)
Метод выделяет подобъект внутри составного объекта
на основе индекса и пути к геометрическому подобъекту.
Метод используется для визуального выделения конкретного подобъекта
(например, сегмента полилинии, ребра 3D-тела, грани или вершины)
в составе сложного объекта. Он активирует подсветку в интерфейсе nanoCAD,
делая выбранный элемент визуально выделенным, что помогает пользователю
или программе отследить, с каким именно компонентом ведётся работа.
subSelectionIndex: Индекс подобъекта в текущем наборе выбранных подобъектов.
path: Путь к геометрическому подобъекту, определяющий его положение

HostMgd.EditorInput.SelectionAddedEventArgs.Remove(System.Int32)
Метод удаляет объект из набора выбранных элементов по указанному индексу.
Метод используется для удаления объекта из коллекции выбранных объектов
(SelectionSet) по его индексу в этой коллекции. Он позволяет программно
изменять состав выборки — например, исключать объекты, не соответствующие
определённым критериям, или корректировать выборку перед выполнением
команды редактирования.
Перед удалением рекомендуется проверить, что индекс находится в допустимом диапазоне
(0 до Count - 1), чтобы избежать исключения ArgumentOutOfRangeException.
Метод изменяет внутреннюю структуру набора выделения,
и после удаления все последующие объекты сдвигаются на одну позицию вниз.
index: Позиция удаляемого объекта в коллекции выбранных объектов.
Пример: 0 — первый объект, 1 — второй и т.д.

HostMgd.EditorInput.SelectionAddedEventArgs.RemoveSubEntity(System.Int32,System.Int32)
Метод удаляет геометрический подобъект из выборки
по индексу объекта и индексу подобъекта внутри него.
Метод используется для программного удаления конкретного подобъекта
(например, сегмента полилинии, ребра 3D-тела или грани) из состава
выбранного объекта. Он применяется в контексте работы с составными
объектами, где выборка может включать не только целые объекты,
но и их внутренние элементы.
После вызова метода указанный подобъект удаляется из внутренней структуры выборки,
что может повлиять на последующую обработку — например, при редактировании,
анализе или визуализации.
entityIndex: Индекс объекта в коллекции выбранных объектов (SelectionSet).
subEntityIndex: Индекс подобъекта внутри указанного объекта.

HostMgd.EditorInput.SelectionAddedEventArgs.AddedObjects
Свойство возвращает набор объектов, которые были добавлены к текущему выделению.
Свойство предоставляет доступ к объекту типа SelectionSet,
содержащему список объектов, недавно добавленных в выборку.
Оно используется в контексте событий и команд,
отслеживающих изменения в наборе выбранных объектов — например,
в обработчиках события SelectionAdded или при анализе динамики выделения.
Returns: Возвращает объект типа SelectionSet, содержащий идентификаторы (ObjectId) объектов, добавленных к выборке.
Если объекты были добавлены — SelectionSet содержит их список.
Если добавлений не было — возвращается пустой SelectionSet (не null).
Example
C#

HostMgd.EditorInput.SelectionAddedEventArgs.Flags
Свойство возвращает признаки, предоставляющие информацию
о контексте и режиме выполнения операции выбора объектов.
Свойство предоставляет доступ к перечислению SelectionFlags,
которое содержит набор флагов, описывающих текущее состояние
и режим операции выбора. Эти флаги позволяют определить,
как именно пользователь выполняет выбор — например,
добавляет объекты к существующей выборке, использует режим удаления,
работает с ключевыми словами или применяет специальные условия.
Returns: Возвращает значение типа SelectionFlags — побитовое перечисление флагов.
Example
C#

HostMgd.EditorInput.SelectionAddedEventArgs.Selection
Свойство возвращает текущий набор выбранных в редакторе объектов.
Свойство предоставляет доступ к объекту типа SelectionSet,
содержащему коллекцию идентификаторов (ObjectId) всех объектов,
выделенных в текущий момент в чертеже. Оно доступно только для чтения
и отражает состояние выборки на момент обращения к свойству — например,
после завершения команды выбора или в ходе интерактивного редактирования.
Returns: Возвращает объект типа SelectionSet, содержащий:
* Список ObjectId выбранных объектов.
* Дополнительную информацию о выборе (точки, матрицы преобразования — при наличии).
Если объекты не выбраны, возвращается пустой SelectionSet (с Count = 0), а не null.
Example
C#