HostMgd.EditorInput.Editor.SelectImplied
Метод возвращает набор объектов, выделенных пользователем до вызова команды, если таковые имеются.
Метод используется для получения текущего набора объектов, которые были предварительно
выбраны пользователем в интерфейсе nanoCAD до начала выполнения команды.
Это позволяет сохранить и использовать существующее выделение, вместо необходимости
повторного выбора объектов. Если никакие объекты не были выделены заранее,
результат может быть пустым или иметь статус Cancel.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). Если объекты были выделены ранее, статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) объектов из текущего выделения (если статус равен OK).
* StringResult — строковое значение.
Если предыдущее выделение отсутствует, Value может быть null.
Example
C#