HostMgd.PlottingServices.PlotConfigManager
Класс реализует доступ к конфигурациям печати, таблицам стилей печати, устройствам и PC3 файлам, установленным в системе.
Имеет только статические методы и свойства.

HostMgd.PlottingServices.PlotConfigManager.SetCurrentConfig(System.String)
Метод устанавливает используемую конфигурацию плоттера печати по его наименованию
Используемая конфигурация плоттера сохраняется только на время текущей сессии. И может иметь значение null.