Teigha.DatabaseServices.LineWeight
Данное перечисление определяет толщины линий (веса линий), используемые при отображении линий и выводе их на печать.
Данное перечисление определяет толщины линий (веса линий), используемые при отображении линий и выводе их на печать.
Толщина линий указывается в сотых долях миллиметра, за исключением отрицательных значений.
Отрицательные значения обозначают значения по умолчанию, отраженные в наименовании константы.