Teigha.DatabaseServices.LineJoinStyle.LjsMiter
Значение: 0. Острый угол.
Соединение сегментов под углом, при котором внешние края линий продолжаются до точки пересечения.
При очень острых углах может вызывать нежелательные артефакты, если не использовать дополнительные ограничения.