Teigha.DatabaseServices.AttachmentPoint
Данное перечисление определяет положения точки присоединения текстового объекта MText.
Данное перечисление определяет положения точки присоединения текстового объекта MText.