Teigha.DatabaseServices.GraphicsMetafileType
Данное перечисление определяет, какие данные могут находиться в графическом метафайле прокси-объекта.
Данное перечисление определяет, какие данные могут находиться в графическом метафайле прокси-объекта.