Teigha.Geometry.Vector2d.ToString
Метод реализует эквивалентное представление данного вектора в виде текстовой строки.
Метод реализует эквивалентное представление данного вектора в виде текстовой строки.
Returns: Возвращает строковое представление данного вектора.
Тип String.