Teigha.BoundaryRepresentation.ShellFaceEnumerator
Класс ShellFaceEnumerator представляет перечислитель граней оболочки BREP.
Класс ShellFaceEnumerator представляет перечислитель граней оболочки BREP.

Teigha.BoundaryRepresentation.ShellFaceEnumerator.Current
Свойство Current представляет текущий элемент данного перечислителя.
Свойство Current представляет текущий элемент данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип Face.