Teigha.Geometry.PointEntity3d
Класс PointEntity3d является базовым классом для всех классов трехмерных точечных объектов.
Класс PointEntity3d является базовым классом для всех классов трехмерных точечных объектов.

Teigha.Geometry.PointEntity3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип PointEntity3d.