Teigha.DatabaseServices.SectionManager.GetEnumerator
Метод предоставляет перечислитель для коллекции секущих плоскостей.
Метод предоставляет перечислитель для коллекции секущих плоскостей.
Returns: Возвращает объект перечислителя. Тип Collections.IEnumerator.