Teigha.BoundaryRepresentation.Hit
Класс Hit является интерфейсным классом для контекстных попаданий, сгенерированных запросами на пересечение объекта BREP с линией.
Класс Hit является интерфейсным классом для контекстных попаданий, сгенерированных запросами на пересечение объекта BREP с линией.
«Контекстное» попадание представляет вершину в контексте пересечения объекта BREP с линией применительно к топологии.

Teigha.BoundaryRepresentation.Hit.Equals(Object)
Метод предназначен для проверки равенства данного объекта указанному.
Метод предназначен для проверки равенства данного объекта указанному.
obj: Входной объект, проверяемый на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если объекты равны.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.Hit.EntityAssociated
Свойство EntityAssociated предоставляет доступ к топологическому объекту, для которого данный объект Hit выполнил проверку на пересечения с линией.
Свойство EntityAssociated предоставляет доступ к топологическому объекту, для которого данный объект Hit выполнил проверку на пересечения с линией.
Returns: Возвращает топологический объект.
Тип BoundaryRepresentation.BrepEntity.

Teigha.BoundaryRepresentation.Hit.EntityEntered
Свойство EntityEntered предоставляет доступ к топологическому объекту наименьшей размерности, которому принадлежит линейный сегмент исходной линии, ограниченной соседними точками пересечения.
Свойство EntityEntered предоставляет доступ к топологическому объекту наименьшей размерности, которому принадлежит линейный сегмент исходной линии, ограниченный соседними точками пересечения.
Returns: Возвращает топологический объект.  Тип BoundaryRepresentation.BrepEntity.
Возвращает NULL, если это последнее пересечение в массиве пересечений, либо линейный сегмент выходит и затем повторно входит в проверяемый объект, т.е. сегмент проходит вне проверяемого объекта.

Teigha.BoundaryRepresentation.Hit.EntityHit
Свойство EntityHit предоставляет доступ к топологическому объекту наименьшей размерности, содержащему данное попадание.
Accesses the dimensionally lowest topological entity that contains this hit.
Note that the start and end points of lines are classified as hits so long as they pass a point containment test.
It is not necessary for the ray they define to pass through a geometric boundary; a hit may reside in the interior of a solid.
Свойство EntityHit предоставляет доступ к топологическому объекту наименьшей размерности, содержащему данное попадание.
Notes
Начальная и конечная точки линий классифицируются как попадания, если они проходят тест на принадлежность точек.
Не обязательно, чтобы определяемый ими сегмент пересекал геометрическую границу тела; он весь может находиться внутри твердого тела.
Returns: Возвращает топологический объект.
Тип BoundaryRepresentation.BrepEntity.

Teigha.BoundaryRepresentation.Hit.IsBrepChanged
Свойство IsBrepChanged позволяет проверить, изменился ли связанный объект nanoCAD с момента последнего обновления данного топологического объекта.
Свойство IsBrepChanged позволяет проверить, изменился ли связанный объект nanoCAD с момента последнего обновления данного топологического объекта.
Returns: Возвращает true, если связанный объект nanoCAD успел измениться с момента последнего обновления данного объекта.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.Hit.IsNull
Свойство IsNull позволяет проверить, является ли данный объект нулевым.
Свойство IsNull позволяет проверить, является ли данный объект нулевым.
Returns: Возвращает true, если данный объект является нулевым.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.Hit.Point
Свойство Point предоставляет доступ к точке попадания данного объекта.
Свойство Point предоставляет доступ к точке попадания данного объекта.
Returns: Возвращает точку попадания данного объекта.
Тип Point3d.

Teigha.BoundaryRepresentation.Hit.ValidationLevel
Свойство ValidationLevel представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
Свойство ValidationLevel представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
В общем случае это означает любую функцию, которая обращается к топологии BREP.
Returns: Возвращает предусмотренный уровень проверки.
Тип BoundaryRepresentation.ValidationLevel.