Teigha.DatabaseServices.DwgFiler.ReadHandle
Метод предназначен для получения дескриптора объекта Handle из текущего элемента этого объекта Filer.
Метод предназначен для получения дескриптора объекта Handle из текущего элемента этого объекта Filer.
Returns: Возвращает дескриптора объекта. Тип Handle.