Teigha.Runtime.LispFunctionAttribute
Класс LispFunctionAttribute представляет атрибуты для вызываемых функций Lisp.
Класс LispFunctionAttribute расширяет интерфейсы Attribute и ICommandLine с тем,
чтобы определить атрибуты для вызываемых функций Lisp.

Teigha.Runtime.LispFunctionAttribute.#ctor(String)
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем функции Lisp.
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем функции Lisp.
globalName: Входное глобальное имя функции Lisp. Тип String.

Teigha.Runtime.LispFunctionAttribute.#ctor(String,String)
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем и локализованным идентификатором функции Lisp.
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем и локализованным идентификатором функции Lisp.
globalName: Входное глобальное имя функции Lisp. Тип String.
localizedNameId: Входной локализованный идентификатор функции Lisp.  Тип String.

Teigha.Runtime.LispFunctionAttribute.#ctor(String,String,String)
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем, локализованным идентификатором и темой справки для функции Lisp.
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем, локализованным идентификатором и темой справки для функции Lisp.
globalName: Входное глобальное имя функции Lisp.                  Тип String.
localizedNameId: Входной локализованный идентификатор функции Lisp.    Тип String.
helpFileName: Входная статья справки для данной функции Lisp.       Тип String.

Teigha.Runtime.LispFunctionAttribute.#ctor(String,String,String,String)
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем, локализованным идентификатором, а также файлом и темой справки для функции Lisp.
Конструктор класса LispFunctionAttribute.
Создает объект с указанным именем, локализованным идентификатором, а также файлом и темой справки для функции Lisp.
globalName: Входное глобальное имя функции Lisp.                  Тип String.
localizedNameId: Входной локализованный идентификатор функции Lisp.    Тип String.
helpFileName: Полный путь и имя файла справки.                      Тип String.
helpFileName: Входная статья справки для данной функции Lisp.       Тип String.

Teigha.Runtime.LispFunctionAttribute.ContextMenuExtensionType
Свойство ContextMenuExtensionType представляет тип расширения контекстного меню для функции Lisp.
Свойство ContextMenuExtensionType представляет тип расширения контекстного меню для функции Lisp.
Returns: Возвращает тип расширения контекстного меню.
Тип Type.

Teigha.Runtime.LispFunctionAttribute.Flags
Свойство Flags представляет командные флаги для данной функции Lisp.
Свойство Flags представляет командные флаги для данной функции Lisp.
Returns: Возвращает командные флаги для данной функции Lisp из перечисления CommandFlags.

Teigha.Runtime.LispFunctionAttribute.GlobalName
Свойство GlobalName представляет глобальное имя данного объекта.
Свойство GlobalName представляет глобальное имя данного объекта.
Returns: Возвращает глобальное имя данного объекта.
Тип String.

Teigha.Runtime.LispFunctionAttribute.GroupName
Свойство GroupName представляет имя группы данного объекта.
Свойство GroupName представляет имя группы данного объекта.
Returns: Возвращает имя группы данного объекта.
Тип String.

Teigha.Runtime.LispFunctionAttribute.HelpFileName
Свойство HelpFileName представляет полное имя файла справки данного объекта.
Свойство HelpFileName представляет полное имя файла справки данного объекта.
Returns: Возвращает полное имя файла справки данного объекта.
Тип String.

Teigha.Runtime.LispFunctionAttribute.HelpTopic
Свойство HelpTopic представляет статью справки для данного объекта.
Свойство HelpTopic представляет статью справки для данного объекта.
Returns: Возвращает статью справки для данного объекта.
Тип String.

Teigha.Runtime.LispFunctionAttribute.LocalizedNameId
Свойство LocalizedNameId представляет локализованный идентификатор функции Lisp.
Свойство LocalizedNameId представляет локализованный идентификатор функции Lisp.
Returns: Возвращает локализованный идентификатор функции Lisp.
Тип String.