Teigha.DatabaseServices.ObjectIdCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает объект перечислителя. Тип System.Collections.IEnumerator.