Teigha.GraphicsInterface.DeviationType
Перечисление DeviationType определяет типы предельных отклонений, используемые при тесселяции.
Перечисление DeviationType определяет типы предельных отклонений, используемые при тесселяции.