Teigha.DatabaseServices.SequenceEnd
Класс SequenceEnd представляет объекты SequenceEnd в экземпляре базы данных Database.
Класс SequenceEnd представляет объекты SequenceEnd (Seqend) в экземпляре базы данных Database.
Объекты SequenceEnd автоматически создаются и обрабатываются чертежами в случае сложных объектов, таких как полилинии и вхождения блоков.  Эти объекты не имеют связанной геометрии.
Клиентские приложения могут добавлять к этим объектам расширенные данные или словари расширений, но не должны создавать или удалять их из базы данных.

Teigha.DatabaseServices.SequenceEnd.#ctor
Конструктор по умолчанию класса SequenceEnd.
Конструктор по умолчанию класса SequenceEnd.