Teigha.GraphicsInterface.MaterialNormalMapComponent.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Оно включает информацию о нормальном наложении материала, методе его вычисления и вкладе этого компонента.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.