Teigha.DatabaseServices.ConstrainType
Данное перечисление определяет допустимые варианты ограничения геометрии спирали.
Данное перечисление определяет допустимые варианты ограничения геометрии спирали.
Ограничения используются для того, чтобы сделать переменный параметр геометрической модели равным некоторой наперёд заданной величине.
Например, если установить ограничение высоты спирали, изменения любых других ее параметров на высоту спирали уже не влияют.
При использовании ограничения становится существенным порядок, в котором вы задаёте свойства спирали.
Скажем, чтобы ограничить количество витков в спирали, следует задать количество витков ДО указания высоты спирали или высоты витка.