Teigha.DatabaseServices.ImageDisplayOptions
Перечисление ImageDisplayOptions определяет опции отображения растровых изображений.
Перечисление ImageDisplayOptions определяет опции отображения растровых изображений.