Teigha.Geometry.Sphere.GetAnglesInU
Метод предоставляет текущий диапазон изменения параметра u.
Метод предоставляет текущий диапазон изменения параметра u.
Returns: Возвращает двухэлементный массив. Тип double[].
Элемент с индексом 0 соответствует начальному углу, а элемент с индексом 1 - конечному углу для параметра u.