Teigha.DatabaseServices.LoftOptions.Clone
Метод предназначен для клонирования данного объекта LoftOptions.
Метод предназначен для клонирования данного объекта LoftOptions.
Returns: Возвращает клон данного объекта. Тип Object.