Teigha.DatabaseServices.LayerStateManager.AbortLayerStateRestore
Это событие создается, если прерван процесс восстановления состояния слоя.
Это событие создается, если прерван процесс восстановления состояния слоя.