HostMgd.EditorInput.PromptFileOptions
Базовый класс для параметров диалогового окна, появляющегося
при открытии и сохранении пользователем файлов.

HostMgd.EditorInput.PromptFileOptions.AllowUrls
Свойство возвращает и устанавливает признак разрешения ввода
URL адресов.

HostMgd.EditorInput.PromptFileOptions.DialogCaption
Свойство возвращает и устанавливает строку, выводимую в
заголовке окна диалога.

HostMgd.EditorInput.PromptFileOptions.DialogName
Возвращает или устанавливает строку с именем окна диалога.

HostMgd.EditorInput.PromptFileOptions.Filter
Свойство возвращает и устанавливает строку для фильтации имен
файлов по расширению.

HostMgd.EditorInput.PromptFileOptions.FilterIndex
Устанавливает или взвращает текущий индекс фильтра.

HostMgd.EditorInput.PromptFileOptions.InitialDirectory
Возвращает или устанавливает строку с начальным каталогом (в
диалоговом окне поиска имени файла).

HostMgd.EditorInput.PromptFileOptions.InitialFileName
Возвращает или устанавливает начальное имя файла.

HostMgd.EditorInput.PromptFileOptions.Message
Возвращает или устанавливает строку с приглашением.

HostMgd.EditorInput.PromptFileOptions.PreferCommandLine
Возвращает или устанавливает признак того, будет ли
приоритетом ввод имени из командной строки.

HostMgd.EditorInput.PromptFileOptions.#ctor(System.String)
Конструктор класса.
message - строка запроса, выводимая в диалоге