HostMgd.PlottingServices.PlotProgress.IsPlotCancelled
Индикатор отмены печати. Пользователь может периодически опрашивать это свойство для определения возможности
продолжения работы.
Только для чтения.