Teigha.GraphicsInterface.RenderSettingsTraits
Класс RenderSettingsTraits представляет настройки рендеринга для базовой системы отображения.
Класс RenderSettingsTraits представляет настройки рендеринга для базовой системы отображения.

Teigha.GraphicsInterface.RenderSettingsTraits.BackFacesEnabled
Свойство BackFacesEnabled позволяет определить, должны ли отображаться задние грани.
Свойство BackFacesEnabled позволяет определить, должны ли отображаться задние грани.
Returns: Возвращает true, если задние грани должны отображаться.
В противном случае возвращает false.

Teigha.GraphicsInterface.RenderSettingsTraits.DiagnosticBackgroundEnabled
Свойство DiagnosticBackgroundEnabled позволяет определить, должен ли отображаться диагностический фон.
Свойство DiagnosticBackgroundEnabled позволяет определить, должен ли отображаться диагностический (клетчатый) фон.
Returns: Возвращает true, если диагностический фон должен отображаться.
В противном случае возвращает false.

Teigha.GraphicsInterface.RenderSettingsTraits.MaterialEnabled
Свойство MaterialEnabled позволяет определить, включен ли режим индивидуального назначения материалов для каждого объекта.
Свойство MaterialEnabled позволяет определить, включен ли режим индивидуального назначения материалов для каждого объекта.
Returns: Возвращает true, если используется режим индивидуального назначения материалов для каждого объекта.
В противном случае возвращает false.

Teigha.GraphicsInterface.RenderSettingsTraits.ModelScaleFactor
Свойство ModelScaleFactor представляет масштабный коэффициент линейных единиц измерения модели относительно 1 метра.
Свойство ModelScaleFactor представляет масштабный коэффициент линейных единиц измерения модели относительно 1 метра.
Например, если модель построена в миллиметрах, то данный масштабный коэффициент равен 0.001.
Returns: Возвращает масштабный коэффициент линейных единиц измерения модели, выраженный в долях метра.
Тип double.

Teigha.GraphicsInterface.RenderSettingsTraits.ShadowsEnabled
Свойство ShadowsEnabled позволяет определить, включено ли отображение теней.
Свойство ShadowsEnabled позволяет определить, включено ли отображение теней.
Returns: Возвращает true, если отображение теней включено.
В противном случае возвращает false.

Teigha.GraphicsInterface.RenderSettingsTraits.TextureSampling
Свойство TextureSampling позволяет определить, включена ли выборка (фильтрация) текстур для изображения.
Свойство TextureSampling позволяет определить, включена ли выборка (фильтрация) текстур для изображения.
Returns: Возвращает true, если фильтрация текстур включена.
В противном случае возвращает false.