HostMgd.Windows.ToolPalette.CatalogItem
Класс CatalogItem является базовым классом для всех элементов каталога, инкапсулируя их общие свойства и поведение.
Класс CatalogItem является базовым классом для всех элементов каталога.
Он инкапсулирует общие свойства и поведение элементов.
Этот класс используется для создания и реализации следующих элементов каталога:
* инструмент (Tool),
* пакет (Package),
* панель инструментов (Palette),
* категория (Category),
* каталог (Catalog),
* стандартный инструмент (Stock Tool).

HostMgd.Windows.ToolPalette.CatalogItem.AddChild(HostMgd.Windows.ToolPalette.CatalogItem)
Метод добавляет дочерний элемент к данному элементу.
Метод добавляет newItem в качестве последнего дочернего элемента данного элемента и
возвращает его индекс.
newItem: Элемент, добавляемый в качестве дочернего. Тип CatalogItem.
Returns: Возвращает индекс только что добавленного дочернего элемента.
Тип int.