Teigha.DatabaseServices.ProxyObject.GetReferences
Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
Returns: Возвращает коллекцию идентификаторов объектов, на которые в данном прокси-объекте имеются ссылки.
Тип DBObjectReferenceCollection.