HostMgd.EditorInput.PromptOpenFileOptions
Класс содержит параметры конфигурации окна диалога выбора
имени файла, которые передаются в метод
Editor.GetFileNameForOpen().

HostMgd.EditorInput.PromptOpenFileOptions.#ctor(System.String)
Конструктор класса.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptOpenFileOptions.SearchPath
Устанавливает или возвращает признак того, что разрешен поиск
пути к файлу. Если свойство имеет значение true, то поиск
пути к файлу разрешен.

HostMgd.EditorInput.PromptOpenFileOptions.TransferRemoteFiles
Устанавливает или возвращает признак того, что разрешно
преобразование или удаление файла. Если свойство имеет
значение true, то преобразование или удаление разрешено.