Teigha.DatabaseServices.PlotType.Extents
Значение: 1. Extents / Границы.
Вывод на печать области чертежа, которая в данный момент содержит какие-либо объекты.
Печатаются все объекты текущего пространства.