HostMgd.EditorInput.JigPromptStringOptions.DefaultValue
Значение по умолчанию для запроса текста во время операции Jig.
Свойство предназначено для чтения и определения текста по умолчанию для запроса текстовых данных во время операции Jig.
Значение по умолчанию будет использовано, если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
Returns: Возвращает текстовые данные, заданные по умолчанию.