Teigha.DatabaseServices.GradientPatternType
Перечисление GradientPatternType определяет источники шаблонов градиента.
Перечисление GradientPatternType определяет источники шаблонов градиента (предопределенный или пользовательский).