Teigha.Geometry.CoordinateSystem3d.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Возвращаемая строка включает начало этой системы координат и направления её осей X, Y и Z
Returns: Возвращает строковое представление данного объекта.
Тип String.