HostMgd.PlottingServices.MediaBounds
Класс MediaBounds представляет границы носителя в терминах размера страницы, нижнего левого угла и верхнего правого угла области печати.
Не реализован.
Класс MediaBounds представляет границы носителя (листа) в терминах размера страницы, нижнего левого угла и верхнего правого угла области печати.
В текущей версии не реализован.

HostMgd.PlottingServices.MediaBounds.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса MediaBounds.
Создает экземпляр класса с указанными параметрами.
Не реализован.
Конструктор класса MediaBounds.
Создает экземпляр класса с указанными параметрами.
В текущей версии не реализован.
pageSize: Размер страницы.            Тип Teigha.Geometry.Point2d.
lowerLeftPrintableArea: Левый нижний угол области печати.   Тип Teigha.Geometry.Point2d.
upperRightPrintableArea: Правый верхний угол области печати. Тип Teigha.Geometry.Point2d.

HostMgd.PlottingServices.MediaBounds.Equals(System.Object)
Метод реализует проверку равенства данного и указанного объектов.
Не реализован.
Метод реализует проверку равенства данного объекта и объекта obj.
В текущей версии не реализован.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

HostMgd.PlottingServices.MediaBounds.IsEqualTo(HostMgd.PlottingServices.MediaBounds)
Метод позволяет проверить, совпадают ли границы носителя в данном объекте и в указанном объекте MediaBounds с точностью по умолчанию.
Не реализован.
Метод позволяет проверить, совпадают ли границы носителя (листа) в данном объекте и в указанном объекте MediaBounds с точностью по умолчанию.
Для этого используется вызов метода MediaBounds.IsEqualTo(MediaBounds a, Tolerance tolerance) c точностью, равной Tolerance.Global.
В текущей версии не реализован.
a: Входной объект, с которым выполняется сравнение. Тип HostMgd.PlottingServices.MediaBounds.
Returns: Возвращает true, если в пределах точности по умолчанию границы листа, определенные данным объектом и объектом a, совпадают.
В противном случае возвращает false.

HostMgd.PlottingServices.MediaBounds.IsEqualTo(HostMgd.PlottingServices.MediaBounds,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадают ли границы носителя в данном объекте и в указанном объекте MediaBounds в пределах заданной точности.
Не реализован.
Метод позволяет проверить, совпадают ли границы носителя (листа) в данном объекте и в указанном объекте MediaBounds в пределах заданной точности.
В текущей версии не реализован.
a: Входной объект, с которым выполняется сравнение. Тип HostMgd.PlottingServices.MediaBounds.
tolerance: Входное значение геометрической точности.  Тип Teigha.Geometry.Tolerance.
Returns: Возвращает true, если в пределах точности tolerance границы листа, определенные данным объектом и объектом a, совпадают.
В противном случае возвращает false.

HostMgd.PlottingServices.MediaBounds.ToString(System.IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
Не реализован.
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
В текущей версии не реализован.
provider: Заданный провайдер региональных и языковых настроек. Тип System.IFormatProvider.
Returns: Возвращает строковое представление данного объекта.
Тип System.String.

HostMgd.PlottingServices.MediaBounds.!=(HostMgd.PlottingServices.MediaBounds,HostMgd.PlottingServices.MediaBounds)
Оператор неравенства класса MediaBounds.
Не реализован.
Оператор неравенства класса MediaBounds.
В текущей версии не реализован.
a: Левый  операнд. Тип HostMgd.PlottingServices.MediaBounds.
b: Правый операнд. Тип HostMgd.PlottingServices.MediaBounds.
Returns: Возвращает true в случае неравенства операндов. В противном случае возвращает false.
Тип bool.

HostMgd.PlottingServices.MediaBounds.==(HostMgd.PlottingServices.MediaBounds,HostMgd.PlottingServices.MediaBounds)
Оператор равенства класса MediaBounds.
Не реализован.
Оператор равенства класса MediaBounds.
В текущей версии не реализован.
a: Левый  операнд. Тип HostMgd.PlottingServices.MediaBounds.
b: Правый операнд. Тип HostMgd.PlottingServices.MediaBounds.
Returns: Возвращает true в случае равенства операндов. В противном случае возвращает false.
Тип bool.

HostMgd.PlottingServices.MediaBounds.LowerLeftPrintableArea
Свойство LowerLeftPrintableArea позволяет задать или получить точку левого нижнего угла области печати.
Не реализовано.
Свойство LowerLeftPrintableArea позволяет задать или получить точку левого нижнего угла области печати.
В текущей версии не реализовано.
Returns: Возвращает точку левого нижнего угла области печати.
Тип Teigha.Geometry.Point2d.

HostMgd.PlottingServices.MediaBounds.PageSize
Свойство PageSize представляет размеры страницы.
Не реализовано.
Свойство PageSize представляет размеры страницы.
В текущей версии не реализовано.
Returns: Возвращает размеры страницы по ширине и высоте.
Тип Teigha.Geometry.Point2d.

HostMgd.PlottingServices.MediaBounds.UpperRightPrintableArea
Свойство UpperRightPrintableArea позволяет задать или получить точку правого верхнего угла области печати.
Не реализовано.
Свойство UpperRightPrintableArea позволяет задать или получить точку правого верхнего угла области печати.
В текущей версии не реализовано.
Returns: Возвращает точку правого верхнего угла области печати.
Тип Teigha.Geometry.Point2d.