HostMgd.EditorInput.PromptResult.ToString
Метод ToString() возвращает строковое представление результата ввода,
отражающее статус операции и значение, введённое пользователем.
Метод используется для получения строкового описания результата интерактивного ввода.
Метод возвращает текст, отражающий либо введённое значение, либо статус операции (например, отмена или ошибка).
Это удобно при отладке, логировании или выводе информации в командную строку nanoCAD.
Returns: Возвращает значение типа string, которое может содержать:
* для успешного ввода (Status == PromptStatus.OK) —
строковое представление введённого значения (например, число, точка, строка).
* для отмены (Status == PromptStatus.Cancel)
— сообщение вроде "Operation cancelled".
* для ошибки (Status == PromptStatus.Error)
— описание ошибки или сообщение о некорректном вводе.
Формат возвращаемой строки зависит от типа производного класса
и статуса операции ввода.
Example
C#