Teigha.DatabaseServices.Entity.EdgeStyleId
Свойство предназначено для получения или установки идентификатора визуального стиля,
применяемого исключительно к ребрам геометрического объекта.
Свойство Обеспечивает доступ к идентификатору визуального стиля только для ребер
объекта.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на объект стиля отображения ребер (EdgeStyle),
который определяет их внешний вид при визуализации.