Teigha.DatabaseServices.TableHitTestInfo.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта, которое содержит индексы строки и столбца.
Returns: Возвращает строковое представление данного объекта. Тип String.