Teigha.LayerManager.LayerFilterCollection.GetEnumerator
Метод предоставляет объект перечислителя для данной коллекции.
Метод предоставляет объект перечислителя для данной коллекции.
Returns: Возвращает перечислитель коллекции.
Тип IEnumerator.