HostMgd.PlottingServices.MediaBounds.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Не реализован.
Метод позволяет получить эквивалентное строковое представление данного объекта.
В текущей версии не реализован.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип System.String.