Teigha.Geometry.BoundBlock2d.GetMinimumPoint
Метод предоставляет минимальную точку данной граничной рамки.
Метод предоставляет минимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса Point2d, который представляет минимальную точку граничной рамки.