Teigha.DatabaseServices.DimAssoc.RemovePointRef
Метод удаляет указатель на опорную точку, которая связывает размер с соответствующей геометрией.
Метод удаляет указатель на опорную точку, которая связывает размер с соответствующей геометрией.