Teigha.GraphicsInterface.DefaultLightingType
Перечисление DefaultLightingType определяет используемые по умолчанию типы удаленных источников света, которые доступны для видовых экранов и рендеринга.
Перечисление DefaultLightingType определяет используемые по умолчанию типы удаленных источников света, которые доступны для видовых экранов и рендеринга.