Teigha.DatabaseServices.CustomScale.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Метод позволяет получить хеш-код данного объекта.
Хеш-код представляет собой целочисленное значение, уникальное для любого экземпляра данного класса.
Returns: Возвращает хеш-код объекта. Тип int.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.