Teigha.DatabaseServices.Database.GetVisualStyleList
Функция возвращает список, содержащий локализованные имена
визуальных стилей, определенных в словаре визуальных стилей.
Анонимные визуальные стили и визуальные стили, помеченные как
«только для внутреннего использования», исключаются из
списка.