Teigha.BoundaryRepresentation.Edge
Класс Edge  является интерфейсным классом для рёбер BREP.
Рёбра являются основными элементами BREP с ассоциированной геометрией - кривыми.
Класс Edge является интерфейсным классом для рёбер BREP.
Этот класс определяет функционал, относящийся к уровню ребра BREP, и поддерживает соответствие между подобъектами рёбер nanoCAD и соответствующими элементами граничного представления.
Поскольку рёбра BREP являются основными элементами BREP, они имеют ассоциированную геометрию - кривые.
Класс Edge обеспечивает опосредованную связь между классами Geometry, Solid3d, Region и Body.

Teigha.BoundaryRepresentation.Edge.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса Edge. Создает экземпляр класса, используя указанный полный путь подобъекта.
Конструктор класса Edge. Создает экземпляр класса, используя указанный полный путь подобъекта.
fullSubentPath: полный путь подобъекта.

Teigha.BoundaryRepresentation.Edge.GetLoopsStartingFrom(Teigha.BoundaryRepresentation.BoundaryLoop)
Метод позволяет получить для данного ребра коллекцию циклов, начиная с указанного цикла.
Метод позволяет получить для данного ребра коллекцию циклов, начиная с указанного цикла startFrom.
startFrom: Входной цикл, с которого начинается формирование коллекции циклов данного ребра.
Returns: Возвращает коллекцию циклов данного ребра.
Тип EdgeLoopCollection.

Teigha.BoundaryRepresentation.Edge.Curve
Свойство Curve предоставляет доступ к 3D-кривой, которая связана с данным ребром BREP.
Свойство Curve предоставляет доступ к 3D-кривой данного ребра BREP.
Returns: Возвращает кривую.  Тип Curve3d.

Teigha.BoundaryRepresentation.Edge.IsOrientToCurve
Свойство IsOrientToCurve позволяет проверить, совпадает ли ориентация ребра от вершины 1 до вершины 2 с направлением параметризации базовой 3D-кривой.
Свойство IsOrientToCurve позволяет проверить, совпадает ли ориентация ребра от вершины 1 до вершины 2 с направлением параметризации базовой 3D-кривой.
Notes
Ориентация базовой 3D-кривой может быть изменена с использованием метода Curve3d.GetReverseParameterCurve().
Returns: Возвращает true, если и только если ориентация ребра от вершины 1 до вершины 2 совпадает с направлением параметризации базовой 3D-кривой.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.Edge.Loops
Свойство Loops предоставляет доступ ко всем циклам данного ребра BREP.
Свойство Loops предоставляет доступ ко всем циклам данного ребра BREP.
Returns: Возвращает коллекцию всех циклов данного ребра BREP.
Тип EdgeLoopCollection.

Teigha.BoundaryRepresentation.Edge.Vertex1
Свойство Vertex1 предоставляет доступ к начальной вершине данного ребра в его естественной ориентации от вершины 1 к вершине 2.
Свойство Vertex1 предоставляет доступ к начальной вершине данного ребра в его естественной ориентации от вершины 1 к вершине 2.
Returns: Возвращает начальную вершину BREP.
Тип BoundaryRepresentation.Vertex.

Teigha.BoundaryRepresentation.Edge.Vertex2
Свойство Vertex2 предоставляет доступ к конечной вершине данного ребра в его естественной ориентации от вершины 1 до вершины 2.
Свойство Vertex2 предоставляет доступ к конечной вершине данного ребра в его естественной ориентации от вершины 1 до вершины 2.
Returns: Возвращает конечную вершину BREP.
Тип BoundaryRepresentation.Vertex.