HostMgd.EditorInput.FenceSelectedObject
Класс, описывающий объект, выбранный с помощью линии выбора
(выбранными будут те объекты, которые эта линия пересекает).
В настоящее время нигде не используется.

HostMgd.EditorInput.FenceSelectedObject.#ctor(Teigha.DatabaseServices.ObjectId,HostMgd.EditorInput.SelectionMethod,System.Int32,array)
Конструктор.
id: Объект для выбора
method: Метод выбора
gsMarker: GS маркеры
descriptors: Описание образующих линию точек