Teigha.DatabaseServices.OrthographicView
Данное перечисление определяет ортогональные виды относительно пользовательской системы координат.
Данное перечисление определяет ортогональные виды относительно пользовательской системы координат.