Teigha.DatabaseServices.Polyline
Класс представляет объект "полилиния" на чертеже.
Полилинию часто называют легкой полилинией из-за эффективного
использования памяти этим классом. Класс Polyline
обеспечивает высокую производительность и уменьшение
накладных расходов по сравнению с классом Polyline2d.
Представление класса Polyline в базе данных является более
эффективным из-за хранения единого объекта со своим
единственным именем, типом, слоями, шириной и т.д.
"Легкая" полилиния — это:
* сегменты прямых линий;
* сегменты дуг;
* постоянная или изменяемая ширина;
* толщина.
Функциональность и использование в командах при работе с
"легкой" полилинией не включает в себя:
* данных для сглаживания дуг кривой;
* данных для проведение сплайна;
* данных для проведения касательной.
"Легкая" полилиния создается командой PLINE и редактируется
командой PEDIT. При создании или редактировании полилинии,
командные опции для команд PLINE или PEDIT остаются теми же,
что и для предыдущих версий.
Команда PEDIT редактирует "Легкие" полилинии так же, как и
Polyline2d в предыдущих версиях. Если опции «Сплайн» или
«Сглаживание» включены, то "легкая" полилиния преобразуется в
Polyline2d для продолжения редактирования. Дескриптор всегда
поддерживается и не меняется. Просто дескриптор "легкой"
полилинии становится дескриптором Polyline2d (заголовок
геометрического объекта для старого стиля геометрических
объектов полилиний, которые содержат подобъекты).
Поведение ручек аналогично поведению ручек для Polyline2d.
Поведение команд редактирования nanoCAD также остается таким
же.
Свойства "легких" полилиний включают цвет, слой, тип линии,
линейный масштаб, ширину, толщину. Все свойства применяются к
объекту целиком и не могут меняться между отдельными
сегментами.
Note
Класс Polyline переопределяет метод Entity.SaveAs(). Метод
Polyline.SaveAs() не вызывает метод WorldDraw()
геометрического объекта и не рисует графику для прокси.
Поэтому, вы должны разработать свой собственный метод для
создания графики, когда nanoCAD получает прокси-графику для
любых объектов вашего класса.
Количество вершин "легкой" полилинии должно быть больше
одной. Полилиния с 0 или 1 вершинами не может быть отправлена
или оставлена в базе данных.

Teigha.DatabaseServices.Polyline.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Polyline.#ctor(System.Int32)
Класс Polyline динамически выделяет память при добавлении
вершин. Однако, если вы знаете количество вершин, которое
будет добавлено к полилинии, в конструкторе может быть
выделен точный объем памяти в соответствии с указанным в
конструкторе количеством вершин. Определение ненулевого
значения для параметра vertices не означает, что объект
автоматически будет иметь столько вершин. Это означает, что
будет выделена память, готовая к загрузке информации о
вершинах. Эта выделенная память не используется, пока не
будет заполнена при вызове метода Polyline.AddVertexAt().
Если полилиния будет расширена или уменьшена с помощью
добавления или удаления вершин, выделенная динамическая
память может только увеличиваться, но не уменьшаться. Когда
пользователь завершает добавление или удаление вершин, может
оставаться неиспользуемая выделенная память. Для ее
освобождения следует использовать метод
Polyline.MinimizeMemory(), но после того, как все добавления
или удаления в полилинии сделаны. Это освобождение памяти не
делается автоматически при выполнении каждой из команд
Polyline.AddVertexAt() и Polyline.RemoveVertexAt(), поскольку
является операцией, затратной по времени.
vertices: Количество вершин, для которых будет выделена

Teigha.DatabaseServices.Polyline.AddVertexAt(System.Int32,Teigha.Geometry.Point2d,System.Double,System.Double,System.Double)
Этот метод добавляет вершину к полилинии. Если index равен 0,
то вершина становится первой из вершин полилинии. Если index
— это значение, возвращаемое методом
Polyline.NumberOfVertices, то добавляемая вершина станет
последней вершиной полилинии. В остальных случаях вершина
добавляется перед вершиной с номером index.
Note
pt должен быть определен в координатной системе полилинии, а
не в Мировой системе координат (WCS).
index: Индекс вершины (отсчитываемый от 0), добавляемой
pt: Координаты добавляемой точки
bulge: Степень выпуклости для вершины
startWidth: Начальная ширина вершины
endWidth: Конечная ширина вершины

Teigha.DatabaseServices.Polyline.ConvertFrom(Teigha.DatabaseServices.Entity,System.Boolean)
Этот метод заполняет данными Polyline из объекта типа
Polyline2d, на который указывает параметр entity. entity
должен указывать на SimplePoly или FitCurvePoly типы объекта
Polyline2d базы данных. Этот метод должен вызываться из
объекта Polyline, который еще не является резидентным в базе
данных.
Если transferId установлен в true, объект Polyline станет
резидентным в базе данных. Этот объект сможет получить Id
объекта, дескриптор и любые расширенные данные
геометрического объекта (кроме данных вершин), расширенный
словарь и реакторы из Polyline2d, на который указывает
параметр entity. entity будет затем удален и установлен в
NULL.
Если transferId установлен в false, entity останется в базе
данных как он и был, и вызвавший метод должен закрыть его.
Полученный объект Polyline не станет резидентом базы данных,
и, если он не будет добавлен к базе данных, то должен быть
удален.
entity: Указатель на копируемый объект Polyline2d
transferId: Признак, будет или нет производиться HandOverTo

Teigha.DatabaseServices.Polyline.ConvertTo(System.Boolean)
Этот метод создает Polyline2D из объекта Polyline и
возвращает вновь созданный объект Polyline2D.
Если transferId установлен в true, объект Polyline2D станет
резидентным в базе данных. Этот объект сможет получить Id
объекта, дескриптор и любые расширенные данные, расширенный
словарь и реакторы из Polyline, из которого вызван метод.
Объект Polyline перестанет быть резидентом базы данных и
может быть удален с помощью оператора delete C++.
Если transferId установлен в false, Polyline останется в базе
данных как он и был и вызвавший метод должен закрыть его.
Полученный объект Polyline2D и все его вершины не станут
резидентом базы данных, и, если они не будут добавлены к базе
данных, то должны быть удалены.
transferId: Признак, будет или нет производиться HandOverTo

Teigha.DatabaseServices.Polyline.GetArcSegment2dAt(System.Int32)
Если сегмент с вершиной с номером, заданным index, является
дугой, то метод создает дугу с 2D информацией указанного
сегмента полилинии (радиус, центр и т.д.) в координатах OCS
полилинии.
index: Индекс (отсчитываемый от 0) вершины для начала дуги

Teigha.DatabaseServices.Polyline.GetArcSegmentAt(System.Int32)
Если сегмент с вершиной с номером, заданным index, является
дугой, то метод создает дугу с 3D информацией указанного
сегмента полилинии (радиус, центр и т.д.) в координатах OCS
полилинии.
index: Индекс (отсчитываемый от 0) вершины для начала дуги

Teigha.DatabaseServices.Polyline.GetBulgeAt(System.Int32)
Этот метод возвращает значение степени выпуклости для вершины,
указанной в index. Степень выпуклости используется для
задания того, какая часть сегмента дуги присутствует в данной
вершине. Степень выпуклости определяется как одна четвертая
тангенса внутреннего угла для сегмента дуги, являющегося
отрицательным, если дуга располагается против часовой стрелки
от начальной к конечной точке. Степень выпуклости, равная 0,
характеризует прямую, а степень выпуклости, равная 1,
характеризует полукруг.
index: Индекс (отсчитываемый от 0) вершины для начала

Teigha.DatabaseServices.Polyline.GetEndWidthAt(System.Int32)
Возвращает величину ширины конца сегмента полилинии. Эта
величина используется как величина ширины конца сегмента для
всех вершин полилинии.
index: Индекс (отсчитываемый от 0) вершины

Teigha.DatabaseServices.Polyline.GetLineSegment2dAt(System.Int32)
Если сегмент с вершиной с номером, заданным index, является
линией, то метод создает 2D копию сегмента с информацией
выбранного сегмента полилинии в собственных объектных
координатах (OCS) полилинии.
index: Индекс (отсчитываемый от 0) вершины для начала

Teigha.DatabaseServices.Polyline.GetLineSegmentAt(System.Int32)
Если сегмент с вершиной с номером, заданным index, является
линией, то метод создает 3D копию сегмента с информацией
выбранного сегмента полилинии в мировых координатах.
index: Индекс (отсчитываемый от 0) вершины для начала

Teigha.DatabaseServices.Polyline.GetPoint2dAt(System.Int32)
Этот метод возвращает 2D расположение вершины полилинии,
заданной параметром index, в собственной координатной системе
(OCS).
index: Индекс (отсчитываемый от 0) вершины

Teigha.DatabaseServices.Polyline.GetPoint3dAt(System.Int32)
Этот метод возвращает 3D расположение вершины полилинии,
заданной параметром index, в Мировой системе координат.
index: Индекс (отсчитываемый от 0) вершины

Teigha.DatabaseServices.Polyline.GetSegmentType(System.Int32)
Этот метод возвращает тип сегмента (SegType), который
начинается с вершины index.
Если index некорректный, то метод принимает значения
начальной и конечной вершин, равными 0.0, и возвращает
SegType Coincident.
index: Индекс (отсчитываемый от 0) вершины

Teigha.DatabaseServices.Polyline.GetStartWidthAt(System.Int32)
Метод возвращает начальную ширину линии в вершине index.
index: Индекс (отсчитываемый от 0) вершины

Teigha.DatabaseServices.Polyline.OnSegmentAt(System.Int32,Teigha.Geometry.Point2d,System.Double)
Этот метод определяет, находится или нет точка, на которую
указывает pt2d (определенная в координатной системе
полилинии), на сегменте полилинии, начинающейся с вершины
index. value является параметрической формой типа сегмента
(другими словами, линия или дуга).
Метод возвращает true, если точка находится на полилинии.
index: Индекс (отсчитываемый от 0) вершины
pt2d: Точка (в координатах OCS полилинии) для проверки
value: Выходной параметр типа вершины

Teigha.DatabaseServices.Polyline.RemoveVertexAt(System.Int32)
Метод удаляет вершину с индексом, заданным index.
index: Индекс (отсчитываемый от 0) удаляемой вершины

Teigha.DatabaseServices.Polyline.Reset(System.Boolean,System.Int32)
Этот метод перезадает данные вершин полилинии.
Если reuse установлен в true, то NumberOfVertices количество
вершин полилинии остается нетронутыми, а все вершины после
этого числа удаляются.
Если reuse установлен в false, то значение NumberOfVertices
игнорируется, и информация обо всех существующих вершинах
удаляется.
reuse: Признак, указывающий, сохраняется или нет,
vertices: Количество остающихся вершин

Teigha.DatabaseServices.Polyline.SetBulgeAt(System.Int32,System.Double)
Этот метод устанавливает значение степени выпуклости для
вершины, указанной в index. Это определяет степени выпуклости
сегмента полилинии, который следует за вершиной index.
index: Индекс (отсчитываемый от 0) вершины
bulge: Значение степени выпуклости для вершины

Teigha.DatabaseServices.Polyline.SetEndWidthAt(System.Int32,System.Double)
Этот метод устанавливает конечную ширину вершины index.
index: Индекс (отсчитываемый от 0) вершины
endWidth: Значение конечной ширины вершины index

Teigha.DatabaseServices.Polyline.SetPointAt(System.Int32,Teigha.Geometry.Point2d)
Устанавливает значение pt (в координатах OCS полилинии) в
качестве расположения вершины index.
index: Индекс (отсчитываемый от 0) вершины
pt: задаваемые координаты вершины

Teigha.DatabaseServices.Polyline.SetStartWidthAt(System.Int32,System.Double)
Этот метод устанавливает начальную ширину для вершины index.
index: Индекс (отсчитываемый от 0) вершины
startWidth: Значение начальной ширины вершины index

Teigha.DatabaseServices.Polyline.Closed
Обеспечивает доступ к признаку того, является ли полилиния
замкнутой (т.е. что есть сегмент от последней вершины к
первой) или нет.

Teigha.DatabaseServices.Polyline.ConstantWidth
Обеспечивает доступ к постоянной ширине полилинии.

Teigha.DatabaseServices.Polyline.Elevation
Обеспечивает доступ к расстоянию между плоскостью полилинии и
началом мировых координат.

Teigha.DatabaseServices.Polyline.HasBulges
Возвращает признак того, что установлен коэффициент
выпуклости для любого из сегментов полиллинии. Этот
коэффициент требуется для сегментов дуг полилинии.

Teigha.DatabaseServices.Polyline.HasWidth
Возвращает признак того, что для полилинии задано значение
ширины для сегментов. Значение ширины необходимо для
измененения ширины сегментов в полилинии.

Teigha.DatabaseServices.Polyline.IsOnlyLines
Возвращает признак того, что полилиния содержит только линии.

Teigha.DatabaseServices.Polyline.Normal
Обеспечивает доступ к вектору нормали (в мировых координатах)
к плоскости, содержащей полилинию.

Teigha.DatabaseServices.Polyline.NumberOfVertices
Возвращает количество вершин полилинии.

Teigha.DatabaseServices.Polyline.Plinegen
Если true, то линии полилинии отображаются поверх ее вершин.

Teigha.DatabaseServices.Polyline.Thickness
Обеспечивает доступ к значению ширины (иногда называемой
глубиной "вытеснения" или высотой) полилинии.