Teigha.Geometry.Matrix3d.GetDeterminant
Метод позволяет получить определитель данной матрицы.
Метод позволяет получить определитель данной матрицы.
Returns: Возвращает значение детерминанта матрицы. Тип double.