Teigha.DatabaseServices.AbstractViewTable
Класс AbstractViewTable является базовым классом для двух классов таблиц символов - ViewTable и ViewportTable.
Класс AbstractViewTable является базовым классом для двух классов таблиц символов - ViewTable и ViewportTable.