Teigha.DatabaseServices.Field.GetStringValue
Метод позволяет получить строковое значение, связанное с данным полем.
Метод позволяет получить строковое значение, связанное с данным полем.
Returns: Возвращает строковое значение, связанное с данным полем. Тип String.