Teigha.DatabaseServices.XrefFullSubentityPath.GetObjectIds
Метод предоставляет массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
Метод предоставляет массив идентификаторов объектов, связанных с данным объектом XrefFullSubentityPath.
Returns: Возвращает массив идентификаторов объектов.
Тип ObjectId[].