Teigha.DatabaseServices.Filters.SpatialFilterVolume
Класс представляет данные, необходимые для описания объема пространственного фильтра.
Класс представляет данные, необходимые для описания объема пространственного фильтра.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector2d)
Конструктор класса SpatialFilterVolume.
Конструктор класса SpatialFilterVolume.
fromPoint: Точка «от» преобразованной границы отсечения. Тип Point3d.
toPoint: Точка «до» преобразованной границы отсечения. Тип Point3d.
upDir: Вектор нормали преобразованной границы отсечения. Тип Vector3d.
viewField: Вектор поля зрения преобразованной границы отсечения. Тип Vector2d.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.FromPoint
Свойство FromPoint возвращает точку "от" преобразованной границы отсечения.
Свойство FromPoint возвращает точку "от" преобразованной границы отсечения.
Returns: Возвращает точку "от" преобразованной границы отсечения. Тип Point3d.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.ToPoint
Свойство ToPoint возвращает точку "до" преобразованной границы отсечения.
Свойство ToPoint возвращает точку "до" преобразованной границы отсечения.
Returns: Возвращает точку "до" преобразованной границы отсечения. Тип Point3d.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.UpDirection
Свойство UpDirection возвращает вектор нормали преобразованной границы отсечения.
Свойство UpDirection возвращает вектор нормали преобразованной границы отсечения.
Returns: Возвращает вектор нормали. Тип Vector3d.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.ViewField
Свойство ViewField возвращает вектор области просмотра преобразованной границы отсечения.
Свойство ViewField возвращает вектор области просмотра преобразованной границы отсечения.
Returns: Возвращает вектор области просмотра. Тип Vector2d.