HostMgd.ApplicationServices.DocumentLockMode.Read
Значение: 32 (0x20).
Этот тип блокировки устанавливает блокировку только на чтение.
Она может сосуществовать с другими блокировками Read, установленными другими исполняемыми контекстами.
Блокировка Read взаимно исключает блокировки типа Write и ExclusiveWrite.
Read позволяет исполняемому контексту просматривать содержимое документа, но не изменять его.