Teigha.DatabaseServices.DimStyleTableRecord.GetArrowId
Метод предназначен для получения ObjectId блока левого или правого окончания размерной линии.
Метод предназначен для получения ObjectId блока левого или правого окончания размерной линии.
whichArrow: параметр типа DimArrowFlag, указывающий, ObjectId какой именно стрелки нужно получить
Returns: Возвращает ObjectId блока окончания размерной линии.