Teigha.DatabaseServices.DbDictionaryEnumerator
Класс DbDictionaryEnumerator представляет перечислитель для коллекции объектов DBDictionaryEntry.
Класс DbDictionaryEnumerator представляет перечислитель для коллекции объектов DBDictionaryEntry.

Teigha.DatabaseServices.DbDictionaryEnumerator.Current
Свойство обеспечивает доступ к текущей записи перечислителя.
Свойство обеспечивает доступ к текущей записи перечислителя.
Returns: Возвращает текущую запись коллекции. Тип DBDictionaryEntry.

Teigha.DatabaseServices.DbDictionaryEnumerator.Entry
Свойство обеспечивает доступ к записи коллекции, на которую указывает свойство Entry перечислителя.
Свойство обеспечивает доступ к записи коллекции, на которую указывает свойство Entry перечислителя.
Returns: Возвращает запись коллекции, указанную в свойстве Entry. Тип DBDictionaryEntry.

Teigha.DatabaseServices.DbDictionaryEnumerator.Key
Свойство возвращает значение ключа текущей записи перечислителя.
Свойство обеспечивает доступ к значению ключа текущей записи перечислителя.
Returns: Возвращает ключ записи. Тип String.

Teigha.DatabaseServices.DbDictionaryEnumerator.Value
Свойство возвращает значение текущей записи перечислителя.
Свойство обеспечивает доступ к значению текущей записи перечислителя.
Returns: Возвращает значение текущей записи перечислителя. Тип DatabaseServices.ObjectId.