HostMgd.EditorInput.SamplerStatus
Перечисление, представляющее возможные результаты действия по
приглашению.
Наименование   Описание
-------------  ------------------
Ok             Изменения приняты
NoChange       Нет изменений
Cancel         Отмена операции