Teigha.Geometry.CoordinateSystem3d.GetHashCode
Метод позволяет получить хеш-код данного объекта.
Метод позволяет получить хеш-код данного объекта.
Хэш-код представляет собой целочисленный идентификатор, уникальный для каждого экземпляра данной структуры.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() из этого класса, в то время как метод Equals() может быть переопределен в производном классе.
Returns: Возвращает хеш-код данного объекта.
Тип int.