Teigha.DatabaseServices.TableCopyOptions.OnlyContentModifiedAfterUpdate
Значение: 4194304 = 0x400000.
Если содержимое целевой ячейки претерпело изменения с момента последнего обновления, восстановить только содержимое.