HostMgd.PlottingServices.DsdData
Класс DsdData реализует чтение и запись DSD-файлов, включает коллекцию объектов DSDEntry, а также DSD-данные о подшивке.
Не реализован.
Класс DsdData реализует чтение и запись DSD-файлов, включает коллекцию объектов DSDEntry, а также DSD-данные о подшивке.
В текущей версии не реализован.
Notes
Аббревиатура DSD означает "drawing set descriptions" - описание подшивки чертежей.
Файлы формата DSD используются в качестве INI-файлов для настройки публикации группы листов с помощью команды PUBLISH.
Пользователи nanoCAD могут загружать, редактировать и сохранять DSD-файлы в диалоговом окне публикации.

HostMgd.PlottingServices.DsdData.#ctor
Конструктор по умолчанию класса DsdData.
Не реализован.
Конструктор по умолчанию класса DsdData.
В текущей версии не реализован.

HostMgd.PlottingServices.DsdData.ReadDsd(System.String)
Метод читает данные из DSD-файла с указанным именем.
Не реализован.
Метод реализует чтение данных из DSD-файла с именем fileName.
В текущей версии не реализован.
fileName: Входное имя файла. Тип System.String.

HostMgd.PlottingServices.DsdData.SetDsdEntryCollection(HostMgd.PlottingServices.DsdEntryCollection)
Метод переопределяет в данном объекте коллекцию сконфигурированных для публикации листов.
Не реализован.
Метод переопределяет в данном объекте коллекцию сконфигурированных для публикации листов, которые сохраняются в DSD-файле.
В текущей версии не реализован.
entries: Входная коллекция объектов DsdEntry для выводимых на публикации листов.

HostMgd.PlottingServices.DsdData.SetUnrecognizedData(System.Collections.Specialized.StringCollection,System.Collections.Specialized.StringCollection)
Метод позволяет сохранить в данном объекте DSDData массив настраиваемых (нераспознанных) разделов DSD и соответствующие данные, полученные при чтении из DSD-файла.
Не реализован.
При чтении DSD-файла обнаруженные нераспознанные разделы классифицируются как «нераспознанные» данные.
Этот метод позволяет сохранить в данном объекте DSDData загруженный из DSD-файла массив настраиваемых (нераспознанных) разделов DSD и соответствующие данные.
В текущей версии не реализован.
sectionNames: Входная коллекция заголовков настраиваемых (нераспознанных) разделов. Тип System.Collections.Specialized.StringCollection.
sectionData: Входная коллекция данных настраиваемых (нераспознанных) разделов. Тип System.Collections.Specialized.StringCollection.

HostMgd.PlottingServices.DsdData.SetUnrecognizedData(System.String,System.String)
Метод позволяет сохранить в данном объекте DSDData кастомизированный (нераспознанный) раздел DSD и соответствующие данные, полученные при чтении из DSD-файла.
Не реализован.
При чтении DSD-файла обнаруженные нераспознанные разделы классифицируются как «нераспознанные» данные.
Этот метод позволяет сохранить в данном объекте DSDData загруженный из DSD-файла кастомизированный (нераспознанный) раздел DSD и соответствующие данные.
В текущей версии не реализован.
sectionName: Входное имя    кастомизированной (нераспознанной) секции. Тип System.String.
sectionData: Входные данные кастомизированной (нераспознанной) секции. Тип System.String.

HostMgd.PlottingServices.DsdData.WriteDsd(System.String)
Метод записывает в DSD-файл информацию из данного объекта.
Не реализован.
Метод записывает информацию из данного объекта в DSD-файл с указанным полным именем fileName.
В текущей версии не реализован.
fileName: Полное имя файла для записи данных DSD.  Тип System.String.

HostMgd.PlottingServices.DsdData.CategoryName
Свойство CategoryName предоставляет доступ к наименованию категории задания на печать.
Не реализовано.
Свойство CategoryName предоставляет доступ к наименованию категории задания на печать.
nanoCAD позволяет группировать задания на печать по разным категориям.
Это поле сериализуется в DSD-файле.
В текущей версии не реализовано.
Returns: Возвращает наименование категории задания на публикацию.
Тип System.String.

HostMgd.PlottingServices.DsdData.DestinationName
Свойство DestinationName определяет путь к выходному DWF-файлу. Это поле сохраняется в DSD-файле.
Не реализовано.
Свойство DestinationName определяет путь к выходному DWF-файлу, который используется при публикации в файл DWF.
Это поле сохраняется в DSD-файле.
В текущей версии не реализовано.
Returns: Возвращает путь к выходному DWF-файлу.
Тип System.String.

HostMgd.PlottingServices.DsdData.Dwf3dOptions
Свойство Dwf3dOptions позволяет определить объект настроек публикации в 3D DWF.
Не реализовано.
Свойство Dwf3dOptions позволяет определить объект настроек публикации в 3D DWF.
В настройках представлены флаги сохранения иерархии внешних ссылок и публикации с использованием назначенных материалов.
В текущей версии не реализовано.
Returns: Возвращает настройки публикации в 3D DWF.
Тип HostMgd.PlottingServices.Dwf3dOptions.

HostMgd.PlottingServices.DsdData.IsHomogeneous
Свойство IsHomogeneous позволяет определить, являются ли все листы в подшивке однородными, т.е. выводятся ли они на однотипные устройства.
Не реализовано.
Свойство IsHomogeneous позволяет определить, являются ли все листы в подшивке однородными, т.е. выводятся ли они на однотипные устройства.
В текущей версии не реализовано.
Returns: Возвращает true, если все листы в подшивке являются однородными.
В противном случае возвращает false.

HostMgd.PlottingServices.DsdData.IsSheetSet
Свойство IsSheetSet позволяет определить, представляет ли этот объект DsdData подшивку листов.
Не реализовано.
Свойство IsSheetSet позволяет определить, представляет ли этот объект DsdData данные подшивки листов.
Это поле сохраняется в файле DSD.
В текущей версии не реализовано.
Returns: Возвращает true, если этот объект представляет данные подшивки листов.
В противном случае возвращает false.

HostMgd.PlottingServices.DsdData.LogFilePath
Свойство LogFilePath определяет полный путь к файлу с логами ошибок, зафиксированных в процессе публикации.
Не реализовано.
Свойство LogFilePath определяет полный путь к файлу с логами ошибок, зафиксированных в процессе публикации.
Это поле сохраняется в DSD-файле.
В текущей версии не реализовано.
Returns: Возвращает  полный путь к файлу с логами ошибок.
Тип System.String.

HostMgd.PlottingServices.DsdData.MajorVersion
Свойство MajorVersion возвращает номер основной версии файла DSD, загруженного методом ReadDsd().
Не реализовано.
Свойство MajorVersion позволяет управлять номером основной (мажорной) версии файла DSD.
Этот номер становится доступным после чтения файла DSD методом ReadDsd().
В текущей версии не реализовано.
Returns: Возвращает номер основной версии файла DSD.
Тип int.

HostMgd.PlottingServices.DsdData.MinorVersion
Свойство MinorVersion возвращает минорную версию файла DSD, загруженного методом ReadDsd().
Не реализовано.
Свойство MinorVersion позволяет управлять номером дополнительной (минорной) версии файла DSD.
Этот номер становится доступным после чтения файла DSD методом ReadDsd().
В текущей версии не реализовано.
Returns: Возвращает номер дополнительной (минорной) версии файла DSD.
Тип int.

HostMgd.PlottingServices.DsdData.NoOfCopies
Свойство NoOfCopies представляет количество листов, подготовленных к публикации.
Не реализовано.
Свойство NoOfCopies представляет количество листов, подготовленных к публикации.
Это поле сохраняется в файле DSD.
Значение NoOfCopies имеет значение только в том случае, если публикация не выполняется в многолистовом файле DWF.
В текущей версии не реализовано.
Returns: Возвращает количество листов, подготовленных к публикации.
Тип int.

HostMgd.PlottingServices.DsdData.Password
Свойство Password представляет пароль, используемый для защиты содержимого выходного DWF-файла.
Не реализовано.
Свойство Password представляет пароль, используемый для защиты содержимого выходного DWF-файла.
Это поле сохраняется в DSD-файле.
В текущей версии не реализовано.
Returns: Возвращает строку пароля. Тип System.String.

HostMgd.PlottingServices.DsdData.PlotStampOn
Свойство PlotStampOn позволяет определить, включена ли простановка штемпеля чертежа.
Не реализовано.
Свойство PlotStampOn позволяет определить, включена ли простановка штемпеля чертежа.
Если данный флаг установлен и указан допустимый путь к файлу PSS (Plot Stamp Settings), все листы в задании на публикацию будут проштампованы.
В текущей версии не реализовано.
Returns: Возвращает true, если флаг простановки штемпеля чертежа установлен.
В противном случае возвращает false.

HostMgd.PlottingServices.DsdData.ProjectPath
Свойство ProjectPath представляет путь к выходной папке.
Не реализовано.
Свойство ProjectPath представляет имя выходной папки.
Это поле актуально только в случае публикации в файл.
Поле сохраняется в DSD-файле и содержит путь к выходной папке.
В текущей версии не реализовано.
Returns: Возвращает путь к выходной папке.
Тип System.String.

HostMgd.PlottingServices.DsdData.PromptForDwfName
Свойство PromptForDwfName позволяет определить, включен ли запрос имени файла DWF.
Не реализовано.
Свойство PromptForDwfName позволяет определить, включен ли запрос имени файла DWF.
В текущей версии не реализовано.
Returns: Возвращает true, если запрос имени файла DWF включен.
В противном случае возвращает false.

HostMgd.PlottingServices.DsdData.SelectionSetName
Свойство SelectionSetName представляет имя именованного набора листов.
Не реализовано.
Свойство SelectionSetName представляет имя именованного набора листов.
Это поле действительно только при публикации подшивки или публикации выбранных листов из диспетчера подшивок.
В текущей версии не реализовано.
Returns: Возвращает имя набора листов.
Тип System.String.

HostMgd.PlottingServices.DsdData.SheetSetName
Свойство SheetSetName представляет имя подшивки.
Не реализовано.
Свойство SheetSetName представляет имя подшивки.
Это поле хранится в файле DSD и имеет значение только в случае публикации подшивки.
В текущей версии не реализовано.
Returns: Возвращает имя подшивки.
Тип System.String.

HostMgd.PlottingServices.DsdData.SheetType
Свойство SheetType представляет значение типа листа, хранящееся в DSD-файле.
Не реализовано.
Свойство SheetType представляет значение типа листа, который используется для публикации (многолистовой DWF, обычный  DWF, многолистовой PDF и т.п.). Это поле хранится в файле DSD.
Значение перечисления SheetType применимо только на уровне данных, а не на уровне записи отдельного листа.
В текущей версии не реализовано.
Returns: Возвращает значение типа листа.
Тип HostMgd.PlottingServices.SheetType.

HostMgd.PlottingServices.DsdData.UnrecognizedDataSectionNames
Свойство UnrecognizedDataSectionNames представляет коллекцию имён настраиваемых (нераспознанных)  разделов и данных DSD.
Не реализовано.
Свойство UnrecognizedDataSectionNames представляет коллекцию имён настраиваемых (нераспознанных)  разделов и данных DSD.
В текущей версии не реализовано.
Returns: Возвращает коллекцию имён настраиваемых (нераспознанных) разделов и данных DSD.
Тип System.Collections.Specialized.StringCollection.

HostMgd.PlottingServices.DsdData.UnrecognizedDataSections
Свойство UnrecognizedDataSections представляет коллекцию настраиваемых (нераспознанных)  разделов и данных DSD.
Не реализовано.
Свойство UnrecognizedDataSections представляет коллекцию настраиваемых (нераспознанных)  разделов и данных DSD.
В текущей версии не реализовано.
Returns: Возвращает коллекцию настраиваемых (нераспознанных)  разделов и данных DSD.
Тип System.Collections.Specialized.StringCollection.