Teigha.DatabaseServices.Dimension
Этот класс является базовым для всех классов, представляющих размеры на чертеже в экземпляре Database.
Этот класс является базовым для всех классов, представляющих размеры на чертеже в экземпляре Database.
Отображение размеров контролируется настройками размеров и размерными стилями.
Ряд свойств этого класса связан с системными переменными для размеров.

Teigha.DatabaseServices.Dimension.FieldFromMText(Teigha.DatabaseServices.MText)
Метод копирует текстовое поле из указанного объекта MText, если он содержит такое поле, и добавляет его копию к данному размеру.
Метод копирует текстовое поле из указанного объекта MText, если он содержит такое поле, и добавляет его копию к данному размеру.
dimMText: Исходный объект, из которого копируется поле. Тип MText.

Teigha.DatabaseServices.Dimension.FieldToMText(MText )
Метод копирует текстовое поле из данного размера, если он содержит такое поле, и добавляет его копию к указанному объекту MText.
Метод копирует текстовое поле из данного размера, если он содержит такое поле, и добавляет его копию к указанному объекту MText.
dimMText: Входной объект, в который копируется поле. Тип MText.

Teigha.DatabaseServices.Dimension.FormatMeasurement(System.Double,String)
Метод возвращает строку MText, представляющую форматированное значение размера объекта Dimension.
Метод возвращает строку MText, представляющую форматированное значение размера объекта Dimension.
measurement: Измеренное значение размера, которое должно быть отформатировано. Тип double.
dimensionText: Размерный текст для форматирования. Тип String.
Returns: Возвращает строку с отформатированным значением размера. Тип String.

Teigha.DatabaseServices.Dimension.SetDimstyleData(Teigha.DatabaseServices.DimStyleTableRecord)
Метод предназначен для копирования настроек размерного стиля, включая все переопределения, из указанной записи таблицы размерных стилей в данный объект Dimension.
Метод предназначен для копирования настроек размерного стиля, включая все переопределения, из указанной записи таблицы размерных стилей в данный объект Dimension.
style: Размерный стиль, который служит источником копируемых данных. Тип DimStyleTableRecord.

Teigha.DatabaseServices.Dimension.RecomputeDimensionBlock(System.Boolean)
Метод предназначен для перевычисления размерного блока, на который ссылается данный объект Dimension, чтобы отразить любые  изменения, внесенные в объект Dimension с момента последнего обновления записи таблицы блоков.
Метод предназначен для перевычисления размерного блока, на который ссылается данный объект Dimension, чтобы отразить любые  изменения, внесенные в объект Dimension с момента последнего обновления записи таблицы блоков.
forceUpdate: Флаг принудительного обновления размера. В случае значения true запись BlockTableRecord обновляется, даже если размер не был изменён. Тип bool.

Teigha.DatabaseServices.Dimension.CenterMarkSize
Свойство возвращает размер маркера центра для радиальных и диаметральных размеров.
Свойство возвращает размер маркера центра для радиальных и диаметральных размеров.
Returns: Возвращает размер маркера центра. Тип double.

Teigha.DatabaseServices.Dimension.CenterMarkType
Свойство возвращает тип маркера центра для радиальных и диаметральных размеров.
Свойство возвращает тип маркера центра для радиальных и диаметральных размеров.
Returns: Возвращает тип маркера центра. Значение из перечисления DimensionCenterMarkType.

Teigha.DatabaseServices.Dimension.AlternatePrefix
Свойство задает или возвращает альтернативный префикс размерного текста.
Свойство задает или возвращает альтернативный префикс размерного текста.
Это свойство имеет эффект только в том случае, если для свойства Dimalt установлено значение true.
Returns: Возвращает альтернативный префикс. Тип String.

Teigha.DatabaseServices.Dimension.AlternateSuffix
Свойство задает или возвращает альтернативный суффикс размерного текста.
Свойство задает или возвращает альтернативный суффикс размерного текста.
Это свойство оказывает влияние только в том случае, если для свойства Dimalt установлено значение true.
Returns: Возвращает альтернативный суффикс. Тип String.

Teigha.DatabaseServices.Dimension.AltSuppressLeadingZeros
Свойство управляет подавлением ведущих нулей в альтернативных значениях размеров.
Свойство позволяет включить или отменить подавление ведущих нулей в альтернативных значениях размеров.
Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.AltSuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в альтернативных значениях размеров.
Свойство позволяет включить или отменить подавление замыкающих нулей в альтернативных значениях размеров.
Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.AltSuppressZeroFeet
Свойство позволяет управлять подавлением отображения нулевого значения целых футов в размере формата футы-дюймы для альтернативных единиц измерения.
Свойство позволяет включить или отменить подавление отображения нулевого значения футов в размере формата футы-дюймы, если значение размера меньше одного фута.
Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.AltSuppressZeroInches
Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в размере формата футы-дюймы для альтернативных единиц измерения.
Свойство позволяет включить или отменить подавление нулевого значения дюймов в размере формата футы-дюймы.
Этот функционал работает только в случае, если для свойства Dimalt установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressLeadingZeros
Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в альтернативных размерных единицах.
Свойство позволяет включить или отключить подавление ведущих нулей в значениях отклонений размеров, выраженных в альтернативных единицах.
Это свойство действует только в том случае, если для свойств Dimalt и Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в отклонениях размеров, выраженных в альтернативных единицах.
Свойство позволяет включить или отключить подавление замыкающих нулей в отклонениях размеров, выраженных в альтернативных единицах.
Это свойство действует только в том случае, если для свойств Dimalt и Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressZeroFeet
Свойство позволяет управлять подавлением отображения нулевого значения целых футов в отклонениях размеров, выраженных в альтернативных единицах формата футы-дюймы.
Свойство позволяет включить или отключить подавление отображения нулевого значения целых футов в отклонениях размеров, выраженных в альтернативных единицах формата футы-дюймы.
Этот функционал работает только в случае, если для свойств Dimalt и Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressZeroInches
Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в альтернативных единицах формата футы-дюймы.
Свойство позволяет включить или отключить подавление отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в альтернативных единицах формата футы-дюймы.
Этот функционал работает только в случае, если для свойств Dimalt и Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Prefix
Свойство задает или возвращает префикс размерного текста.
Свойство задает или возвращает префикс размерного текста при использовании основных единиц измерения.
Returns: Возвращает префикс размерного текста. Тип String.

Teigha.DatabaseServices.Dimension.Suffix
Свойство задает или возвращает суффикс размерного текста при использовании основных единиц измерения.
Returns: Возвращает суффикс размерного текста. Тип String.

Teigha.DatabaseServices.Dimension.SuppressAngularLeadingZeros
Свойство управляет подавлением ведущих нулей в значениях угловых размеров.
Свойство управляет подавлением ведущих нулей в значениях угловых размеров.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.SuppressAngularTrailingZeros
Свойство управляет подавлением замыкающих нулей в значениях угловых размеров.
Свойство управляет подавлением замыкающих нулей в значениях угловых размеров.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.SuppressLeadingZeros
Свойство управляет подавлением ведущих нулей в значениях размеров.
Свойство управляет подавлением ведущих нулей в значениях размеров. Используются основные единицы измерения.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.SuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в значениях размеров.
Свойство управляет подавлением замыкающих нулей в значениях размеров.
Используются основные единицы измерения.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.SuppressZeroFeet
Свойство управляет подавлением отображения нулевого значения целых футов в размере формата футы-дюймы, если футы и дюймы являются основными единицами измерения.
Свойство управляет подавлением отображения нулевого значения целых футов в размере формата футы-дюймы, если футы и дюймы являются основными единицами измерения.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.SuppressZeroInches
Свойство используется для управления подавлением нулевого значения целых дюймов в размере формата футы-дюймы, когда футы и дюймы являются основными единицами измерения.
Свойство управляет подавлением отображения нулевого значения целых дюймов в размере формата футы-дюймы, когда футы и дюймы являются основными единицами измерения.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.ToleranceSuppressLeadingZeros
Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в основных единицах.
Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в основных единицах.
Это свойство действует только в случае, когда для свойства Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.ToleranceSuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в отклонениях размеров, выраженных в основных единицах.
Свойство позволяет включить или отключить подавление замыкающих нулей в отклонениях размеров, выраженных в основных единицах.
Это свойство действует только в том случае, когда для свойства Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.ToleranceSuppressZeroFeet
Свойство позволяет управлять подавлением отображения нулевого значения целых футов в отклонениях размеров, выраженных в основных единицах формата футы-дюймы.
Свойство позволяет включить или отключить подавление отображения нулевого значения целых футов в отклонениях размеров, выраженных в основных единицах формата футы-дюймы.
Этот функционал работает только в случае, если для свойства Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.ToleranceSuppressZeroInches
Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в основных единицах измерения.
Свойство позволяет включить или отключить подавление отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в основных единицах измерения.
Этот функционал работает только в случае, если для свойства Dimtol установлено значение true.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.DimensionStyle
Свойство задает или возвращает ObjectId для объекта DimStyleTableRecord, который связан с данным объектом Dimension.
Свойство задает или возвращает идентификатор ObjectId для объекта DimStyleTableRecord, который связан с данным объектом Dimension.
Returns: Возвращает идентификатор записи в таблице размерных стилей. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimadec
Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений.
Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений.
Значение	Описание
--------	-------------------------------------------------------------
0-8			Задает количество десятичных знаков после запятой в угловых размерах (независимо от текущего значения свойства Dimdec).
-1			Количество десятичных знаков после запятой в угловых размерах определяется свойством Dimdec.
Это свойство действует только в том случае, если для свойства Dimtol установлено значение true.
Returns: Возвращает количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений. Тип int.

Teigha.DatabaseServices.Dimension.Dimalt
Свойство управляет режимом отображения размеров в альтернативных единицах измерения.
Свойство позволяет включать режим отображения размеров в альтернативных единицах измерения.
Returns: Возвращает true, если размеры отображаются в альтернативных единицах измерения.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimaltd
Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях размеров, выраженных в альтернативных единицах измерения.
Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях размеров, выраженных в альтернативных единицах измерения.  Это свойство действует только в том случае, если для свойства Dimalt установлено значение true.
Returns: Возвращает количество десятичных знаков после запятой в значениях размеров. Тип int.

Teigha.DatabaseServices.Dimension.Dimaltf
Свойство позволяет контролировать значение масштабного коэффициента для альтернативных линейных единиц измерения.
Свойство позволяет контролировать значение масштабного коэффициента для альтернативных линейных единиц измерения.
Работает при условии, что свойство Dimalt возвращает значение true.
Returns: Возвращает масштабный коэффициент. Тип double.

Teigha.DatabaseServices.Dimension.Dimaltrnd
Свойство позволяет задать или получить действительное число, используемое для округления линейных размеров в альтернативных единицах измерения (но не  допусков).
Свойство позволяет задать или получить действительное число, используемое для округления линейных размеров в альтернативных единицах измерения (но не  допусков).  Работает при условии, что свойство Dimalt возвращает значение true.
Returns: Возвращает единицу округления размеров. Тип double.

Teigha.DatabaseServices.Dimension.CurrentMeasurement
Свойство возвращает величину данного размера в указанных единицах измерения как значение с плавающей точкой двойной точности.
Свойство возвращает величину данного размера в указанных единицах измерения как значение с плавающей точкой двойной точности.
Для линейных размеров — это длина, для угловых размеров — это угол.
Returns: Возвращает текущее значение размера. Тип double.

Teigha.DatabaseServices.Dimension.Dimalttd
Свойство определяет количество десятичных знаков после запятой, используемых при отображении отклонений размеров в альтернативных единицах измерения.
Свойство определяет количество десятичных знаков после запятой, используемых при отображении отклонений размеров в альтернативных единицах измерения.
Это свойство действует при условии, что для свойств Dimalt и Dimtol установлено значение true.
Returns: Возвращает количество десятичных знаков после запятой для отображения значений размеров. Тип int.

Teigha.DatabaseServices.Dimension.Dimalttz
Свойство управляет подавлением нулей в значениях допусков при использовании альтернативных единиц изменения.
Свойство управляет подавлением нулей в значениях допусков при использовании альтернативных единиц изменения.
Значение	Описание
--------	-------------------------------------------------------
0			Подавляются нулевые значения целых футов и дюймов.
1			Отображаются нулевые значения целых футов и дюймов.
2			Отображаются нули в футах и подавляются нули в дюймах.
3			Подавляются нули в футах и отображаются нули в дюймах.
4			Подавляются ведущие нули.
8			Подавляются замыкающие нули.
12			Подавляются как ведущие, так и замыкающие нули.
Это свойство действует при условии, что для свойств Dimalt и Dimtol установлено значение true.
Returns: Возвращает код состояния отображения/подавления нулей. Тип int.

Teigha.DatabaseServices.Dimension.Dimaltu
Свойство задает формат для размеров, представленных в альтернативных единицах измерения.
Свойство задает формат для размеров, представленных в альтернативных единицах измерения.
Значение	Описание
--------	-----------------------------------------------------
1			Научный формат.
2			Десятичный формат.
3			Конструкторский формат.
4			Архитектурный (дробный) формат.
5 			Дробный формат.
6			Архитектурный формат.
7			Формат с дробной частью.
8			Формат по умолчанию, принятый в Microsoft® Windows®. Используются настройки панели управления для десятичного разделителя и группирования разрядов.
Это свойство действует при условии, что для свойства Dimalt установлено значение true.
Returns: Возвращает код формата. Тип int.

Teigha.DatabaseServices.Dimension.Dimaltz
Свойство управляет подавлением нулей в значениях размеров при использовании альтернативных единиц изменения.
Свойство управляет подавлением нулей в значениях размеров при использовании альтернативных единиц изменения.
Значение	Описание
--------	--------------------------------------------------------
0			Подавляются нулевые значения целых футов и дюймов.
1			Отображаются нулевые значения целых футов и дюймов.
2			Отображаются нули в футах и подавляются нули в дюймах.
3			Подавляются нули в футах и отображаются нули в дюймах.
4			Подавляются ведущие нули.
8			Подавляются замыкающие нули.
12			Подавляются как ведущие, так и замыкающие нули.
Это свойство действует при условии, что для свойства Dimalt установлено значение true.
Returns: Возвращает код состояния отображения/подавления нулей. Тип int.

Teigha.DatabaseServices.Dimension.Dimapost
Свойство определяет префикс или суффикс размерного текста (или и то, и другое) при использовании альтернативных единиц измерения.
Свойство определяет префикс или суффикс размерного текста (или и то, и другое) при использовании альтернативных единиц измерения.
Dimpost имеет вид  prefixlt;gt;suffix.
Подстрока 'lt;gt;' в Dimpost заменяется текстом размера в альтернативных единицах измерения.
Это свойство действует при условии, что для свойства Dimalt установлено значение true.
Returns: Возвращает префикс или суффикс размерного текста. Тип String.

Teigha.DatabaseServices.Dimension.Dimarcsym
Свойство определяет отображение обозначения дуги в размерном тексте длины дуги.
Свойство определяет отображение обозначения дуги в размерном тексте длины дуги.
Значение	Описание
--------	--------------------------------------------------------
0			Помещает обозначение длины дуги перед текстом размера.
1			Помещает обозначение длины дуги над текстом размера.
2			Отображение обозначения длины дуги подавлено.
Returns: Возвращает вариант отображения обозначения дуги. Тип int.

Teigha.DatabaseServices.Dimension.Dimasz
Свойство задает длину стрелок на размерных линиях и линиях выносок.
Свойство задает длину стрелок на размерных линиях и линиях выносок.
Returns: Возвращает длину стрелок. Тип double.

Teigha.DatabaseServices.Dimension.Dimatfit
Свойство задает способ расположения размерного текста и стрелок, если между выносными линиями недостаточно места для текста и/или для стрелок.
Свойство задает способ расположения размерного текста и стрелок, если между выносными линиями недостаточно места для текста и/или для стрелок.
Значение	Описание
--------	--------------------------------------------------------
0			Размещение текста и стрелок за пределами выносных линий.
1			Стрелки располагаются за пределами выносных линий, текст остается в пределах.
2			Текст располагаются за пределами выносных линий, стрелки остаются в пределах.
3			Выбирается оптимальный вариант перемещения за пределы выносных линий текста и/или стрелок.
Returns: Возвращает вариант расположения размерного текста и стрелок относительно выносных линий. Тип int.

Teigha.DatabaseServices.Dimension.Dimaunit
Свойство задает вариант единиц измерения для угловых размеров.
Свойство позволяет задать вариант единиц измерения для угловых размеров.
Значение	Описание
--------	-------------------------
0			Десятичные градусы.
1			Градусы/минуты/секунды.
2			Грады.
3			Радианы.
Returns: Возвращает вариант единиц измерения для угловых размеров. Тип int.

Teigha.DatabaseServices.Dimension.Dimazin
Свойство управляет подавлением нулей в угловых размерах и допусках.
Свойство управляет подавлением нулей в угловых размерах и допусках.
Значение	Описание
--------	-------------------------
0			Отображаются все ведущие и замыкающие нули.
1			Подавляются ведущие нули в десятичных размерах (напр., 0,3000 записывается как ,3000).
2			Подавляются замыкающие нули в десятичных размерах (напр., 22,3000 записывается как 22,3).
3			Подавляются ведущие и замыкающие нули (напр., 0,3000 записывается как ,3).
Returns: Возвращает вариант подавления нулей. Тип int.

Teigha.DatabaseServices.Dimension.Dimblks
Свойство задает или возвращает имя блока, используемого для отображения концов стрелок на размерных линиях.
Свойство задает или возвращает имя блока, используемого для отображения концов стрелок на размерных линиях.
Допустимы следующие имена:
Значение		Описание
--------------	---------------------------------------
"None" 			Отсутствует.
"Closed" 		Закрытая.
"Dot" 			Точка.
"ClosedBlank" 	Контурная замкнутая.
"Oblique" 		Засечка.
"ArchTick" 		Двойная засечка.
"Open" 			Разомкнутая.
"Origin" 		Указатель исходной точки.
"Origin2" 		Указатель исходной точки 2.
"Open90" 		Разомкнутая 90 градусов (прямой угол).
"Open30" 		Разомкнутая 30 градусов.
"DotBlank" 		Контурная точка.
"DotSmall" 		Малая точка.
"BoxFilled" 	Заполненный прямоугольник.
"BoxBlank" 		Прямоугольник.
"DatumFilled" 	Заполненный треугольник базы отсчета.
"DatumBlank" 	Треугольник базы отсчета.
"Integral" 		Интеграл.
"Small" 		Контурная малая точка.
Returns: Возвращает имя блока для концов стрелок. Тип String.

Teigha.DatabaseServices.Dimension.Dimblk
Свойство задает или возвращает идентификатор блока, который используется для отображения концов стрелок на размерных линиях.
Свойство задает или возвращает идентификатор ObjectId блока, который используется для отображения концов стрелок на размерных линиях.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimblk1
Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на первом конце размерной линии.
Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на первом конце размерной линии.
Свойство работает, если в свойстве Dimsah установлено значение true.
В противном случае тип стрелок определяется свойством Dimblk.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimblk2
Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на втором конце размерной линии.
Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на втором конце размерной линии.
Свойство работает, если в свойстве Dimsah установлено значение true.
В противном случае тип стрелки определяется свойством Dimblk.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimblk1s
Свойство задает или возвращает имя блока, используемого для отображения стрелки на первом конце размерной линии.
Свойство задает или возвращает имя блока, используемого для отображения стрелки на первом конце размерной линии.
Допустимы следующие имена:
Значение		Описание
--------------	---------------------------------------
"None" 			Отсутствует.
"Closed" 		Закрытая.
"Dot" 			Точка.
"ClosedBlank" 	Контурная замкнутая.
"Oblique" 		Засечка.
"ArchTick" 		Двойная засечка.
"Open" 			Разомкнутая.
"Origin" 		Указатель исходной точки.
"Origin2" 		Указатель исходной точки 2.
"Open90" 		Разомкнутая 90 градусов (прямой угол).
"Open30" 		Разомкнутая 30 градусов.
"DotBlank" 		Контурная точка.
"DotSmall" 		Малая точка.
"BoxFilled" 	Заполненный прямоугольник.
"BoxBlank" 		Прямоугольник.
"DatumFilled" 	Заполненный треугольник базы отсчета.
"DatumBlank" 	Треугольник базы отсчета.
"Integral" 		Интеграл.
"Small" 		Контурная малая точка.
Свойство работает, если в свойстве Dimsah установлено значение true.
В противном случае тип стрелок определяется свойством Dimblks.
Returns: Возвращает имя блока. Тип String.

Teigha.DatabaseServices.Dimension.Dimblk2s
Свойство задает или возвращает имя блока, используемого для отображения стрелки на втором конце размерной линии.
Свойство задает или возвращает имя блока, используемого для отображения стрелки на втором конце размерной линии.
Допустимы следующие имена:
Значение		Описание
--------------	---------------------------------------
"None" 			Отсутствует.
"Closed" 		Закрытая.
"Dot" 			Точка
"ClosedBlank" 	Контурная замкнутая.
"Oblique" 		Засечка.
"ArchTick" 		Двойная засечка.
"Open" 			Разомкнутая.
"Origin" 		Указатель исходной точки.
"Origin2" 		Указатель исходной точки 2.
"Open90" 		Разомкнутая 90 градусов (прямой угол).
"Open30" 		Разомкнутая 30 градусов.
"DotBlank" 		Контурная точка.
"DotSmall" 		Малая точка.
"BoxFilled" 	Заполненный прямоугольник.
"BoxBlank" 		Прямоугольник.
"DatumFilled" 	Заполненный треугольник базы отсчета.
"DatumBlank" 	Треугольник базы отсчета.
"Integral" 		Интеграл.
"Small" 		Контурная малая точка.
Свойство работает, если в свойстве Dimsah установлено значение true.
В противном случае тип стрелок определяется свойством Dimblks.
Returns: Возвращает имя блока. Тип String.

Teigha.DatabaseServices.Dimension.DimBlockId
Свойство задает или возвращает идентификатор ObjectId записи BlockTableRecord, связанной с данным размером.
Свойство задает или возвращает идентификатор ObjectId записи BlockTableRecord, связанной с данным размером.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.DimBlockPosition
Свойство задает или возвращает относительное положение в мировой системе координат WCS блока, связанного с данным размером.
Свойство задает или возвращает относительное положение в мировой системе координат WCS блока, связанного с данным размером.
Returns: Возвращает точку вставки блока данного размера. Тип Point3d.

Teigha.DatabaseServices.Dimension.Dimcen
Свойство управляет отображением и размерами маркеров центра и центровых линий дуг и окружностей.
Свойство управляет отображением и размерами маркеров центра и центровых линий дуг и окружностей.
Абсолютное значение Dimcen определяет половину длины маркера центра, длину части центровой линии за пределами дуги или окружности, а также длину просвета между маркером центра и центровой линией.
Знак значения Dimcen управляет отображением маркеров центра и центровых линий:
Значение	Описание
--------	---------------------------------------
0			Не отображаются ни маркеры центров, ни центровые линии.
<0			Отображаются центровые линии.
>0			Отображаются маркеры центров.
<seealso cref="Teigha::DatabaseServices::Dimension::CenterMarkType"
Returns: Возвращает размер маркеров центра и центровых линий. Тип double.

Teigha.DatabaseServices.Dimension.Dimclrd
Свойство задает или возвращает цвет выносок, стрелок, а также размерных линий и выносных линий.
Свойство задает или возвращает цвет выносок, стрелок, а также размерных линий и выносных линий.
Returns: Возвращает цвет указанных объектов чертежа. Тип Colors.Color.

Teigha.DatabaseServices.Dimension.Dimclre
Свойство определяет цвет выносных линий.
Свойство определяет цвет выносных линий.
Returns: Возвращает цвет линий. Тип Colors.Color

Teigha.DatabaseServices.Dimension.Dimclrt
Свойство задает или возвращает цвет размерного текста.
Свойство задает или возвращает цвет размерного текста.
Returns: Возвращает цвет размерного текста. Тип Colors.Color.

Teigha.DatabaseServices.Dimension.Dimdec
Свойство задает или возвращает количество десятичных знаков после запятой в основном значении размера и допуске.
Свойство задает или возвращает количество десятичных знаков после запятой в основном значении размера и допуске.
Если свойство Dimadec равно -1, то свойство Dimdec определяет количество десятичных знаков и для углового размера.
Returns: Возвращает количество десятичных знаков после запятой. Тип int.

Teigha.DatabaseServices.Dimension.Dimdle
Свойство задает или возвращает расстояние, на которое размерные линии выступают за пределы выносных линий.
Свойство задает или возвращает расстояние, на которое размерные линии выступают за пределы выносных линий.
Это свойство применяется, когда для типа стрелки установлено одно из следующих значений: "None", "Oblique", "ArchTick", "DotSmall", "Integral" или "Small".
Returns: Возвращает длину выступа размерных линий за пределы выносных. Тип double.

Teigha.DatabaseServices.Dimension.Dimdli
Свойство задает или возвращает шаг размерных линий в размерах от общей базы.
Свойство задает или возвращает шаг размерных линий в размерах от общей базы.
Returns: Возвращает шаг в базовых размерах. Тип double.

Teigha.DatabaseServices.Dimension.Dimdsep
Свойство задает или возвращает символ, который используется в качестве десятичного разделителя в значениях размеров.
Свойство задает или возвращает символ, который используется в качестве десятичного разделителя в значениях размеров.
Returns: Возвращает символ десятичного разделителя. Тип System.Char.

Teigha.DatabaseServices.Dimension.DimensionStyleName
Свойство задает или возвращает имя размерного стиля в данном объекте Dimension.
Свойство задает или возвращает имя размерного стиля в данном объекте Dimension.
Установка DimensionStyleName присваивает размерному стилю этого имени стиля размеру, если стиль существует, или будет выдано исключение, если стиля с таким именем нет.
Returns: Возвращает имя размерного стиля. Тип String.

Teigha.DatabaseServices.Dimension.DimensionText
Свойство задает или возвращает текстовую строку, которая заменяет измеренное значение.
Свойство задает или возвращает текстовую строку, которая заменяет измеренное значение.
Если свойство DimensionText представляет собой пустую строку, что является значением по умолчанию, размер представляет на чертеже измеренное значение.
Returns: Возвращает текстовую строку, которая заменяет измеренное значение. Тип String.

Teigha.DatabaseServices.Dimension.Dimexe
Свойство задает или возвращает расстояние, на которое выносные линии выступают за пределы размерных линий.
Свойство задает или возвращает расстояние, на которое выносные линии выступают за пределы размерных линий.
Returns: Возвращает расстояние, на которое выносные линии выступают за пределы размерных линий. Тип double.

Teigha.DatabaseServices.Dimension.Dimexo
Свойство задает или возвращает отступ выносных линий от исходных точек.
Свойство задает или возвращает отступ выносных линий от исходных точек.
В случае выносных линий фиксированной длины Dimexo определяет минимальный отступ.
Returns: Возвращает отступ выносных линий от исходных точек. Тип double.

Teigha.DatabaseServices.Dimension.Dimfrac
Свойство задает или возвращает дробный формат.
Свойство задает или возвращает дробный формат.
Применимо, если для свойства Dimlunit установлено значение 5 (дробный формат) или 4 (архитектурный дробный формат).
Returns: Возвращает значение типа int, которое кодирует вариант отображения дроби: 0 для горизонтальной, 1 для диагональной, 2 для дроби в одну строку.

Teigha.DatabaseServices.Dimension.Dimfxlen
Свойство задает или возвращает длину выносных линий с фиксированной длиной.
Свойство задает или возвращает длину выносных линий с фиксированной длиной.
Длина выносной линии — это расстояние от начала выносной линии и до ее пересечения с размерной линией.
Выступ и отступ в эту длину не включаются.
Если длина выносной линии имеет отрицательное значение, выносные линии проводят снаружи к точкам пересечения с размерными линиями, в сторону выносных точек.
Свойство Dimfxlen действительно, только если свойство DimfxlenOn имеет значение true.
Returns: Возвращает длину выносных линий. Тип double.

Teigha.DatabaseServices.Dimension.DimfxlenOn
Свойство позволяет определить, имеют ли выносные линии фиксированную длину.
Свойство позволяет определить, имеют ли выносные линии фиксированную длину.
Returns: Возвращает true, если выносные линии имеют фиксированную длину.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimgap
Свойство задает или возвращает зазор между полем размерного текста и размерной линией, выносной линией или линией выноски с учетом с положения и ориентации текста.
Свойство задает или возвращает зазор между полем размерного текста и размерной линией, выносной линией или линией выноски с учетом с положения и ориентации текста.
Если свойство Dimgap равно нулю, объект размера прикрепляет поле размерного текста к размеру, выносной линии или линии выноски.
Если свойство Dimgap отрицательное, вокруг поля размерного текста отображается рамка.
Returns: Возвращает зазор вокруг поля размерного текста.  Тип double.

Teigha.DatabaseServices.Dimension.Dimjogang
Свойство задает или возвращает угол излома размерных линий в радиусных размерах с изломом.
Свойство задает или возвращает угол излома размерных линий в радиусных размерах с изломом.
Returns: Возвращает угол излома радиусной размерной линии. Тип double.

Teigha.DatabaseServices.Dimension.Dimjust
Свойство задает или возвращает горизонтальное выравнивание поля размерного текста (относительно выносных линий).
Свойство задает или возвращает горизонтальное выравнивание поля размерного текста (относительно выносных линий).
Список допустимых значений:
Значение	Описание
--------	---------------------------------------
0			Размещение текста над размерной линией и центром (выравнивание между выносными линиями).
1			Размещение текста рядом с первой выносной линией.
2			Размещение текста рядом со второй выносной линией.
3			Размещение текста выше и параллельно первой выносной линии.
4			Размещение текста выше и параллельно второй выносной линии.
Returns: Возвращает код горизонтального выравнивания поля размерного текста. Тип int.

Teigha.DatabaseServices.Dimension.Dimldrblk
Свойство задает или возвращает блок стрелок на концах линий выноски.
Свойство задает или возвращает блок стрелок на концах линий выноски.
Нулевое значение указывает, что используется стрелка по умолчанию.
Returns: Возвращает ссылку на блок стрелок. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimldrblks
Свойство задает или возвращает имя блока стрелок на концах линий выноски.
Свойство задает или возвращает имя блока стрелок на концах линий выноски.
Допустимы следующие имена блоков:
Значение		Описание
--------------	---------------------------------------
"None" 			Отсутствует.
"Closed" 		Закрытая.
"Dot" 			Точка.
"ClosedBlank" 	Контурная замкнутая.
"Oblique" 		Засечка.
"ArchTick" 		Двойная засечка.
"Open" 			Разомкнутая.
"Origin" 		Указатель исходной точки.
"Origin2" 		Указатель исходной точки 2.
"Open90" 		Разомкнутая 90 градусов (прямой угол).
"Open30" 		Разомкнутая 30 градусов.
"DotBlank" 		Контурная точка.
"DotSmall" 		Малая точка.
"BoxFilled" 	Заполненный прямоугольник.
"BoxBlank" 		Прямоугольник.
"DatumFilled" 	Заполненный треугольник базы отсчета.
"DatumBlank" 	Треугольник базы отсчета.
"Integral" 		Интеграл.
"Small" 		Контурная малая точка.
Returns: Возвращает имя блока стрелок. Тип String.

Teigha.DatabaseServices.Dimension.Dimlfac
Свойство задает или возвращает масштабный коэффициент для значений линейных размеров.
Свойство задает или возвращает масштабный коэффициент для значений линейных размеров.
Этот коэффициент представляет собой положительное число с плавающей точкой двойной точности, которое влияет на значение размера, но не влияет на значение допуска.
Returns: Возвращает масштабный коэффициент для линейных размеров. Тип double.

Teigha.DatabaseServices.Dimension.Dimlim
Свойство позволяет определить, включен ли режим отображения размерного текста в виде предельных размеров.
Свойство позволяет определить, включен ли режим отображения размерного текста в виде предельных размеров.
Returns: Возвращает true, если режим включен.  В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimltex1
Свойство задает или возвращает тип первой выносной линии.
Свойство задает или возвращает тип первой выносной линии.
Returns: Возвращает идентификатор объекта типа линии.  Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimltex2
Свойство задает или возвращает тип второй выносной линии.
Свойство задает или возвращает тип второй выносной линии.
Returns: Возвращает идентификатор объекта типа линии.  Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimltype
Свойство задает или возвращает тип линии выноски, размерных линий и выносных линий
Свойство задает или возвращает тип линии выноски, размерных линий и выносных линий.
Это свойство не влияет на границу вокруг поля размерного текста и выносных линий.
Returns: Возвращает идентификатор типа размерных линий. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimlunit
Свойство задает или возвращает формат представления основных значений размеров и допусков.
Свойство задает или возвращает формат представления основных значений размеров и допусков.
Допустимые значения:
Значение	Описание
--------	------------------------------------------
1			Научный формат.
2			Десятичный формат.
3			Конструкторский формат.
4			Архитектурный формат.
5 			Дробный формат.
6			Формат по умолчанию, заданный в настройках Microsoft® Windows®.
Returns: Возвращает код формата числовых значений размеров и допусков. Тип int.

Teigha.DatabaseServices.Dimension.Dimlwd
Свойство задает или возвращает толщину линии выноски, размерных и выносных линий.
Свойство задает или возвращает толщину (вес) линии выноски, размерных и выносных линий.
Это свойство также влияет на толщину границы вокруг поля размерного текста, когда свойство Dimgap отрицательно.
Returns: Возвращает вес линий как объект типа DatabaseServices.LineWeight.

Teigha.DatabaseServices.Dimension.Dimlwe
Свойство задает или возвращает толщину (вес) обеих выносных линий.
Свойство задает или возвращает толщину (вес) обеих выносных линий.
Returns: Возвращает вес линий как объект типа DatabaseServices.LineWeight.

Teigha.DatabaseServices.Dimension.Dimpost
Свойство задает или возвращает префикс и/или суффикс размерного текста при использовании основных единиц измерения.
Свойство задает или возвращает префикс и/или суффикс размерного текста при использовании основных единиц измерения.
Dimpost имеет вид  prefixlt;gt;suffix.
Пустые угловые скобки 'lt;gt;' в Dimpost заменяются размерным текстом в основных единицах измерения.
Returns: Возвращает префикс и/или суффикс размерного текста. Тип String.

Teigha.DatabaseServices.Dimension.Dimrnd
Свойство задает или возвращает действительное число, используемое для округления линейных размеров в основных единицах измерения (но не значений допусков/отклонений).
Свойство задает или возвращает действительное число, используемое для округления линейных размеров в основных единицах измерения (но не значений допусков/отклонений).
Например, если для округления установлено значение 0,04, значение будет округлено до ближайшей единицы 0,04. Таким образом, 1,912 становится 1,92, 1,935 становится 1,92, 1,945 становится 1,96, а 1,972 становится 1,96. Если для округления установлено значение 1,0, значение будет округлено до ближайшего целого значения.
Returns: Возвращает действительное число, используемое для округления линейных размеров.  Тип double.

Teigha.DatabaseServices.Dimension.Dimsah
Свойство играет роль переключателя между режимами индивидуальной настройки типа стрелок слева и справа на размерной линии и режимом, при котором стрелки одинаковы.
Свойство управляет режимом отображения стрелок на размерных линиях. Оно позволяет переключаться между режимом индивидуальной настройки типа стрелок слева и справа и режимом, при котором стрелки одинаковы.
Если свойство Dimsah принимает значение true, для отображения стрелок слева и справа используются блоки, заданные свойствами Dimblk1 и Dimblk2, соответственно. В противном случае тип стрелок одинаков и определяется свойством Dimblk.
Returns: Возвращает true, если для стрелок слева и справа используются блоки, заданные свойствами Dimblk1 и Dimblk2, соответственно.
Если блоки стрелок одинаковы, возвращает false.

Teigha.DatabaseServices.Dimension.Dimscale
Свойство используется для управления общим масштабом размеров.
Свойство задает или возвращает общий коэффициент масштабирования, применяемый ко всем размерным переменным, которые регулируют размеры, отступы и расстояния.
Returns: Возвращает общий коэффициент масштабирования размеров. Тип double.

Teigha.DatabaseServices.Dimension.Dimsd1
Свойство управляет подавлением первой размерной линии и стрелки.
Свойство управляет подавлением первой размерной линии и стрелки.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimsd2
Свойство управляет подавлением второй размерной линии и стрелки.
Свойство управляет подавлением второй размерной линии и стрелки.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimse1
Свойство управляет подавлением первой выносной линии.
Свойство управляет подавлением первой выносной линии.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimse2
Свойство управляет подавлением второй выносной линии.
Свойство управляет подавлением второй выносной линии.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimsoxd
Свойство управляет подавлением стрелок, если между выносными линиями для них недостаточно места.
Свойство управляет подавлением стрелок, если между выносными линиями для них недостаточно места.
Returns: Возвращает true, если подавление включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimtad
Свойство позволяет выбирать вариант вертикального выравнивания размерного текста относительно размерной линии.
Свойство позволяет выбирать вариант вертикального выравнивания размерного текста относительно размерной линии из следующего списка:
Значение	Описание
--------	--------------------------------------------------------
0			"По центру" - размерный текст центрируется между выносными линиями.
1			"Над линией" - размерный текст размещается над размерной линией, кроме случая, когда размерная линия не горизонтальна, а текст между выносными линиями выровнен горизонтально.
2			"Снаружи" - размерный текст размещается рядом с размерной линией со стороны, наиболее удаленной от первой определяющей точки.
3			"Согласно JIS " - размерный текст размещается согласно требованиям промышленных стандартов Японии JIS (Japanese Industrial Standards).
4			"Под линией" - размерный текст размещается под размерной линией.
Returns: Возвращает вариант вертикального выравнивания размерного текста. Тип int.

Teigha.DatabaseServices.Dimension.Dimtdec
Свойство задает или возвращает количество десятичных знаков после запятой в значениях допусков в основных единицах измерения.
Свойство задает или возвращает количество десятичных знаков после запятой в значениях допусков в основных единицах измерения.
Свойство оказывает влияние, только если включено отображение допусков (т.е. свойство Dimtol равно true).
Returns: Возвращает количество десятичных знаков после запятой в значениях допусков.  Тип int.

Teigha.DatabaseServices.Dimension.Dimtfac
Свойство задает или возвращает масштабный коэффициент для высоты текста допусков в размерах.
Свойство задает или возвращает масштабный коэффициент для высоты текста допусков в размерах.
Returns: Возвращает масштабный коэффициент для высоты текста. Тип double.

Teigha.DatabaseServices.Dimension.Dimtfill
Свойство управляет фоном размерного текста.
Свойство задает или возвращает код варианта отображения фона размерного текста.
Значение	Описание
--------	-----------------------------------
0			Фон отсутствует.
1			Цвет фона чертежа.
2			Фон задан свойством Dimtfillclr.
Returns: Возвращает код варианта отображения фона размерного текста.  Тип int.

Teigha.DatabaseServices.Dimension.Dimtfillclr
Свойство определяет цвет фона для заполнения поля размерного текста.
Свойство определяет цвет фона для заполнения поля размерного текста.
Чтобы разрешить фоновую заливку текста указанным цветом, свойство Dimtfill должно быть установлено в значение 2.
Returns: Возвращает цвет фоновой заливки размерного текста.  Тип Colors.Color.

Teigha.DatabaseServices.Dimension.Dimtih
Свойство Dimtih управляет ориентацией размерного текста между выносными линиями.
Свойство задает или возвращает ориентацию размерного текста между выносными линиями.
Если свойство Dimtih имеет значение true, поле размерного текста выравнивается по горизонтали.
Если Dimtih имеет значение false, ориентация поля размерного текста определяется ориентацией размерной линии или линии выноски.
Returns: Возвращает true в случае выравнивания по горизонтали.
Возвращает false в случае выравнивания вдоль размерной линии или линии выноски.

Teigha.DatabaseServices.Dimension.Dimtix
Свойство Dimtix позволяет контролировать размещение размерного текста между выносными линиями.
Свойство позволяет переключаться между двумя вариантами размещения размерного текста между выносными линиями.
Если свойство Dimtix имеет значение true, размерный текст обязательно размещается между выносными линиями.
В случае значения false поле размерного текста размещается между выносными линиями только в том случае, если для него  имеется достаточно свободного места.
Returns: Возвращает true в случае принудительного размещения между выносными линиями.
Возвращает false в случае размещения между выносными линиями только при наличии достаточного свободного места.

Teigha.DatabaseServices.Dimension.Dimtm
Свойство задает или возвращает нижнее предельное отклонение размера.
Свойство задает или возвращает нижнее предельное отклонение размера.
Это свойство действует только в том случае, если отображение допусков включено (свойство Dimtol имеет значение true).
Returns: Возвращает нижнее предельное отклонение размера. Тип double.

Teigha.DatabaseServices.Dimension.Dimtmove
Свойство определяет правила перемещения размерного текста относительно размерной линии.
Свойство Dimtmove задает или возвращает правило перемещения размерного текста и размерных линий относительно друг друга при перетаскивании текста.
Значение 	Описание
--------	---------------------------------------------
0 			Текст размера и размерная линия перемещаются совместно.
1 			Текст размера перемещается независимо от размерной линии и соединяется с ней выноской.
2 			Текст размера перемещается независимо от размерной линии, выноска не отображается.
Returns: Возвращает код правила перемещения размерного текста относительно размерной линии.  Тип int.

Teigha.DatabaseServices.Dimension.Dimtofl
Свойство позволяет управлять отображением линии между выносными линиями или внутри измеряемого объекта, когда размерные линии размещены за пределами выносных линий или измеряемого объекта.
Свойство позволяет управлять отображением линии между выносными линиями или внутри измеряемого объекта, когда размерные линии размещены за пределами выносных линий или измеряемого объекта.  Свойство принимает следующие значения:
Значение		Описание
-------------	-------------------------------------------
true		Стрелки принудительно соединены линией, даже если стрелки размещены снаружи.
false	Стрелки размещены снаружи, но соединяющая их линия отсутствует.
Returns: Возвращает true, если стрелки соединены линией. Если линия подавлена, возвращает false.

Teigha.DatabaseServices.Dimension.Dimtoh
Свойство управляет расположением размерного текста за пределами выносных линий или измеряемого объекта.
Свойство управляет расположением размерного текста за пределами выносных линий или измеряемого объекта.
Свойство принимает следующие значения:
Значение		Описание
-------------	-------------------------------------------
true		Текст выравнивается по горизонтали.
false	Ориентация текста определяется ориентацией размерной линии или линии выноски.
Returns: Возвращает true в случае выравнивания текста по горизонтали и
false в случае выравнивания вдоль размерной линии или линии выноски.

Teigha.DatabaseServices.Dimension.Dimtol
Свойство управляет отображением допусков в размерах.
Свойство позволяет отображать предельные отклонения в конце размерного текста.
Returns: Возвращает true, если отображение допусков включено.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Dimtolj
Свойство управляет вертикальным выравниванием текста допуска относительно текста номинального размера.
Свойство позволяет выбрать вариант вертикального выравнивания текста допуска относительно текста номинального размера.
Свойство принимает следующие значения:
Значение	Описание
--------	---------------
0 			Снизу.
1			Посередине.
2 			Сверху.
Это свойство имеет эффект только в том случае, когда отображение допуска включено (т.е. свойство Dimtol имеет значение true).
Returns: Возвращает код варианта вертикального выравнивания текста допуска.  Тип int.

Teigha.DatabaseServices.Dimension.Dimtp
Свойство позволяет включить режим отображения верхнего предельного отклонения размера.
Свойство позволяет установить верхнее предельное отклонение размера.
Это свойство действует только в том случае, если отображение допусков включено (т.е. свойство Dimtol имеет значение true).
Returns: Возвращает верхнее предельное отклонение. Тип double.

Teigha.DatabaseServices.Dimension.Dimtsz
Свойство управляет размером засечек, отображаемых вместо стрелок на линейных, радиальных и диаметральных размерах.
Свойство задает или возвращает размер засечек, отображаемых вместо стрелок на линейных, радиальных и диаметральных размерах.
Значение свойства Dimtsz определяет расстояние параллельно размерной линии, на которое засечка выходит за пределы выносных линий.
Если Dimtsz = 0, отображаются стрелки. Положительные значения определяют размер косых штрихов.
Returns: Возвращает размер засечек. Тип double. Если Dimtsz = 0, отображаются стрелки.

Teigha.DatabaseServices.Dimension.Dimtvp
Свойство управляет вертикальным положением размерного текста относительно размерной линии.
Свойство задает или возвращает расстояние по вертикали от середины поля размерного текста до размерной линии.
Returns: Возвращает смещение текста по вертикали относительно размерной линии. Тип double.

Teigha.DatabaseServices.Dimension.Dimtxt
Свойство управляет размером размерного текста.
Свойство задает или возвращает размер размерного текста.
Это свойство влияет как на высоту, так и на ширину размерного текста и используется в качестве масштабного коэффициента для межсимвольного интервала.
Returns: Возвращает размер текста.  Тип double.

Teigha.DatabaseServices.Dimension.Dimtzin
Свойство управляет подавлением нулей при отображении допусков.
Свойство позволяет получить или задать вариант отображения нулей в значениях допусков.
Кодировка режимов имеет следующий вид:
Значение 	Описание
--------	-----------------------------------------------
0			Подавляет нулевые значения для целых футов и дюймов.
1			Отображает нулевые значения целых для футов и дюймов.
2			Отображает нулевые значения для футов и подавляет нулевые значения для дюймов.
3			Подавляет нулевые значения для футов и отображает для дюймов.
4			Подавляет ведущие нули в десятичных размерах (например, 0,5000 записывается как ,5000).
8			Подавляет замыкающие нули в десятичных размерах (например, 12,5000 записывается как 12,5).
12			Подавляет как ведущие, так и замыкающие нули (например, 0,5000 записывается как ,5).
Свойство Dimtzin учитывается, только если отображение допусков включено (т.е., свойство Dimtol имеет значение true).
Returns: Возвращает вариант отображения нулей в значениях допусков. Тип int.

Teigha.DatabaseServices.Dimension.Dimupt
Свойство управляет режимом перемещения текста, позиционирование которого определено пользователем, при перемещении размерной линии.
Свойство управляет режимом перемещения текста, позиционирование которого определено пользователем, при перемещении размерной линии.
Значение		Описание
false	Перемещается только размерная линия.
true		Перемещается и размерная линия, и текст.
Returns: Возвращает true, если перемещается размерная линия и текст, и false, если перемещается только размерная линия.

Teigha.DatabaseServices.Dimension.Dimzin
Свойство управляет подавлением нулей в значениях размеров, заданных в основных единицах измерения.
Свойство управляет подавлением нулей в значениях размеров, заданных в основных единицах измерения.
Возможны следующие варианты подавления:
Значение	Описание
--------	-------------------------------------------------------
0			Подавляются нулевые значения целых футов и дюймов.
1			Отображаются нулевые значения целых футов и дюймов.
2			Отображаются нули в футах и подавляются нули в дюймах.
3			Подавляются нули в футах и отображаются нули в дюймах.
4			Подавляются ведущие нули.
8			Подавляются замыкающие нули.
12			Подавляются как ведущие, так и замыкающие нули.
Returns: Возвращает вариант подавления нулей в значениях размеров. Тип int.

Teigha.DatabaseServices.Dimension.DynamicDimension
Свойство позволяет задать или определить, является ли данный размер динамическим.
Свойство позволяет задать или определить, является ли данный размер динамическим.
Returns: Возвращает true, если размер является динамическим.
В противном случае возвращает false.

Teigha.DatabaseServices.Dimension.Elevation
Свойство задает или возвращает высоту данного размера.
Свойство задает или возвращает высоту данного размера.
Высота определяется как расстояние от начала координат WCS до плоскости, на которой располагается размер.
Returns: Возвращает высоту данного размера. Тип double.

Teigha.DatabaseServices.Dimension.HorizontalRotation
Свойство управляет углом поворота размера в горизонтальной плоскости (в радианах).
Свойство задает или возвращает угол поворота размера в горизонтальной плоскости.
Угол задается в радианах в диапазоне от 0 до 2*PI рад.
Положительное значение угла определяет вращение по часовой стрелке (вправо), если смотреть вниз вдоль оси Z на начало координат.
Отрицательный угол означает поворот против часовой стрелки (влево).
Returns: Возвращает угол поворота размера в горизонтальной плоскости (в радианах).  Тип double.

Teigha.DatabaseServices.Dimension.Measurement
Свойство возвращает значение размера как значение с плавающей точкой двойной точности.
Свойство возвращает значение размера как значение с плавающей точкой двойной точности.
Для линейных размеров — это длина, для угловых размеров — это угол.
Объект Dimension вычисляют это значение автоматически. Изменять его нельзя.
Returns: Возвращает значение размера. Тип double.

Teigha.DatabaseServices.Dimension.Normal
Свойство задает или возвращает 3D-вектор нормали данного размера (в координатах WCS).
Свойство задает или возвращает 3D-вектор нормали данного размера (в координатах WCS).
Returns: Возвращает вектор нормали размера. Тип Vector3d.

Teigha.DatabaseServices.Dimension.TextAttachment
Свойство задает или возвращает режим выравнивания размерного текста в пределах текстового поля.
Свойство задает или возвращает режим выравнивания размерного текста в пределах текстового поля.
Returns: Возвращает режим выравнивания размерного текста. Значение из перечисления AttachmentPoint.

Teigha.DatabaseServices.Dimension.TextLineSpacingFactor
Свойство задает или возвращает относительное расстояние между базовыми линиями соседних строк текста.
Свойство задает или возвращает относительное расстояние между базовыми линиями соседних строк текста.
Коэффициент межстрочного интервала принимает значения в диапазоне от 0,25 до 4,0.
TextLineSpacingFactor имеет тот же эффект, что и свойство LineSpacingFactor объекта MText.
Returns: Возвращает коэффициент межстрочного интервала.  Тип double.

Teigha.DatabaseServices.Dimension.TextLineSpacingStyle
Свойство задает или возвращает стиль межстрочного интервала для размерного текста.
Свойство задает или возвращает стиль межстрочного интервала для размерного текста.
По эффекту аналогично свойству LineSpacingStyle объекта MText.
Returns: Возвращает стиль межстрочного интервала.  Значение из перечисления LineSpacingStyle.

Teigha.DatabaseServices.Dimension.TextPosition
Свойство позволяет управлять 3D-точкой привязки текста.
Свойство задает или возвращает точку привязки текста в виде значения Point3d.
Это свойство действительно, только если для свойства UseDefaultTextPosition установлено значение false.
Returns: Возвращает точку привязки текста. Тип Point3d.

Teigha.DatabaseServices.Dimension.TextRotation
Свойство управляет углом поворота поля размерного текста в радианах.
Свойство задает или возвращает угол поворота поля размерного текста.
Угол задается в радианах.
Направление поворота определяется знаком угла.
Отрицательные значения угла означают поворот по часовой стрелке (вправо).
Положительные значения - против часовой стрелки (влево).
Returns: Возвращает угол поворота размерного текста. Тип double.

Teigha.DatabaseServices.Dimension.TextStyleId
Свойство задает или возвращает текстовый стиль, используемый для размерного текста в данном объекте.
Свойство задает или возвращает текстовый стиль, используемый для размерного текста в данном объекте.
Returns: Возвращает идентификатор текстового стиля размерного текста. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.UsingDefaultTextPosition
Свойство позволяет определить, должно ли для размерного текста использоваться положение по умолчанию или нет.
Свойство позволяет определить, должно ли для размерного текста использоваться положение по умолчанию или нет.
В случае значения true используется позиция текста по умолчанию.
В случае необходимости изменить позицию текста, этому свойству следует задать значение false.
Returns: Возвращает true, если используется позиция по умолчанию.
В противном случае возвращает false.