Teigha.Geometry.Point2dCollection.ToArray
Метод создает массив объектов Point2d, содержащий копии всех элементов данной коллекции.
Метод создает массив объектов Point2d, содержащий копии всех элементов данной коллекции.
Returns: Возвращает массив, содержащий копии всех элементов данной коллекции.
Тип Point2d[].