Teigha.DatabaseServices.DgnUnderlayItem
Этот класс представляет элементы подложки DGN.
Этот класс представляет элементы подложки DGN.

Teigha.DatabaseServices.DgnUnderlayItem.ShowRasterRef
Свойство позволяет определить, отображаются ли растровые изображения в файлах DGN, на которые имеются ссылки.
Свойство позволяет определить, отображаются ли растровые изображения в файлах DGN, на которые имеются ссылки.
Returns: Возвращает true, если растровые изображения в файлах DGN будут отображаться.
В противном случае возвращает false.

Teigha.DatabaseServices.DgnUnderlayItem.SetShowRasterRef
Свойство позволяет задать режим отображения растровых изображений в файлах DGN, на которые имеются ссылки.
Returns: Возвращает true, если растровые изображения в файлах DGN должны отображаться.
В противном случае возвращает false.

Teigha.DatabaseServices.DgnUnderlayItem.UseMasterUnits
Свойство предоставляет доступ на изменение к флагу, который определяет, использует ли подложка основные единицы измерения из файла DGN при преобразовании файла DGN в формат DWG.  Если основные единицы измерения не используются, используются вспомогательные.
Свойство предоставляет доступ на изменение к флагу, который определяет, использует ли подложка основные единицы измерения из файла DGN при преобразовании файла DGN в формат DWG.  Если основные единицы измерения не используются, используются вспомогательные.
Returns: Возвращает true, если подложка использует основные единицы измерения из файла DGN.
В противном случае возвращает false.