Teigha.DatabaseServices.DatabaseIOEventArgs
Класс представляет данные для событий базы данных, связанных с операциями ввода-вывода (BeginSave, DwgFileOpened и SaveComplete).
Класс представляет данные для событий базы данных, связанных с операциями ввода-вывода (BeginSave, DwgFileOpened и SaveComplete).

Teigha.DatabaseServices.DatabaseIOEventArgs.FileName
Свойство представляет доступ к имени файла чертежа.
Свойство представляет доступ к имени файла чертежа.
Returns: Возвращает имя файла. Тип String.