Teigha.Geometry.Vector2d.IsZeroLength
Метод проверяет, является ли данный вектор нулевым.
Метод проверяет, является ли данный вектор нулевым.
Реализация использует вызов метода Vector2d.IsZeroLength(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
Returns: Возвращает true, если в пределах точности по умолчанию длина данного вектора равна нулю.
В противном случае возвращает false.