Teigha.DatabaseServices.ViewTable
Класс предназначен для хранения определений именованных видов
в базе данных чертежа.
Класс предназначен для хранения определений именованных видов
в базе данных чертежа, то есть является коллекцией/таблицей,
в которой каждая запись – это определение именованного вида.
Именованные виды создаются для быстрого перехода от одного
фрагмента чертежа к другому.
Определение именованного вида – это набор данных,
определяющий его характеристики: название, яркость, ракурс и
пр. Для определения именованного вида используется класс
ViewTableRecord. Соответственно, все записи таблицы видов
имеют тип данных ViewTableRecord.
Итератор таблицы устроен так, что при переборе коллекции
перебираются ObjectId каждого элемента, а не сами записи
таблицы. По ObjectId можно открыть каждую запись и получить
подробные данные, либо изменить их.
По умолчанию, в чертеже всегда есть стандартные виды:
ортогональные (сверху, снизу и пр.) и изометрические (ЮЗ, ЮВ
и пр.). Но в таблицу именованных видов они не входят. В
таблицу входят только виды, созданные пользователем. В
интерфейсе nanoCAD каждое определение именованного вида
(запись в таблице видов) является видом в перечне сохраненных
видов. Сам перечень сохраненных видов отражает всё содержимое
таблицы видов:
Рис. 1
На рисунке 1 сохраненные именованные виды отображены в
верхней части перечня, над чертой. Такой перечень можно
увидеть несколькими способами:
* С помощью кнопки слева от вкладок листов:
* Через меню: Вид #45;gt; Именованные виды #45;gt; ? #45;gt;
#42;. В этом случае перечень будет выведен в командную
строку nanoCAD:
* Через ленту: Вид #45;gt; Виды #45;gt; Установить вид
#45;gt; ? #45;gt; #42;. Перечень видов будет также
выведен в командную строку nanoCAD;
* Через команду ВИД #45;gt; ? #45;gt; #42;. Перечень
видов будет также выведен в командную строку nanoCAD.
Example
В качестве примера работы с таблицей видов приведена команда
VIEWTABLEREADING, которая открывает таблицу видов и
перебирает её содержимое, выводя в командную строку название
каждого вида и его тип данных.
C#