HostMgd.Windows.ToolPalette.FlyoutEntryAttribute
Класс FlyoutEntryAttribute представляет атрибут, который идентифицирует выпадающие элементы.
Не реализован.
Класс FlyoutEntryAttribute представляет атрибут, который идентифицирует выпадающие элементы.
В текущей версии не реализован.

HostMgd.Windows.ToolPalette.FlyoutEntryAttribute.#ctor
Конструктор по умолчанию класса FlyoutEntryAttribute.
Не реализован.
Конструктор по умолчанию класса FlyoutEntryAttribute.
В текущей версии не реализован.

HostMgd.Windows.ToolPalette.FlyoutEntryAttribute.#ctor(System.Int32)
Конструктор класса FlyoutEntryAttribute для создания экземпляра класса с указанным диспетчерским идентификатором.
Конструктор не реализован.
Конструктор класса FlyoutEntryAttribute.
Создает экземпляр класса с указанным диспетчерским идентификатором dispatchId.
В текущей версии не реализован.
dispatchId: Диспетчерский идентификатор. Тип int.

HostMgd.Windows.ToolPalette.FlyoutEntryAttribute.DispId
Свойство DispId представляет идентификатор диспетчеризации.
Не реализовано.
Свойство DispId представляет идентификатор диспетчеризации.
В текущей версии не реализовано.
Returns: Возвращает идентификатор диспетчеризации.
Тип int.