Teigha.DatabaseServices.RasterImage.GetVertices
Возвращает вершины фрейма изображения. Эти точки могут
представлять четыре угла прямоугольника или, если изображение
задано в виде контура, вершины границ многоугольника контура
изображения.