HostMgd.ApplicationServices.PreTranslateMessageEventHandler
Делегат предназначен для обработки события Application.PreTranslateMessage, возникающего непосредственно перед переводом сообщения.
Делегат PreTranslateMessageEventHandler предназначен для обработки события PreTranslateMessage класса Application, которое возникает непосредственно перед переводом сообщения.
Контекст события передается через параметры sender и e, где e содержит собственно объект сообщения в формате структуры MSG и флаг состояния события (обработано или нет).
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип PreTranslateMessageEventArgs.