Teigha.GraphicsInterface.ShadowMode
Перечисление ShadowMode определяет режим отрисовки теней в графической подсистеме платформы.
Перечисление ShadowMode определяет режим отрисовки теней при рендеринге 3D-объектов в графической подсистеме платформы.