HostMgd.Windows.ToolPalette.CustomToolBase.ExecuteCallback
Метод реализует обратный вызов, используемый при выполнении логики пользовательского инструмента.
Не реализован.
Метод реализует обратный вызов, используемый при выполнении логики пользовательского инструмента.
В текущей версии не реализован.
Returns: Возвращает true, если вызов метода завершен успешно.
В противном случае возвращает false.