Teigha.DatabaseServices.DataTable.GetRowAt
Метод позволяет получить строку с заданным индексом.
Метод позволяет получить строку с заданным индексом.
index: Индекс искомой строки. Тип int
Returns: Возвращает строку. Тип DataCellCollection.
Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.