Teigha.DatabaseServices.NurbsData.GetControlPoints
Метод возвращает коллекцию управляющих вершин данного объекта.
Метод возвращает коллекцию управляющих вершин данного объекта.
Returns: Возвращает коллекцию управляющих вершин.
Тип Point3dCollection.