HostMgd.EditorInput.PromptSelectionResult.ToString
Метод возвращает строковое представление результата выборки объектов,
включая статус и количество выбранных элементов.
Метод предоставляет читаемую строку, описывающую результат
операции выбора объектов в чертеже nanoCAD.
Метод формирует текст на основе статуса операции и содержимого
набора выделенных объектов (SelectionSet).
Это удобно для отладки, логирования
или вывода информации в командную строку.
Если операция завершена успешно, метод возвращает количество объектов в выборке.
В случае отмены или ошибки — соответствующее текстовое сообщение.
Returns: Возвращает значение типа string,
представляющее результат выборки:
* Для успешной операции (Status == PromptStatus.OK) :
Пример: "12 object(s) selected" или "Selection set contains 3 objects".
* Для отмены пользователем (Status == PromptStatus.Cancel) :
Пример: "Operation cancelled".
* Для ошибки (Status == PromptStatus.Error) :
Пример: "Input error occurred".
Если результат пустой или не определён может вернуть null.
Example
C#