Teigha.Runtime.Overrule
Класс Overrule — это базовый класс для реализации объектных переопределений.
Класс Overrule — это базовый класс для реализации объектных переопределений.
Поставщики объектных переопределений регистрируют и отменяют регистрацию своих переопределений с помощью методов AddOverrule и RemoveOverrule.  Запросы реализованы через метод HasOverrule.
Переопределения внутренне управляются парами «целевой класс» - «переопределение».
Целевой класс — это класс, к которому применяется переопределение.
В каждом классе может быть зарегистрировано несколько переопределений, и их порядок определяется порядком их регистрации.
Каждый класс, наследующий переопределения, должен реализовывать часть или все поведение по умолчанию, которое делегируется целевому классу.

Teigha.Runtime.Overrule.AddOverrule(Teigha.Runtime.RXClass,Teigha.Runtime.Overrule,System.Boolean)
Метод регистрирует объект для данного класса, который надлежит переопределить.
Метод регистрирует объект для данного класса, который подлежит переопределению.
targetClass: Целевой класс, к которому применяется переопределение. Тип RXClass.
overrule: Объектное переопределение. Тип Overrule.
bAtLast: Флаг, который определяет, следует ли добавлять пару в конец коллекции переопределений.  Значение по умолчанию - false. Тип bool.

Teigha.Runtime.Overrule.HasOverrule(Teigha.Runtime.RXObject,Teigha.Runtime.RXClass)
Метод позволяет проверить, поддерживает ли указанное переопределение данный объект.
Метод позволяет проверить, поддерживает ли указанное переопределение данный объект.
Если объект должен обрабатываться переопределением, возвращает true. В противном случае возвращает false.
overruledSubject: Переопределяемый объект. Тип RXObject.
targetClass: Целевой класс, к которому применяется переопределение. Тип RXClass.
Returns: Возвращает true, если объект overruledSubject должен обрабатываться переопределением.
В противном случае возвращает false.

Teigha.Runtime.Overrule.RemoveOverrule(Teigha.Runtime.RXClass,Teigha.Runtime.Overrule)
Метод отменяет регистрацию объектного переопределения для данного класса.
Метод отменяет регистрацию объектного переопределения для данного класса.
targetClass: Целевой класс, к которому применяется переопределение. Тип RXClass.
overrule: Объектное переопределение. Тип Overrule.

Teigha.Runtime.Overrule.IsApplicable(Teigha.Runtime.RXObject)
Метод позволяет определить, применимо ли объектное переопределение.
Метод позволяет определить, применимо ли объектное переопределение.
Если оно применимо, возвращает true. В противном случае возвращает false.
Это чисто виртуальный метод, который должен быть реализован в производном классе.
overruledSubject: Переопределяемый объект. Тип RXObject.
Returns: Если переопределение применимо, возвращает true. В противном случае возвращает false.

Teigha.Runtime.Overrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD искал в словаре расширений запись с именем entryName.  Переопределения не будут вызываться, если запись с entryName не будет найдена в словаре расширений.
entryName: Имя записи в словаре расширений. Тип String.

Teigha.Runtime.Overrule.SetIdFilter(array)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
ids: Входной массив идентификаторов объектов.  Тип ObjectId[].

Teigha.Runtime.Overrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
registeredApplicationName: Имя зарегистрированного приложения. Тип String.

Teigha.Runtime.Overrule.Overruling
Свойство позволяет включить или отключить механизм объектного переопределения.
Свойство позволяет включить или отключить механизм объектного переопределения.
Returns: Возвращает true, если механизм объектного переопределения включен.  В противном случае возвращает false.