Teigha.DatabaseServices.DiametricDimension
Класс представляет объект диаметрального размера.
Класс представляет объект диаметрального размера в nanoCAD.

Teigha.DatabaseServices.DiametricDimension.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию. Создает объект диаметрального размера с концами хорды в точке (0, 0, 0) и нулевой длиной выноски.

Teigha.DatabaseServices.DiametricDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Double,String,DatabaseServices.ObjectId)
Конструктор класса DiametricDimension. Создает объект DiametricDimension с указанными параметрами.
Конструктор класса DiametricDimension. Создает объект DiametricDimension с указанными параметрами.
chordPoint: Первая точка диаметра. Тип Point3d.
farChordPoint: Дальняя точка диаметра. Тип Point3d.
leaderLength: Длина выноски. Тип double.
dimensionText: Размерный текст. Тип String.
dimensionStyle: Размерный стиль. Тип DatabaseServices.ObjectId.
Returns: Возвращает новый объект DiametricDimension с указанными параметрами.

Teigha.DatabaseServices.DiametricDimension.LeaderLength
Свойство задает или получает длину от точки диаметра до точки начала полки диаметрального размера.
Свойство задает или получает длину от точки диаметра до точки начала полки диаметрального размера.
Returns: Возвращает длину от точки диаметра до точки начала полки. Тип double.

Teigha.DatabaseServices.DiametricDimension.chordPoint
Свойство позволяет получить или задать первую точку диаметра на измеряемой окружности или дуге.
Свойство позволяет получить или задать первую точку диаметра на измеряемой окружности или дуге.
Точка хорды — это точка, в которой размерная линия для этого размерного объекта пересекает кривую, для которой проставляется размер, и выходит за ее пределы (если текст аннотации находится за пределами кривой).
Returns: Возвращает первую точку диаметра. Тип Point3d.

Teigha.DatabaseServices.DiametricDimension.farChordPoint
Свойство позволяет получить или задать вторую (дальнюю) точку диаметра на измеряемой окружности или дуге.
Свойство позволяет получить или задать вторую (дальнюю) точку диаметра на измеряемой окружности или дуге.
Returns: Возвращает вторую (противоположную) точку диаметра. Тип Point3d.