Teigha.DatabaseServices.CellBorder
Класс CellBorder представляет границу ячейки таблицы.
Класс CellBorder представляет границу ячейки таблицы.

Teigha.DatabaseServices.CellBorder.Color
Свойство Color представляет цвет границы ячейки.
Свойство Color представляет цвет границы ячейки.
Returns: Возвращает цвет границы ячейки.
Тип Colors.Color.

Teigha.DatabaseServices.CellBorder.DoubleLineSpacing
Свойство DoubleLineSpacing представляет величину интервала между двойными линиями границы.
Свойство DoubleLineSpacing представляет величину интервала между двойными линиями границы.
Returns: Возвращает величину интервала между двойными линиями границы.
Тип double?.

Teigha.DatabaseServices.CellBorder.IsVisible
Свойство IsVisible позволяет определить видимость границы ячейки.
Свойство IsVisible позволяет определить видимость границы ячейки.
Returns: Возвращает true, если граница является видимой.
Тип bool?.

Teigha.DatabaseServices.CellBorder.LineStyle
Свойство LineStyle представляет стиль линии, используемый объектом границы ячейки.
Свойство LineStyle представляет стиль линии, используемый объектом границы ячейки.
Returns: Возвращает стиль линии границы ячейки.
Тип DatabaseServices.GridLineStyle?.

Teigha.DatabaseServices.CellBorder.Linetype
Свойство Linetype представляет тип линии, используемый объектом границы ячейки.
Свойство Linetype представляет тип линии, используемый объектом границы ячейки.
Returns: Возвращает идентификатор объекта типа линии для границы ячейки.
Тип DatabaseServices.ObjectId?.

Teigha.DatabaseServices.CellBorder.LineWeight
Свойство LineWeight представляет вес линии, которая используется для границы ячейки.
Свойство LineWeight представляет вес (толщину) линии, которая используется для границы ячейки.
Returns: Возвращает вес (толщину) линии.
Перечисление DatabaseServices.LineWeight?.

Teigha.DatabaseServices.CellBorder.Margin
Свойство Margin представляет размер поля на границе ячейки.
Свойство Margin представляет размер поля на границе ячейки.
Returns: Возвращает размер поля на границе ячейки.
Тип double?.

Teigha.DatabaseServices.CellBorder.Overrides
Свойство Overrides представляет переопределения свойств границы ячейки.
Свойство Overrides представляет переопределения свойств границы ячейки.
Returns: Возвращает переопределения свойств границы ячейки.
Перечисление GridProperties?.