HostMgd.Windows.ToolPalette.CustomToolBase.GetToolProperties
Метод предназначен для получения объекта, представляющего свойства пользовательского инструмента.
Не реализован.
Метод предназначен для получения объекта, представляющего свойства пользовательского инструмента.
Свойства инструмента могут запрашиваться, например, при выделении пользователем пользовательского инструмента на панели инструментов.
В текущей версии не реализован.
Notes
Данный метод возвращает тот же объект, который передается в метод SetToolProperties().
Returns: Возвращает объект, представляющий свойства пользовательского инструмента.
Тип System.Object.