Teigha.DatabaseServices.TableHitTestInfo
Класс TableHitTestInfo представляет данные, получаемые от метода Table.HitTest().
Класс TableHitTestInfo представляет данные, получаемые от метода Table.HitTest().

Teigha.DatabaseServices.TableHitTestInfo.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
Метод позволяет получить эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
provider: Провайдер языковых и региональных настроек.
Returns: Возвращает строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки. Тип String. Строка содержит индексы строки и столбца таблицы.

Teigha.DatabaseServices.TableHitTestInfo.Column
Свойство Column представляет индекс столбца таблицы.
Свойство Column представляет индекс столбца таблицы.
Returns: Возвращает индекс столбца таблицы. Тип int.

Teigha.DatabaseServices.TableHitTestInfo.Row
Свойство Row представляет индекс строки таблицы.
Свойство Row представляет индекс строки таблицы.
Returns: Возвращает индекс строки таблицы. Тип int.

Teigha.DatabaseServices.TableHitTestInfo.Type
Свойство Type представляет тип результата проверки попадания в таблицу.
Свойство Type представляет тип результата проверки попадания в таблицу.
Отражается факт попадания в некоторую ячейку таблицы, либо мимо таблицы.
Returns: Возвращает результат проверки попадания в таблицу. Значение из перечисления TableHitTestType.