Teigha.GraphicsInterface.GIRasterImage.GIRasterImage.Convert(System.Boolean)
Метод позволяет преобразовать палитру данного изображения в формат RGB.
Метод позволяет преобразовать палитру данного изображения в формат RGB, если входной аргумент convertPaletteToRGB имеет значение true.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.GIRasterImage.Convert(System.Boolean,System.Double)
Метод позволяет изменить яркость данного изображения и преобразовать его палитру в формат RGB.
Метод позволяет изменить яркость данного изображения и преобразовать его палитру в формат RGB.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
brightness: Новое значение яркости изображения в диапазоне [0 .. 100]. Тип double.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.GIRasterImage.Convert(System.Boolean,System.Double,System.Double)
Метод позволяет изменить яркость и контраст данного изображения, а также преобразовать его палитру в формат RGB.
Метод позволяет изменить яркость и контраст данного изображения, а также преобразовать его палитру в формат RGB.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
brightness: Новое значение яркости изображения в диапазоне [0 .. 100]. Тип double.
contrast: Новое значение контраста изображения в диапазоне [0 .. 100]. Тип double.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.GIRasterImage.Convert(System.Boolean,System.Double,System.Double,System.Double)
Метод позволяет изменить яркость, контраст и затухание данного изображения, а также преобразовать его палитру в формат RGB.
Метод позволяет изменить яркость, контраст и затухание данного изображения, а также преобразовать его палитру в формат RGB.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
brightness: Новое значение яркости изображения в диапазоне [0 .. 100]. Тип double.
contrast: Новое значение контраста изображения в диапазоне [0 .. 100]. Тип double.
fade: Новое значение затухания изображения в диапазоне [0 .. 100]. Тип double.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.GIRasterImage.Convert(System.Boolean,System.Double,System.Double,System.Double,Drawing.Color)
Метод позволяет изменить яркость, контраст, затухание и цвет фона данного изображения, а также преобразовать его палитру в формат RGB.
Метод позволяет изменить яркость, контраст, затухание и цвет фона данного изображения, а также преобразовать его палитру в формат RGB.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
brightness: Новое значение яркости изображения в диапазоне [0 .. 100]. Тип double.
contrast: Новое значение контраста изображения в диапазоне [0 .. 100]. Тип double.
fade: Новое значение затухания изображения в диапазоне [0 .. 100]. Тип double.
backgroundColor: Новый цвет фона изображения. Тип System.Drawing.Color.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.GIRasterImage.Convert(System.Boolean,System.Double,System.Double,System.Double,Drawing.Color,System.Boolean,System.Boolean)
Метод позволяет изменить яркость, контраст, затухание, цвет фона данного изображения, а также опционально преобразовать его палитру в формат RGB и применить зеркальные отражения относительно осей X и Y.
Метод позволяет изменить яркость, контраст, затухание, цвет фона данного изображения, а также опционально преобразовать его палитру в формат RGB и применить зеркальные отражения относительно осей X и Y.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
brightness: Новое значение яркости изображения в диапазоне [0 .. 100]. Тип double.
contrast: Новое значение контраста изображения в диапазоне [0 .. 100]. Тип double.
fade: Новое значение затухания изображения в диапазоне [0 .. 100]. Тип double.
backgroundColor: Новый цвет фона изображения. Тип System.Drawing.Color.
flipX: Если установлено значение true, к изображению применяется зеркальное отражение относительно оси X. Тип bool.
flipY: Если установлено значение true, к изображению применяется зеркальное отражение относительно оси Y. Тип bool.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.GIRasterImage.Convert(System.Boolean,System.Double,System.Double,System.Double,Drawing.Color,System.Boolean,System.Boolean,System.Boolean)
Метод позволяет изменить яркость, контраст, затухание, цвет фона данного изображения, а также опционально преобразовать его палитру в формат RGB и применить к изображению зеркальные отражения и поворот на угол 90°.
Метод позволяет изменить яркость, контраст, затухание, цвет фона данного изображения, а также опционально преобразовать его палитру в формат RGB и применить зеркальные отражения относительно осей X и Y и повернуть изображение на угол 90°.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
brightness: Новое значение яркости изображения в диапазоне [0 .. 100]. Тип double.
contrast: Новое значение контраста изображения в диапазоне [0 .. 100]. Тип double.
fade: Новое значение затухания изображения в диапазоне [0 .. 100]. Тип double.
backgroundColor: Новый цвет фона изображения. Тип System.Drawing.Color.
flipX: Если установлено значение true, к изображению применяется зеркальное отражение относительно оси X. Тип bool.
flipY: Если установлено значение true, к изображению применяется зеркальное отражение относительно оси Y. Тип bool.
rotate90: Если установлено значение true, изображение будет повернуто на угол 90°. Тип bool.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.