HostMgd.EditorInput.DeviceInputEventHandler
Делегат DeviceInputEventHandler используется в обработке пользовательских событий, связанных с устройствами ввода.
Делегат DeviceInputEventHandler  используется для обработки пользовательских событий, связанных с устройствами ввода.
Контекст события передается через параметры sender и e, где e передает параметры низкоуровневых пользовательских событий, связанных с изменениями состояния устройства ввода (например, мыши, клавиатуры или графического планшета).
sender: Объект, инициировавший событие.  Тип Object.
e: Аргументы события.  Тип DeviceInputEventArgs.