Teigha.DatabaseServices.FieldCodeFlags.ObjectReference
Значение: 8.
Получает внедренные в текст поля как ссылки на объекты дочерних полей, хранящиеся в аргументе ChildFields.
Этот флаг действителен только для текстовых полей и используется для редактирования.
Данный флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.