Teigha.DatabaseServices.SubentityType
Перечисление SubentityType определяет типы подобъектов для объектов SubentityId.
Перечисление SubentityType определяет типы подобъектов для объектов Teigha.DatabaseServices.SubentityId.
Notes
Объект чертежа может состоять из множества графических подобъектов, таких как дуги, линии, текст, вершины, ребра, грани и т.д.
Идентификатор подобъекта формируется на основе типа подобъекта SubentityType и индекса подобъекта, который является маркером графической системы для подобъекта (обычно это указатель).