Teigha.GraphicsInterface.DiagnosticMode.Samples
Значение: 3.
Режим отрисовки изображения в оттенках серого, которое отражает плотность выборки. Диапазон размеров выборки управляется свойством MentalRayRenderSettingsTraits.Sampling. Более высокие уровни сэмплирования отображаются более светлыми оттенками серого.