HostMgd.EditorInput.PromptPointResult
Класс содержит результат операции интерактивного ввода точки
пользователем в редакторе nanoCAD.
Класс наследуется от PromptResult и используется для хранения данных,
полученных в результате вызова методов ввода точки — таких как GetPoint(),
GetCorner() и других. Он предоставляет информацию о статусе завершения операции (Status),
значение точки в мировой системе координат (Value),
а также строковое представление введённой пользователем информации (InputString).
Этот класс служит основным контейнером данных при обработке графического ввода точки,
что позволяет разработчикам надстроек nanoCAD реагировать на успешный выбор,
отмену или ошибку ввода.
Example
C#

HostMgd.EditorInput.PromptPointResult.ToString(IFormatProvider)
Метод возвращает строковое представление точки, введённой пользователем,
с учётом локализации и форматирования, заданного провайдером.
Метод переопределяет стандартный метод и предоставляет возможность
отформатировать координаты точки (Point3d) с учётом текущих региональных настроек
или указанного объекта IFormatProvider.
Это позволяет корректно отображать числовые значения с нужным разделителем (точкой или запятой),
а также учитывать системные настройки пользователя при выводе результата операции ввода точки.
Метод используется, например, при отладке, логировании или отображении информации в командной строке nanoCAD.
provider: Объект, предоставляющий информацию о правилах форматирования чисел и дат
Returns: Возвращает значение типа string, представляющее собой текстовое отображение точки в формате (X, Y, Z),
где X, Y и Z — координаты точки в мировой системе (WCS), отформатированные с использованием переданного provider.
Примеры:
* Без указания провайдера: (100,50; 200,75; 0,00)
* С CultureInfo.InvariantCulture: (100.50, 200.75, 0.00)
* Если операция выбора точки была отменена или завершена ошибкой,
может вернуть пустую строку или специальное сообщение.
Example
C#

HostMgd.EditorInput.PromptPointResult.Value
Свойство возвращает координаты точки, указанные пользователем в ходе интерактивного ввода.
Свойство используется для получения результата операции ввода точки,
выполненной методами, такими как GetPoint(), GetCorner() и другими,
которые позволяют пользователю выбрать или ввести координаты в чертеже.
Значение доступно только для чтения и представляет собой точку
в мировой системе координат (WCS), если операция завершена успешно.
Если пользователь отменил ввод или произошла ошибка,
значение может быть неопределённым или установлено в Point3d.Null.
Returns: Возвращает объект типа Point3d, представляющий трёхмерную точку в мировых координатах (X, Y, Z),
которую пользователь указал с помощью мыши или ввёл вручную через командную строку.
Point3d содержит:
* Координаты X, Y, Z.
* Методы сравнения и преобразования.
* Поддержку различных систем координат (WCS, OCS и др.).
Если ввод точки не был завершён корректно, возвращается Point3d.Null.
Example
C#