Teigha.DatabaseServices.TableTemplate
Класс TableTemplate предназначен для хранения и управления шаблонами таблиц.
Класс TableTemplate предназначен для хранения и управления шаблонами таблиц.

Teigha.DatabaseServices.TableTemplate.#ctor(Teigha.DatabaseServices.Table,Teigha.DatabaseServices.TableCopyOptions)
Конструктор класса TableTemplate. Создает экземпляр класса с указанными параметрами.
Конструктор класса TableTemplate. Создает экземпляр класса с указанными параметрами.
table: Таблица, на основе которой создается шаблон. Тип Table.
copyOption: Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление TableCopyOptions.

Teigha.DatabaseServices.TableTemplate.Capture(Teigha.DatabaseServices.Table,Teigha.DatabaseServices.TableCopyOptions)
Метод позволяет захватить шаблон таблицы.
Метод позволяет захватить шаблон таблицы.
table: Исходная таблица. Тип Table.
copyOption: Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление TableCopyOptions.

Teigha.DatabaseServices.TableTemplate.CreateTable(Teigha.DatabaseServices.TableCopyOptions)
Метод предназначен для создания нового шаблона таблицы.
Метод предназначен для создания нового шаблона таблицы.
copyOption: Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление TableCopyOptions.
Returns: Возвращает созданный шаблон таблицы. Тип Table.