HostMgd.EditorInput.JigPromptDistanceOptions.DefaultValue
Значение по умолчанию для запроса расстояния во время операции Jig.
Свойство предназначено для чтения и определения значения расстояния по умолчанию для операции Jig с геометрическим объектом.
Значение по умолчанию будет использовано, если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
Returns: Возвращает значение расстояния, заданнное по умолчанию.