Teigha.GraphicsSystem.SelectionMode.CPoly
Значение: 4.
Область выделения представляет собой многоугольник, граница которого задается по трем или более точкам.
Выделяются объекты, которые целиком оказались в пределах области выделения или пересекают ее границу.