Teigha.DatabaseServices.AssocDependency
Класс AssocDependency является базовым классом для реализации ассоциативных зависимостей.
Класс AssocDependency является базовым классом для реализации ассоциативных зависимостей в чертеже.
Класс хранит информацию о том, какие ассоциативные действия (экземпляры AssocAction) зависят от соответствующих объектов базы данных DBObject или изменяют их.
Владельцами зависимостей становятся ассоциативные действия.
Зависимости подключаются к объектам базы данных как постоянные реакторы.
Когда зависимый объект изменяется, он уведомляет зависимость, используя функционал постоянного реактора.
Зависимость проверяет, актуально ли изменение, и в случае необходимости меняет свой статус, указывая, что ее необходимо перевычислить, а также изменяет статус действия-владельца, указывая, что оно также требует перевычисления. Действие, в свою очередь, меняет статус сети AssocNetwork, которой оно принадлежит.
Базовый класс AssocDependency можно использовать и сам по себе, но предусмотрены также несколько конкретных производных классов зависимостей, которые представляют определенные виды зависимостей от конкретных объектов или подобъектов.
Примерами являются зависимости от подобъектов геометрических объектов (граней, ребер, вершин), зависимости от объектов, которые предоставляют некоторое числовое значение и т.д.
Скажем, зависимость геометрического объекта от подобъекта сохраняет AssocPersSubentId подобъекта и кэшированную геометрию подобъекта (скажем, координаты [x,y,z] подобъекта вершины, объект Curve ребра подобъекта и т.д.).  Это дает возможность сравнивать кэшированную геометрию подобъекта с фактической, чтобы проверить, действительно ли подобъект изменился.  В случае совпадения уведомление об изменении игнорируется.

Teigha.DatabaseServices.AssocDependency.#ctor
Конструктор класса по умолчанию.
Конструктор класса по умолчанию.

Teigha.DatabaseServices.AssocDependency.AttachToObject(Teigha.DatabaseServices.CompoundObjectId)
Метод позволяет прикрепить данную зависимость к одному или нескольким объектам в качестве постоянного реактора.
Метод позволяет прикрепить данную зависимость к указанному объекту compoundId в качестве постоянного реактора.
Когда CompoundObjectId представляет составной объект (т.е. CompoundObjectId содержит несколько идентификаторов ObjectId), зависимость прикрепляется в качестве постоянного реактора ко всем объектам, на которые ссылается CompoundObjectId.
Позиция зависимости в списке зависимостей объекта корректно учитывает порядок этих зависимостей.
Прикрепляемая зависимость в данный момент не должна быть прикрепленной ни к какому объекту.
compoundId: Объекты базы данных, к которым прикрепляется данная зависимость. Тип CompoundObjectId.

Teigha.DatabaseServices.AssocDependency.GetDependenciesOnObject(Teigha.DatabaseServices.DBObject,System.Boolean,System.Boolean)
Метод позволяет получить все зависимости, связанные с указанным объектом базы данных.
Метод позволяет получить все зависимости, связанные с указанным объектом DBObject базы данных.
Зависимости прикрепляются к объектам DBObject в виде постоянных реакторов, упорядочение зависимостей на каждом объекте определяется на основе значений свойства Order. Возвращаемая коллекция отражает корректную последовательность зависимостей.
dbObj: Идентификатор объекта, из которого извлекаются зависимости.  Тип DBObject.
readDependenciesWanted: Флаг, указывающий, следует ли извлекать зависимости чтения ("read-dependency").  Тип bool.
writeDependenciesWanted: Флаг, указывающий, следует ли извлекать зависимости записи ("write-dependency"). Тип bool.
Returns: Возвращает коллекцию ObjectId объектов, которые имеют зависимости чтения и/или записи от указанного объекта.
Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocDependency.GetFirstDependencyOnObject(Teigha.DatabaseServices.DBObject)
Метод позволяет получить первую зависимость у заданного объекта DBObject.
Метод позволяет получить первую зависимость у данного объекта DBObject.
Зависимости прикрепляются к объектам DBObject в виде постоянных реакторов и упорядочиваются в рамках объекта на основе значений их свойства Order. Возвращается первая зависимость в этом упорядоченном списке.
dbObj: Идентификатор объекта, из которого извлекается зависимость.  Тип DBObject.  Объект должен быть открыт как минимум для чтения.
Returns: Возвращает первую зависимость от объекта DBObject или ObjectId.Null, если у DBObject отсутствуют прикрепленные зависимости. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.NotifyDependenciesOnObject(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.AssocStatus)
Метод уведомляет все ассоциативные зависимости указанного объекта DBObject о новом статусе.
Метод получает все зависимости от данного DBObject и уведомляет их об изменении, устанавливая их статус.
Уведомлению подлежат как первичные зависимости от объекта (когда идентификатор объекта возвращается свойством DependentOnObject зависимости), так и вторичные зависимости (когда объект оказывается одним из составных объектов в CompoundObjectId зависимости).
dbObj: Объект базы данных DBObject, зависимости которого подлежат уведомлению о новом статусе. Тип DBObject.
newStatus: Новый статус в уведомлении.  Значение из перечисления AssocStatus.

Teigha.DatabaseServices.AssocDependency.SetDependentOnObject(Teigha.DatabaseServices.CompoundObjectId)
Метод устанавливает зависимость от объекта для данной зависимости с помощью идентификатора составного объекта CompoundObjectId.
Метод устанавливает зависимость от объекта для данной зависимости с помощью идентификатора составного объекта CompoundObjectId.
В отличие от AttachToObject(), этот метод не добавляет эту зависимость в список постоянных реакторов объекта.  Таким образом, зависимость оказывается в неопределенном состоянии — она не является ни прикрепленной к объекту, ни неприкрепленной к объекту.
Чтобы действительно прикрепить эту зависимость к объекту после того, как метод SetDependentOnObject() уже был вызван с ненулевым ObjectId, следует перед вызовом метода AttachToObject() сначала вызвать SetDependentOnObject() с нулевым аргументом compoundId.
Этот метод может повредить зависимость, и у клиентского кода не должно быть никаких причин для его использования.
compoundId: Идентификатор составного объекта, от которого должна зависеть данная зависимость (может быть нулевым).  Тип CompoundObjectId.

Teigha.DatabaseServices.AssocDependency.SetStatus(Teigha.DatabaseServices.AssocStatus,System.Boolean)
Метод устанавливает статус  AssocStatus данной зависимости.
Метод устанавливает статус  AssocStatus данной зависимости.
Если статус зависимости указывает, что действию-владельцу зависимости потребуется обновление (т.е. предикат IsEvaluationRequest() для такого статуса возвращает true), метод также может уведомить действие-владельца зависимости о необходимости изменить свой статус в связи с необходимостью перевычисления.
Действие может изменить свой статус и далее уведомить свою сеть-владельца.
Сеть может изменить свой статус и уведомить свою сеть-владельца и т.д. до тех пор, пока все сети в иерархии не будут уведомлены о том, что содержат действие, которое нуждается в перевычислении.
Если новый статус удовлетворяет предикату IsEvaluationRequest(), и EvaluationRequestSeverityLevel() нового статуса ниже текущего статуса запроса на обновление зависимости, текущий более высокий статус зависимости сохраняется без изменений и более низким новым статусом не перезаписывается.
Кроме того, если текущий статус зависимости удовлетворяет предикату IsToBeSkipped(), он не перезаписывается никаким новым статусом, который удовлетворяет предикату IsEvaluationRequest().
Чтобы в таком случае изменить статус зависимости, его необходимо сначала изменить на IsUpToDateAssocStatus, и уже после этого изменить на статус IsEvaluationRequest().
newStatus: Новый статус ассоциативной зависимости.  Значение из перечисления AssocStatus.
notifyOwningNetwork: Флаг необходимости уведомить ассоциативную сеть-владельца.  Тип bool.

Teigha.DatabaseServices.AssocDependency.DependencyBody
Свойство обеспечивает доступ к ObjectId тела зависимости, которое принадлежит данной зависимости и представлено классом, производным от AssocDependencyBody.
Свойство обеспечивает доступ к ObjectId тела зависимости, которое принадлежит данной зависимости и представлено классом, производным от AssocDependencyBody.  Если объект тела зависимости не задан, свойство возвращает нулевой идентификатор.
См. также комментарии к классу AssocDependencyBody.
Returns: Возвращает идентификатор тела пользовательской зависимости.  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.DependentOnCompoundObject
Свойство возвращает родительский составной объект, к которому данная зависимость прикреплена как постоянный реактор.
Свойство возвращает родительский составной объект, к которому данная зависимость прикреплена как постоянный реактор.
Если зависимость не использует CompoundObjectId, свойство возвращает результат обращения к свойству DependentOnObject(), приведенный к типу CompoundObjectId.
Returns: Возвращает идентификатор составного объекта.  Тип CompoundObjectId.

Teigha.DatabaseServices.AssocDependency.DependentOnObject
Свойство возвращает объект базы данных, с которым связана данная зависимость.
Свойство возвращает объект базы данных, с которым связана данная зависимость, или ObjectId.Null, если зависимость не прикреплена ни к какому объекту.
Зависимость прикрепляется к связанному объекту DBObject как постоянный реактор.
Returns: Возвращает идентификатор связанного объекта.  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.DependentOnObjectStatus
Свойство возвращает текущее состояние объекта DependentOnObject.
Свойство возвращает текущее состояние связанного объекта DependentOnObject как значение из перечисления Teigha.Runtime.ErrorStatus.
Returns: Возвращает состояние связанного объекта как значение из перечисления Teigha.Runtime.ErrorStatus.
Возможные состояния: OK, NotInitializedYet или InvalidObjectId.

Teigha.DatabaseServices.AssocDependency.HasCachedValue
Свойство позволяет установить, хранит ли данная зависимость кэшированное значение для объекта, с которым она связана.
Свойство позволяет установить, хранит ли данная зависимость кэшированное значение для связанного объекта.  Кэшированное значение не обязательно является актуальным и  не обязательно совпадает с текущим значением для связанного объекта.  Если связанный объект изменился, хранимое зависимостью кэшированное значение, может по-прежнему отражать предыдущее состояние объекта.  Но если статус зависимости равен IsUpToDateAssocStatus, кэшированное значение должно быть синхронизировано со связанным объектом.
Реализация этого предиката по умолчанию делегирует принятие решения действию-владельцу, вызывая его метод AssocAction.HasDependencyCachedValue().  Делегирование можно отключить, если свойству IsDelegatingToOwningAction задать значение false.  Реализация AssocAction.HasDependencyCachedValue() по умолчанию возвращает false.
Если зависимость владеет объектом AssocDependencyBody, который переопределяет предикат HasCachedValueOverride(), вызов переопределения заменяет реализацию по умолчанию.
Значение по умолчанию false.
Returns: Возвращает true, если зависимость хранит кэшированное значение для связанного объекта.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsActionEvaluationInProgress
Свойство позволяет установить, занята ли система в данный момент вычислением действия или сети действий.
Свойство позволяет установить, занята ли система в данный момент вычислением действия или сети действий.
Следует иметь ввиду, что в процессе обновления действий уведомления зависимостей отключаются.
Зависимости игнорируют уведомления об изменении связанного объекта.  Соответственно, не происходит и уведомление действий-владельцев этих зависимостей.
Это необходимо, чтобы исключить зацикливание обновлений.
Returns: Возвращает true, если в данный момент система выполняет обновление действия или сети действий.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsAttachedToObject
Свойство позволяет установить, связана ли данная зависимость с каким-либо объектом.
Свойство позволяет установить, связана ли данная зависимость с каким-либо объектом.
Зависимость прикрепляется к связанному объекту DBObject как постоянный реактор, но она также может вовсе не иметь связи ни с каким объектом.  В этом случае свойство AssocDependency.DependentOnObject() возвращает ObjectId.Null.
Returns: Возвращает true, если данная зависимость прикреплена к какому-либо объекту.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsDelegatingToOwningAction
Свойство проверяет или задает режим делегирования действию-владельцу некоторыми методами зависимостей, если метод не реализован непосредственно в зависимости или в объекте AssocDependencyBody, которым может владеть зависимость.
Свойство проверяет или задает режим делегирования действию-владельцу некоторыми методами зависимостей, если метод не реализован непосредственно в зависимости или в объекте AssocDependencyBody, которым может владеть зависимость.
По умолчанию установлено значение true, т.е. делегирование имеет место.
Примерами методов, выполняющих делегирование от зависимости действию-владельцу, являются такие методы, как IsRelevantChange(), HasCachedValue(), IsEqualTo(), IsDependentOnTheSameThingAs(), Evaluate() и т.д.
Причина такого делегирования — желание предоставить разработчикам пользовательских действий больше свободы в выборе места хранения данных, связанных с зависимостями, которые принадлежат их пользовательским действиям, а также уменьшение потребности в создании новых классов тела зависимости.
Returns: Возвращает true, если режим делегирования установлен.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsDependentOnCompoundObject
Свойство позволяет проверить, является ли связанный с зависимостью объект составным, т.е. используется ли данной зависимостью идентификатор составного объекта CompoundObjectId.
Свойство позволяет проверить, является ли связанный с зависимостью объект составным, т.е. используется ли данной зависимостью идентификатор составного объекта CompoundObjectId.
Returns: Возвращает true, если зависимость использует идентификатор CompoundObjectId.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsObjectStateDependent
Свойство позволяет задать или проверить, требует ли владеющее зависимостью действие AssocAction, чтобы связанный DBObject находился в ожидаемом «состоянии объекта» с точки зрения списка зависимостей объекта, прежде чем действие можно будет перевычислить.
Свойство позволяет задать или проверить, требует ли владеющее зависимостью действие AssocAction, чтобы связанный DBObject  с точки зрения списка зависимостей объекта находился в ожидаемом «состоянии объекта», прежде чем действие можно будет перевычислить.
Это означает, что действия-владельцы влияющих на объект зависимостей, которые предшествуют данной в общем списке зависимостей объекта, должны быть вычислены, а действия-владельцы влияющих на объект зависимостей, которые следуют в списке после этой зависимости, должны оставаться пока не обновленными.  Это также означает, что объект переходит в желаемое состояние после вычисления непосредственно предшествующего действия, но до вычисления следующего действия, которое может снова изменить объект, переведя его в следующее состояние.
Значение этого флага по умолчанию — true.
Returns: Возвращает true, если вычисление действия предполагает пребывание объекта в некотором определенном состоянии.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsReadDependency
Свойство позволяет указать или проверить, что данная зависимость использует связанный объект, не меняя его состояния.
Свойство позволяет указать или проверить, что данная зависимость использует связанный объект, не меняя его состояния.
Значение true указывает, что действие AssocAction как владелец зависимости лишь использует значение зависимого объекта DBObject.
Значение этого флага по умолчанию — false.
Returns: Возвращает true, если действие-владелец зависимости лишь использует значение связанного объекта DBObject.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsRelevantChange
Свойство позволяет проверить, действительно ли изменение связанного объекта релевантно и меняет состояние данной зависимости.
Свойство позволяет проверить, действительно ли изменение связанного объекта релевантно и меняет состояние данной зависимости.  Например, если зависимость завязана на подобъект геометрического объекта, она должна проверить, действительно ли изменилась геометрия этого подобъекта (например, путем сравнения ее с кэшированной геометрией).
Использование этого свойства позволяет отфильтровывать уведомления о ложных или нерелевантных изменениях и, таким образом, избегать ненужного перевычисления действий.
Если это свойство имеет значение false, уведомление об изменении от зависимого объекта игнорируется, а состояние данной зависимости не изменяется.
Реализация по умолчанию данного свойства делегирует принятие решения действию-владельцу, вызывая его метод AssocAction.IsRelevantDependencyChange().
Делегирование можно отключить, если свойству IsDelegatingToOwningAction задать значение false.
Реализация по умолчанию AssocAction.IsRelevantDependencyChange() возвращает true.
Если зависимость владеет объектом AssocDependencyBody, который переопределяет свойство IsRelevantChangeOverride(), вызов переопределения заменяет реализацию по умолчанию.
Returns: Возвращает true, если изменение связанного объекта меняет состояние данной зависимости.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.IsWriteDependency
Свойство позволяет проверить или указать, что данная зависимость изменяет состояние связанного объекта.
Свойство позволяет проверить или указать, что данная зависимость изменяет состояние связанного объекта.
Значение true указывает, что действие AssocAction как владелец зависимости изменяет зависимый объект DBObject.
Значение этого флага по умолчанию — false.
Returns: Возвращает true, если зависимость изменяет состояние связанного объекта.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocDependency.NextDependencyOnObject
Свойство возвращает следующую зависимость после данной в списке зависимостей объекта DBObject или ObjectId.Null, если данная зависимость является последней в списке.
Свойство возвращает следующую зависимость после данной в списке зависимостей объекта DBObject или ObjectId.Null, если данная зависимость является последней в списке.
Все зависимости, связанные с одним и тем же объектом DBObject, хранятся в двусвязном списке.
Порядок следования зависимостей в списке определяется свойством Order этих зависимостей.
Returns: Возвращает идентификатор зависимости. Тип Teigha.DatabaseServices.ObjectId.
В случае последней в списке зависимости возвращает ObjectId.Null.

Teigha.DatabaseServices.AssocDependency.Order
Свойство позволяет получить или задать порядок зависимости, определяющий ее место в списке всех зависимостей связанного объекта DBObject.
Свойство позволяет получить или задать порядок зависимости, который определяет ее место в списке всех зависимостей связанного объекта DBObject.
Зависимости с более низким значением свойства Order располагаются в списке перед зависимостями с более высоким значением Order.
Последовательность зависимостей с одинаковым значением Order определяется по мере их добавления к объекту зависимости - добавленные позже, располагаются после зависимостей, добавленных ранее.
Заметим, если зависимость уже прикреплена к объекту методом AttachToObject(), изменение свойства Order не меняет положение зависимости в списке, и задавать его не следует.
Значение по умолчанию этого элемента данных — 0.
Returns: Возвращает порядок зависимости в списке зависимостей связанного объекта. Тип int.

Teigha.DatabaseServices.AssocDependency.OwningAction
Свойство позволяет получить или задать ассоциативное действие AssocAction, являющееся владельцем данной зависимости.
Свойство позволяет получить или задать ассоциативное действие AssocAction, являющееся владельцем данной зависимости.
Каждая зависимость принадлежит некоторому действию AssocAction (как в логическом смысле, так и в смысле базы данных nanoCAD).
Это свойство не следует задавать напрямую; используйте методы AssocAction.AddDependency() и AssocAction.RemoveDependency().
Returns: Возвращает ObjectId действия-владельца данной зависимости.  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.PrevDependencyOnObject
Свойство возвращает зависимость, которая предшествует данной в списке зависимостей связанного объекта DBObject.
Свойство возвращает зависимость, которая предшествует данной в списке зависимостей связанного объекта DBObject.
Для первой в списке зависимости возвращает ObjectId.Null.
Все зависимости, связанные с одним и тем же оъектом DBObject, хранятся в двусвязном списке.
Порядок следования зависимостей в списке определяется свойством Order этих зависимостей.
Returns: Возвращает идентификатор зависимости. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.Status
Свойство получает и устанавливает текущий статус AssocStatus данной зависимости.
Свойство получает и устанавливает текущий статус данной зависимости как значение из перечисления AssocStatus.
Returns: Возвращает статус зависимости как значение из перечисления AssocStatus.