HostMgd.PlottingServices.BeginPlotEventHandler
Делегат BeginPlotEventHandler предназначен для обработки события PlotReactorManager.BeginPlot, возникающего перед началом вывода на плоттер
Делегат BeginPlotEventHandler предназначен для обработки события PlotReactorManager.BeginPlot, возникающего перед началом вывода на плоттер.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события,
а аргумент e типа BeginPlotEventArgs передает объекты PlotProgress и PlotType, которые определяют поведение диалога прогресса печати и тип печати, соответственно.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип BeginPlotEventArgs.