Teigha.LayerManager.LayerFilterDisplayImages
Структура LayerFilterDisplayImages представляет информацию об изображениях, используемых для пользовательских фильтров в менеджере свойств слоёв .
Структура LayerFilterDisplayImages представляет информацию об изображениях, используемых для пользовательских фильтров в менеджере свойств слоёв .

Teigha.LayerManager.LayerFilterDisplayImages.#ctor(IntPtr,System.Int32,System.Int32)
Конструктор структуры LayerFilterDisplayImages. Создает экземпляр структуры с указанными параметрами.
Конструктор структуры LayerFilterDisplayImages. Создает экземпляр структуры с указанными параметрами.
imageListHandle: Дескриптор списка изображений. Тип IntPtr.
imageIndex: Индекс изображения.            Тип int.
selectedImageIndex: Индекс выбранного изображения. Тип int.

Teigha.LayerManager.LayerFilterDisplayImages.ImageIndex
Свойство ImageIndex представляет индекс обычного изображения в списке изображений.
Свойство ImageIndex представляет индекс обычного изображения в списке изображений.
Индексация элементов списка начинается с нуля.
Returns: Возвращает индекс изображения в списке.
Тип int.

Teigha.LayerManager.LayerFilterDisplayImages.ImageListHandle
Свойство ImageListHandle представляет дескриптор списка изображений, содержащего обычное и выбранное изображение.
Свойство ImageListHandle представляет дескриптор списка изображений, содержащего обычное и выбранное изображение.
Returns: Возвращает дескриптор списка изображений.
Тип IntPtr.

Teigha.LayerManager.LayerFilterDisplayImages.SelectedImageIndex
Свойство SelectedImageIndex представляет индекс выбранного изображения в списке изображений.
Свойство SelectedImageIndex представляет индекс выбранного изображения в списке изображений.
Индексация элементов списка начинается с нуля.
Returns: Возвращает индекс выбранного изображения.
Тип int.