HostMgd.EditorInput.Editor.PromptedForString
Событие возникает после завершения операции ввода строки пользователем в редакторе nanoCAD.
Событие не реализовано.
Событие инициируется платформой nanoCAD при завершении интерактивного ввода
текстовой строки — например, после вызова метода GetString() или других команд,
где требуется ввод текста. Оно предоставляет разработчикам доступ к результату ввода,
включая введённую строку (Value), статус выполнения (OK, Cancel, Error) и параметры команды.
Событие реализуется через делегат PromptStringResultEventHandler,
который передаёт данные в виде объекта PromptStringResultEventArgs.
Это позволяет реагировать на действия пользователя, обрабатывать ввод,
проверять допустимость значения или выполнять другие действия на основе введённой строки.
Example
C#