Teigha.BoundaryRepresentation.BrepFaceCollection.GetEnumerator
Метод предоставляет перечислитель данной коллекции.
Метод предоставляет перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции граней B-Rep.
Тип BrepFaceEnumerator.