Teigha.DatabaseServices.UpdateOption.IncludeXrefs
Значение: 0x2000000.  Выполняется обновление ссылок на данные во внешних ссылках xrefs. Используется в методе UpdateDataLink классов, где есть функционал связывания данных.