Teigha.Geometry.Curve3d.GetInterval
Метод позволяет определить параметрический интервал данной кривой.
Метод позволяет определить параметрический интервал данной кривой.
Метод Curve3d.EvaluatePoint(double) гарантированно возвращает точку на этой кривой при вызове со значением в пределах возвращаемого интервала.
Returns: Возвращает параметрический интервал данной кривой. Тип Interval.