Teigha.GraphicsSystem.PageParams
Класс PageParams представляет размеры и поля печатной страницы.
Класс PageParams представляет размеры и поля печатной страницы.
Notes
Все значения указываются в миллиметрах.

Teigha.GraphicsSystem.PageParams.#ctor
Конструктор по умолчанию класса PageParams.
Создает страницу с параметрами по умолчанию.
Конструктор по умолчанию класса PageParams.
Создает страницу с размерами по умолчанию (мм):
* Ширина = 210,
* Высота = 297,
* Левое поле = 0,
* Правое поле = 0,
* Верхнее поле = 0,
* Нижнее поле = 0.

Teigha.GraphicsSystem.PageParams.#ctor(Teigha.GraphicsSystem.PageParams)
Конструктор класса PageParams.
Создает копию указанного объекта PageParams.
Конструктор класса PageParams.
Создает экземпляр класса с параметрами, которые предоставляет указанный объект PageParams.
par: Объект, являющийся источником копируемых параметров страницы. Тип PageParams.

Teigha.GraphicsSystem.PageParams.scale(System.Double)
Метод выполняет масштабирование параметров страницы.
Метод изменяет масштаб параметров страницы согласно указанному коэффициенту масштаба dScale.
dScale: Коэффициент масштаба. Тип double.

Teigha.GraphicsSystem.PageParams.setParams(System.Double,System.Double)
Метод переопределяет высоту и ширину страницы.
Метод переопределяет высоту и ширину страницы.
dPaperWidth: Новое значение ширины страницы. Тип double.
dPaperHeight: Новое значение высоты страницы. Тип double.

Teigha.GraphicsSystem.PageParams.setParams(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Метод переопределяет размеры и поля страницы.
Метод переопределяет размеры и поля страницы.
dPaperWidth: Ширина страницы.       Тип double.
dPaperHeight: Высота страницы.       Тип double.
dLeftMargin: Левое поле страницы.   Тип double.
dRightMargin: Правое поле страницы.  Тип double.
dTopMargin: Верхнее поле страницы. Тип double.
dBottomMargin: Нижнее поле страницы.  Тип double.

Teigha.GraphicsSystem.PageParams.BottomMargin
Свойство BottomMargin возвращает величину нижнего поля страницы.
Свойство BottomMargin возвращает величину нижнего поля страницы.
Returns: Возвращает величину нижнего поля страницы.
Тип double.

Teigha.GraphicsSystem.PageParams.LeftMargin
Свойство LeftMargin возвращает величину левого поля страницы.
Свойство LeftMargin возвращает величину левого поля страницы.
Returns: Возвращает величину левого поля страницы.
Тип double.

Teigha.GraphicsSystem.PageParams.PaperHeight
Свойство PaperHeight возвращает высоту страницы.
Свойство PaperHeight возвращает высоту страницы.
Returns: Возвращает высоту страницы.
Тип double.

Teigha.GraphicsSystem.PageParams.PaperWidth
Свойство PaperWidth возвращает ширину страницы.
Свойство PaperWidth возвращает ширину страницы.
Returns: Возвращает ширину страницы. Тип double.

Teigha.GraphicsSystem.PageParams.RightMargin
Свойство RightMargin возвращает величину правого поля страницы.
Свойство RightMargin возвращает величину правого поля страницы.
Returns: Возвращает величину правого поля страницы.
Тип double.

Teigha.GraphicsSystem.PageParams.TopMargin
Свойство TopMargin возвращает величину верхнего поля страницы.
Свойство TopMargin возвращает величину верхнего поля страницы.
Returns: Возвращает величину верхнего поля страницы.
Тип double.