Teigha.DatabaseServices.UnitsConverter
Класс UnitsConverter реализует конвертер единиц измерения.
Класс UnitsConverter реализует конвертер единиц измерения.

Teigha.DatabaseServices.UnitsConverter.CanConvertFrom(ITypeDescriptorContext,Type)
Метод позволяет проверить, допустимо ли преобразование заданного объекта в указанном контексте.
Метод позволяет проверить, допустимо ли преобразование заданного объекта в указанном контексте.
context: Контекст преобразования. Тип ITypeDescriptorContext.
sourceType: Исходный тип. Тип Type.
Returns: Возвращает true, если преобразование объекта возможно.
В противном случае возвращает false.

Teigha.DatabaseServices.UnitsConverter.ConvertFrom(ITypeDescriptorContext,CultureInfo,Object)
Метод предоставляет объект, полученный в результате преобразования предоставленного объекта в указанном контексте с учетом языковых и региональных настроек.
Метод предоставляет объект, полученный в результате преобразования предоставленного объекта в указанном контексте с учетом языковых и региональных настроек.
context: Контекст преобразования. Тип ITypeDescriptorContext.
culture: Региональные и языковые настройки. Тип CultureInfo.
value: Входной объект для преобразования. Тип Object.
Returns: Возвращает результат преобразования. Тип Object.

Teigha.DatabaseServices.UnitsConverter.ConvertTo(ITypeDescriptorContext,CultureInfo,Object,Type)
Метод преобразует заданный объект к указанному типу в указанном контексте с учетом заданных языковых и региональных настроек.
Метод преобразует заданный объект к указанному типу в указанном контексте с учетом заданных языковых и региональных настроек.
context: Контекст преобразования. Тип ITypeDescriptorContext.
culture: Региональные и языковые настройки. Тип CultureInfo.
value: Входной объект для преобразования. Тип Object.
destinationType: Целевой тип. Тип Type.
Returns: Возвращает результат преобразования.
Тип Object.

Teigha.DatabaseServices.UnitsConverter.GetConversionFactor(Teigha.DatabaseServices.UnitsValue,Teigha.DatabaseServices.UnitsValue)
Метод позволяет вычислить коэффициент преобразования между единицами измерения блока и единицами текущего чертежа.
Метод позволяет вычислить коэффициент преобразования между единицами измерения блока и единицами текущего чертежа.
from: Исходные единицы измерения. Перечисление UnitsValue.
to: Целевые единицы измерения. Перечисление UnitsValue.
Returns: Возвращает коэффициент преобразования между заданными единицами измерения.
Тип double.