Teigha.Geometry.Matrix3d.IsUniscaledOrtho
Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу.
Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу.
Реализация метода использует вызов Matrix3d.IsUniscaledOrtho(Tolerance tolerance) с точностью, равной Tolerance.Global.
Returns: Возвращает true, если векторы-столбцы линейной части данной матрицы перпендикулярны друг другу и одинаковы по длине. В противном случае возвращает false.