Teigha.Geometry.ClipBoundary2dData
Структура ClipBoundary2dData представляет данные, используемые классом ClipBoundary2d.
Структура ClipBoundary2dData представляет данные, используемые классом ClipBoundary2d.

Teigha.Geometry.ClipBoundary2dData.Equals(Object)
Метод предназначен для проверки на равенство данного и переданного в метод объектов.
Метод предназначен для проверки на равенство данного и переданного в метод объектов.
Два объекта ClipBoundary2dData считаются равными, если одновременно выполняются следующие условия:
1. Совпадают обрезанные вершины;
2. Совпадают исходные метки обрезанных сегментов;
3. Совпадают условия обрезки.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, с которым проверяется равенство. Тип Object.
Returns: Возвращает true, если оба сравниваемых объекта не являются нулевыми и выполняются условия равенства объектов ClipBoundary2dData (см. выше). В противном случае возвращает false.

Teigha.Geometry.ClipBoundary2dData.IsEqualTo(Teigha.Geometry.ClipBoundary2dData)
Метод предназначен для проверки данного объекта на равенство другому объекту ClipBoundary2dData.
Метод предназначен для проверки данного объекта на равенство другому объекту ClipBoundary2dData.
a: Входной объект, с которым проверяется равенство.  Тип ClipBoundary2dData.
Returns: Возвращает true, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Совпадают обрезанные вершины;
2. Совпадают исходные метки обрезанных сегментов;
3. Совпадают условия обрезки.
В противном случае возвращает false.

Teigha.Geometry.ClipBoundary2dData.!=(Teigha.Geometry.ClipBoundary2dData,Teigha.Geometry.ClipBoundary2dData)
Оператор неравенства структуры ClipBoundary2dData.
Оператор неравенства структуры ClipBoundary2dData.
a: Левый  операнд. Тип ClipBoundary2dData.
b: Правый операнд. Тип ClipBoundary2dData.
Returns: Возвращает true, если не выполняется хотя бы одно из следующих условий:
1. Совпадают обрезанные вершины;
2. Совпадают исходные метки обрезанных сегментов;
3. Совпадают условия обрезки.
В противном случае возвращает false.

Teigha.Geometry.ClipBoundary2dData.==(Teigha.Geometry.ClipBoundary2dData,Teigha.Geometry.ClipBoundary2dData)
Оператор равенства структуры ClipBoundary2dData.
Оператор равенства структуры ClipBoundary2dData.
a: Левый  операнд. Тип ClipBoundary2dData.
b: Правый операнд. Тип ClipBoundary2dData.
Returns: Возвращает true, если одновременно выполняются все представленные ниже условия:
1. Совпадают обрезанные вершины;
2. Совпадают исходные метки обрезанных сегментов;
3. Совпадают условия обрезки.
В противном случае возвращает false.

Teigha.Geometry.ClipBoundary2dData.ClipCondition
Свойство ClipCondition представляет условие обрезки.
Свойство ClipCondition представляет условие обрезки.
Returns: Возвращает условие обрезки. Тип ClipCondition.

Teigha.Geometry.ClipBoundary2dData.ClippedSegmentSourceLabel
Свойство ClippedSegmentSourceLabel представляет исходную метку обрезанного сегмента.
Свойство ClippedSegmentSourceLabel представляет исходную метку обрезанного сегмента.
Returns: Возвращает исходную метку обрезанного сегмента.
Тип IntegerCollection.

Teigha.Geometry.ClipBoundary2dData.ClippedVertices
Свойство ClippedVertices представляет массив обрезанных вершин.
Свойство ClippedVertices представляет массив обрезанных вершин.
Returns: Возвращает массив обрезанных вершин.
Тип Point2dCollection.