Teigha.DatabaseServices.Intersect.ExtendThis
Значение: 1.
При вычислении пересечения продлеваются ребра граничной рамки данного объекта, если это необходимо.
Граничная рамка второго объекта (передается как аргумент) остаётся без изменений.