HostMgd.PlottingServices.SheetCancelStatus
Данное перечисление определяет состояния отмены печати листа в сценарии вывода на печать чертежа на одном листе.
Перечисление SheetCancelStatus определяет состояния отмены печати листа в сценарии вывода на печать чертежа на одном листе.