Teigha.Geometry.Matrix3d.Inverse
Метод позволяет получить матрицу, обратную по отношению к данной матрице.
Метод позволяет получить матрицу, обратную по отношению к данной матрице.
Returns: Возвращает обратную матрицу. Тип Matrix3d.