Teigha.DatabaseServices.GripDataCollection
Класс GripDataCollection представляет коллекцию объектов GripData.
Класс GripDataCollection представляет коллекцию объектов GripData.

Teigha.DatabaseServices.GripDataCollection.#ctor
Конструктор по умолчанию класса GripDataCollection.
Конструктор по умолчанию класса GripDataCollection.

Teigha.DatabaseServices.GripDataCollection.Add(Teigha.DatabaseServices.GripData)
Метод добавляет в коллекцию объект GripData.
Метод добавляет в коллекцию указанный объект GripData.
gripData: Входной объект, который требуется добавить в данную коллекцию. Тип GripData.

Teigha.DatabaseServices.GripDataCollection.Contains(Teigha.DatabaseServices.GripData)
Метод позволяет проверить, содержит ли эта коллекция объект, соответствующий указанному объекту GripData.
Метод позволяет проверить, содержит ли эта коллекция объект, соответствующий указанному объекту GripData.
gripData: Входной проверяемый объект. Тип GripData.
Returns: Возвращает true, если объект gripData уже содержится в коллекции.
В противном случае возвращает false.

Teigha.DatabaseServices.GripDataCollection.CopyTo(array,System.Int32)
Метод копирует все элементы коллекции в указанный массив, начиная с позиции в массиве с указанным индексом.
Метод копирует все элементы коллекции в указанный массив, начиная с позиции в массиве с указанным индексом.
A_0: Массив, в который копируется эта коллекция. Тип GripData[].
A_1: Индекс позиции в массиве, начиная с которой в массиве последовательно сохраняются все элементы коллекции. Тип int.

Teigha.DatabaseServices.GripDataCollection.Remove(Teigha.DatabaseServices.GripData)
Метод удаляет из коллекции элемент, соответствующий указанному объекту GripData.
Метод удаляет из коллекции элемент, соответствующий указанному объекту GripData.
gripData: Удаляемый из коллекции объект. Тип GripData.
Returns: Возвращает true, если удаление из коллекции объекта gripData завершилось успешно.
В противном случае возвращает false.

Teigha.DatabaseServices.GripDataCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет текущее количество элементов в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.DatabaseServices.GripDataCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, что коллекция доступна только на чтение.
Свойство IsReadOnly позволяет проверить, доступна ли коллекция только на чтение.
Returns: Возвращает true, если коллекция доступна только на чтение.
В противном случае возвращает false.

Teigha.DatabaseServices.GripDataCollection.Item
Свойство Item предоставляет элемент коллекции с указанным индексом.
Свойство Item предоставляет элемент коллекции с указанным индексом.
A_0: Индекс искомого элемента коллекции. Тип int. Должен удовлетворять множеству допустимых значений.
Returns: Возвращает элемент коллекции с индексом A_0.
Тип GripData.