Teigha.DatabaseServices.LayerStateEventArgs
Класс LayerStateEventArgs представляет данные для события LayerState.
Класс LayerStateEventArgs представляет данные для события LayerState.

Teigha.DatabaseServices.LayerStateEventArgs.Id
Свойство Id представляет идентификатор объекта слоя.
Свойство Id представляет идентификатор объекта слоя.
Returns: Возвращает идентификатор объекта слоя.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LayerStateEventArgs.Name
Свойство Name представляет имя слоя.
Свойство Name представляет имя слоя.
Returns: Возвращает имя слоя.
Тип String.