Teigha.DatabaseServices.CellContentsCollection.Add
Метод добавляет в коллекцию дополнительное содержимое с недействительными индексами.
Метод добавляет в коллекцию дополнительное содержимое с недействительными индексами.