Teigha.DatabaseServices.Layout.Initialize
Этот метод выполняет закулисную работу по созданию видового экрана для листа.
Это позволяет настроить лист и подготовить его для создания в нем других видовых экранов и объектов, а также задать различные свойства листа.
Этот метод выполняет закулисную работу по созданию видового экрана для листа.
Это позволяет настроить лист и подготовить его для создания в нем других видовых экранов и объектов, а также задать различные свойства листа.
Возвращает ObjectId видового экрана пространства листа, созданного этим методом.
Returns: Возвращает ObjectId созданного видового экрана в пространстве листа.