Teigha.Geometry.LineSegment2d
Класс LineSegment2d представляет линейные сегменты в двумерном пространстве.
Класс LineSegment2d представляет линейные сегменты (прямолинейные отрезки) в двумерном пространстве.

Teigha.Geometry.LineSegment2d.#ctor
Конструктор по умолчанию класса LineSegment2d.
Конструктор по умолчанию класса LineSegment2d.
Строит линейный сегмент с концами в точках (0,0) и (1,0).

Teigha.Geometry.LineSegment2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса LineSegment2d.
Строит линейный сегмент с концами в указанных точках.
Конструктор класса LineSegment2d.
Строит линейный сегмент с концами в точках point1 и point2.
point1: Первая входная точка (начальная). Тип Point2d.
point2: Вторая входная точка (конечная).  Тип Point2d.

Teigha.Geometry.LineSegment2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Конструктор класса LineSegment2d.
Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
Конструктор класса LineSegment2d.
Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
point1: Начальная точка линейного сегмента. Тип Point2d.
vector: Направляющий вектор линейного сегмента. Тип Vector2d. Определяет как направление, так и конечную точку линейного сегмента. Не может быть нулевой длины.

Teigha.Geometry.LineSegment2d.BaryComb(System.Double)
Метод вычисляет позицию точки на коллинеарной сегменту прямой, которая определяется средневзвешенным значением координат начальной и конечной точек данного сегмента в зависимости от указанного значения весового коэффициента.
Метод вычисляет позицию точки на коллинеарной сегменту прямой, которая определяется средневзвешенным значением координат начальной и конечной точек данного сегмента в зависимости от значения коэффициента blendCoefficient.
blendCoefficient: Коэффициент, определяющий положение средневзвешенной точки.
Returns: Возвращает средневзвешенную точку.  Тип Point2d.
Возможны следующие варианты положения этой точки.
blendCoefficient     Возвращаемая позиция
-----------------------     -----------------------------
0                           Начальная точка.
1                           Конечная точка.
0.5                         Середина линейного сегмента.
0 - 1                       Промежуточная точка на этом сегменте.
1                 Точка лежит вне сегмента, но на коллинеарной ему бесконечной прямой.

Teigha.Geometry.LineSegment2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип LineSegment2d.

Teigha.Geometry.LineSegment2d.GetSegmentLength(System.Double,System.Double)
Метод позволяет вычислить длину параметрически заданного отрезка на данном сегменте.
Метод позволяет вычислить длину отрезка на данном сегменте, концы которого определены указанными значениями параметра.
Используется вызов метода LineSegment2d.GetSegmentLength(Double fromParameter, Double toParameter, Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
fromParameter: Значение параметра для начальной точки отрезка. Тип double.
toParameter: Значение параметра для конечной  точки отрезка. Тип double.
Returns: Возвращает длину отрезка между указанными точками.
Тип double.

Teigha.Geometry.LineSegment2d.GetSegmentLength(System.Double,System.Double,Teigha.Geometry.Tolerance)
Метод позволяет с указанной точностью вычислить длину параметрически заданного отрезка на данном сегменте.
Метод позволяет вычислить длину отрезка на данном сегменте, концы которого определены указанными значениями параметра.
Вычисления выполняются с указанной геометрической точностью.
fromParameter: Значение параметра для начальной точки отрезка. Тип double.
toParameter: Значение параметра для конечной  точки отрезка. Тип double.
tolerance: Входное значение геометрической точности.       Тип Tolerance.
Returns: Возвращает длину отрезка между указанными точками.
Тип double.

Teigha.Geometry.LineSegment2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод позволяет переопределить начальную и конечную точки данного линейного сегмента.
Метод позволяет переопределить начальную и конечную точки данного линейного сегмента.
point1: Новая начальная точка. Тип Point2d.
point2: Новая конечная  точка. Тип Point2d.

Teigha.Geometry.LineSegment2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
point: Новая начальная точка. Тип Point2d.
vector: Новый направляющий вектор. Тип Vector2d. Определяет направление линейного сегмента и его конечную точку.

Teigha.Geometry.LineSegment2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Point2d,System.Double)
Метод позволяет переопределить данный объект таким образом, чтобы линейный сегмент оказался касательным к указанной кривой и проходил через заданную точку.
Метод позволяет переопределить данный объект таким образом, чтобы линейный сегмент оказался касательным к кривой curve и проходил через заданную точку point.
Входное значение параметра parameter для кривой curve используется в качестве первоначального приближения при вычислении точки касания.
curve: Входная кривая, касательность к которой требуется обеспечить. Тип Curve2d.
point: Входная точка, через которую должен проходить линейный сегмент. Тип Point2d.
parameter: Входное значение параметра точки на кривой curve, в которой кривая касается линейного сегмента.  Тип double.

Teigha.Geometry.LineSegment2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,System.Double,System.Double)
Метод позволяет переопределить данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым.
Метод позволяет переопределить данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым.
Входные значения параметров parameter1 для кривой curve1 и parameter2 для кривой curve2 используются в качестве первоначальных приближений при вычислении точек касания.
curve1: Первая входная кривая, касательность к которой требуется обеспечить. Тип Curve2d.
curve2: Вторая входная кривая, касательность к которой требуется обеспечить. Тип Curve2d.
parameter1: Значение параметра точки на кривой curve1, в которой кривая касается линейного сегмента. Тип double.
parameter2: Значение параметра точки на кривой curve2, в которой кривая касается линейного сегмента. Тип double.

Teigha.Geometry.LineSegment2d.EndPoint
Свойство EndPoint представляет конечную точку данного линейного сегмента.
Свойство EndPoint представляет конечную точку данного линейного сегмента.
Returns: Возвращает конечную точку линейного сегмента.
Тип Point2d.

Teigha.Geometry.LineSegment2d.Length
Свойство Length представляет длину данного линейного сегмента.
Свойство Length представляет длину данного линейного сегмента (расстояние между его начальной и конечной точками).
Returns: Возвращает длину линейного сегмента.
Тип double.

Teigha.Geometry.LineSegment2d.MidPoint
Свойство MidPoint представляет среднюю точку данного линейного сегмента.
Свойство MidPoint представляет среднюю точку данного линейного сегмента.
Returns: Возвращает среднюю точку линейного сегмента.
Тип Point2d.

Teigha.Geometry.LineSegment2d.StartPoint
Свойство StartPoint представляет начальную точку данного линейного сегмента.
Свойство StartPoint представляет начальную точку данного линейного сегмента.
Returns: Возвращает начальную точку линейного сегмента.
Тип Point2d.