Teigha.GraphicsInterface.IlluminationModel
Данное перечисление определяет вариант модели освещения, которая используется в расширенном процессе рендеринга при работе с материалами.
Данное перечисление определяет вариант модели освещения, которая используется в расширенном процессе рендеринга при работе с материалами.