Teigha.Geometry.Matrix2d.ToArray
Метод позволяет получить данную матрицу в виде массива из девяти элементов.
Запись элементов матрицы в массив выполняется построчно.
Метод позволяет получить данную матрицу в виде массива из девяти элементов.
Запись элементов матрицы в массив выполняется построчно (data11, data12 ... data33).
Returns: Возвращает массив из девяти элементов, в котором построчно сохранены элементы матрицы.
Тип double[].