Teigha.DatabaseServices.CellContentsCollection
Класс CellContentsCollection представляет коллекцию объектов содержимого ячейки таблицы.
Класс CellContentsCollection представляет коллекцию объектов содержимого ячейки таблицы CellContent.

Teigha.DatabaseServices.CellContentsCollection.InsertAt(System.Int32)
Метод вставляет в коллекцию дополнительное содержимое для ячейки по указанному индексу.
Метод вставляет в коллекцию дополнительное содержимое для ячейки по указанному индексу.
index: Индекс, под которым создается дополнительный контент для ячейки.

Teigha.DatabaseServices.CellContentsCollection.Move(System.Int32,System.Int32)
Метод перемещает указанный по индексу элемент коллекции в позицию с другим индексом.
Метод позволяет переместить элемент коллекции с индексом fromIndex в позицию с индексом toIndex.
fromIndex: Исходный индекс элемента коллекции. Тип int.
toIndex: Новый индекс элемента коллекции. Тип int.

Teigha.DatabaseServices.CellContentsCollection.RemoveAt(System.Int32)
Метод удаляет элемент коллекции с указанным индексом.
Метод удаляет элемент коллекции с указанным индексом.
Notes
Если переданный в метод индекс оказывается недействительным, выбрасывается исключение ArgumentOutOfRangeException.
index: Индекс удаляемого элемента коллекции. Тип int.

Teigha.DatabaseServices.CellContentsCollection.Count
Свойство Count представляет фактическое количество элементов в данной коллекции.
Свойство Count представляет фактическое количество элементов в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.DatabaseServices.CellContentsCollection.Item
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Notes
Если значение аргумента val окажется недействительным, выбрасывается исключение ArgumentOutOfRangeException.
val: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип CellContent.