Teigha.Geometry.Point2d.GetHashCode
Метод позволяет получить хеш-код для данного объекта.
Метод позволяет получить хеш-код для данного объекта.
Returns: Возвращает хеш-код в виде целочисленного значения, которое уникально для каждого экземпляра этого класса. Тип int.