Teigha.BoundaryRepresentation.FaceLoopEnumerator
Класс FaceLoopEnumerator представляет перечислитель циклов грани BREP.
Класс FaceLoopEnumerator представляет перечислитель циклов грани BREP.

Teigha.BoundaryRepresentation.FaceLoopEnumerator.Current
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает цикл грани, являющийся текущим элементом данного перечислителя.
Тип BoundaryLoop.