Teigha.GraphicsInterface.GdiDrawObject
Класс GdiDrawObject реализует интерфейс, который позволяет объекту-владельцу GDI использовать новый OwnerDraw().
Класс GdiDrawObject реализует интерфейс, который позволяет объекту-владельцу GDI использовать новый OwnerDraw().

Teigha.GraphicsInterface.GdiDrawObject.Draw(IntPtr,System.Drawing.Rectangle)
Метод выполняет отрисовку объекта, который отображается объектом-владельцем GDI, в указанных прямоугольных границах, используя предоставленный контекст устройства.
Метод выполняет отрисовку объекта, который отображается объектом-владельцем GDI, в указанных прямоугольных границах, используя предоставленный контекст устройства.
Текущее преобразование модели не применяется к линии.
hDC: Дескриптор контекста устройства. Тип IntPtr.
bounds: Прямоугольные границы, в которых отображается требуемый объект. Тип System.Drawing.Rectangle.
Returns: Возвращает true, если отрисовка объекта выполнена успешно.
В противном случае возвращает false.

Teigha.GraphicsInterface.GdiDrawObject.Height
Свойство Height представляет доступ к исходной высоте (в пикселях) объекта, который отображается объектом-владельцем GDI.
Свойство Height представляет доступ к исходной высоте (в пикселях) объекта, который отображается объектом-владельцем GDI.
Returns: Возвращает исходную высоту отображаемого объекта в пикселях.
Тип int.

Teigha.GraphicsInterface.GdiDrawObject.Width
Свойство Width представляет доступ к исходной ширине (в пикселях) объекта, который отображается объектом-владельцем GDI.
Свойство Width представляет доступ к исходной ширине (в пикселях) объекта, который отображается объектом-владельцем GDI.
Returns: Возвращает исходную ширину отображаемого объекта в пикселях.
Тип int.