Teigha.DatabaseServices.AssocDependency.DetachFromObject
Метод позволяет открепить данную зависимость от объекта DBObject, к которому она в данный момент прикреплена.
Метод позволяет открепить данную зависимость от объекта DBObject, к которому она в данный момент прикреплена.
Зависимость удаляется из списка постоянных реакторов объекта.
Если этот объект является составным, зависимость удаляется из списков постоянных реакторов всех составляющих объектов, к которым она в данный момент прикреплена.