Teigha.DatabaseServices.DxfFiler.ReadHandle
Метод возвращает дескриптор Handle из текущего элемента этого объекта Filer.
Метод возвращает дескриптор Handle из текущего элемента этого объекта Filer.
Returns: Возвращает дескриптор объекта. Тип Handle.