Teigha.DatabaseServices.XrefPreXrefLockFileEventArgs
Класс XrefPreXrefLockFileEventArgs представляет данные для события XrefPreXrefLockFile в базе данных.
Класс XrefPreXrefLockFileEventArgs представляет данные для события XrefPreXrefLockFile в базе данных.

Teigha.DatabaseServices.XrefPreXrefLockFileEventArgs.btrId
Свойство btrId представляет идентификатор объекта записи таблицы блоков.
Свойство btrId представляет идентификатор объекта записи таблицы блоков.
Returns: Возвращает идентификатор объекта записи таблицы блоков.
Тип ObjectId.