HostMgd.EditorInput.PickPointKind
Перечисление, определяющее возможные виды базовых точек.
Члены перечисления   Описание
-------------------  ----------------------
InfiniteLine         Базовая точка линии
Ray                  Базовая точка луча
LineSegment          Базовая точка отрезка