Teigha.Geometry.ExternalBoundedSurface.SetToOwnSurface
Метод делает этот объект владельцем данных своего определения.
Метод делает этот объект владельцем данных своего определения.
Если текущий экземпляр уже является владельцем этих данных, метод не делает ничего.
В противном случае метод создает копию данных определения поверхности перед тем, как сделать данный объект владельцем этой геометрии.
Notes
Данные, которыми владеет внешняя поверхность, удаляются при уничтожении внешней поверхности.