Teigha.DatabaseServices.SymbolTable
Класс является базовым для всех таблиц базы данных чертежа.
Класс SymbolTable является базовым классом для всех классов,
используемых для экспорта встроенных таблиц символов nanoCAD.

Teigha.DatabaseServices.SymbolTable.SkipDeleted
Возвращает очищенные записи таблицы символов в добавление ко
всем присутствующим в данный момент записям таблицы.

Teigha.DatabaseServices.SymbolTable.Add(Teigha.DatabaseServices.SymbolTableRecord)
Этот метод добавляет запись value и в базу данных, содержащую
таблицу, и в саму эту таблицу.
value: Входная запись для добавления в таблицу

Teigha.DatabaseServices.SymbolTable.Has(DatabaseServices.ObjectId)
Метод возвращает true, если таблица содержит запись с
ObjectId, соответствующим Id. В противном случае он
возвращает false.
id: Id записи для поиска

Teigha.DatabaseServices.SymbolTable.Has(String)
Этот метод возвращает true, если таблица содержит запись с
именем, соответствующим key. Если соответствие не найдено, то
метод возвращает false.
key: Имя записи для поиска