Teigha.GraphicsSystem.Device
Класс Device реализует устройство как абстрактное представление окна графического интерфейса, в котором отображается чертеж.
Класс Device реализует устройство как абстрактное представление окна графического интерфейса (GUI), в котором отображается чертеж.  Кроме того, класс реагирует на уведомления операционной системы, такие как изменение размера окна, которые пересылаются клиентом графической системы.

Teigha.GraphicsSystem.Device.#ctor
Конструктор по умолчанию класса Device.
Конструктор по умолчанию класса Device.
Создает графическое устройство на основе внутреннего указателя на обернутый объект C++.

Teigha.GraphicsSystem.Device.Add(Teigha.GraphicsSystem.View)
Метод позволяет добавить графический вид для отображения чертежа на устройстве.
Метод позволяет добавить графический вид для отображения чертежа на устройстве.
pView: Добавляемый вид, который связывается с данным устройством.

Teigha.GraphicsSystem.Device.CreateView(Teigha.GraphicsSystem.ClientViewInfo)
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
pViewInfo: Информация о клиентском виде, на основе которого создается вид.
Returns: Возвращает дескриптор созданного вида.
Тип View.

Teigha.GraphicsSystem.Device.CreateView(Teigha.GraphicsSystem.ClientViewInfo,System.Boolean)
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
Дополнительно метод позволяет включить поддержку видимости слоев индивидуально в каждом видовом экране.
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
Дополнительно метод позволяет включить поддержку видимости слоев индивидуально в каждом видовом экране.
pViewInfo: Информация о клиентском виде, на основе которого создается вид. Тип ClientViewInfo.
enableLayerVisibilityPerView: Флаг включения поддержки видимости слоев индивидуально для каждого видового экрана. Тип bool.
Returns: Возвращает дескриптор созданного вида.
Тип View.

Teigha.GraphicsSystem.Device.Erase(System.Int32)
Метод предназначен для удаления вида с указанным индексом.
Метод предназначен для удаления вида с указанным индексом.
viewIndex: Индекс удаляемого вида.
Returns: Возвращает true, если удаление вида завершилось успешно.
В противном случае возвращает false.

Teigha.GraphicsSystem.Device.Erase(Teigha.GraphicsSystem.View)
Метод предназначен для удаления указанного вида.
Метод предназначен для удаления указанного вида.
pView: Удаляемый вид. Тип View.
Returns: Возвращает true, если удаление вида завершилось успешно.
В противном случае возвращает false.

Teigha.GraphicsSystem.Device.GetSnapshot(System.Drawing.Rectangle)
Метод позволяет получить снимок текущего состояния графики данного устройства.
Метод позволяет получить снимок текущего состояния графики данного устройства.
rectangle: Область снимка на устройстве. Тип System.Drawing.Rectangle.
Returns: Возвращает снимок состояния графики в формате System.Drawing.Bitmap.

Teigha.GraphicsSystem.Device.InsertView(System.Int32,Teigha.GraphicsSystem.View)
Метод позволяет вставить указанный вид в заданную индексом позицию на этом устройстве.
Метод позволяет вставить указанный вид в заданную индексом позицию на этом устройстве.
viewIndex: Индекс вида на устройстве.    Тип int.
pView: Вставляемый в устройство вид. Тип View.

Teigha.GraphicsSystem.Device.Invalidate(System.Drawing.Rectangle)
Метод предназначен для уведомления о том, что указанная область экрана стала недействительной и требует обновления.
Метод предназначен для уведомления о том, что указанная область экрана стала недействительной и требует обновления.
screenRect: Границы области. Тип System.Drawing.Rectangle.

Teigha.GraphicsSystem.Device.OnDisplayChange(System.Int32,System.Int32,System.Int32)
Метод заставляет данное устройство принимать новое разрешение экрана и глубину цвета всякий раз, когда операционная система меняет эти параметры.
Метод заставляет данное устройство принимать новое разрешение экрана и глубину цвета всякий раз, когда операционная система меняет эти параметры.
bitsPerPixel: Новая глубина цвета в битах на пиксель. Тип int.
xPixels: Разрешение по оси X. Тип int.
yPixels: Разрешение по оси Y. Тип int.

Teigha.GraphicsSystem.Device.OnSize(DatabaseServices.Extents2d)
Метод позволяет сообщить устройству новые размеры, используя объект DatabaseServices.Extents2d.
Этот метод следует вызывать при каждом изменении размеров устройства.
Метод позволяет сообщить устройству новые размеры, используя объект DatabaseServices.Extents2d.
Этот метод следует вызывать при каждом изменении размеров устройства.
outputRect: Новые размеры устройства. Тип DatabaseServices.Extents2d.

Teigha.GraphicsSystem.Device.OnSize(System.Drawing.Rectangle)
Метод позволяет сообщить устройству новые размеры, используя объект System.Drawing.Rectangle.
Этот метод следует вызывать при каждом изменении размеров устройства.
Метод позволяет сообщить устройству новые размеры, используя объект System.Drawing.Rectangle.
Этот метод следует вызывать при каждом изменении размеров устройства.
outputRect: Прямоугольник, который задает новые размеры устройства.

Teigha.GraphicsSystem.Device.OnSize(System.Drawing.Size)
Метод позволяет сообщить устройству новые размеры, используя объект System.Drawing.Size.
Этот метод следует вызывать при каждом изменении размеров устройства.
Метод позволяет сообщить устройству новые размеры, используя объект System.Drawing.Size.
Этот метод следует вызывать при каждом изменении размеров устройства.
size: Новые размеры устройства. Тип System.Drawing.Size.

Teigha.GraphicsSystem.Device.SetLogicalPalette(array)
Метод предоставляет возможность задать на данном устройстве логическую цветовую палитру.
В дальнейшем эта палитра позволит использовать индексированные цвета.
Метод предоставляет возможность задать на данном устройстве логическую цветовую палитру.
В дальнейшем эта палитра позволит использовать индексированные цвета.
logicalPalette: Логическая цветовая палитра. Тип array.

Teigha.GraphicsSystem.Device.Update(System.Drawing.Rectangle)
Метод позволяет направить всем принадлежащим видам требование обновить указанную область с целью актуализировать текущее изображение.
Метод позволяет направить всем принадлежащим видам требование обновить указанную область с целью актуализировать текущее изображение.
pUpdatedRect: Область экрана для обновления. Тип System.Drawing.Rectangle.

Teigha.GraphicsSystem.Device.ViewAt(System.Int32)
Метод позволяет получить вид по его индексу.
Метод позволяет получить вид по его индексу.
viewIndex: Входной индекс вида. Тип int.
Returns: Возвращает Дескриптор искомого вида. Тип View.

Teigha.GraphicsSystem.Device.BackgroundColor
Свойство BackgroundColor представляет цвет фона в окне графического интерфейса данного устройства.
Свойство BackgroundColor представляет цвет фона в окне графического интерфейса данного устройства.
Returns: Возвращает цвет фона в окне GUI.  Тип System.Drawing.Color.

Teigha.GraphicsSystem.Device.DarkPalette
Свойство DarkPalette представляет палитру темных фоновых цветов, которая используется данным устройством.
Свойство DarkPalette представляет палитру темных фоновых цветов, которая используется данным устройством.
Returns: Возвращает массив цветов палитры.
Тип System.Drawing.Color[].

Teigha.GraphicsSystem.Device.IsValid
Свойство IsValid позволяет определить, корректное ли изображение отображается в окне графического интерфейса данного устройства.
Свойство IsValid позволяет определить, корректное ли изображение отображается в окне графического интерфейса данного устройства.
Returns: Возвращает true, если изображение является корректным.
В противном случае возвращает false.

Teigha.GraphicsSystem.Device.LightPalette
Свойство LightPalette представляет палитру светлых фоновых цветов, которая используется данным устройством.
Свойство LightPalette представляет палитру светлых фоновых цветов, которая используется данным устройством.
Returns: Возвращает массив цветов палитры. Тип System.Drawing.Color[].

Teigha.GraphicsSystem.Device.LogicalPalette
Свойство LogicalPalette представляет логическую палитру, которая будет использоваться данным устройством.
Свойство LogicalPalette представляет логическую палитру, которая будет использоваться данным устройством.
Returns: Возвращает Массив цветов палитры. Тип System.Drawing.Color[].

Teigha.GraphicsSystem.Device.NumViews
Свойство NumViews представляет количество видов, связанных с данным устройством.
Свойство NumViews представляет количество видов, связанных с данным устройством.
Returns: Возвращает количество видов на устройстве. Тип int.

Teigha.GraphicsSystem.Device.Properties
Свойство Properties представляет набор свойств данного устройства, хранимых в виде словаря.
Свойство Properties представляет набор свойств данного устройства, хранимых в виде словаря.
Returns: Возвращает словарь со свойствами устройства. Тип Teigha.Runtime.Dictionary.

Teigha.GraphicsSystem.Device.UserGiContext
Свойство UserGiContext представляет пользовательский контекст для графического интерфейса.
Свойство UserGiContext представляет пользовательский контекст для графического интерфейса.
Returns: Возвращает пользовательский контекст для графического интерфейса.
Тип GraphicsInterface.Context.