Teigha.Runtime.Interop
Класс Interop предоставляет средства для обеспечения взаимодействия управляемых и неуправляемых типов данных.
Класс Interop предоставляет средства для обеспечения взаимодействия управляемых и неуправляемых типов данных.

Teigha.Runtime.Interop.AttachUnmanagedObject(Teigha.Runtime.DisposableWrapper,IntPtr,System.Boolean)
Метод позволяет прикрепить обертку к совместимому с ней неуправляемому ресурсу.
Метод позволяет прикрепить обертку к неуправляемому ресурсу.
Обертка должна быть совместима с неуправляемым ресурсом.
obj: Входная обертка. Тип DisposableWrapper.
unmanagedPointer: Входной неуправляемый ресурс. Тип IntPtr.
autoDelete: Входной флаг, определяющий, является ли объект обертки владельцем базового неуправляемого ресурса. Тип bool. В случае значения true ресурс будет удаляться методом Dispose() автоматически.

Teigha.Runtime.Interop.Check(System.Int32)
Метод проверяет статус ошибки по её номеру в перечислении Teigha.Runtime.ErrorStatus с последующей генерацией найденного исключения.
Метод проверяет статус ошибки по её номеру в перечислении Teigha.Runtime.ErrorStatus.
Если значение параметра returnValue не равно Teigha.Runtime.ErrorStatus.OK, метод выбрасывает исключение, соответствующее номеру ошибки в перечислении Teigha.Runtime.ErrorStatus с указанием статуса ошибки. Если ошибка с номером returnValue в перечислении отсутствует, метод завершает работу без результата.
returnValue: Входное значение. Тип int.

Teigha.Runtime.Interop.CheckAds(System.Int32)
Метод проверяет переданный аргумент на равенство значению HostMgd.EditorInput.PromptStatus.OK.
Метод проверяет переданное значение параметра returnValue на равенство значению HostMgd.EditorInput.PromptStatus.OK (5100).
Если равенства нет, то метод выбрасывает исключение Teigha.Runtime.ErrorStatus.InvalidInput.
returnValue: Входное значение. Тип int.

Teigha.Runtime.Interop.CheckAdsForCancel(System.Int32)
Метод проверяет значение параметра returnValue на равенство значениям HostMgd.EditorInput.PromptStatus.OK (5100), HostMgd.EditorInput.PromptStatus.None (5000) и HostMgd.EditorInput.PromptStatus.Cancel (-5002).
Метод проверяет значение параметра returnValue на равенство значениям HostMgd.EditorInput.PromptStatus.OK (5100), HostMgd.EditorInput.PromptStatus.None (5000) и HostMgd.EditorInput.PromptStatus.Cancel (-5002).
returnValue: Входное значение. Тип int.
Returns: Метод вернет false, если параметр равен HostMgd.EditorInput.PromptStatus.Cancel.
Если параметр не равен HostMgd.EditorInput.PromptStatus.OK или HostMgd.EditorInput.PromptStatus.None, метод выбросит исключение Teigha.Runtime.ErrorStatus.InvalidInput.
Во всех остальных случаях метод возвращает true.

Teigha.Runtime.Interop.CheckBool(System.Boolean)
Метод проверяет переданное логическое значение.
Метод выбрасывает исключение System.InvalidOperationException, если аргумент returnValue имеет значение false.
returnValue: Входное логическое значение. Тип bool.

Teigha.Runtime.Interop.CheckBoolean(System.Int32)
Метод реализует проверку входного значения типа BOOLEAN.
Метод реализует проверку входного значения BOOLEAN, переданного как тип int.
Если аргумент returnValue принимает значение 0 и, соответственно, оценивается как false, метод выбрасывает исключение System.InvalidOperationException.
В противном случае метод не делает ничего.
returnValue: Входное значение. Тип int.

Teigha.Runtime.Interop.CheckCPPErrName(System.Int32)
Метод проверяет статус ошибки по её номеру в перечислении Teigha.Runtime.ErrorStatus с последующим выборосом найденного исключения и сообщения, соответствующего исключению.
Метод проверяет статус ошибки по её номеру в перечислении Teigha.Runtime.ErrorStatus с последующим выборосом найденного исключения и сообщения, соответствующего исключению.
Если значение параметра returnValue не равно Teigha.Runtime.ErrorStatus.OK,  метод выбрасывает исключение, соответствующее номеру ошибки в перечислении Teigha.Runtime.ErrorStatus с указанием статуса ошибки.
Если ошибка с номером returnValue в перечислении отсутствует, метод завершает работу без результата.
returnValue: Входное значение. Тип int.

Teigha.Runtime.Interop.CheckNull(IntPtr)
Метод реализует проверку возвращаемого значения на равенство null или System.IntPtr.Zero.
Метод выбрасывает исключение System.NullReferenceException, если значение returnValue равно null или System.IntPtr.Zero.
returnValue: Входное значение.  Тип IntPtr.

Teigha.Runtime.Interop.DetachUnmanagedObject(Teigha.Runtime.DisposableWrapper)
Метод разрывает связь между оберткой и соответствующим неуправляемым ресурсом.
Метод позволяет разорвать связь между оберткой и соответствующим неуправляемым ресурсом.
obj: Входная обертка. Тип DisposableWrapper.

Teigha.Runtime.Interop.SetAutoDelete(Teigha.Runtime.DisposableWrapper,System.Boolean)
Метод задаёт состояние флага, который определяет, является ли обертка владельцем связанного с ней неуправляемого ресурса.
Метод задаёт состояние флага, который определяет, является ли обертка владельцем связанного с ней неуправляемого ресурса.
Когда обертка владеет ресурсом, метод Dispose() удалит ресурс автоматически.
obj: Входная обёртка. Тип DisposableWrapper.
value: Входное состояние флага автоудаления. Тип bool.

Teigha.Runtime.Interop.ThrowExceptionForErrorStatus(System.Int32)
Метод позволяет выбросить исключение Teigha.Runtime.Exception для переданного статуса ошибки.
Метод позволяет выбросить исключение Teigha.Runtime.Exception для переданного статуса ошибки errorStatus.
errorStatus: Входной статус ошибки. Тип int.