Teigha.GraphicsInterface.FaceModifiers.Opacity
Значение: 1. К граням объекта применяется заданное значение непрозрачности.
Если данный битовый флаг не установлен, грани объекта отображаются с полной непрозрачностью.
Если флаг установлен, грани объекта отображаются с заданной степенью непрозрачности в диапазоне от полной непрозрачности до полной прозрачности.