Teigha.DatabaseServices.TableBreakOptions
Перечисление TableBreakOptions определяет поддерживаемые параметры разрывов в таблице.
Перечисление TableBreakOptions определяет поддерживаемые параметры разрывов в таблице.