Teigha.BoundaryRepresentation.MeshEntity
Класс MeshEntity представляет базовый интерфейсный класс для объектов и подобъектов сети.
Класс MeshEntity представляет базовый интерфейсный класс для объектов и подобъектов сети.
Notes
Этот класс реализован только для среды пространственного моделирования.

Teigha.BoundaryRepresentation.MeshEntity.Equals(Object)
Метод предназначен для проверки равенства двух объектов.
Метод предназначен для проверки равенства двух объектов.
obj: Входной объект сети, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если объекты равны.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.MeshEntity.EntityAssociated
Свойство EntityAssociated предоставляет доступ к топологическому объекту наименьшей размерности, связанному с данным объектом сети.
Свойство EntityAssociated предоставляет доступ к топологическому объекту наименьшей размерности, связанному с данным объектом сети.
Для 2D-сети возвращает грань, оболочку или граничное представление BREP.
В случае 2D-элемента возвращает грань.
Для узла возвращает вершину, ребро или грань.
Returns: Возвращает объект BREP, связанный с данным объектом сети.
Тип BrepEntity.

Teigha.BoundaryRepresentation.MeshEntity.IsBrepChanged
Свойство IsBrepChanged позволяет проверить, изменилось ли связанное граничное представление BREP с момента последнего обновления данного объекта.
Свойство IsBrepChanged позволяет проверить, изменилось ли связанное граничное представление BREP с момента последнего обновления данного объекта.
Returns: Возвращает true, если связанный объект BREP изменился или если невозможно определить, изменился ли он.
Возвращает false, если связанный объект BREP не изменился, или если он не является резидентным в базе данных.

Teigha.BoundaryRepresentation.MeshEntity.IsNull
Свойство IsNull позволяет проверить, был ли данный объект инициализирован.
Свойство IsNull позволяет проверить, был ли данный объект инициализирован, т.е. было ли присвоено данному объекту какое-либо осмысленное значение.
Returns: Возвращает true, только если данный объект не является инициализированным.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.MeshEntity.ValidationLevel
Свойство ValidationLevel представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
Свойство ValidationLevel представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD. В общем случае это означает любую функцию, которая обращается к топологии BREP.
Returns: Возвращает уровень проверки, связанный с данным объектом.
Перечисление Teigha.BoundaryRepresentation.ValidationLevel.