Teigha.DatabaseServices.PolygonMesh.MakeNClosed
Метод реализует замыкание сети PolygonMesh в направлении N.
Метод реализует замыкание сети PolygonMesh в направлении N.
Это означает, что сеть будет рассматриваться как непрерывная при переходе от последнего столбца к первому.