Teigha.BoundaryRepresentation.BrepVertexCollection
Класс BrepVertexCollection представляет коллекцию вершин граничного представления B-Rep.
Класс BrepVertexCollection представляет коллекцию вершин граничного представления B-Rep.