Teigha.DatabaseServices.Helix.GetAxisPoint
Метод предоставляет точку начала оси спирали.
Метод предоставляет точку начала оси спирали (центр основания).
Returns: Возвращает точку начала оси. Тип Point3d.