Teigha.DatabaseServices.SkyBackground.GetDrawableType
Метод предоставляет тип отображаемого объекта DrawableType для данного объекта.
Метод предоставляет тип отображаемого объекта DrawableType для данного объекта.
Returns: Возвращает тип отображаемого объекта DrawableType для данного объекта.
Тип GraphicsInterface.DrawableType.