Teigha.Geometry.LineSegment2d.GetBisector
Метод вычисляет серединный перпендикуляр для данного линейного сегмента.
Метод вычисляет серединный перпендикуляр для данного линейного сегмента.
Returns: Возвращает бесконечную прямую, которая представляет собой серединный перпендикуляр для данного линейного сегмента.
Тип Line2d.