HostMgd.Windows.Window
Класс представляет собой окно операционной системы.

HostMgd.Windows.Window.Handle
Реализация IWin32Window.Handle.

HostMgd.Windows.Window.Icon
Предоставляет доступ к пиктограмме, содержащейся в окне.

HostMgd.Windows.Window.Location
Предоставляет доступ к точке размещения окна,
определенной экранными координатами верхнего левого угла.

HostMgd.Windows.Window.Size
Обеспечивает доступ к размерам окна.

HostMgd.Windows.Window.Text
Обеспечивает доступ к заголовку окна.

HostMgd.Windows.Window.Visible
Обеспечивает доступ к режиму видимости окна.

HostMgd.Windows.Window.WindowState
Обеспечивает доступ к статусу отображения окна.