Teigha.DatabaseServices.FileOpenMode.OpenForReadAndReadShare
Значение: 1.
Файл открывается на чтение и разрешается совместный доступ на чтение.
Использование метода Database.ReadDwgFile() в этом режиме исключает возможность записи в файл другими приложениями.
В случае, когда файл уже был открыт на запись другим приложением, обращение к методу Database.ReadDwgFile() завершится ошибкой.