HostMgd.ApplicationServices.InplaceTextEditor.SpellDictinaryDialog
Метод вызывает диалоговое окно проверки орфографии.
В текущей версии не реализован.
Метод вызывает диалоговое окно проверки орфографии  в данном текстовом редакторе.
В текущей версии метод не реализован.