HostMgd.EditorInput.Editor.PromptForSelectionEnding
Событие возникает после завершения операции выбора объектов, но перед фиксацией результата.
Событие не реализовано.
Событие вызывается на этапе завершения интерактивного выбора
множества объектов в nanoCAD. Оно является частью
последовательности событий, связанных с выборкой:
* SelectionRemoved — объекты удалены из текущего выделения.
* PromptingForSelection — начало новой операции выборки.
* SelectionAdded — объекты добавлены к выделению.
* PromptForSelectionEnding — завершение операции выборки (текущее событие).
* PromptedForSelection — пост-обработка после окончания выборки.
Это событие позволяет разработчику получить доступ к текущему набору
выбранных объектов и обработать его перед тем, как выбор будет использован в команде.
Может применяться для проверки допустимости выборки, изменения состава
выделенных объектов или выполнения предварительных действий.
Notes
Событие реализуется через делегат PromptForSelectionEndingEventHandler,
который предоставляет доступ к объекту PromptForSelectionEndingEventArgs.
Example
C#