Teigha.Geometry.Matrix2d.GetScale
Метод вычисляет масштабный коэффициент этой матрицы.
Метод вычисляет масштабный коэффициент этой матрицы.
Масштабный коэффициент равен квадратному корню самого длинного вектора-столбца в линейной части этой матрицы
Returns: Возвращает масштабный коэффициент матрицы.
Тип double.