HostMgd.Windows.ToolPalette.CustomToolBase.New
Метод предназначен для создания нового пользовательского инструмента.
Не реализован.
Метод предназначен для создания нового пользовательского инструмента.
При вызове инициализирует все элементы данных инструмента.
В текущей версии не реализован.