Teigha.DatabaseServices.NewLayerNotification
Перечисление NewLayerNotification определяет допустимые значения переменной заголовка LAYERNOTIFY.
Перечисление NewLayerNotification определяет допустимые значения переменной заголовка LAYERNOTIFY.
Эта переменная определяет условия, когда выводятся предупреждения об обнаружении несогласованных новых слоев.