Teigha.DatabaseServices.SweptSurface
Класс SweptSurface представляет в базе данных поверхности, полученные вытягиванием по траектории.
Класс SweptSurface представляет в базе данных поверхности, полученные вытягиванием по траектории.

Teigha.DatabaseServices.SweptSurface.#ctor
Конструктор по умолчанию класса SweptSurface.
Конструктор по умолчанию класса SweptSurface.

Teigha.DatabaseServices.SweptSurface.CreateSweptSurface(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,DatabaseServices.SweepOptions)
Метод предназначен для создания поверхности вытягиванием указанного объекта по заданной траектории с учетом переданных опций
Метод предназначен для создания поверхности вытягиванием указанного объекта по заданной траектории с учетом переданных опций.
sweepEnt: Объект, вытягиваемый по траектории. Тип Entity.
pathEnt: Объект траектории. Тип Entity.
sweepOptions: Настройки операции вытягивания по траектории. Тип DatabaseServices.SweepOptions.

Teigha.DatabaseServices.SweptSurface.Bank
Свойство Bank позволяет определить, расположена ли вытягиваемая поверхность или кривая вдоль траектории вытягивания.
Свойство Bank позволяет определить расположена ли вытягиваемая поверхность или кривая вдоль траектории вытягивания.
Returns: Возвращает true, если вытягиваемая поверхность или кривая располагается вдоль траектории.
В противном случае возвращает false.

Teigha.DatabaseServices.SweptSurface.PathEntity
Свойство PathEntity представляет траекторию вытягивания для данной поверхности.
Свойство PathEntity представляет траекторию вытягивания для данной поверхности.
Returns: Возвращает траекторию операции. Тип Entity.

Teigha.DatabaseServices.SweptSurface.PathLength
Свойство PathLength представляет длину траектории, вытягиванием по которой получен данный объект.
Свойство PathLength представляет длину траектории, вытягиванием по которой получен данный объект.
Returns: Возвращает длину траектории. Тип double.

Teigha.DatabaseServices.SweptSurface.ProfileRotation
Свойство ProfileRotation представляет угол поворота профиля.
Свойство ProfileRotation представляет угол поворота профиля.
Returns: Возвращает угол поворота. Тип double.

Teigha.DatabaseServices.SweptSurface.ScaleAlongPath
Свойство ScaleAlongPath представляет масштабный коэффициент, использованный при получении данного объекта при вытягивании по траектории.
Свойство ScaleAlongPath представляет масштабный коэффициент, использованный при получении данного объекта при вытягивании по траектории.
Returns: Возвращает масштабный коэффициент. Тип double.

Teigha.DatabaseServices.SweptSurface.SweepEntity
Свойство SweepEntity представляет геометрический объект, использованный для получения данной поверхности вытягиванием по траектории.
Свойство SweepEntity представляет геометрический объект, использованный для получения данной поверхности вытягиванием по траектории.
Returns: Возвращает геометрический объект для вытягивания по траектории.
Тип Entity.

Teigha.DatabaseServices.SweptSurface.SweepOptions
Свойство SweepOptions представляет комплекс настроек операции вытягивания по траектории.
Свойство SweepOptions представляет комплекс настроек операции вытягивания по траектории.
Returns: Возвращает настройки операции вытягивания по траектории. Тип DatabaseServices.SweepOptions.

Teigha.DatabaseServices.SweptSurface.TwistAlongPath
Свойство TwistAlongPath представляет угол кручения профиля по мере его вытягивания по траектории.
Свойство TwistAlongPath представляет угол кручения профиля по мере его вытягивания по траектории.
Returns: Возвращает угол кручения. Тип double.