Teigha.DatabaseServices.SymbolTableEnumerator.MoveNext
Метод реализует переход указателя перечислителя к следующей записи в таблице символов.
Метод реализует переход указателя перечислителя к следующей записи в таблице символов.
Returns: Возвращает true, если текущий элемент перечислителя находится в таблице (его индекс не превышает размер таблицы), и false, если индекс вышел за пределы таблицы.