Teigha.DatabaseServices.HyperLink.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Метод позволяет получить хеш-код данного объекта.
Хеш-код представляет собой целочисленное значение, уникальное для любого экземпляра данного класса.
Returns: Возвращает хеш-код объекта. Тип int.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.