Teigha.DatabaseServices.GripOverrule.SetCustomFilter
Включает использование метода IsApplicable базового класса Overrule для фильтрации объектов, подлежащих объектному переопределению.
Включает использование метода IsApplicable базового класса Overrule для фильтрации объектов, подлежащих объектному переопределению.