Teigha.GraphicsInterface.DrawableOverrule.SetCustomFilter
Этот метод активирует использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.
Этот метод активирует использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.