Teigha.Geometry.Point3d.GetAsVector
Метод преобразует данную 3D-точку в 3D-вектор с тем же набором координат и возвращает экземпляр Vector3d.
Метод преобразует данную 3D-точку в 3D-вектор с тем же набором координат и возвращает экземпляр Vector3d.
Returns: Возвращает вектор с теми же координатами, что и у данной точки. Тип Vector3d.