Teigha.Colors.TransparencyCollectionEnumerator
Класс TransparencyCollectionEnumerator представляет перечислитель для коллекции TransparencyCollection.
Класс TransparencyCollectionEnumerator представляет перечислитель для коллекции TransparencyCollection.

Teigha.Colors.TransparencyCollectionEnumerator.#ctor(Teigha.Colors.TransparencyCollection)
Конструктор класса TransparencyCollectionEnumerator.
Создает новый экземпляр класса для указанной коллекции TransparencyCollection.
Конструктор класса TransparencyCollectionEnumerator.
Создает новый экземпляр класса для указанной коллекции TransparencyCollection.
col: Входная коллекция, для которой требуется создать перечислитель. Тип TransparencyCollection.

Teigha.Colors.TransparencyCollectionEnumerator.Current
Свойство Current возвращает текущий элемент коллекции.
Свойство Current возвращает текущий элемент коллекции.
Returns: Возвращает текущий элемент коллекции.
Тип ValueType.