Teigha.LayerManager.LayerFilterTree
Структура LayerFilterTree представляет корневой и текущий объекты LayerFilter.
Структура LayerFilterTree представляет корневой и текущий объекты LayerFilter.

Teigha.LayerManager.LayerFilterTree.#ctor(Teigha.LayerManager.LayerFilter,Teigha.LayerManager.LayerFilter)
Конструктор структуры LayerFilterTree.
Создает экземпляр структуры с указанными корневым и текущим узлами дерева фильтров слоев.
Конструктор структуры LayerFilterTree.
Создает экземпляр структуры с указанными корневым и текущим узлами дерева фильтров слоев.
root: Корневой узел дерева. Тип LayerFilter.
current: Текущий узел дерева.  Тип LayerFilter.

Teigha.LayerManager.LayerFilterTree.Current
Свойство Current представляет текущий узел дерева фильтров слоев.
Свойство Current представляет текущий узел дерева фильтров слоев.
Returns: Возвращает текущий узел дерева фильтров слоев.
Тип LayerFilter.

Teigha.LayerManager.LayerFilterTree.Root
Свойство Root представляет корневой узел дерева фильтров слоев.
Свойство Root представляет корневой узел дерева фильтров слоев.
Returns: Возвращает корневой узел дерева фильтров слоев.
Тип LayerFilter.