Teigha.DatabaseServices.OsnapPointRef.IntersectEntity
Метод предоставляет ссылку на объект XrefFullSubentityPath объекта чертежа, с которым пересекается данный объект OsnapPointRef.
Метод предоставляет ссылку на объект XrefFullSubentityPath объекта чертежа, с которым пересекается данный объект OsnapPointRef.
Returns: Возвращает ссылку на полный путь подобъекта внешней ссылки.
Тип XrefFullSubentityPath.