Teigha.DatabaseServices.LayerStateManager
Класс LayerStateManager используется для доступа и управления состояниями индивидуального слоя, связанными с базой данных чертежа.
Класс LayerStateManager используется для доступа и управления индивидуального слоя, связанными с базой данных чертежа.
Реализация менеджера состояний слоев не наследует класс коллекции.
Его использование предполагает высокоуровневый доступ к функциям управления состояниями слоя.
Для перечисления состояний, получения списков и других низкоуровневых функций разработчики должны использовать существующие API для доступа к словарю состояний слоя в словаре расширения таблицы слоев.

Teigha.DatabaseServices.LayerStateManager.#ctor(Teigha.DatabaseServices.Database)
Конструктор класса LayerStateManager, использует базу данных, которую связывает с новым экземпляром менеджера состояния слоя.
Конструктор класса LayerStateManager, использует базу данных, которую связывает с новым экземпляром менеджера состояния слоя.
database: База данных, связываемая с новым экземпляром LayerStateManager, тип Database.

Teigha.DatabaseServices.LayerStateManager.CompareLayerStateToDb(String,DatabaseServices.ObjectId)
Сравнивает значения слоя, сохраненные в состоянии слоя, со значениями текущего слоя в чертеже.
Сравнивает значения слоя, сохраненные в состоянии слоя, со значениями текущего слоя в чертеже.
Этот метод сравнивает все значения, за исключением описания слоя.
Метод может также использовать VPLAYER и переопределять настройки видового экрана для сравнения видимости и переопределяемых свойств.
Чтобы игнорировать настройки видового экрана, укажите Null для аргумента idVp.
name: Имя состояния слоя, которое необходимо сравнить с состоянием слоя в чертеже, тип String.
idVp: Идентификатор ObjectId видового экрана, настройки VPLAYER которого должны использоваться при сравнении.
Returns: Возвращает true, если состояние слоя соответствует состоянию слоя в чертеже, и false в противном случае.

Teigha.DatabaseServices.LayerStateManager.DeleteLayerState(String)
Удаляет указанное состояние слоя.
Удаляет указанное состояние слоя.
name: Имя состояния слоя, которое подлежит удалению. Тип String.

Teigha.DatabaseServices.LayerStateManager.ExportLayerState(String,String)
Метод ExportLayerState() получает имя состояния слоя и экспортирует соответствующее состояние слоя в указанный файл.
Метод ExportLayerState() получает имя состояния слоя и экспортирует соответствующее состояние слоя в указанный файл. Имя состояния слоя должно быть передано нуль-терминированной строкой.
nameToExport: Имя состояния слоя, тип String. Концом строки считается первый встретившийся нуль-символ.
fileName: Имя файла, в который экспортируется состояние слоя. Тип String.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateDescription(String)
Извлекает описание, заданное методом SetLayerStateDescription().
Извлекает описание, заданное методом SetLayerStateDescription().
name: Имя состояния слоя, описание которого необходимо получить, тип String.
Returns: Возвращает строку с именем состояния слоя.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateLayers(String,System.Boolean)
Возвращает массив с именами всех слоев, сохраненных в состоянии слоя.
Если bInvert равно true, массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя.
Возвращает массив с именами всех слоев, сохраненных в состоянии слоя.
Если bInvert равно true, массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя.
name: Имя состояния слоя, для которого выполняется запрос, тип String.
bInvert: Если данному аргументу задано значение true, возвращаемый массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя. Тип bool.
Returns: Тип результата - ArrayList.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateMask(String)
Возвращает маску для именованного состояния слоя.
Возвращает маску для именованного состояния слоя.
name: Имя состояния слоя, тип String.
Returns: Возвращаемый тип - LayerStateMasks.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateNames(System.Boolean,System.Boolean)
Возвращает массив с именами всех состояний слоя.
Возвращает массив с именами всех состояний слоя.
bIncludeHidden: Задать true, чтобы включить в массив имена скрытых состояний слоя. Тип bool.
bIncludeXref: Задать true для включения XRefs. Тип bool.
Returns: Возвращает массив типа ArrayList с именами всех состояний слоя.

Teigha.DatabaseServices.LayerStateManager.HasLayerState(String)
Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.
Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.
name: Имя состояния слоя, String.
Returns: Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.

Teigha.DatabaseServices.LayerStateManager.ImportLayerState(String)
Метод ImportLayerState() импортирует в чертеж состояния слоя из указанного файла импорта.
Метод ImportLayerState() считывает переданное имя файла (сохраненное при предыдущем экспорте) и извлекает состояния слоя для импорта.
Если имя состояния слоя из файла импорта совпадает с уже существующим в чертеже именем состояния слоя, то импортированное состояние слоя игнорируется.
Если имя импортируемого состояния слоя в чертеже не найдено, состояние с таким именем создается.
Если какие-либо вновь созданные состояния слоев относятся к слоям, пока не существующим в чертеже, такие слои создаются с настройками по умолчанию.
fileName: Имя файла для импорта состояний слоя, String.

Teigha.DatabaseServices.LayerStateManager.ImportLayerStateFromDb(String,Teigha.DatabaseServices.Database)
Метод импортирует состояние слоя с указанным именем, используя указатель открытого файла чертежа, переданный через базу данных.
Метод импортирует состояние слоя с указанным именем, используя указатель открытого файла чертежа, переданный через базу данных.
Этот метод импортирует также типы линий, материалы и стили печати, которые сохранены в состоянии импортированного слоя, но отсутствуют в текущем чертеже.  Этот метод позволяет импортировать состояния слоев непосредственно из файлов чертежей, а не экспортировать их в файл формата .LAS с последующим импортом состояния слоя.
name: Имя импортируемого состояния слоя, String.
database: Указатель на действительную и доступную на чтение базу данных, из которой следует импортировать состояние слоя.

Teigha.DatabaseServices.LayerStateManager.LayerStateHasViewportData(String)
Метод определяет, связаны ли с этим состоянием слоя данные видового экрана.  Состояние слоя имеет данные видового экрана, если метод SaveLayerState() был вызван с ненулевым параметром id.
Метод определяет логическое значение, указывающее, связаны ли с этим состоянием слоя данные видового экрана.  Состояние слоя имеет данные видового экрана, если метод SaveLayerState() был вызван с ненулевым параметром id.
name: Имя интересующего состояния слоя, тип String.
Returns: Возвращает true, если с этим состоянием слоя связаны данные видового экрана, и false в противном случае.

Teigha.DatabaseServices.LayerStateManager.LayerStatesDictionaryId(System.Boolean)
Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или ObjectId (NULL).
Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или ObjectId (NULL), если реализуется какая-либо из следующих ситуаций:
* база данных имеет значение Null, или
* таблица символов имеет значение Null, или
* словарь расширения таблицы слоев или словарь расширения состояний слоев имеет значение Null (а аргумент createIfNotPresent имеет значение false), или
* словарь расширения таблицы слоев или словарь расширения состояний слоев не может быть создан (а аргумент createIfNotPresent имеет значение true), или
* словарь расширения таблицы слоев не может быть открыт на чтение.
createIfNotPresent: Логический флаг, управляющий созданием словаря, тип bool.
Returns: Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или нулевой ObjectId (NULL).

Teigha.DatabaseServices.LayerStateManager.RenameLayerState(String,String )
Метод переименовывает состояние слоя.
Метод переименовывает состояние слоя.  Состоянию слоя с именем name присваивается новое имя newName.
name: Имя существующего состояния слоя, String.
newName: Новое имя состояния слоя, String.

Teigha.DatabaseServices.LayerStateManager.RestoreLayerState(String,DatabaseServices.ObjectId,System.Int32,Teigha.DatabaseServices.LayerStateMasks)
Метод восстанавливает имя состояния слоя и настройки VPLAYER для указанного видового экрана. Также восстанавливает атрибуты, указанные в clientMask.
Метод восстанавливает имя состояния слоя и настройки VPLAYER для указанного видового экрана. Также восстанавливает атрибуты, указанные в clientMask.
name: Имя состояния слоя, которое станет текущим, тип String.
id: Идентификатор ObjectId видового экрана, настройка VPLAYER которого должна быть восстановлена из сохраненных данных, тип DatabaseServices.ObjectId.
undefinedLayerStatePolicy: Аргумент, определяющий, следует ли обрабатывать неопределенные слои, тип int.
clientMask: Маска атрибутов слоя, тип LayerStateMasks.

Teigha.DatabaseServices.LayerStateManager.SaveLayerState(String,Teigha.DatabaseServices.LayerStateMasks,DatabaseServices.ObjectId)
Метод сохраняет текущее состояние слоя в состоянии слоя с указанным именем.
Метод сохраняет текущее состояние слоя в состоянии слоя с указанным именем.
Этот метод сохраняет также настройки VPLAYER для указанного видового экрана.
Чтобы сохранить состояние слоя без настроек VPLAYER, следует аргументу id задать значение Null.
name: Имя сохраняемого состояния слоя, тип String.
mask: Маска для применения к состоянию слоя, тип LayerStateMasks,
id: ObjectId видового экрана, чья настройка VPLAYER должна быть сохранена, тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LayerStateManager.SetLayerStateDescription(String,String)
Метод задает произвольную строку в качестве описания состояния слоя.
Метод задает произвольную строку (длиной до 255 символов) в качестве описания состояния слоя.
name: Имя состояния слоя, у которого обновляется описание, тип String.
description: Строка описания длиной до 256 символов, тип String.

Teigha.DatabaseServices.LayerStateManager.SetLayerStateMask(String,Teigha.DatabaseServices.LayerStateMasks)
Обновляет маску LayerStateMasks, используемую при восстановлении состояния слоя.
Обновляет маску LayerStateMasks, используемую при восстановлении состояния слоя.
name: Имя состояния слоя для маски, тип String.
mask: Маска, применяемая к состоянию слоя, тип LayerStateMasks.

Teigha.DatabaseServices.LayerStateManager.LastRestoredLayerState
Метод обеспечивает доступ к последнему восстановленному состоянию слоя.
Метод обеспечивает доступ к последнему восстановленному состоянию слоя.
Returns: Возвращает имя последнего восстановленного состояния слоя, String.