Teigha.DatabaseServices.HatchStyle
Перечисление HatchStyle определяет поддерживаемые стили штрихования.
В текущей версии поддерживаются три стиля штрихования: Normal, Outer и Ignore.
В отсутствие внутренних граничных циклов указание стиля штрихования не влияет на результирующую штриховку.