Teigha.DatabaseServices.DxfFiler.ReadString
Метод возвращает текстовую строку из текущего элемента этого объекта Filer.
Метод возвращает текстовую строку из текущего элемента этого объекта Filer.
Returns: Возвращает строку. Тип String.