Teigha.DatabaseServices.DBObject.Erased
Cобытие возникает, когда объект был удалён методом Erase(), либо такое удаление было отменено.
Cобытие возникает, когда объект был удалён методом Erase(), либо удаление было отменено.
Returns: Тип данных ObjectEventHandler, представляющий обработчик события.