Teigha.Colors.TransparencyCollection
Класс TransparencyCollection представляет коллекцию объектов Transparency.
Класс TransparencyCollection представляет коллекцию объектов Transparency.

Teigha.Colors.TransparencyCollection.#ctor
Конструктор по умолчанию класса TransparencyCollection.
Конструктор по умолчанию класса TransparencyCollection.
Создает новый экземпляр TransparencyCollection с ёмкостью по умолчанию.

Teigha.Colors.TransparencyCollection.#ctor(System.Int32)
Конструктор класса TransparencyCollection.
Создает экземпляр класса с указанной ёмкостью.
Конструктор класса TransparencyCollection.
Создает новый экземпляр TransparencyCollection с указанной ёмкостью capacity.
capacity: Входное значение ёмкости создаваемой коллекции. Тип int.

Teigha.Colors.TransparencyCollection.#ctor(array)
Конструктор класса TransparencyCollection.
Создает экземпляр класса на основе массива объектов Transparency.
Конструктор класса TransparencyCollection.
Создает новый экземпляр класса TransparencyCollection, используя переданный массив объектов Transparency.
values: Входной массив объектов, которыми заполняется созданная коллекция. Тип Transparency[].

Teigha.Colors.TransparencyCollection.Add(Teigha.Colors.Transparency)
Метод добавляет в коллекцию указанный объект Transparency.
Метод добавляет в данную коллекцию указанный объект Transparency.
value: Входной объект, добавляемый в данную коллекцию. Тип Transparency.
Returns: Возвращает индекс в коллекции вновь созданного элемента.
Тип int.

Teigha.Colors.TransparencyCollection.AddRange(array)
Метод добавляет в коллекцию массив объектов Transparency.
Метод добавляет в данную коллекцию указанный массив объектов Transparency.
range: Входной массив добавляемых в коллекцию объектов.  Тип Transparency[].

Teigha.Colors.TransparencyCollection.Contains(Teigha.Colors.Transparency)
Метод позволяет определить, является ли указанный объект Transparency членом данной коллекции.
Метод позволяет определить, является ли указанный объект Transparency членом данной коллекции.
value: Входной проверяемый объект. Тип Transparency.
Returns: Возвращает true, если объект value присутствует в коллекции.
В противном случае возвращает false.

Teigha.Colors.TransparencyCollection.Copy(array,System.Int32,array,System.Int32,System.Int32)
Метод копирует заданный диапазон элементов Transparency из одного массива в другой.
Метод копирует из массива source диапазон элементов, который начинается с индекса sourceIndex и включает length элементов, в целевой массив destination, начиная вставку с индекса destinationIndex.
Notes
См. также описание метода Array.Copy(Array, Int32, Array, Int32, Int32) в документацию .NET.
source: Массив, содержащий данные для копирования. Тип Transparency[].
sourceIndex: Индекс в массиве source, с которого начинается копирование. Тип int.
destination: Целевой массив, в который копируются данные. Тип Transparency[].
destinationIndex: Индекс в массиве destination, с которого начинается вставка копируемых элементов. Тип int.
length: Количество элементов, копируемых из массива sourceIndex в массив destination. Тип int.

Teigha.Colors.TransparencyCollection.CopyTo(array,System.Int32)
Метод копирует все элементы данной коллекции в указанный одномерный массив.
Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
array: Целевой массив, в который копируются элементы коллекции. Тип Transparency[].
index: Входной индекс в массиве array, начиная с которого в массив копируются элементы коллекции. Тип int.

Teigha.Colors.TransparencyCollection.IndexOf(Teigha.Colors.Transparency)
Метод определяет индекс элемента в коллекции, в котором хранится указанный объект Transparency.
Метод определяет индекс элемента в коллекции, в котором хранится указанный объект Transparency.
value: Входной искомый объект.  Тип Transparency.
Returns: Возвращает индекс объекта value в данной коллекции. Тип int. Если объект в коллекции отсутствует, возвращается значение -1.

Teigha.Colors.TransparencyCollection.Insert(System.Int32,Teigha.Colors.Transparency)
Метод вставляет в коллекцию заданный объект Transparency по указанному индексу.
Метод вставляет в коллекцию заданный объект Transparency по указанному индексу.
Индекс должен иметь допустимое значение.
index: Входной индекс вставленного в коллекцию элемента. Тип int.
value: Входной объект, вставляемый в коллекцию. Тип Transparency.

Teigha.Colors.TransparencyCollection.Remove(Teigha.Colors.Transparency)
Метод удаляет из коллекции первое вхождение указанного объекта Transparency.
Метод удаляет из коллекции первое вхождение указанного объекта Transparency.
value: Удаляемый из коллекции объект.  Тип Transparency.

Teigha.Colors.TransparencyCollection.RemoveAt(System.Int32)
Метод удаляет из данной коллекции элемент с указанным индексом.
Метод удаляет из данной коллекции элемент с индексом index.
index: Индекс удаляемого из коллекции элемента. Тип int.

Teigha.Colors.TransparencyCollection.Capacity
Свойство Capacity представляет ёмкость данной коллекции.
Свойство Capacity управляет ёмкостью коллекции, т.е. количеством элементов, которые может содержать данная коллекция.
Returns: Возвращает текущее значение ёмкости данной коллекции.
Тип int.

Teigha.Colors.TransparencyCollection.Count
Свойство Count представляет фактическое количество элементов в данной коллекции.
Свойство Count представляет фактическое количество элементов в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.Colors.TransparencyCollection.IsFixedSize
Свойство IsFixedSize позволяет определить, является ли размер данной коллекции фиксированным.
Свойство IsFixedSize позволяет определить, является ли размер данной коллекции фиксированным.
Returns: Возвращает true, если размер данной коллекции является фиксированным.
В противном случае возвращает false.

Teigha.Colors.TransparencyCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Returns: Возвращает true, если данная коллекция доступна только на чтение.
В противном случае возвращает false.

Teigha.Colors.TransparencyCollection.IsSynchronized
Свойство IsSynchronized позволяет проверить, является ли доступ к коллекции синхронизированным (потокобезопасным).
Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции синхронизированным (потокобезопасным).
Returns: Возвращает true, если доступ к данной коллекции является синхронизированным.
В противном случае возвращает false.

Teigha.Colors.TransparencyCollection.Item
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Notes
Если значение аргумента index окажется недействительным, выбрасывается исключение ArgumentOutOfRangeException.
index: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип Transparency.

Teigha.Colors.TransparencyCollection.SyncRoot
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Returns: Возвращает объект для синхронизации доступа к коллекции.
Тип Object.