Teigha.DatabaseServices.FillStyle.FsUseObject
Значение: 73. Стиль заливки замкнутой области определяется свойствами предоставленного объекта.
Полезно при работе с объектами, имеющими собственные стили заливки.