Teigha.GraphicsSystem.ImpDevice.CreateView
Метод позволяет создать новый вид и связать его с данным устройством.
Метод создает новый вид, связывает его с данным устройством и возвращает дескриптор созданного вида.
Returns: Возвращает дескриптор созданного вида.
Тип View.