Teigha.BoundaryRepresentation.BrepShellCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции оболочек B-Rep.
Метод позволяет получить перечислитель данной коллекции оболочек B-Rep.
Returns: Возвращает перечислитель данной коллекции.
Тип BrepShellEnumerator.