Teigha.Colors.EntityColorCollection
Класс EntityColorCollection представляет коллекцию объектов EntityColor.
Класс EntityColorCollection представляет коллекцию объектов EntityColor.

Teigha.Colors.EntityColorCollection.#ctor
Конструктор по умолчанию класса EntityColorCollection.
Конструктор по умолчанию класса EntityColorCollection.
Создает новую коллекцию EntityColorCollection с ёмкостью по умолчанию, которая определяется константой EntityColorCollection.DefaultSize.

Teigha.Colors.EntityColorCollection.#ctor(System.Int32)
Конструктор класса EntityColorCollection.
Создает новую коллекцию с указанной ёмкостью.
Конструктор класса EntityColorCollection.
Создает новую коллекцию EntityColorCollection с заданной ёмкостью capacity.
capacity: Входное значение ёмкости создаваемой коллекции. Тип int.

Teigha.Colors.EntityColorCollection.#ctor(array)
Конструктор класса EntityColorCollection.
Создает экземпляр класса, используя переданный массив объектов EntityColor.
Конструктор класса EntityColorCollection.
Создает новую коллекцию EntityColorCollection, используя переданный массив объектов EntityColor.
values: Входной массив. Тип EntityColor[].

Teigha.Colors.EntityColorCollection.Add(Teigha.Colors.EntityColor)
Метод добавляет в коллекцию указанный объект EntityColor.
Метод добавляет в коллекцию новый элемент, используя указанный объект EntityColor.
value: Входной объект для добавления в коллекцию. Тип EntityColor.
Returns: Возвращает количество элементов в коллекции после добавления объекта value.
Тип int.

Teigha.Colors.EntityColorCollection.AddRange(array)
Метод добавляет в коллекцию массив объектов EntityColor.
Метод добавляет в коллекцию массив объектов EntityColor.
range: Входной массив объектов, которые добавляются в данную коллекцию. Тип EntityColor[].

Teigha.Colors.EntityColorCollection.Contains(Teigha.Colors.EntityColor)
Метод позволяет определить, является ли указанный объект EntityColor членом данной коллекции.
Метод позволяет определить, является ли указанный объект EntityColor членом данной коллекции.
value: Входной проверяемый объект. Тип EntityColor.
Returns: Возвращает true, если объект value присутствует в коллекции.
В противном случае возвращает false.

Teigha.Colors.EntityColorCollection.CopyTo(array,System.Int32)
Метод копирует все элементы данной коллекции в указанный одномерный массив.
Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
array: Целевой массив, в который копируются элементы коллекции. Тип EntityColor[].
index: Входной индекс в массиве array, начиная с которого в массив копируются элементы коллекции. Тип int.

Teigha.Colors.EntityColorCollection.IndexOf(Teigha.Colors.EntityColor)
Метод определяет индекс конкретного элемента в коллекции, в котором хранится указанный объект EntityColor.
Метод определяет индекс конкретного элемента коллекции, в котором хранится указанный объект EntityColor.
value: Входной объект. Тип EntityColor.
Returns: Возвращает индекс объекта value в данной коллекции. Тип int. Если объект в коллекции отсутствует, возвращается значение -1.

Teigha.Colors.EntityColorCollection.Insert(System.Int32,Teigha.Colors.EntityColor)
Метод вставляет в коллекцию заданный объект EntityColor по указанному индексу.
Метод вставляет в коллекцию заданный объект EntityColor по указанному индексу.
Индекс должен иметь допустимое значение.
index: Входной индекс вставленного в коллекцию элемента. Тип int.
value: Входной объект, вставляемый в коллекцию. Тип EntityColor.

Teigha.Colors.EntityColorCollection.Remove(Teigha.Colors.EntityColor)
Метод удаляет из коллекции первое вхождение указанного объекта EntityColor.
Метод удаляет из коллекции первое вхождение указанного объекта EntityColor.
value: Удаляемый из коллекции объект. Тип EntityColor.

Teigha.Colors.EntityColorCollection.RemoveAt(System.Int32)
Метод удаляет из данной коллекции элемент с указанным индексом.
Метод удаляет из данной коллекции элемент с указанным индексом.
index: Индекс удаляемого из коллекции элемента. Тип int.

Teigha.Colors.EntityColorCollection.Capacity
Свойство Capacity представляет ёмкость данной коллекции.
Свойство Capacity управляет ёмкостью коллекции, т.е. количеством элементов, которые может содержать данная коллекция.
Returns: Возвращает текущее значение ёмкости данной коллекции.
Тип int.

Teigha.Colors.EntityColorCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет количество элементов, фактически содержащихся в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.Colors.EntityColorCollection.IsFixedSize
Свойство IsFixedSize позволяет определить, является ли размер данной коллекции фиксированным.
Свойство IsFixedSize позволяет определить, является ли размер данной коллекции фиксированным.
Returns: Возвращает true, если размер данной коллекции является фиксированным.
В противном случае возвращает false.

Teigha.Colors.EntityColorCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Returns: Возвращает true, если данная коллекция доступна только на чтение.
В противном случае возвращает false.

Teigha.Colors.EntityColorCollection.IsSynchronized
Свойство IsSynchronized позволяет проверить, является ли доступ к коллекции синхронизированным (потокобезопасным).
Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции синхронизированным (потокобезопасным).
Returns: Возвращает true, если доступ к данной коллекции является синхронизированным.
В противном случае возвращает false.

Teigha.Colors.EntityColorCollection.Item
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
index: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
Returns: Возвращает элемент коллекции с указанным индексом. Тип EntityColor.

Teigha.Colors.EntityColorCollection.SyncRoot
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Свойство SyncRoot предоставляет объект, который можно использовать для синхронизации доступа к данной коллекции.
Returns: Возвращает объект для синхронизации доступа к коллекции.
Тип Object.