Teigha.Geometry.Point2dCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для данной коллекции.
Тип System.Collections.IEnumerator.