HostMgd.EditorInput.InputPointContext
Класс предоставляет контекстные данные для событий фильтрации и мониторинга ввода точки в nanoCAD.
Класс используется в .NET API nanoCAD для передачи дополнительной информации при обработке событий,
связанных с интерактивным вводом точки — таких как PointFilter и PointMonitor.
Он содержит параметры, описывающие текущее состояние операции ввода.
Класс позволяет разработчику корректно обрабатывать и модифицировать точку ввода
с учётом текущего контекста чертежа — например, выполнять фильтрацию,
корректировку или визуальную подсказку с учётом активной ПСК, проекции или привязок.
Example
C#

HostMgd.EditorInput.InputPointContext.CartesianSnappedPoint
Свойство предназначено для получения точки, привязанной по прямоугольной (декартовой) сетке,
если в контексте ввода был активирован соответствующий режим привязки.
Свойство предоставляет доступ к координатам точки, которая была скорректирована
с учётом прямоугольного режима привязки, аналогичного устаревшему CartSnap.
Оно возвращает значение только в том случае, если в истории операции ввода
установлен внутренний признак CartSnapped, указывающий на то, что была выполнена
декартова коррекция положения курсора.
Это свойство используется в обработчиках событий, связанных с мониторингом или фильтрацией ввода точки (PointMonitor, PointFilter),
и позволяет определить, применялась ли привязка по фиксированной сетке — например, при включённом режиме SNAP в интерфейсе nanoCAD.
Свойство актуально исключительно в тех случаях, когда пользователь работает с активной прямоугольной привязкой,
а система выполняет выравнивание курсора по шагам сетки.
Returns: Возвращает объект типа Point3d — координаты привязанной точки в мировой системе координат (WCS),
скорректированной по прямоугольной сетке.
Возвращает старый стиль привязки в случае, если в истории установлен признак CartSnapped.
Если режим декартовой привязки не был активен, возвращается некорректное или исходное значение.
При отсутствии привязки может совпадать с RawPoint.
Example
C#

HostMgd.EditorInput.InputPointContext.ComputedPoint
Свойство предназначено для получения или установки конечной вычисленной точки ввода,
если она была определена в процессе обработки.
Свойство используется для хранения итоговой координаты точки, которая была рассчитана системой ввода nanoCAD.
Оно содержит финальное положение точки после применения всех доступных механизмов: привязок (OSNAP),
сетки, полярного отслеживания, автоматического выравнивания и пользовательских фильтров.
Значение свойства устанавливается, когда внутренний флаг pointComputed имеет значение true,
что указывает на успешное вычисление точки. Важно, что ComputedPoint всегда устанавливается системой,
независимо от того, были ли применены пользовательские фильтры (PointFilter) или нет.
Это позволяет использовать его как надёжный источник текущей расчётной позиции курсора.
Свойство даёт возможность:
* получить текущую вычисленную точку,
* программно задать новое значение, например, при реализации кастомного поведения ввода.
После установки ComputedPoint система может использовать его для последующих операций — например, для расчёта OsnapPoint (привязанной точки) или динамической визуализации.
Returns: Возвращает объект типа Point3d — координаты конечной вычисленной точки в мировой системе координат (WCS),
если значение pointComputed равно true.
Если точка была успешно вычислена, содержит её актуальные координаты.
Если вычисление не выполнено (например, на раннем этапе), может содержать недопустимое или исходное значение.
Example
C#

HostMgd.EditorInput.InputPointContext.Document
Свойство предназначено для получения ссылки на документ,
в котором произошло событие ввода точки.
Свойство предоставляет доступ к объекту HostMgd.ApplicationServices.Document,
который является источником события, связанного с вводом точки — например,
PointMonitor или PointFilter.
Оно позволяет определить, в каком именно чертеже было инициировано событие,
что особенно важно при работе с несколькими открытыми документами в одной сессии nanoCAD.
Это свойство делает возможным использование единого обработчика событий для всех документов,
так как разработчик может проверить, к какому документу относится текущее событие,
и выполнить соответствующую логику. Например, можно избежать обработки ввода в фоновых или неактивных чертежах.
Свойство устанавливается системой автоматически при генерации контекста ввода.
Returns: Возвращает объект типа Document — ссылку на экземпляр документа nanoCAD,
в котором выполняется операция ввода точки.
Если событие возникло в активном чертеже — возвращается ссылка на этот документ.
Если контекст повреждён или недоступен — может вернуть null.
Example
C#

HostMgd.EditorInput.InputPointContext.DrawContext
Свойство предназначено для получения или установки контекста отрисовки,
используемого при визуализации графики во время операции ввода точки.
Свойство предоставляет доступ к объекту ViewportDraw,
который содержит информацию о текущем контексте отображения — включая активный вид,
параметры отрисовки, трансформационные матрицы, размеры точек и другие графические настройки.
Оно используется в обработчиках событий ввода (PointMonitor, PointFilter)
для рисования временной графики (например, направляющих, подсказок, "резиновых линий") прямо в окне чертежа.
Благодаря DrawContext разработчик может:
* определить, в каком виде (viewport) происходит ввод,
* корректно преобразовать координаты для отображения,
* нарисовать примитивы с учётом масштаба, поворота и стиля вида,
* обеспечить совместимость с различными режимами отображения (2D/3D, изометрия и др.).
Свойство позволяет не только читать текущие параметры отрисовки, но и, при необходимости, модифицировать контекст — например,
при реализации пользовательских визуальных эффектов.
Returns: Возвращает объект типа ViewportDraw — контекст отрисовки,
связанный с текущим видом (viewport).
Может быть null, если контекст отрисовки недоступен
(например, при ошибке инициализации).
Example
C#

HostMgd.EditorInput.InputPointContext.GrippedPoint
Свойство предназначено для получения координат точки ручки (grip),
если в контексте ввода активирован режим редактирования с помощью ручек
и установлен соответствующий флаг.
Свойство возвращает координаты точки привязки к ручке (grip) — маркеру редактирования объекта,
при активации которого пользователь начинает тянуть за него (например, перемещение вершины полилинии).
Оно содержит значение только в том случае, если в истории операции ввода установлен внутренний флаг Gripped,
указывающий на то, что текущая операция началась с выбора и активации ручки.
Это свойство используется в обработчиках событий ввода (PointMonitor, PointFilter) для определения,
находится ли пользователь в режиме редактирования через ручки.
Это позволяет адаптировать поведение команды — например, изменить логику привязки,
отключить конфликтующие подсказки или визуализировать дополнительные направляющие.
Свойство актуально исключительно во время операций, инициированных через grip-редактирование.
Returns: Возвращает объект типа Point3d — координаты активной ручки в мировой системе координат (WCS).
Если режим ручек активен и точка захвачена — содержит её положение.
Если редактирование не через ручки — может содержать неопределённое значение (не null, но игнорируется).
Example
C#

HostMgd.EditorInput.InputPointContext.History
Свойство предназначено для получения информации о типе привязки или операции,
выполненной при вводе точки, на основе битовых флагов.
Свойство предоставляет значение перечисления PointHistoryBits, представляющее собой битовую маску,
которая содержит сведения о том, как была получена текущая точка ввода.
Оно позволяет определить, был ли использован режим:
* объектной привязки,
* прямоугольной сетки,
* полярного отслеживания,
* ручек,
* автоматического выравнивания,
* или другой специфический режим.
Это свойство особенно полезно в обработчиках событий PointMonitor и PointFilter,
где важно различать контекст ввода — например, чтобы избежать конфликтов между пользовательскими подсказками
и системными привязками, или чтобы изменить поведение команды в зависимости от активного режима.
Значение устанавливается системой nanoCAD автоматически. Каждый бит в возвращаемом значении
соответствует определённому состоянию или режиму, что позволяет использовать побитовые операции
для проверки конкретных условий.
Returns: Возвращает значение типа PointHistoryBits — перечисление с побитовой структурой,
определяющей историю формирования точки.
Флаги могут комбинироваться с помощью побитовых операций:

HostMgd.EditorInput.InputPointContext.LastPoint
Свойство предназначено для получения последней введённой точки,
если в истории ввода установлен соответствующий флаг.
Свойство предоставляет координаты последней успешно введённой точки в текущем сеансе команды
— например, конечная точка предыдущего отрезка, центр ранее построенного круга
или точка завершения последней операции.
Оно содержит корректное значение только в том случае, если в битовой маске History установлен флаг LastPoint,
что указывает на наличие доступной "предыдущей" точки в контексте ввода.
Это свойство особенно полезно при реализации команд, где следующая точка привязывается к предыдущей
(например, построение полилинии, смещение, цепочка объектов).
Оно позволяет использовать встроенную логику nanoCAD для продолжения черчения без повторного запроса базовой точки.
Returns: Возвращает объект типа Point3d — координаты последней введённой точки в мировой системе координат (WCS).
Если команда уже вводила точку ранее и флаг LastPoint установлен — возвращает её.
Если LastPoint не был задан (например, начало сеанса), может вернуть неопределённое значение (технически — точку, но логически недоступную).
Для проверки доступности точки рекомендуется анализировать History:
C#

HostMgd.EditorInput.InputPointContext.ObjectSnapMask
Свойство предназначено для получения текущего режима объектной привязки (OSNAP),
если точка была вычислена и активирована привязка к объекту.
Свойство возвращает значение перечисления ObjectSnapMasks,
представляющее собой битовую маску, которая определяет,
какой именно тип объектной привязки используется в текущий
момент при вводе точки.
Значение свойства доступно только при выполнении двух условий:
1. Флаг pointComputed установлен в true — система завершила расчёт точки.
2. В истории (History) установлен бит Osnapped — указывает, что активирована объектная привязка.
Это свойство особенно полезно в обработчиках событий PointMonitor и PointFilter, где необходимо:
* определить, к какому элементу геометрии привязывается курсор,
* адаптировать поведение команды в зависимости от типа OSNAP,
* избежать конфликтов с пользовательскими подсказками или направляющими.
Returns: Возвращает значение типа ObjectSnapMasks — побитовое перечисление,
указывающее текущий активный режим объектной привязки.
Пример проверки:
C#

HostMgd.EditorInput.InputPointContext.ObjectSnapOverrides
Свойство предназначено для получения текущего режима объектной привязки,
активированного пользователем вручную (например, через клавишу Shift + ПКМ),
независимо от того, участвует ли он в вычислении точки.
Свойство возвращает значение типа ObjectSnapMasks,
представляющее собой активный временный режим объектной привязки,
установленный с помощью переопределения (override) — например,
при вызове контекстного меню привязок или использовании горячих клавиш.
В отличие от свойства ObjectSnapMask, это свойство возвращает тип привязки
даже в тех случаях, когда она ещё не была применена к вычисляемой точке
(ComputedPoint) или процесс привязки находится в стадии анализа.
Это позволяет разработчику:
* определить, какую именно привязку пытается использовать пользователь,
* предоставить соответствующую визуальную подсказку,
* адаптировать поведение команды до завершения ввода,
* реализовать "умные" направляющие или динамические подсказки, соответствующие выбранному OSNAP.
Свойство особенно полезно при создании интерактивных инструментов (Jig, PointMonitor),
где важно реагировать на намерения пользователя ещё до фактической привязки.
Свойство обновляется системой в реальном времени при изменении режима привязки.
Returns: Возвращает значение типа ObjectSnapMasks — побитовую маску,
указывающую на текущий активный режим переопределения объектной привязки.
Пример проверки:
C#

HostMgd.EditorInput.InputPointContext.ObjectSnappedPoint
Свойство предназначено для получения координат точки,
к которой была выполнена объектная привязка (OSNAP),
если таковая активирована и вычислена.
Свойство предоставляет точку в мировой системе координат (WCS),
которая была скорректирована с учётом объектной привязки — например,
привязка к конечной точке линии, центру окружности или точке пересечения.
Значение доступно только при одновременном выполнении двух условий:
* Система завершила расчёт точки (pointComputed == true),
* В истории ввода установлен флаг Osnapped, указывающий на использование OSNAP.
Это свойство используется в обработчиках событий PointMonitor и PointFilter
для определения фактического положения привязанной точки, что позволяет:
* корректно отображать динамические подсказки,
* выполнять дополнительные вычисления относительно привязанного положения,
* избегать конфликтов между пользовательскими и системными режимами привязки.
В отличие от ComputedPoint, которое может включать сетку, полярные направления и другие режимы,
ObjectSnappedPoint отражает чистую привязку к геометрии объекта.
Свойство устанавливается системой nanoCAD автоматически.
Returns: Возвращает объект типа Point3d — координаты точки, полученной в результате объектной привязки.
Если OSNAP активен и точка вычислена — содержит корректные координаты.
Если привязка не применялась — значение может быть неопределённым или совпадать с RawPoint.
Для надёжного использования необходимо проверять флаг в History:
C#

HostMgd.EditorInput.InputPointContext.PointComputed
Свойство предназначено для определения,
была ли успешно вычислена точка ввода на текущем этапе операции.
Свойство возвращает логическое значение, указывающее,
завершила ли система расчёт координат точки ввода
с учётом всех активных режимов — таких как объектная привязка (OSNAP),
сетка, полярное отслеживание, автоматическое выравнивание и другие.
Оно служит флагом готовности:
* true — все необходимые данные получены, и точка считается корректной для использования.
* false — вычисление ещё не завершено, или точка не может быть определена из-за отсутствия данных или конфликтующих условий.
Это свойство особенно важно при работе с событиями PointMonitor и PointFilter,
где необходимо понимать, можно ли уже использовать текущие координаты (
ComputedPoint, ObjectSnappedPoint и др.) для дальнейших действий — например, построения,
отрисовки направляющих или запуска команды.
Оно позволяет избежать обработки неполных или промежуточных состояний ввода,
обеспечивая стабильность и предсказуемость поведения пользовательских команд.
Свойство устанавливается системой nanoCAD автоматически при обновлении контекста ввода.
Returns: Возвращает значение типа bool:
* true — точка полностью вычислена и корректна.
* false — точка ещё не вычислена, находится в состоянии обработки или недоступна.
Рекомендуется использовать в сочетании с другими свойствами контекста:
C#

HostMgd.EditorInput.InputPointContext.RawPoint
Свойство предназначено для получения исходной координаты курсора
до применения привязок, фильтрации или выравнивания.
Свойство возвращает точку в мировой системе координат (WCS),
соответствующую непосредственному положению курсора на экране
или значению, введённому с клавиатуры, до применения любых режимов коррекции —
таких как объектная привязка (OSNAP), сетка, полярное отслеживание,
автоматическое выравнивание и пользовательские фильтры.
Это "сырая" позиция, отражающая первоначальный ввод пользователя.
Значение RawPoint считается корректным только при условии,
что свойство PointComputed установлено в true, что означает
завершение базового этапа обработки точки.
В противном случае значение может быть неактуальным или устаревшим.
Это свойство особенно полезно при реализации:
* пользовательских фильтров ввода (PointFilter),
* динамических подсказок,
* алгоритмов выравнивания,
* команд, где необходимо сравнить исходное положение курсора с привязанной точкой.
Оно позволяет разработчику определить, куда указывал пользователь изначально,
и принять решение о дальнейшей обработке — например, активировать
направляющую линию или применить собственную привязку.
Свойство устанавливается системой nanoCAD.
Returns: Возвращает объект типа Point3d — координаты исходной точки ввода в мировой системе координат (WCS).
Если PointComputed == true — значение актуально и отражает последнее положение курсора.
Если PointComputed == false — значение может быть недействительным или относиться к предыдущему состоянию.
⚠️ Важно: всегда проверяйте PointComputed, прежде чем использовать RawPoint.
Пример:
C#

HostMgd.EditorInput.InputPointContext.ToolTipText
Свойство предназначено для получения текста всплывающей подсказки,
ассоциированной с текущим инструментом или операцией ввода точки.
Свойство предоставляет строку, отображаемую системой nanoCAD
в виде всплывающей подсказки (tooltip) при выполнении интерактивных команд — например,
во время рисования, редактирования или привязки.
Текст обычно определяется текущим активным инструментом (например, "Укажите первую точку", "Выберите объект" и т.п.)
и управляется самим редактором.
Это свойство доступно в контексте событий ввода (PointMonitor, PointFilter) и позволяет разработчику:
* ознакомиться с текущим системным сообщением,
* при необходимости проанализировать состояние команды по её описанию,
* реализовать логику, зависящую от контекста подсказки (например, адаптацию поведения фильтра).
Хотя в описании указано "может быть заменено на возвращение новой строки",
в реальности это свойство только читается из контекста,
и его нельзя программно изменить через присваивание — nanoCAD не предоставляет
механизм переопределения ToolTipText на уровне InputPointContext.
Returns: Возвращает объект типа string — текст всплывающей подсказки, отображаемый в данный момент у курсора.
Если команда активна — содержит актуальное приглашение или пояснение.
Если подсказка отсутствует — может возвращать null или пустую строку.