HostMgd.EditorInput.EditorUserInteraction
Класс позволяет пользователям взаимодействовать с редактором
при помощи диалогового окна. Приложение, которое определяет
модальное диалоговое окно, получает экземпляр класса при
вызове метода Editor.StartUserInteraction(). При
использовании этого объекта, диалоговое окно может вызвать
редактор nanoCAD, чтобы разрешить пользователю произвести
выбор.