Teigha.DatabaseServices.Column
Класс Column представляет столбец диапазона ячеек.
Класс Column представляет столбец диапазона ячеек.

Teigha.DatabaseServices.Column.MinimumWidth
Свойство MinimumWidth представляет минимально допустимую ширину столбца ячеек.
Свойство MinimumWidth представляет минимально допустимую ширину столбца ячеек.
Returns: Возвращает минимальную ширину столбца ячеек.
Тип double.

Teigha.DatabaseServices.Column.Name
Свойство Name представляет имя столбца ячеек.
Свойство Name представляет имя столбца ячеек.
Returns: Возвращает имя столбца ячеек.
Тип String.

Teigha.DatabaseServices.Column.Width
Свойство Width представляет текущую ширину столбца ячеек.
Свойство Width представляет текущую ширину столбца ячеек.
Returns: Возвращает ширину столбца ячеек.
Тип double.