Teigha.DatabaseServices.UnderlayLayerCollection
Класс UnderlayLayerCollection представляет коллекцию слоев подложки.
Класс UnderlayLayerCollection представляет коллекцию слоев подложки.

Teigha.DatabaseServices.UnderlayLayerCollection.CopyTo(array,System.Int32)
Метод предназначен для копирования коллекции слоёв подложки в указанный массив, начиная с позиции с указанным индексом.
Метод предназначен для копирования данной коллекции в указанный массив, начиная с позиции с указанным индексом.
arr: Массив, в который выполняется копирование элементов данной коллекции. Тип UnderlayLayer[].
index: Позиция в массиве, начиная с которой в массив копируются элементы коллекции слоёв. Тип int.

Teigha.DatabaseServices.UnderlayLayerCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет текущее количество элементов в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.DatabaseServices.UnderlayLayerCollection.Item
Свойство Item представляет слой подложки с указанным индексом.
Свойство Item представляет слой подложки, хранящийся в данной коллекции под указанным индексом.
index: Индекс искомого слоя подложки. Тип int.
Returns: Возвращает слой подложки с индексом index.
Тип UnderlayLayer.