Teigha.Colors.EntityColorCollection.ToArray
Метод создает массив объектов EntityColor, содержащий копии всех элементов данной коллекции.
Метод создает массив объектов EntityColor, содержащий копии всех элементов данной коллекции.
Returns: Возвращает массив, содержащий копии всех элементов данной коллекции.
Тип EntityColor[].