HostMgd.EditorInput.PromptNestedEntityResult
Класс содержит результат выбора вложенного геометрического объекта
(внутри блока или внешней ссылки), включая его идентификатор,
точку выбора и матрицу преобразования.
Класс наследуется от PromptEntityResult и расширяет его функционал
возможностью получения данных о вложенном объекте — элементе,
находящемся внутри блока или внешней ссылки.
Он используется при вызове метода GetNestedEntity() и предоставляет информацию:
* ObjectId — идентификатор выбранного вложенного объекта.
* PickedPoint — координаты точки выбора в мировой системе координат (WCS).
* Transform — матрица преобразования, применённая к объекту внутри родительской структуры.
* Status — статус выполнения операции (OK, Cancel, Error и др.).
Этот класс играет ключевую роль при работе с вложенными объектами,
позволяя разработчикам плагинов получать полную информацию
о выбранном элементе и его положении внутри составной сущности чертежа.

HostMgd.EditorInput.PromptNestedEntityResult.ToString(IFormatProvider)
Метод возвращает строковое представление результата выбора вложенного объекта,
отформатированное с учётом заданного провайдера локализации.
Метод предоставляет строковое описание операции выбора вложенного геометрического объекта
— например, идентификатор (ObjectId) выбранного элемента, точку выбора (PickedPoint)
и статус операции. Форматирование значения точки или чисел производится
с учетом переданного через параметр provider формата, что позволяет
корректно отображать координаты и другие данные в соответствии
с региональными настройками пользователя.
Этот метод полезен при разработке мультиязычных надстроек nanoCAD,
где важно сохранить единое представление чисел и дат для разных культур.
provider: Объект, предоставляющий информацию о правилах форматирования данных,
Может быть:
Returns: Возвращает значение типа string, представляющее результат операции выбора в виде строки:
* При успешном завершении (Status == PromptStatus.OK)
— содержит ObjectId и отформатированные координаты точки выбора.
* При отмене или ошибке — текстовое сообщение, соответствующее статусу,
например "Operation cancelled".
Примеры:
* Успешный результат: "Object ID: 12345, Point: (100.50, 200.25, 0.00)" (с InvariantCulture)
* Отмена: "Operation cancelled"

HostMgd.EditorInput.PromptNestedEntityResult.Transform
Свойство возвращает матрицу преобразования,
применённую к выбранному объекту его контейнерами
(например, блоками или внешними ссылками).
Свойство предоставляет доступ к объекту типа Matrix3d,
представляющему собой матрицу аффинного преобразования,
которая определяет, как выбранный вложенный геометрический объект
трансформирован относительно родительского контейнера — например,
повёрнут, смещён или отмасштабирован.
Это значение особенно важно при работе с объектами,
находящимися внутри блоков или внешних ссылок, так как
позволяет учитывать текущее положение и ориентацию объекта
в мировой системе координат (WCS), несмотря на то,
что он хранится в локальной системе координат контейнера.
Свойство доступно только для чтения и формируется автоматически
при завершении операции выбора вложенного объекта,
например, через метод GetNestedEntity().
Returns: Возвращает объект типа Matrix3d, который представляет собой математическую матрицу 4x4,
используемую для преобразования координат из системы контейнера в мировую систему координат (WCS).
Если объект не вложен или преобразование не требуется,
может возвращаться единичная матрица (Matrix3d.Identity), означающая отсутствие изменений.
* Matrix3d.Identity — если преобразование отсутствует.
* Ненулевая матрица — если объект находится внутри блока
с заданными параметрами трансформации.