Teigha.Geometry.Matrix3d.GetScale
Метод предоставляет масштабный коэффициент этой матрицы.
Метод предоставляет масштабный коэффициент этой матрицы.
Масштабный коэффициент равен квадратному корню из самого длинного вектора-столбца линейной части матрицы.
Returns: Возвращает масштабный коэффициент матрицы. Тип double.