Teigha.GraphicsInterface.ShadowParameters
Класс ShadowParameters представляет связанные с тенью свойства источников света.
Класс ShadowParameters представляет связанные с тенью свойства источников света.

Teigha.GraphicsInterface.ShadowParameters.#ctor
Конструктор по умолчанию класса ShadowParameters.
Конструктор по умолчанию класса ShadowParameters.
Notes
Определяет свойства теней значениями по умолчанию:
* Тени включены.
* Тени мягкие.
* Видимость формы источника света отключена.
* Метод расчета теней — трассировка лучей.
* Размер теневой карты — 256.
* Размер выборочной тени — 16.
* Форма протяженного источника света — сфера.
* Длина протяженного источника света — 0.0.
* Ширина протяженного источника света — 0.0.
* Радиус протяженного источника света — 0.0.

Teigha.GraphicsInterface.ShadowParameters.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.ShadowParameters.ExtendedLightLength
Свойство ExtendedLightLength позволяет определить длину протяженного источника света.
Свойство ExtendedLightLength позволяет определить длину протяженного источника света.
Notes
Применяется только для протяженных источников света линейной, прямоугольной или цилиндрической формы, эффекты которых моделируются алгоритмом выборочных теней (по площади).
Returns: Возвращает длину протяженного источника света.
Тип double.

Teigha.GraphicsInterface.ShadowParameters.ExtendedLightRadius
Свойство ExtendedLightRadius позволяет определить радиус протяженного источника света.
Свойство ExtendedLightRadius позволяет определить радиус протяженного источника света.
Notes
Применяется только для протяженных источников, имеющих форму диска, цилиндра или сферы, эффекты которых моделируются алгоритмом выборочных теней (по площади).
Returns: Возвращает радиус протяженного источника света.
Тип double.

Teigha.GraphicsInterface.ShadowParameters.ExtendedLightShape
Свойство ExtendedLightShape позволяет определить форму протяженного источника света.
Свойство ExtendedLightShape позволяет определить форму протяженного источника света.
Notes
Применяется только для протяженных источников, эффекты которых моделируются алгоритмом выборочных теней (по площади).
Returns: Возвращает форму протяженного источника света.
Тип GraphicsInterface.ExtendedLightShape.

Teigha.GraphicsInterface.ShadowParameters.ExtendedLightWidth
Свойство ExtendedLightWidth определяет ширину протяженного источника света.
Свойство ExtendedLightWidth определяет ширину протяженного источника света.
Notes
Применяется только для протяженных источников прямоугольной формы, тени от которых моделируются алгоритмом выборочных теней (по площади).
Returns: Возвращает  ширину протяженного источника света.
Тип double.

Teigha.GraphicsInterface.ShadowParameters.ShadowMapSize
Свойство ShadowMapSize позволяет определить размер теневой карты.
Свойство ShadowMapSize позволяет определить размер теневой карты.
Notes
Применимо только для источников света с теневыми картами.
Returns: Возвращает размер теневой карты (64, 128, 256, 512, 1024, 2048 или 4096).
Тип short.

Teigha.GraphicsInterface.ShadowParameters.ShadowMapSoftness
Свойство ShadowMapSoftness позволяет определить размытость края тени.
Свойство ShadowMapSoftness позволяет определить размытость (мягкость) края тени.
Это значение представляет собой количество пикселей на краю тени, которые смешиваются с базовым изображением.
Returns: Возвращает размытость края тени.
Тип byte.

Teigha.GraphicsInterface.ShadowParameters.ShadowSamples
Свойство ShadowSamples определяет количество лучей, используемых алгоритмом выборочных теней.
Свойство ShadowSamples определяет количество лучей, используемых алгоритмом выборочных теней.
Это значение управляет размытостью (мягкостью) выборочных теней.
Notes
Применяется только для протяженных источников, эффекты которых моделируются алгоритмом выборочных теней (по площади).
Returns: Возвращает количество лучей, используемых алгоритмом выборочных теней.
Тип short.

Teigha.GraphicsInterface.ShadowParameters.ShadowsOn
Свойство ShadowsOn определяет, отбрасывает ли тени данный источник света.
Свойство ShadowsOn определяет, отбрасывает ли тени данный источник света.
Returns: Возвращает true, если источник света отбрасывает тени.
В противном случае возвращает false.

Teigha.GraphicsInterface.ShadowParameters.ShadowType
Свойство ShadowType определяет используемый метод расчета теней, отбрасываемых данным источником света.
Свойство ShadowType определяет используемый метод расчета теней, отбрасываемых данным источником света.
Returns: Возвращает метод расчета теней.
Перечисление GraphicsInterface.ShadowType.

Teigha.GraphicsInterface.ShadowParameters.ShapeVisibility
Свойство ShapeVisibility позволяет определить, видима ли форма источника света при рендеринге.
Свойство ShapeVisibility позволяет определить, видима ли форма источника света при рендеринге.
Returns: Возвращает true, если форма источника света является видимой при рендеринге.
В противном случае возвращает false.