Teigha.GraphicsSystem.SelectionMode.Crossing
Значение: 1.
Область выделения представляет собой прямоугольное окно, заданное по двум точкам на диагонали.
Выделяются объекты, которые целиком оказались в пределах области выделения или пересекают ее границу.