Teigha.Geometry.Matrix3d.IsSingular
Метод позволяет проверить, является ли данная матрица сингулярной.
Метод позволяет проверить, является ли данная матрица сингулярной.
Реализация метода использует вызов Matrix3d.IsSingular(Tolerance tolerance) с точностью, равной Tolerance.Global.
Returns: Возвращает true, если данная матрица является сингулярной, иначе - false.
Notes
* Матрица сингулярна тогда и только тогда, когда ее определитель равен нулю. Такое возможно, например, если какие-либо векторы-столбцы линейной части данной матрицы имеют нулевую длину или оказываются параллельными.
* Сингулярная матрица не может быть инвертирована.