Teigha.DatabaseServices.DgnDefinition
Этот класс представляет определения подложек DGN.
Этот класс представляет определения подложек DGN.
Подложки аналогичны растровым изображениям, за исключением того, что их контент допускает объектные привязки.

Teigha.DatabaseServices.DgnDefinition.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DgnDefinition.#ctor(IntPtr,System.Boolean)
Конструктор класса DgnDefinition.
Конструктор класса DgnDefinition.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.DgnDefinition.SetShowRasterRef
Свойство позволяет установить логический флаг, определяющий, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки.
Свойство позволяет установить логический флаг, определяющий, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки.
Returns: Возвращает true, если требуется отображать растровые изображения.
В противном случае возвращает false.

Teigha.DatabaseServices.DgnDefinition.ShowRasterRef
Свойство возвращает значение логического флага, который определяет, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки (xref).
Свойство возвращает значение логического флага, который определяет, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки (xref).
Returns: Возвращает true, если растровые изображения отображаются.
В противном случае возвращает false.

Teigha.DatabaseServices.DgnDefinition.UseMasterUnits
Свойство определяет, должна ли подложка использовать основные единицы измерения из файла DGN при преобразовании из формата DGN в формат DWG.
Если основные единицы не используются, то используются вспомогательные.
Свойство определяет, должна ли подложка использовать основные единицы измерения из файла DGN при преобразовании из формата DGN в формат DWG.
Если основные единицы не используются, то используются вспомогательные.
Returns: Возвращает true, если подложка должна использовать основные единицы измерения из файла DGN.
В противном случае возвращает false.

Teigha.DatabaseServices.DgnDefinition.XrefDepth
Свойство представляет значение глубины вложенности внешней ссылки, которое используется при экспорте файла DWG в формат DGN.
При преобразовании из DWG в DGN подложки DGN становятся внешними ссылками DGN с указанным значением глубины вложенности.
Свойство представляет значение глубины вложенности внешней ссылки, которое используется при экспорте файла DWG в формат DGN.
При преобразовании из DWG в DGN подложки DGN становятся внешними ссылками DGN с указанным значением глубины вложенности.
Returns: Возвращает глубину вложенности внешних ссылок. Тип int.