HostMgd.PlottingServices.EndPlotEventArgs
Класс EndPlotEventArgs предоставляет данные, специфичные для вывода чертежа на печать и
необходимые для события PlotReactorManager.EndPlot.
Класс EndPlotEventArgs является наследником класса System.EventArgs и в .NET API nanoCAD
предоставляет данные, специфичные для вывода листа на печать и необходимые для события PlotReactorManager.EndPlot.
Эти данные включают состояние флага PlotCancelStatus.
Используется совместно с делегатом HostMgd.PlottingServices.EndPlotEventHandler.

HostMgd.PlottingServices.EndPlotEventArgs.#ctor(HostMgd.PlottingServices.PlotCancelStatus)
Конструктор класса EndPlotEventArgs.
Конструктор класса EndPlotEventArgs.
Создает экземпляр класса с указанным значением флага HostMgd.PlottingServices.PlotCancelStatus.
status: Входное значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.

HostMgd.PlottingServices.EndPlotEventArgs.PlotCancelStatus
Свойство PlotCancelStatus возвращает текущий статус печати.
Свойство PlotCancelStatus возвращает текущий статус печати.
Returns: Возвращает текущий статус печати как значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.

HostMgd.PlottingServices.EndPlotEventArgs.Status
Свойство Status представляет текущий статус задания на печать.
Свойство Status представляет текущий статус задания на печать.
Returns: Возвращает текущий статус задания на печать.
Значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.