HostMgd.EditorInput.SelectionFilter
Класс, описывающий виды фильтров, которые применяются к
объектам при выборе объектов после приглашения.
Класс, описывающий виды фильтров, которые применяются к
объектам при выборе объектов после приглашения.
Представляет собой контейнер для хранения массива значений
TypedValue. Структура TypedValue является аналогом структуры
resbuf в небезопасном коде и хранит два поля:
1. TypeCode (System.Int16)
2. Value (System.Object)
Значение TypeCode является кодом, определяющим тип Value.
Например:
0 - Entity type group. Value = "CIRCLE", "LINE" и пр.
2 - Имя блока. Value - строка.
3 - имя DIMSTYLE
6 - Line Type
7 - text style
8 - имя Layer. Возможно применение символа "*".
40 - Radius
62 - Entity color. Value - как строковое значение, так и
индекс цвета.

HostMgd.EditorInput.SelectionFilter.#ctor(array)
Конструктор класса.
value: Опиание назначения парамтра приведено в описании