Teigha.DatabaseServices.Solid3d.CleanBody
Метод позволяет удалить все избыточные ребра и грани, которые не являются необходимыми для обеспечения топологии данного твердого тела.
Метод позволяет удалить все избыточные ребра и грани, которые не являются необходимыми для обеспечения топологии данного твердого тела.