Teigha.GraphicsInterface.MaterialDiffuseComponent
Класс MaterialDiffuseComponent представляет диффузный компонент материала.
Класс MaterialDiffuseComponent представляет диффузный компонент (диффузный канал) материала,
который состоит из цвета материала и карты материала.

Teigha.GraphicsInterface.MaterialDiffuseComponent.#ctor(Teigha.GraphicsInterface.MaterialColor,Teigha.GraphicsInterface.MaterialMap)
Конструктор класса MaterialDiffuseComponent.
Создает объект с указанными цветом и текстурой материала.
Конструктор класса MaterialDiffuseComponent.
Создает объект с указанными цветом и текстурой материала.
color: Цвет материала.  Тип MaterialColor.
map: Карта материала. Тип MaterialMap.

Teigha.GraphicsInterface.MaterialDiffuseComponent.Equals(Object)
Метод реализует проверку равенства данного объекта и указанного объекта.
Метод реализует проверку равенства данного объекта и указанного объекта.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialDiffuseComponent.ToString(IFormatProvider)
Метод предоставляет эквивалентное строковое представление данного объекта, сформированное с учетом переданных региональных и языковых настроек.
Метод предоставляет эквивалентное строковое представление данного объекта, сформированное с учетом переданных региональных и языковых настроек.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данного объекта.
Тип String.

Teigha.GraphicsInterface.MaterialDiffuseComponent.!=(Teigha.GraphicsInterface.MaterialDiffuseComponent,Teigha.GraphicsInterface.MaterialDiffuseComponent)
Оператор неравенства класса MaterialDiffuseComponent.
Оператор неравенства класса MaterialDiffuseComponent.
Notes
Условием неравенства двух экземпляров класса MaterialDiffuseComponent является нарушение хотя бы одного из следующих требований:
* Карта материала левого операнда идентична карте материала правого операнда (оба могут быть null).
* Цвет  материала левого операнда идентичен цвету материала правого операнда (оба могут быть null).
a: Левый  операнд. Тип MaterialDiffuseComponent.
b: Правый операнд. Тип MaterialDiffuseComponent.
Returns: Возвращает true, если левый операнд не равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialDiffuseComponent.==(Teigha.GraphicsInterface.MaterialDiffuseComponent,Teigha.GraphicsInterface.MaterialDiffuseComponent)
Оператор равенства класса MaterialDiffuseComponent.
Оператор равенства класса MaterialDiffuseComponent.
Notes
Условием равенства двух экземпляров класса MaterialDiffuseComponent является одновременное выполнение следующих требований:
* Карта материала левого операнда идентична карте материала правого операнда (оба могут быть null).
* Цвет  материала левого операнда идентичен цвету материала правого операнда (оба могут быть null).
a: Левый  операнд. Тип MaterialDiffuseComponent.
b: Правый операнд. Тип MaterialDiffuseComponent.
Returns: Возвращает true, если левый операнд равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialDiffuseComponent.Color
Свойство Color представляет текущее значение диффузного (рассеянного) цвета.
Свойство Color представляет текущее значение диффузного (рассеянного) цвета.
Returns: Возвращает значение диффузного (рассеянного) цвета.
Тип MaterialColor.

Teigha.GraphicsInterface.MaterialDiffuseComponent.Map
Свойство Map представляет карту материала данного диффузного компонента.
Свойство Map представляет карту материала данного диффузного компонента.
Returns: Возвращает карту материала данного объекта.
Тип MaterialMap.