Teigha.GraphicsInterface.VertexData
Класс VertexData представляет контейнер для массивов атрибутов вершин сетей и оболочек.
Класс VertexData является контейнером для массивов атрибутов вершин сетей и оболочек.
Notes
Объекты VertexData используются как опциональные аргументы для соответствующих методов классов WorldGeometry и ViewportGeometry.

Teigha.GraphicsInterface.VertexData.get_MappingCoords(Teigha.GraphicsInterface.MapChannel)
Метод предназначен для получения массива координат наложения карты материала для вершин,
используемых объектом VertexData.
Метод предназначен для получения массива координат наложения карты материала для вершин,
используемых объектом VertexData.
mapChannel: Канал наложения карты. Значение из перечисления MapChannel.
Returns: Возвращает массив координат наложения карты материала для канала карты mapChannel или NULL, если для канала передано значение, отличное от MapChannel.AllChannels или MapChannel.MapChannels.
Тип Point3d[].

Teigha.GraphicsInterface.VertexData.set_MappingCoords(Teigha.GraphicsInterface.MapChannel,array)
Метод позволяет задать массив координат наложения карты материала для вершин, используемых объектом VertexData.
Метод позволяет задать массив координат наложения карты материала для вершин, используемых объектом VertexData.
Аргумент mapChannel дает возможность указать канал карты материала.
Notes
Для каждой вершины в сети или оболочке указывается по одной координате наложения.
Массив должен иметь точно такое же количество элементов, сколько вершин имеет сеть или оболочка.
В аргументе coords следует передать значение NULL, если спецификация координат наложения нежелательна для указанного канала карты материала. NULL является значением по умолчанию для всех каналов карты.
mapChannel: Канал наложения карты. Значение из перечисления MapChannel.
coords: Массив координат наложения карты материала. Тип Point3d[].

Teigha.GraphicsInterface.VertexData.SetNormalVectors(array)
Метод позволяет задать массив нормалей для вершин, используемых данным объектом VertexData.
Устанавливает массив normal как массив нормалей для вершин, используемых данным объектом VertexData.
Notes
Массив normal должен передавать по одному элементу для каждой вершины сети или оболочки или значение NULL, если спецификация нормали в вершинах не требуется.
Каждый из элементов входного массива должен представлять собой допустимый вектор в системе координат модели, который затем используется как нормаль для соответствующей вершины в массиве вершин сети или оболочки.
normal: Массив нормалей для вершин. Тип Vector3d[].

Teigha.GraphicsInterface.VertexData.SetTrueColors(array)
Метод позволяет задать массивом цвета вершин, используемых данным объектом.
Метод позволяет задать массивом цвета вершин, используемых данным объектом.
colors: Входной массив цветов для вершин.

Teigha.GraphicsInterface.VertexData.OrientationFlag
Свойство OrientationFlag представляет тип ориентации, определяющий положительное направление нормалей в вершинах.
Свойство OrientationFlag представляет тип ориентации, определяющий положительное направление нормалей в вершинах.
Returns: Возвращает тип ориентации нормалей в вершинах.
Значение из перечисления OrientationType.