HostMgd.EditorInput.PromptKeywordOptionsEventArgs
Класс предоставляет данные для события PromptingForKeyword,
позволяя настроить параметры ввода ключевого слова перед началом операции.
Класс используется для передачи параметров, связанных с началом операции
ввода ключевого слова — например, при вызове GetString() с набором ключевых слов.
Он предоставляет доступ к объекту PromptKeywordOptions, содержащему:
* текст приглашения (Message),
* список доступных ключевых слов (Keywords),
* глобальные ключевые слова ,
* режимы ввода (например, обязательный выбор).
Этот класс применяется в обработчике события PromptingForKeyword,
где разработчик может динамически изменять параметры ввода в зависимости от контекста
— например, показывать разные варианты выбора в зависимости от состояния чертежа.
Example
C#

HostMgd.EditorInput.PromptKeywordOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при вводе ключевого слова.
Свойство содержит настройки, применяемые к операции ввода ключевого слова
— например, при вызове метода GetString() с заданными ключевыми словами.
Оно используется в обработчике события PromptingForKeyword, чтобы дать разработчику
возможность изменить параметры ввода до начала взаимодействия с пользователем.
Через это свойство можно:
* изменить текст приглашения (Message),
* добавить или удалить ключевые слова через Keywords,
* задать глобальные ключевые слова,
* настроить поведение ввода (например, требуется ли выбор).
Returns: Возвращает объект типа PromptKeywordOptions.
Если параметры не были инициализированы, может вернуть null.