Teigha.BoundaryRepresentation.MeshEntity.GetHashCode
Метод позволяет получить хеш-код для данного объекта.
Метод позволяет получить хеш-код для данного объекта.
Returns: Возвращает хеш-код данного объекта.
Тип int.