Teigha.Runtime.CommandClassAttribute
Класс CommandClassAttribute представляет пользовательские атрибуты, которые используются для обозначения типа как класса команд приложения.
Класс CommandClassAttribute представляет пользовательские атрибуты, которые используются для обозначения типа как класса команд приложения.
Атрибут CommandClass может быть объявлен для любого типа, который определяет обработчик команды nanoCAD.
Если приложение использует атрибут CommandClass, оно должно объявить экземпляр этого атрибута для каждого типа, который содержит метод обработчика команды nanoCAD.
nanoCAD запрашивает сборку приложения на предмет одного или нескольких атрибутов CommandClass.
Если экземпляры этого атрибута найдены, nanoCAD ищет только связанные с ними типы для методов команд.
В противном случае выполняется поиск среди всех экспортированных типов.

Teigha.Runtime.CommandClassAttribute.#ctor(Type)
Конструктор класса CommandClassAttribute. Создает экземпляр класса с указанным именем.
Конструктор класса CommandClassAttribute. Создает экземпляр класса с указанным именем.
name: Имя атрибута.

Teigha.Runtime.CommandClassAttribute.Type
Свойство Type представляет тип объекта, связанный с данным атрибутом.
Свойство Type представляет тип объекта, связанный с данным атрибутом.
Returns: Возвращает тип объекта.
Тип System.Type.