Teigha.DatabaseServices.GeometryOverrule
Абстрактный класс Teigha.DatabaseServices.GeometryOverrule определяет связанные с геометрией методы объектных переопределений.
Абстрактный класс Teigha.DatabaseServices.GeometryOverrule определяет связанные с геометрией методы объектных переопределений.

Teigha.DatabaseServices.GeometryOverrule.GetGeomExtents(Teigha.DatabaseServices.Entity)
Метод GetGeomExtents возвращает минимальный прямоугольный параллелепипед, в который вписан заданный экземпляр класса Entity.
Метод GetGeomExtents возвращает минимальный прямоугольный параллелепипед, в который вписан заданный экземпляр класса Entity.
Прямоугольный параллелепипед ориентирован по осям системы координат.
entity: Входной объект типа Entity, для которого определяются границы.
Returns: Возвращает экземпляр класса Extents3d для аргумента entity.

Teigha.DatabaseServices.GeometryOverrule.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Plane,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод находит точки пересечения двух объектов чертежа.
Метод находит точки пересечения двух объектов чертежа.
entity: Первый объект, экземпляр класса Entity,
ent: Второй объект, экземпляр класса Entity,
intType: Значение перечисления Teigha.DatabaseServices.Intersect,
Plane projPlane: Плоскость проекции, экземпляр класса Plane,
points: Коллекция Point3dCollection точек пересечения,
thisGsMarker: Первый указатель IntPtr,
otherGsMarker: Второй указатель IntPtr.

Teigha.DatabaseServices.GeometryOverrule.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод находит точки пересечения двух объектов чертежа.
Метод находит точки пересечения двух объектов чертежа.
entity: Первый объект, экземпляр класса Entity,
ent: Второй объект, экземпляр класса Entity,
intType: Значение перечисления Teigha.DatabaseServices.Intersect,
points: Коллекция Point3dCollection точек пересечения,
thisGsMarker: Первый указатель IntPtr,
otherGsMarker: Второй указатель IntPtr.

Teigha.DatabaseServices.GeometryOverrule.SetExtensionDictionaryEntryFilter(String)
Метод делает возможным поиск в словаре расширений, чтобы установить необходимость применения объектных переопределений.
Делает возможным поиск в словаре расширений, чтобы установить необходимость применения  объектных переопределений.
Используйте этот метод, если требуется, чтобы nanoCAD искал в словаре расширений запись с именем entryName для объекта с переопределениями перед вызовом любого из ваших переопределений. Переопределения не будут вызываться, если entryName отсутствует в словаре расширений.
entryName: Имя входного объекта, тип String.

Teigha.DatabaseServices.GeometryOverrule.SetIdFilter(array)
Метод реализует фильтрацию объектов по ObjectId перед применением объектного переопределения.
Метод реализует фильтрацию объектов по ObjectId перед применением объектного переопределения.
Используйте этот метод, когда nanoCAD должен вызывать ваше переопределение только для объектов, чьи идентификаторы присутствуют в указанном массиве.
ids: Входной массив объектов ObjectId.

Teigha.DatabaseServices.GeometryOverrule.SetXDataFilter(String)
Позволяет задать условие применения объектного переопределения на основе расширенных данных (xdata).
Позволяет задать условие применения объектного переопределения на основе расширенных данных (xdata).
Используйте этот метод, если требуется, чтобы nanoCAD искал в объекте расширенные данные xdata с именем registeredApplicationName перед применением к нему любого из ваших переопределений.
registeredApplicationName: Имя зарегистрированного приложения, тип String.