HostMgd.EditorInput.Editor.TurnForcedPickOff
Метод отключает принудительный выбор объектов и возвращает предыдущее состояние режима выборки.
Метод используется для временного отключения режима принудительного выбора объектов (forced pick),
который может быть активирован другим методом или командой.
Этот режим заставляет пользователя выбирать объекты мышью, игнорируя автоматическое выделение
по окну или другим способам. Метод возвращает предыдущее значение состояния режима,
чтобы можно было восстановить его при необходимости.
Returns: Возвращает значение типа int, представляющее предыдущее состояние режима принудительного выбора:
* 0 — режим был выключен.
* 1 — режим был включен.
Это значение можно использовать для последующего восстановления исходного состояния
после выполнения операции, требующей принудительного выбора.
Example
C#