HostMgd.EditorInput.Editor.PromptingForDistance
Событие возникает при начале интерактивной операции ввода расстояния,
позволяя настроить параметры команды до её запуска.
Событие не реализовано.
Событие инициируется в момент начала операции ввода расстояния —
например, перед вызовом метода GetDistance() или GetAngle() с параметром расстояния.
Оно предоставляет доступ к параметрам ввода через объект PromptDistanceOptionsEventArgs,
что позволяет динамически изменять:
* сообщение приглашения (Message),
* начальное значение расстояния (DefaultValue),
* режимы ввода (AllowNone, AllowNegative и др.).
Это событие особенно полезно при разработке интерактивных команд,
где требуется гибкая настройка параметров ввода расстояния в зависимости от контекста.
Example
C#