Teigha.DatabaseServices.ClipBoundaryType
Перечисление ClipBoundaryType определяет типы границ обрезки растровых изображений.
Перечисление ClipBoundaryType определяет типы границ обрезки растровых изображений.