Teigha.Geometry.Matrix2d.IsUniscaledOrtho
Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу.
Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу.
Используется вызов метода Matrix2d.IsUniscaledOrtho(Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
Returns: Возвращает true, если в пределах используемой точности векторы в линейной части матрицы можно считать равными по длине и перпендикулярными друг другу. В противном случае возвращает false.