Teigha.Geometry.Vector2d.GetPerpendicularVector
Метод предоставляет 2D-вектор, ортогональный данному вектору.
Метод предоставляет 2D-вектор с координатами (-y, x), ортогональный данному вектору.
Returns: Возвращает вектор с координатами (-y, x), ортогональный данному вектору.
Тип Vector2d.