Teigha.DatabaseServices.Layout.GetViewports
Метод возвращает коллекцию ObjectId всех видовых экранов, присутствующих в пространстве листа.
Метод возвращает коллекцию ObjectId всех видовых экранов, присутствующих в пространстве листа.
Первым в списке будет ObjectId видового экрана пространства листа.
Если возвращаемый список пуст, то этот лист ни разу  не переключался (не был активирован).
Список обновляется при каждой активации листа и поддерживается в актуальном состоянии, пока этот лист активен (список актуализируется при каждом добавлении или удалении видовых экранов).
Returns: Возвращает коллекцию ObjectId всех видовых экранов, тип ObjectIdCollection.