Teigha.LayerManager.LayerFilter.GenerateNested
Метод предназначен для генерации вложенного фильтра.
Метод предназначен для генерации вложенного фильтра.
Вызывается фреймворком ObjectDBX после загрузки фильтра из постоянного хранилища.