Teigha.GraphicsInterface.EdgeStyleApply
Перечисление EdgeStyleApply определяет, к каким элементам геометрии при отрисовке применяется стиль рёбер.
Перечисление EdgeStyleApply определяет, к каким элементам геометрии при отрисовке применяется стиль рёбер.