Teigha.DatabaseServices.XrefOperation.XrefResolveOperation
Значение: 6.
Операция разрешает существующие внешние ссылки в HostDb.
HostDb не должна указывать на базу данных, которая является основной базой данных для документа в nanoCAD (т.е. она не должна указывать на базу данных, загруженную в редакторе nanoCAD).