Teigha.DatabaseServices.Field.ConvertToTextField
Метод предоставляет возможность преобразовать поле в текстовое. Не реализовано.
Метод предоставляет возможность преобразовать поле в текстовое. Не реализовано.