Teigha.DatabaseServices.Surface.ConvertToRegion
Метод позволяет для каждой грани данной поверхности создать объект области Region.
Метод позволяет для каждой грани данной поверхности создать объект области Region.
Исходная поверхность должна быть плоской.
Notes
Этот метод реализован только в среде пространственного моделирования.
Returns: Возвращает массив объектов Region, созданных на основе граней данной поверхности. Тип Entity[].