HostMgd.EditorInput.CrossingOrWindowSelectedSubObject
Класс, инкапсулирующий подобъект, который выбран при
выделении окном или пересечением с окном.

HostMgd.EditorInput.CrossingOrWindowSelectedSubObject.#ctor(Teigha.DatabaseServices.FullSubentityPath,HostMgd.EditorInput.SelectionMethod,System.Int32)
Конструктор.
path: Путь к объекту
method: Метод выбора объекта
gsMarker: GS маркер

HostMgd.EditorInput.CrossingOrWindowSelectedSubObject.ToString(IFormatProvider)
Возвращает строковое представление данного объекта в формате
(зависящем от локализации), определенном параметром метода.
Метод не реализован.
provider: Формат, зависящий от локализации