Teigha.GraphicsInterface.MaterialColor
Класс MaterialColor представляет цвета материалов.
Класс MaterialColor представляет цвета материалов.

Teigha.GraphicsInterface.MaterialColor.#ctor
Конструктор по умолчанию класса MaterialColor.
Конструктор по умолчанию класса MaterialColor.
Создает объект с наследованием цвета с коэффициентом смешивания 1.0.

Teigha.GraphicsInterface.MaterialColor.#ctor(Teigha.GraphicsInterface.Method,System.Double,Teigha.Colors.EntityColor)
Конструктор класса MaterialColor.
Создает объект с указанным цветом, методом цвета и коэффициентом смешивания.
Конструктор класса MaterialColor.
Создает объект с указанным цветом, методом цвета и коэффициентом смешивания.
method: Метод цвета. Тип Method.
factor: Коэффициент смешивания. Тип double.
color: Цвет материала. Тип EntityColor.

Teigha.GraphicsInterface.MaterialColor.Equals(Object)
Метод реализует проверку равенства данного объекта и указанного объекта.
Метод реализует проверку равенства данного объекта и указанного объекта.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialColor.Color
Свойство Color представляет текущее значение цвета материала.
Свойство Color представляет текущее значение цвета материала.
Returns: Возвращает текущее значение цвета материала.
Тип EntityColor.

Teigha.GraphicsInterface.MaterialColor.Factor
Свойство Factor представляет текущее значение коэффициента смешивания.
Свойство Factor представляет текущее значение коэффициента смешивания (масштабный коэффициент).
Значение 0.0 соответствует черному цвету, значение 1.0 указывает на то, что цвета остаются неизменными.
Returns: Возвращает текущее значение коэффициента смешивания.
Тип double.

Teigha.GraphicsInterface.MaterialColor.Method
Свойство Method представляет текущий метод назначения цвета (наследование или переопределение).
Свойство Method представляет текущий метод назначения цвета (наследование или переопределение).
Returns: Возвращает  текущий метод назначения цвета.
Значение из перечисления GraphicsInterface.Method.