Teigha.Geometry.Point3d.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает представление данного объекта в виде строки. Тип String.