Teigha.DatabaseServices.FileOpenMode
Перечисление FileOpenMode определяет поддерживаемые режимы открытия резидентных объектов базы данных.
Перечисление FileOpenMode определяет поддерживаемые режимы открытия резидентных объектов базы данных.