Teigha.DatabaseServices.ObjectIdCollection
Класс представляет коллекцию идентификаторов объектов ObjectId.
Класс представляет коллекцию идентификаторов объектов ObjectId.

Teigha.DatabaseServices.ObjectIdCollection.#ctor
Конструктор по умолчанию класса ObjectIdCollection.
Конструктор по умолчанию класса ObjectIdCollection.

Teigha.DatabaseServices.ObjectIdCollection.#ctor(array)
Конструктор класса ObjectIdCollection. Создает коллекцию из массива идентификаторов объектов ObjectId.
Конструктор класса ObjectIdCollection. Создает коллекцию из массива идентификаторов объектов ObjectId.
values: Входной массив идентификаторов объектов. Тип ObjectId[].

Teigha.DatabaseServices.ObjectIdCollection.Add(Teigha.DatabaseServices.ObjectId)
Метод позволяет добавить в коллекцию указанный идентификатор объекта.
Метод позволяет добавить в коллекцию указанный идентификатор объекта.
value: Добавляемый идентификатор объекта. Тип ObjectId.
Returns: Возвращает индекс вновь добавленного элемента коллекции. Тип int.

Teigha.DatabaseServices.ObjectIdCollection.Contains(Teigha.DatabaseServices.ObjectId)
Метод позволяет проверить, содержит ли данная коллекция указанный объект ObjectId.
Метод позволяет проверить, содержит ли данная коллекция указанный объект ObjectId.
value: Проверяемый идентификатор объекта. Тип ObjectId.
Returns: Возвращает true, если идентификатор value в коллекции присутствует.
В противном случае возвращает false.

Teigha.DatabaseServices.ObjectIdCollection.CopyTo(array,System.Int32)
Метод предназначен для копирования этой коллекции идентификаторов объектов в указанный массив по указанному индексу.
Метод предназначен для копирования этой коллекции идентификаторов объектов в указанный массив a по указанному индексу index.
a: Целевой массив. Тип ObjectId[].
index: Индекс в массиве a, начиная с которого в массиве сохраняются идентификаторы объектов из данной коллекции.

Teigha.DatabaseServices.ObjectIdCollection.IndexOf(Teigha.DatabaseServices.ObjectId)
Метод предоставляет индекс идентификатора объекта в данной коллекции, соответствующий указанному идентификатору объекта.
Метод предоставляет индекс идентификатора объекта в данной коллекции, соответствующий указанному идентификатору объекта.
value: Входной идентификатор объекта, для которого ищется индекс. Тип ObjectId.
Returns: Возвращает индекс идентификатора объекта. Тип int.
Если искомый идентификатор в коллекции отсутствует, метод возвращает -1.

Teigha.DatabaseServices.ObjectIdCollection.Insert(System.Int32,Teigha.DatabaseServices.ObjectId)
Метод позволяет вставить указанный идентификатор объекта в коллекцию по указанному индексу.
Метод позволяет вставить указанный идентификатор объекта в коллекцию по указанному индексу.
Этот метод выбрасывает исключение ArgumentOutOfRangeException, если предоставленный индекс недействителен.
index: Индекс позиции добавляемого элемента. Тип int.
value: Добавляемый идентификатор объекта. Тип ObjectId.

Teigha.DatabaseServices.ObjectIdCollection.Remove(Teigha.DatabaseServices.ObjectId)
Метод удаляет из коллекции элемент, соответствующий аргументу.
Метод удаляет из коллекции элемент, соответствующий аргументу.
value: Идентификатор объекта, который следует удалить из коллекции. Тип ObjectId.

Teigha.DatabaseServices.ObjectIdCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции идентификатор объекта с указанным индексом.
Метод удаляет из коллекции идентификатор объекта с указанным индексом.
index: Индекс удаляемого элемента коллекции. Тип int.

Teigha.DatabaseServices.ObjectIdCollection.Count
Свойство представляет общее количество идентификаторов объектов в этой коллекции.
Свойство представляет общее количество идентификаторов объектов в этой коллекции.
Returns: Возвращает общее количество элементов в коллекции. Тип int.

Teigha.DatabaseServices.ObjectIdCollection.Item
Свойство предоставляет доступ к элементу коллекции по его индексу.
Свойство предоставляет доступ к элементу коллекции по его индексу.
index: Индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции. Тип ObjectId.