Teigha.Geometry.Vector3dCollectionEnumerator.Reset
Метод выполняет сброс данного перечислителя в исходное состояние.
Метод выполняет сброс данного перечислителя в исходное состояние, устанавливая текущий индекс перечислителя на -1.