Teigha.DatabaseServices.Section
Класс Section представляет объект секущей плоскости.
Класс Section представляет объект секущей плоскости.

Teigha.DatabaseServices.Section.#ctor
Конструктор по умолчанию класса Section.
Конструктор по умолчанию класса Section.

Teigha.DatabaseServices.Section.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d)
Конструктор класса Section. Создает экземпляр класса с использованием указанных точек и вектора.
Конструктор класса Section. Создает экземпляр класса с использованием указанных точек и вектора.
pts: Коллекция точек, определяющих секущую плоскость. Тип Point3dCollection. Совпадающие точки в этой коллекции не допускаются. Должна содержать как минимум две точки.
verticalDir: Вектор вертикального направления, перпендикулярный линии сечения. Тип Vector3d.

Teigha.DatabaseServices.Section.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса Section. Создает экземпляр класса с указанными параметрами.
Конструктор класса Section. Создает экземпляр класса с указанными параметрами.
pts: Коллекция точек, определяющих секущую плоскость. Тип Point3dCollection. Совпадающие точки в этой коллекции не допускаются. Должна содержать как минимум две точки.
verticalDir: Вектор вертикального направления, перпендикулярный линии сечения. Тип Vector3d.
vecViewingDir: Вектор направления просмотра. Тип Vector3d.

Teigha.DatabaseServices.Section.AddVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет добавить в плоскость сечения новую вершину.
Метод позволяет добавить в плоскость сечения новую вершину.
Чтобы новая вершина была добавлена после последней вершины, аргумент nInsertAt должен быть меньше нуля или равен или больше общего количества вершин.
nInsertAt: Индекс, по которому добавляется новая вершина. Тип int.
pt: Координаты добавляемой вершины. Тип Point3d.

Teigha.DatabaseServices.Section.CreateJog(Teigha.Geometry.Point3d)
Метод позволяет создать излом в указанной точке на линии сечения.
Метод позволяет создать излом в указанной точке на линии сечения.
ptOnSection: Координаты точки на линии сечения. Тип Point3d.

Teigha.DatabaseServices.Section.GenerateSectionGeometry(Teigha.DatabaseServices.Entity,[Out]Array%,[Out]Array%,[Out]Array%,[Out]Array%,[Out]Array%)
Метод предназначен для формирования геометрии сечения.
Метод предназначен для формирования 2D- или 3D-геометрии сечения.
Операция применима к следующим объектам чертежа:  3dSolid, Surface, Body и Region.
pEnt: Входной объект чертежа, тип которого допустим для построения сечения. Тип Entity.
pIntFillEnts: Выходной массив, содержащий геометрию границ разрезов. Тип Array.
pBackgroundEnts: Выходной массив, содержащий объекты штриховки разрезов. Тип Array.
pForegroundEnts: Выходной массив, содержащий геометрию объектов фона. Тип Array.
pFurveTangencyEnts: Выходной массив, содержащий геометрию объектов переднего плана. Тип Array.
pCurveTangencyEnts: Выходной массив, содержащий объекты касательных к кривой. Тип Array.

Teigha.DatabaseServices.Section.GetVertex(System.Int32)
Метод позволяет получить вершину по ее индексу.
Метод позволяет получить вершину по ее индексу.
nIndex: Входной индекс вершины. Тип int.
Returns: Возвращает вершину с указанным индексом. Тип Point3d.

Teigha.DatabaseServices.Section.GetVertices(Teigha.Geometry.Point3dCollection)
Метод позволяет получить все вершины секущей плоскости.
Метод позволяет получить все вершины секущей плоскости.
pts: Коллекция вершин. Тип Point3dCollection.

Teigha.DatabaseServices.Section.Height(Teigha.DatabaseServices.SectionHeight)
Метод предназначен для вычисления высоты секущей плоскости для указанного типа высоты.
Метод предназначен для вычисления высоты секущей плоскости для указанного типа высоты (выше или ниже линии сечения).
Если типом секущей плоскости является плоскость или граница, возвращаемая высота является высотой индикатора  секущей плоскости (или границы).
Если типом секущей плоскости является объем, возвращается высота разреза.
nHeightType: Задает тип вычисляемой высоты (выше или ниже линии сечения). Перечисление SectionHeight.
Returns: Возвращает вычисленное значение высоты. Тип double.

Teigha.DatabaseServices.Section.HitTest(Teigha.Geometry.Point3d)
Метод проверяет попадание указанной точки на секущую плоскость.
Метод проверяет попадание указанной точки на секущую плоскость и возвращает результат в виде объекта SectionHitTestInfo.
ptHit: Координаты проверяемой точки. Тип Point3d.
Returns: Возвращает результат проверки на попадание.
Тип SectionHitTestInfo.

Teigha.DatabaseServices.Section.RemoveVertex(System.Int32)
Метод предназначен для удаления из секущей плоскости вершины с указанным индексом.
Метод предназначен для удаления из секущей плоскости вершины с указанным индексом.
Первую вершину удалить нельзя.
nIndex: Индекс удаляемой вершины. Тип int.

Teigha.DatabaseServices.Section.SetHeight(Teigha.DatabaseServices.SectionHeight,System.Double)
Метод позволяет задать высоту индикатора секущей плоскости выше или ниже линии сечения.
Метод позволяет задать высоту индикатора секущей плоскости выше или ниже линии сечения.
Используется, когда типом секущей плоскости является плоскость или граница, поскольку в этих случаях разрез в вертикальном направлении бесконечен.
nHeightType: Входной тип высоты из перечисления SectionHeight (выше или ниже линии сечения).
fHeight: Входное значение высоты. Тип double.

Teigha.DatabaseServices.Section.SetVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет задать координаты вершины с указанным индексом.
Метод позволяет задать координаты вершины с указанным индексом.
nIndex: Индекс вершины. Тип int. Отсчет индексов ведется от нуля. Передаваемое в метод значение индекса  должно быть меньше текущего количества вершин.
pt: Новые координаты вершины.  Тип Point3d.

Teigha.DatabaseServices.Section.BottomPlane
Свойство BottomPlane представляет высоту индикатора секущей плоскости ниже линии сечения.
Свойство BottomPlane представляет высоту индикатора секущей плоскости ниже линии сечения.
Returns: Возвращает высоту индикатора. Тип double.

Teigha.DatabaseServices.Section.Boundary
Свойство Boundary представляет секущую плоскость, ограниченную линией сечения, двумя боковыми линиями и задней линией.
Свойство Boundary представляет секущую плоскость, ограниченную линией сечения, двумя боковыми линиями и задней линией.
Returns: Возвращает список точек границы. Тип IList\.

Teigha.DatabaseServices.Section.Elevation
Свойство Elevation представляет уровень плоскости по оси Z.
Свойство Elevation представляет уровень плоскости по оси Z.
Returns: Возвращает значение координаты Z.
Тип double.

Teigha.DatabaseServices.Section.IndicatorFillColor
Свойство IndicatorFillColor представляет цвет заливки индикатора секущей плоскости.
Свойство IndicatorFillColor представляет цвет заливки индикатора секущей плоскости.
Returns: Возвращает цвет заливки. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.Section.IndicatorTransparency
Свойство IndicatorTransparency представляет прозрачность индикатора секущей плоскости в интервале [1–100].
Свойство IndicatorTransparency представляет прозрачность индикатора секущей плоскости в интервале [1–100].
Returns: Возвращает прозрачность индикатора. Тип int.

Teigha.DatabaseServices.Section.IsLiveSectionEnabled
Свойство IsLiveSectionEnabled позволяет определить, включен ли режим псевдоразреза.
Свойство IsLiveSectionEnabled позволяет определить, включен ли режим псевдоразреза.
Returns: Возвращает true, если режим псевдоразреза активен.
В противном случае возвращает false.

Teigha.DatabaseServices.Section.Name
Свойство Name представляет имя секущей плоскости.
Свойство Name представляет имя секущей плоскости.
Returns: Возвращает имя секущей плоскости. Тип String.

Teigha.DatabaseServices.Section.Normal
Свойство Normal представляет вектор нормали секущей плоскости.
Свойство Normal представляет вектор нормали секущей плоскости.
Returns: Возвращает вектор нормали плоскости. Тип Vector3d.

Teigha.DatabaseServices.Section.NumVertices
Свойство NumVertices представляет количество вершин на секущей плоскости.
Свойство NumVertices представляет количество вершин на секущей плоскости.
Returns: Возвращает количество вершин. Тип int.

Teigha.DatabaseServices.Section.Settings
Свойство Settings представляет настройки этого сечения или разреза.
Свойство Settings представляет настройки этого сечения или разреза.
Returns: Возвращает идентификатор объекта настроек данного объекта.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Section.State
Свойство State представляет тип секущей плоскости.
Свойство State представляет тип секущей плоскости.
Returns: Возвращает тип секущей плоскости как значение из перечисления SectionState.

Teigha.DatabaseServices.Section.TopPlane
Свойство TopPlane представляет высоту индикатора секущей плоскости выше линии сечения.
Свойство TopPlane представляет высоту индикатора секущей плоскости выше линии сечения.
Returns: Возвращает указанную высоту индикатора секущей плоскости.
Тип double.

Teigha.DatabaseServices.Section.VerticalDirection
Свойство VerticalDirection представляет вектор вертикального направления этой секущей плоскости.
Свойство VerticalDirection представляет вектор вертикального направления этой секущей плоскости.
Этот вектор лежит в плоскости первого сегмента секущей плоскости и перпендикулярен линии сечения.
Returns: Возвращает направление вертикали. Тип Vector3d.

Teigha.DatabaseServices.Section.Vertices
Свойство Vertices представляет коллекцию вершин данной секущей плоскости.
Свойство Vertices представляет коллекцию вершин данной секущей плоскости.
Returns: Возвращает коллекцию вершин секущей плоскости.
Тип Point3dCollection.

Teigha.DatabaseServices.Section.ViewingDirection
Свойство ViewingDirection представляет вектор направления обзора этой секущей плоскости.
Свойство ViewingDirection представляет вектор направления обзора этой секущей плоскости.
Этот вектор перпендикулярен плоскости первого сегмента.
Returns: Возвращает направление обзора. Тип Vector3d.