Teigha.DatabaseServices.PlotType.Limits
Значение: 2. Limits / Лимиты.
Вывод на печать объектов чертежа, расположенных в пределах заданных границ сетки (лимитов четрежа).
Этот тип печати доступен только в пространстве модели.