Teigha.DatabaseServices.Intersect.OnBothOperands
Значение: 0.
Не продлевать ребра граничной рамки для обоих пересекающихся объектов.
Пересечение вычисляется только в местах фактического пересечения граничных рамок.