HostMgd.EditorInput.Editor.PointFilter
Событие возникает при перемещении мыши в окне редактора nanoCAD
и позволяет фильтровать или изменять координаты указателя.
Событие не реализовано.
Событие вызывается каждый раз, когда пользователь перемещает мышь
в графической области чертежа, и предназначено для динамического изменения
или фильтрации текущих координат курсора. Оно используется, например,
для реализации пользовательских привязок, ограничений по осям
или других интерактивных функций, связанных с движением мыши.
С помощью этого события можно модифицировать положение точки,
полученной от устройства ввода, до её применения в команде.
Notes
Событие использует делегат PointFilterEventHandler,
который предоставляет доступ к контексту перемещения
и позволяет манипулировать точкой ввода.
Example
C#