Teigha.Geometry.Matrix3d.ToString
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки.
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки.
Returns: Возвращает строку. Тип String.