Teigha.DatabaseServices.UnderlayLayer
Класс UnderlayLayer представляет слои подложки на чертеже.
Класс UnderlayLayer представляет слои подложки на чертеже.

Teigha.DatabaseServices.UnderlayLayer.#ctor
Конструктор по умолчанию класса UnderlayLayer.
Конструктор по умолчанию класса UnderlayLayer.

Teigha.DatabaseServices.UnderlayLayer.Name
Свойство Name представляет имя данного слоя подложки.
Свойство Name представляет имя данного слоя подложки.
Returns: Возвращает имя слоя. Тип String.

Teigha.DatabaseServices.UnderlayLayer.State
Свойство State представляет состояние блокировки данного слоя подложки.
Свойство State представляет состояние данного слоя подложки из перечисления UnderlayLayerState (разблокированный или заблокированный).
Returns: Возвращает состояние слоя подложки. Перечисление UnderlayLayerState.