Teigha.GraphicsInterface.Projection
Перечисление Projection определяет типы проекционных отображений, которые используются мапперами.
Перечисление Projection определяет поддерживаемые типы проекционных отображений, которые используются мапперами.