Teigha.BoundaryRepresentation.Mesh2dElement2dCollection.GetEnumerator
Метод предоставляет перечислитель данной коллекции.
Метод предоставляет перечислитель данной коллекции.
Returns: Возвращает перечислитель данной коллекции.
Тип Mesh2dElement2dEnumerator.