Teigha.BoundaryRepresentation.LoopVertexEnumerator
Класс LoopVertexEnumerator представляет перечислитель вершин цикла грани.
Класс LoopVertexEnumerator представляет перечислитель вершин цикла грани.

Teigha.BoundaryRepresentation.LoopVertexEnumerator.Current
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип Vertex.