Teigha.DatabaseServices.SymbolTableEnumerator
Класс SymbolTableEnumerator представляет перечислитель для таблицы символов.
Класс SymbolTableEnumerator представляет перечислитель для таблицы символов.

Teigha.DatabaseServices.SymbolTableEnumerator.Current
Свойство Current представляет текущую запись перечислителя в таблице символов.
Свойство Current представляет текущую запись перечислителя в таблице символов.
Returns: Возвращает идентификатор текущей записи в таблице символов. Тип ObjectId.