HostMgd.EditorInput.Editor.SelectionRemoved
Событие возникает при удалении одного или нескольких объектов
из текущего набора выделенных объектов в редакторе nanoCAD.
Событие инициируется системой nanoCAD при изменении набора выбранных объектов,
когда один или несколько объектов удаляются из выборки — например,
пользователь удерживает клавишу Shift и щелкает по объекту,
использует режим "Удалить" в команде выбора или выполняет операцию,
исключающую объекты из текущей выборки.
Оно предоставляет доступ к списку удалённых объектов через объект SelectionSet,
что позволяет разработчику плагина отслеживать изменения в выборке и реагировать на них
— например, обновлять панель свойств, корректировать логику команды или визуализировать изменения.
Example
C#