Teigha.Geometry.Point2d.GetAsVector
Метод преобразует данную точку в 2D-вектор с тем же набором координат и возвращает экземпляр Vector2d.
Метод преобразует данную точку в 2D-вектор с тем же набором координат и возвращает экземпляр Vector2d.
Returns: Возвращает вектор с теми же координатами, что и у данной 2D-точки. Тип Vector2d.