Teigha.DatabaseServices.UnderlayLayerState
Данное перечисление определяет состояние слоя подложки - является ли он разблокированным или заблокированным.
Данное перечисление определяет состояние слоя подложки - является ли он разблокированным или заблокированным.