Teigha.Geometry.SurfaceSurfaceIntersector
Класс SurfaceSurfaceIntersector представляет данные пересечения двух поверхностей.
Класс SurfaceSurfaceIntersector представляет данные пересечения двух поверхностей.
Notes
Создание объектов этого класса сопровождается указанием двух поверхностей, пересечения которых требуется вычислить.
Объект лишь хранит дескрипторы ассоциированных объектов поверхностей, но не владеет ими.
Геометрия пересечения поверхностей вычисляется в рамках поддерживаемых классом запросов.
Любая выходная геометрия, получаемая объектом SurfaceSurfaceIntersector, принадлежит вызывающему объекту.
В случае изменения (или удаления) одной из связанных поверхностей внутренние результаты пересечения помечаются как недействительные и должны быть перевычислены.
Если одна из поверхностей равна NULL, выбрасывается исключение kXXUnknown и возвращается значение non-valid.

Teigha.Geometry.SurfaceSurfaceIntersector.#ctor
Конструктор по умолчанию класса SurfaceSurfaceIntersector.
Конструктор по умолчанию класса SurfaceSurfaceIntersector.
Созданный объект имеет нулевые ссылки на поверхности. Ему назначена точность по умолчанию, а также сняты флаги перекрытия поверхностей и инициализированности внутренних данных.

Teigha.Geometry.SurfaceSurfaceIntersector.#ctor(Teigha.DatabaseServices.Surface,Teigha.DatabaseServices.Surface)
Конструктор класса SurfaceSurfaceIntersector.
Создает объект пересечения двух указанных поверхностей, использующий геометрическую точность по умолчанию.
Конструктор класса SurfaceSurfaceIntersector.
Создает объект пересечения двух указанных поверхностей,
использующий геометрическую точность по умолчанию Geometry.Tolerance.Global.
Notes
Конструктор не вычисляет геометрию пересечений указанных поверхностей.
Эту задачу решают поддерживаемые данным классом запросы.
surface2: Первая поверхность, участвующая в пересечении. Тип Surface.
surface1: Вторая поверхность, участвующая в пересечении. Тип Surface.

Teigha.Geometry.SurfaceSurfaceIntersector.#ctor(Teigha.DatabaseServices.Surface,Teigha.DatabaseServices.Surface,Geometry.Tolerance)
Конструктор класса SurfaceSurfaceIntersector.
Создает объект пересечения двух указанных поверхностей, предполагающий использование заданной точности геометрических вычислений.
Конструктор класса SurfaceSurfaceIntersector.
Создает объект пересечения двух указанных поверхностей, предполагающий использование заданной точности геометрических вычислений.
Notes
Конструктор не вычисляет геометрию пересечений указанных поверхностей.
Эту задачу решают поддерживаемые данным классом запросы.
surface2: Первая поверхность, участвующая в пересечении. Тип Surface.
surface1: Вторая поверхность, участвующая в пересечении. Тип Surface.
tolerance: Заданная геометрическая точность. Тип Geometry.Tolerance.

Teigha.Geometry.SurfaceSurfaceIntersector.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип SurfaceSurfaceIntersector.

Teigha.Geometry.SurfaceSurfaceIntersector.GetDimension(System.Int32)
Метод предоставляет геометрическую размерность (точка или кривая) пересечения с указанным индексом.
Метод предоставляет геометрическую размерность (точка или кривая) пересечения с указанным индексом.
Notes
Метод выбрасывает исключения kXXUnknown, если данный объект пересечения еще не был инициализирован, и kXXIndexOutOfRange, если указанный методу индекс является недействительным.
number: Индекс пересечения. Индексация начинается с нуля.  Тип int.
Returns: Возвращает 0, если пересечение представлено точкой, и 1, если пересечением является кривая.
Тип int.

Teigha.Geometry.SurfaceSurfaceIntersector.GetIntersectionConfigurations(System.Int32)
Метод предоставляет относительные конфигурации пересекающихся поверхностей в окрестности кривой пересечения.
В текущей версии не реализован.
Метод предоставляет относительные конфигурации пересекающихся поверхностей в окрестности кривой пересечения.
В текущей версии не реализован.
Notes
Метод выбрасывает исключения kXXUnknown, если данный объект пересечения еще не был инициализирован, и kXXIndexOutOfRange, если указанный методу индекс является недействительным.
number: Индекс пересечения.  Индексация начинается с нуля.  Тип int.
Returns: Возвращает объект SurfaceSurfaceIntersectorConfigurations с информацией о конфигурациях поверхностей в окрестности пересечения:
* Размерность и тип пересечения;
* Конфигурация поверхности 1 слева и справа от пересечения;
* Конфигурация поверхности 2 слева и справа от пересечения.

Teigha.Geometry.SurfaceSurfaceIntersector.GetIntersectPointParameters(System.Int32)
Метод предоставляет для каждой из поверхностей параметрическую точку (U, V), которая соответствует точке пересечения с указанным индексом.
Метод предоставляет для каждой из поверхностей свою параметрическую точку (U, V), которая соответствует точке пересечения с указанным индексом.
number: Индекс пересечения.  Индексация начинается с нуля.  Тип int.
Returns: Возвращает двухэлементный массив параметрических точек (U, V) для каждой из поверхностей в точке пересечения.
Тип Point2d[]. Принята следующая индексация элементов массива:
* 0 — Параметрическая точка на первой поверхности в точке пересечения.
* 1 — Параметрическая точка на второй поверхности в точке пересечения.

Teigha.Geometry.SurfaceSurfaceIntersector.GetType(System.Int32)
Метод предоставляет тип пересечения c указанным индексом.
В текущей версии не реализован.
Метод предоставляет тип пересечения c указанным индексом.
В текущей версии не реализован.
Notes
Метод выбрасывает исключения kXXUnknown, если данный объект пересечения не инициализирован, и kXXIndexOutOfRange, если указанный методу индекс является недействительным.
number: Индекс пересечения.  Индексация начинается с нуля.  Тип int.
Returns: Возвращает значение из перечисления SurfaceSurfaceIntersectorType, которое характеризует тип пересечения:
* Transverse — некасательное пересечение;
* Tangent — касательное пересечение с сонаправленными нормалями двух поверхностей в любой точке в пределах компонента;
* AntiTangent — касательное  пересечение с противонаправленными нормалями двух поверхностей в любой точке в пределах компонента.

Teigha.Geometry.SurfaceSurfaceIntersector.IntersectCurve(System.Int32,System.Boolean)
Метод возвращает 3D-кривую, представляющую пересечение с указанным индексом.
Метод возвращает 3D-кривую, представляющую пересечение с указанным индексом.
Notes
Метод выбрасывает следующие исключения:
* kXXIndexOutOfRange, если указанный методу индекс является недействительным.
* kXXWrongDimensionAtIndex в случае неверной размерности указанного пересечения;
* kXXUnknown, если данный объект пересечения не инициализирован.
number: Индекс кривой пересечения.  Индексация начинается с нуля.  Тип int.
isExternal: Флаг, указывающий, следует ли возвращать дескриптор внешней кривой.  Тип bool.  В текущей версии не реализован.
Returns: Возвращает 3D-кривую пересечения с индексом number. Тип Curve3d.

Teigha.Geometry.SurfaceSurfaceIntersector.IntersectParameterCurve(System.Int32,System.Boolean,System.Boolean)
Метод позволяет получить параметрическую 2D-кривую, представляющую на выбранной поверхности пересечение с указанным индексом.
Метод позволяет получить параметрическую 2D-кривую, представляющую на выбранной поверхности пересечение с указанным индексом.
Notes
Метод выбрасывает следующие исключения:
* kXXIndexOutOfRange, если указанный индекс выходит за пределы диапазона допустимых значений;
* kXXWrongDimensionAtIndex в случае неверной размерности указанного пересечения;
* kXXUnknown, если данный объект пересечения не инициализирован.
number: Индекс кривой пересечения.  Индексация начинается с нуля.  Тип int.
isExternal: Флаг, указывающий, следует ли возвращать дескриптор внешней кривой (не реализован). Тип bool.
isFirst: Если данный флаг принимает значение true, метод возвращает кривую на первой поверхности, в противном случае возвращает кривую на второй поверхности. Тип bool.
Returns: Возвращает параметрическую 2D-кривую на указанной поверхности, представляющую пересечение с индексом number.
Тип Curve2d.

Teigha.Geometry.SurfaceSurfaceIntersector.IntersectPoint(System.Int32)
Метод позволяет получить трехмерную точку пересечения с указанным индексом.
Метод позволяет получить трехмерную точку пересечения с указанным индексом.
Notes
Метод выбрасывает следующие исключения:
* kXXIndexOutOfRange, если указанный индекс выходит за пределы диапазона допустимых значений;
* kXXWrongDimensionAtIndex в случае неверной размерности указанного пересечения;
* kXXUnknown, если данный объект пересечения не инициализирован.
number: Индекс кривой пересечения.  Индексация начинается с нуля.  Тип int.
Returns: Возвращает точку пересечения с индексом number.
Тип Point3d.

Teigha.Geometry.SurfaceSurfaceIntersector.Set(Teigha.DatabaseServices.Surface,Teigha.DatabaseServices.Surface)
Метод позволяет переопределить обе поверхности, связанные с данным объектом.
Метод позволяет переопределить обе поверхности, связанные с данным объектом.
Notes
Используется вызов метода Set(Surface surface1, Surface surface2, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
surface1: Первая поверхность, участвующая в пересечении со второй поверхностью. Тип Surface.
surface2: Вторая поверхность, участвующая в пересечении с первой поверхностью.  Тип Surface.

Teigha.Geometry.SurfaceSurfaceIntersector.Set(Teigha.DatabaseServices.Surface,Teigha.DatabaseServices.Surface,Geometry.Tolerance)
Метод позволяет переопределить обе поверхности, связанные с данным объектом, а также геометрическую точность вычисления пересечений.
Метод позволяет переопределить обе поверхности, связанные с данным объектом, а также геометрическую точность вычисления пересечений.
surface1: Первая поверхность, участвующая в пересечении со второй поверхностью. Тип Surface.
surface2: Вторая поверхность, участвующая в пересечении с первой поверхностью.  Тип Surface.
tolerance: Заданная геометрическая точность. Тип Geometry.Tolerance.

Teigha.Geometry.SurfaceSurfaceIntersector.NumResults
Свойство NumResults представляет общее количество пересечений любой размерности.
Свойство NumResults представляет общее количество пересечений любой размерности.
Returns: Возвращает общее количество пересечений любой размерности.
Тип int.

Teigha.Geometry.SurfaceSurfaceIntersector.Surface1
Свойство Surface1 представляет объект первой поверхности, связанный с данным объектом.
Свойство Surface1 представляет объект первой поверхности, связанный с данным объектом.
Returns: Возвращает объект первой поверхности.
Тип Surface.

Teigha.Geometry.SurfaceSurfaceIntersector.Surface2
Свойство Surface2 представляет объект второй поверхности, связанный с данным объектом.
Свойство Surface2 представляет объект второй поверхности, связанный с данным объектом.
Returns: Возвращает объект второй поверхности.
Тип Surface.

Teigha.Geometry.SurfaceSurfaceIntersector.Tolerance
Свойство Tolerance представляет текущее значение геометрической точности, которая используется данным объектом для вычисления пересечений.
Свойство Tolerance представляет текущее значение геометрической точности, которая используется данным объектом для вычисления пересечений.
Returns: Возвращает текущее значение геометрической точности.
Тип Geometry.Tolerance.