HostMgd.ApplicationServices.RecentDocument
Класс RecentDocument представляет недавно открытый документ или чертеж.
В текущей версии данный класс не реализован.
Класс RecentDocument представляет недавно открытый документ или чертеж.
В текущей версии данный класс не реализован.

HostMgd.ApplicationServices.RecentDocument.#ctor
Конструктор по умолчанию класса RecentDocument.
Не реализован.
Конструктор по умолчанию класса RecentDocument.
Не реализован.

HostMgd.ApplicationServices.RecentDocument.CurrentlyOpenBy
Свойство CurrentlyOpenBy представляет имя приложения, в котором в настоящее время открыт данный документ.
В текущей версии данное свойство не реализовано.
Свойство CurrentlyOpenBy представляет имя приложения, в котором в настоящее время открыт данный документ.
В текущей версии данное свойство не реализовано.
Returns: Возвращает имя приложения, в котором открыт документ.
Тип System.String.

HostMgd.ApplicationServices.RecentDocument.IsPinned
Свойство IsPinned позволяет определить, закреплен ли документ на начальной странице или в меню приложений.
В текущей версии данное свойство не реализовано.
Свойство IsPinned позволяет определить, закреплен ли документ на начальной странице или в меню приложений.
В текущей версии данное свойство не реализовано.
Returns: Возвращает true, если  документ закреплён на начальной странице или в меню приложений.
В противном случае возвращает false.

HostMgd.ApplicationServices.RecentDocument.LastOpenedTime
Свойство LastOpenedTime представляет время последнего открытия документа.
В текущей версии данное свойство не реализовано.
Свойство LastOpenedTime представляет время последнего открытия документа.
В текущей версии данное свойство не реализовано.
Returns: Возвращает время последнего открытия документа.
Тип ValueType.

HostMgd.ApplicationServices.RecentDocument.LastSavedBy
Свойство LastSavedBy представляет имя пользователя, который последним модифицировал данный документ.
В текущей версии данное свойство не реализовано.
Свойство LastSavedBy представляет имя пользователя, который последним модифицировал данный документ.
В текущей версии данное свойство не реализовано.
Returns: Возвращает имя пользователя.
Тип System.String.

HostMgd.ApplicationServices.RecentDocument.Path
Свойство Path представляет путь к файлу, связанному с документом.
В текущей версии данное свойство не реализовано.
Свойство Path представляет путь к файлу, связанному с документом.
В текущей версии данное свойство не реализовано.
Returns: Возвращает путь к файлу документа.
Тип System.String.

HostMgd.ApplicationServices.RecentDocument.Preview
Свойство Preview представляет растровое изображение предварительного просмотра, связанное с документом.
В текущей версии данное свойство не реализовано.
Свойство Preview представляет растровое изображение предварительного просмотра, связанное с документом.
В текущей версии данное свойство не реализовано.
Returns: Возвращает изображение предпросмотра документа.
Тип System.Windows.Media.Imaging.BitmapSource.

HostMgd.ApplicationServices.RecentDocument.Version
Свойство Version возвращает версию документа.
В текущей версии данное свойство не реализовано.
Свойство Version возвращает версию документа.
В текущей версии данное свойство не реализовано.
Returns: Возвращает версию документа.
Тип System.String.