Teigha.BoundaryRepresentation.Node
Класс Node является интерфейсным классом для узлов сети.
Класс Node является интерфейсным классом для узлов сети.
Notes
Этот класс реализован только в среде пространственного моделирования.

Teigha.BoundaryRepresentation.Node.#ctor
Конструктор по умолчанию класса Node.
Конструктор по умолчанию класса Node.

Teigha.BoundaryRepresentation.Node.Point
Свойство Point представляет базовую точку узла сети.
Свойство Point представляет базовую точку узла сети.
При этом применяется вся цепочка преобразований из пути подобъекта соответствующего топологического объекта .
Returns: Возвращает базовую точку узла сети.
Тип Point3d.