Teigha.Runtime
Пространство имен Runtime содержит классы, связанные со средой и временем выполнения программы.
Пространство имен Runtime содержит классы, связанные со средой и временем выполнения программы.