Teigha.GraphicsInterface.GradientBackgroundTraits
Класс GradientBackgroundTraits представляет характеристики градиентного фона базовой системы отображения.
Класс GradientBackgroundTraits представляет характеристики градиентного фона базовой системы отображения.
Экземпляр этого класса формируется объектом GradientBackground с использованием его метода SetAttributes().

Teigha.GraphicsInterface.GradientBackgroundTraits.ColorBottom
Свойство ColorBottom представляет нижний цвет градиентного фона.
Свойство ColorBottom представляет нижний цвет градиентного фона.
Returns: Возвращает нижний цвет градиентного фона.
Тип Colors.EntityColor.

Teigha.GraphicsInterface.GradientBackgroundTraits.ColorMiddle
Свойство ColorMiddle представляет средний цвет градиентного фона.
Свойство ColorMiddle представляет средний цвет градиентного фона.
Returns: Возвращает средний цвет градиентного фона.
Тип Colors.EntityColor.

Teigha.GraphicsInterface.GradientBackgroundTraits.ColorTop
Свойство ColorTop представляет верхний цвет градиентного фона.
Свойство ColorTop представляет верхний цвет градиентного фона.
Returns: Возвращает верхний цвет градиентного фона.
Тип Colors.EntityColor.

Teigha.GraphicsInterface.GradientBackgroundTraits.Height
Свойство Height представляет высоту среднего цвета этого градиентного фона.
Свойство Height представляет высоту среднего цвета этого градиентного фона.
Это значение отражает процент среднего цвета в трехцветном градиенте.
Notes
Положение точки второго цвета определяется свойством Horizon.
Значение Horizon = 0 дает двухцветный градиент, использующий лишь верхний и нижний цвета.
Если Horizon = 0.5 и Height = 0.33, то все три цвета градиента равномерно распределены внутри окна сцены (если вращение не применяется).
Returns: Возвращает высоту среднего цвета градиентного фона.
Тип double.

Teigha.GraphicsInterface.GradientBackgroundTraits.Horizon
Свойство Horizon представляет относительное положение среднего цвета между верхним и нижним цветами градиента.
Свойство Horizon представляет относительное положение среднего цвета между верхним и нижним цветами градиента.
Например, если Horizon = 0.5, то в отсутствие поворота средний цвет будет находиться в середине окна.
Notes
Значение свойства Horizon вне диапазона [0..1] означает, что точка среднего цвета располагается за пределами экрана.
Returns: Возвращает относительное положение среднего цвета градиента.
Тип double.

Teigha.GraphicsInterface.GradientBackgroundTraits.Rotation
Свойство Rotation представляет поворот данного градиентного фона.
Свойство Rotation представляет поворот данного градиентного фона, выраженный в градусах.
Notes
Положительным направлением отсчета угла поворота принято направление против часовой стрелки, относительно координат окна.
Так, при угле поворота 45 градусам ориентация градиентного фона такова, что нижняя точка градиента располагается в левом нижнем углу экрана, а верхняя точка градиента - в правом верхнем углу.
Returns: Возвращает угол в градусах, на который повернут градиентный фон.
Тип double.