HostMgd.EditorInput.PromptEntityOptionsEventHandler
Делегат предназначен для обработки события, возникающего перед началом выбора
геометрического объекта, и позволяет настроить параметры команды выборки.
Делегат используется как тип обработчика для события PromptingForEntity,
которое генерируется перед началом операции выбора объекта в nanoCAD —
например, при вызове метода GetEntity(). Он позволяет разработчику модифицировать параметры выбора
в реальном времени, такие как:
* текст приглашения ,
* допустимые типы объектов (линии, окружности, полилинии и др.),
* ключевые слова ,
* режимы ввода (AllowNone, AllowArbitraryInput и т.д.).
Этот делегат является ключевым элементом при создании интерактивных команд,
где требуется фильтрация или контекстная настройка поведения выбора объектов.
sender: Источник события — обычно экземпляр редактора (Editor), в котором происходит выбор объекта.
e: Объект, содержащий параметры выбора