HostMgd.PlottingServices.PreviewEngineFlags
Данное перечисление определяет функциональность предварительного просмотра чертежа.
Перечисление PreviewEngineFlags определяет функциональность предварительного просмотра чертежа.