Teigha.DatabaseServices.MLeader.GetContentGeomExtents
Метод позволяет получить ограничивающий бокс для данной мультивыноски.
Метод позволяет получить ограничивающий бокс для данного объекта MLeader.
Это прямоугольный параллелепипед минимального размера, ориентированный по осям системы координат, в который вписана вся геометрия мультивыноски (габаритный бокс).
Returns: Возвращает ограничивающий бокс. Тип Extents3d.