Teigha.GraphicsInterface.EdgeData.GetLayers
Метод предоставляет массив идентификаторов слоев, используемых данным объектом.
Метод предоставляет массив идентификаторов объектов LayerTableRecord, по одному для каждого ребра сети или оболочки, с которыми используется данный объект.
Returns: Возвращает массив идентификаторов объектов LayerTableRecord.
Тип ObjectId[].
Возвращает пустой массив, если массив идентификаторов слоев не был задан.