Teigha.Runtime.CommandFlags.Session
Значение: 2097152 (0x200000).
Команда будет выполняться в контексте приложения, а не в контексте текущего документа, с различными возможностями и ограничениями, которые это влечет. Ее следует использовать в меру.