HostMgd.EditorInput.PromptSelectionResult
Класс содержит результат операции выбора объектов в чертеже,
включая статус выполнения и набор выбранных элементов.
Класс используется в .NET API nanoCAD для хранения данных о результатах
интерактивной выборки объектов — например, после вызова методов GetSelection()
или SelectAll().
Он предоставляет информацию:
* о статусе операции (OK, Cancel, Error и др.),
* о наборе выделенных объектов через свойство Value типа SelectionSet,
* строковое представление ввода , если операция была прервана с клавиатуры,
* параметры приглашения , использованные в команде выбора.
Этот класс применяется при разработке плагинов и надстроек,
где требуется обработка множественного выбора объектов,
проверка допустимости выборки и реакция на отмену или ошибку ввода.
Example
C#

HostMgd.EditorInput.PromptSelectionResult.ToString(IFormatProvider)
Метод возвращает строковое представление результата выборки объектов,
отформатированное с учётом текущих локализационных настроек.
Метод предоставляет строковое описание результата операции выбора объектов,
форматируемое в соответствии с переданным провайдером форматирования.
Это позволяет корректно отображать числовые значения (например, количество объектов)
или другие данные с учётом региональных и языковых настроек пользователя
— таких как разделитель десятичной точки или запятой, формат даты и т. д.
Метод может использоваться при разработке мультиязычных плагинов nanoCAD
для единообразного отображения информации о выделенных объектах
в командной строке или лог-файлах.
provider: Объект, определяющий правила форматирования данных — например
Returns: Возвращает значение типа string, представляющее собой текстовое описание результата выборки:
* Если статус OK и набор объектов не пуст:
Пример: "3 object(s) selected" или "Выбрано объектов: 3", в зависимости от культуры.
* Если операция была отменена:
Пример: "Operation cancelled".
* Если произошла ошибка:
Пример: "Input error".
Формат строки зависит от реализации и переданного provider.
Example
C#

HostMgd.EditorInput.PromptSelectionResult.Status
Свойство возвращает статус завершения операции выбора объектов,
указывая на успешное выполнение, отмену или ошибку.
Свойство используется для определения результата интерактивной операции выбора объектов
— например, после вызова метода GetSelection() или при обработке события PromptedForSelection.
Оно предоставляет информацию о том, как была завершена операция:
успешно (OK), отменена пользователем (Cancel) или прервана из-за ошибки (Error).
Свойство доступно только для чтения и автоматически устанавливается системой nanoCAD по завершении операции.
Это свойство играет ключевую роль при проверке допустимости выборки
перед выполнением последующих действий над объектами чертежа.
Returns: Возвращает значение из перечисления PromptStatus,
которое может принимать следующие значения:
* PromptStatus.OK — операция выполнена успешно, и выборка содержит допустимые объекты.
* PromptStatus.Cancel — пользователь отменил операцию (например, нажав Esc).
* PromptStatus.Error — произошла ошибка ввода (например, некорректный ввод с клавиатуры).
* PromptStatus.None — результат не определён или операция не завершена.
* PromptStatus.Keyword — введено ключевое слово вместо выбора объектов.
* PromptStatus.Timeout — операция прервана по таймауту.
Example
C#

HostMgd.EditorInput.PromptSelectionResult.StringResult
Свойство возвращает строковое значение, если операция выбора завершена
с ключевым словом или пользователь ввёл текст вместо выбора объектов.
Свойство используется для получения строки, введённой пользователем
в ходе интерактивной команды выборки объектов — например,
при вызове метода GetSelection() с использованием ключевых слов.
Оно содержит текстовое значение, если:
* Пользователь нажал Enter без выбора объектов.
* Было введено ключевое слово из списка, заданного через PromptSelectionOptions.Keywords.
* Выборка была прервана клавиатурным вводом.
При успешном завершении операции (Status == PromptStatus.OK) это свойство может быть null,
если ввод не был выполнен. Если статус равен PromptStatus.Keyword, свойство возвращает соответствующее слово.
Returns: Возвращает значение типа string:
* Если пользователь ввёл ключевое слово или строку — возвращается эта строка.
* Если операция завершена успешно и объекты выбраны — StringResult может быть null.
* Если операция отменена или произошла ошибка — может содержать сообщение об этом или быть пустой/null.
Example
C#

HostMgd.EditorInput.PromptSelectionResult.Value
Свойство возвращает набор объектов,
выбранных пользователем в ходе интерактивной операции выделения.
Свойство предоставляет доступ к множеству объектов,
выделенных пользователем — например, с помощью мыши,
рамки или метода GetSelection(). Оно доступно только
для чтения и содержит результат выборки,
если операция завершена успешно (Status == PromptStatus.OK).
Если выборка отменена или выполнена с ошибкой,
свойство может возвращать null.
Это свойство используется в связке с событием
PromptedForSelection и методом GetSelection()
для получения и дальнейшей обработки выделенных
объектов чертежа — таких как редактирование,
анализ или удаление.
Returns: Возвращает объект типа SelectionSet, представляющий собой набор идентификаторов
(ObjectId) выбранных геометрических объектов.
Если операция выборки завершена успешно, Value содержит список объектов, иначе — null.
Example
C#