Teigha.DatabaseServices.XrefBeginOperationEventArgs
Класс XrefBeginOperationEventArgs представляет данные для событий базы данных XrefBeginRestore, XrefBeginAttached и XrefBeginOtherAttached.
Класс XrefBeginOperationEventArgs представляет данные для событий базы данных XrefBeginRestore, XrefBeginAttached и XrefBeginOtherAttached.

Teigha.DatabaseServices.XrefBeginOperationEventArgs.FileName
Свойство FileName представляет имя файла, на который указывает внешняя ссылка.
Свойство FileName представляет имя файла, на который указывает внешняя ссылка.
Returns: Возвращает имя файла. Тип String.

Teigha.DatabaseServices.XrefBeginOperationEventArgs.From
Свойство From представляет базу данных, на которую имеется внешняя ссылка.
Свойство From представляет базу данных, на которую имеется внешняя ссылка.
Returns: Возвращает базу данных внешней ссылки.
Тип Database.