HostMgd.EditorInput.PromptOptions.HasDefaultKeyword
Признак наличия ключевого слова по умолчанию.
Возвращает признак наличия ключевого слова по умолчанию, значение которого будет использовано,
если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
Returns: Возвращает тип данных bool.