Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs
Класс представляет данные для события BeginWblockSelectedObjects базы данных.
Класс представляет данные для события BeginWblockSelectedObjects базы данных.

Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs.From
Свойство возвращает объект базы данных, для которой выполняется операция Wblock.
Свойство возвращает объект базы данных, для которой выполняется операция Wblock.
Returns: Возвращает объект базы данных. Тип Database.

Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs.InsertionPoint
Свойство возвращает точку вставки для операции Wblock.
Свойство возвращает 3D-точку вставки для операции Wblock.
Returns: Возвращает точку вставки. Тип Point3d.