HostMgd.EditorInput.SelectedObject
Это базовый класс для выбранного объекта.

HostMgd.EditorInput.SelectedObject.GraphicsSystemMarker
Возвращает значение, которое описывает какая часть объекта
выбрана. Это уникальный целый индекс для части объекта,
который был выбран.

HostMgd.EditorInput.SelectedObject.ObjectId
Возвращает Id выбранного объекта.

HostMgd.EditorInput.SelectedObject.OptionalDetails
Возвращает объект, описывающий детали выделения объекта.,
полезные для вложенных объектов.

HostMgd.EditorInput.SelectedObject.SelectionMethod
Возвращает величину, описывающую метод выделения объекта.

HostMgd.EditorInput.SelectedObject.ToString(IFormatProvider)
Метод возвращает строковое представление объекта (ObjectId, метод выделения, gsMarker)
в соответствии с заданным форматом, зависящим от локализации.
provider: Формат, зависящей от локализации