Teigha.Colors.Color
Класс представляет цвета, либо как RGB, либо как
индексированные цвета.
Color представляет цвета, либо как RGB, либо как
индексированные цвета.
Большинство классов-потребителей используют этот существующий
класс. Остальные клиенты (такие как Entity и SubEntityTraits)
используют непосредственно EntityColor для экономии памяти.

Teigha.Colors.Color.#ctor
Конструктор по умолчанию. Инициализирует индекс цвета, равный
0.

Teigha.Colors.Color.Audit(DatabaseServices.AuditInfo)
Этот метод вызывается nanoCAD, когда исполняется команда
AUDIT. Объект типа AuditInfo, на который указывает параметр
auditInfo, содержит функции, которые используются для
определения того, что необходимо делать, а также для печати
результатов операции аудита объекта.
auditInfo: Объект AuditInfo

Teigha.Colors.Color.CompareTo(Object)
Возвращает результат сравнения.
obj: Объект для сравнения

Teigha.Colors.Color.DwgIn(DatabaseServices.DwgFiler)
Этот метод совершает некоторые внутренние действия, вызывает
функцию DwgInFields() объекта, и читает все xdata,
присоединенные к объекту. Если метод объекта DwgInFields() не
вызывает соответствующего метода своего родительского класса,
вызывается процедура assert.
Note
Использование этого метода может вызвать снятие программы для
любой версии до 2004 года, которая пытается прочитать объект
с использованием метода Color.DwgIn().

Teigha.Colors.Color.DwgOut(DatabaseServices.DwgFiler)
Этот метод совершает некоторые внутренние действия, вызывает
функцию объекта, и затем записывает все xdata, присоединенные к
объекту. Если метод объекта DwgOutFields()не вызывает
соответствующего метода своего родительского класса,
вызывается процедура assert.
Note
Использование этого метода может вызвать снятие программы для
любой версии до 2004 года, которая пытается прочитать объект
с использованием метода Color.DwgIn().

Teigha.Colors.Color.Equals(Object)
Возвращает результат сравнения объектов.
obj: Объект для нахождения эквивалентности с ним

Teigha.Colors.Color.FromColor(System.Drawing.Color)
Возвращает новый объект Color, созданный с использованием
value.
value: Объект, из которого получается color

Teigha.Colors.Color.FromColorIndex(Colors.ColorMethod,short)
Возвращает новый объект color, созданный с использованием цветовой модели
color и индекса.
colorMethod: Объект NanoCAD.Colors.ColorMethod
colorIndex: Индекс

Teigha.Colors.Color.FromDictionaryName(String)
Возвращает новый цвет, используя имя словаря.
name: Ключ в словаре

Teigha.Colors.Color.FromNames(String,String)
Возвращает новый цвет, используя имя цвета и имя палитры
плашечных цветов (book).
colorName: Имя цвета
bookName: Необязательное имя палитры

Teigha.Colors.Color.FromRgb(System.Byte,System.Byte,System.Byte)
Создает новый объект Color, используя значения для Red, Green
и Blue.
red: Значение цвета от 0 до 255
green: Значение цвета от 0 до 255
blue: Значение цвета от 0 до 255

Teigha.Colors.Color.ToString(IFormatProvider)
Возвращает строку, эквивалентно представляющую данный объект,
с учетом формата, зависящего от локализации. Для получения
дополнительной информации смотри документацию на Microsoft .NET API.
provider: Формат, зависящий от локализации

Teigha.Colors.Color.!=(Teigha.Colors.Color,Teigha.Colors.Color)
Возвращает true, если a не равно b.
a: Левый операнд
b: Правый операнд

Teigha.Colors.Color.&lt;(Teigha.Colors.Color,Teigha.Colors.Color)
Возвращает true, если a меньше b.
a: Левый операнд
b: Правый операнд

Teigha.Colors.Color.==(Teigha.Colors.Color,Teigha.Colors.Color)
Возвращает true, если a равно b.
a: Левый операнд
b: Правый операнд

Teigha.Colors.Color.&gt;(Teigha.Colors.Color,Teigha.Colors.Color)
Возвращает true, если a больше b.
a: Левый операнд
b: Правый операнд

Teigha.Colors.Color.ColorValue
Возвращает значение цвета.

Teigha.Colors.Color.DictionaryKeyLength
Возвращает длину ключа в словаре.

Teigha.Colors.Color.EntityColor
Возвращает цвет геометрического объекта.

Teigha.Colors.Color.HasBookName
Возвращает true, если книга (палитра плашечных цветов) имеет
имя.

Teigha.Colors.Color.HasColorName
Возвращает true, если существует имя цвета.

Teigha.Colors.Color.Blue
Возвращает значение компонента цвета Blue от 0 до 255.

Teigha.Colors.Color.BookName
Возвращает имя книги (палитры плашечных цветов).

Teigha.Colors.Color.ColorIndex
Возвращает индекс цвета.

Teigha.Colors.Color.ColorMethod
Возвращает цветовую модель.

Teigha.Colors.Color.ColorName
Возвращает имя цвета.

Teigha.Colors.Color.ColorNameForDisplay
Возвращает имя цвета для отображения.

Teigha.Colors.Color.Description
Возвращает описание.

Teigha.Colors.Color.DictionaryKey
Возвращает ключ из словаря.

Teigha.Colors.Color.Explanation
Возвращает строку пояснения.

Teigha.Colors.Color.Green
Возвращает значение компонента цвета Green от 0 до 255.

Teigha.Colors.Color.IsByAci
Возвращает true, если цвет определен с помощью индекса
(номера).

Teigha.Colors.Color.IsByBlock
Возвращает true, если цвет определен с помощью блока.

Teigha.Colors.Color.IsByColor
Возвращает true, если цвет определен с помощью другого цвета.

Teigha.Colors.Color.IsByLayer
Возвращает true, если цвет задается как EntityColor.ByLayer
или цвет задается с помощью индекса (номера) и индекс задан
как EntityColor.ACIbyLayer.

Teigha.Colors.Color.IsForeground
Возвращает true, если цвет — цвет переднего плана.

Teigha.Colors.Color.IsNone
Возвращает true, если цвет не задан.

Teigha.Colors.Color.Red
Возвращает значение компонента цвета Red от 0 до 255.

Teigha.Colors.Color.IsByPen
Возвращает true, если цвет является цветом ручки.

Teigha.Colors.Color.PenIndex
Возвращает номер ручки.