Teigha.DatabaseServices.Graph.Reset
Метод предназначен для удаления из данного графа всех узлов, включая узлы циклов, что делает граф пустым.
Метод предназначен для удаления из данного графа всех узлов, включая узлы циклов, что делает граф пустым.
Этот метод вызывается также деструктором класса Graph.