Teigha.GraphicsSystem.Model
Класс Model представляет коллекции отображаемых объектов платформы ODA Platform.
Класс Model представляет коллекции отображаемых объектов платформы ODA Platform.
Фактически, класс представляет собой абстракцию базы данных.
Эта база данных может быть объектом Database, контейнером для временной графики (например, Icon и Grid) или представлять другой постоянный формат базы данных, например DWF.
Существенно то, что Model предоставляет базе данных механизм для информирования графической системы (GS) об изменениях (добавление, удаление и изменение).
Каждому экземпляру Model назначается свой RenderType, который используется графической системой для определения типа визуализации геометрию этой модели.

Teigha.GraphicsSystem.Model.Highlight(GraphicsInterface.PathNode,System.Boolean,Teigha.GraphicsSystem.View)
Метод подсвечивает указанный объект чертежа в данном объекте Model.
Метод подсвечивает указанный объект чертежа в данном объекте Model.
path: Путь к объекту, который следует подсветить. Тип GraphicsInterface.PathNode.
bDoIt: Флаг, определяющий, включено ли подсвечивание объектов (значение true) или отключено (значение false). Тип bool.
pView: Вид, в котором указанный объект должен быть подсвечен. Тип View.

Teigha.GraphicsSystem.Model.Invalidate(Teigha.GraphicsSystem.InvalidationHint)
Метод делает недействительными указанные кэшированные данные, содержащиеся в данном объекте Model.
Метод делает недействительными указанные кэшированные данные, содержащиеся в данном объекте Model.
Аргумент hint является перечислимым типом InvalidateHint и позволяет уточнить, какие именно данные в кэше потеряли актуальность и нуждаются в перестроении. Это могут быть изолинии, кэшированные данные, относящиеся к конкретному графическому виду, материалы, типы линий.
hint: Уточнение типа кэшированных данных, которые следует отметить как неактуальные.

Teigha.GraphicsSystem.Model.Invalidate(Teigha.GraphicsSystem.View)
Метод делает недействительными кэшированные данные указанного вида в данном объекте Model.
Метод делает недействительными кэшированные данные указанного вида в данном объекте Model.
pView: Объект вида, кэшированные данные которого следует отметить как неактуальные.

Teigha.GraphicsSystem.Model.OnAdded(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждом добавлении объекта типа Drawable к данному объекту Model.
Данные о родительском объекте добавленного объекта передаются идентификатором родительского объекта.
Метод реализует уведомление о каждом добавлении объекта типа Drawable к данному объекту Model.
Данные о родительском объекте добавленного объекта передаются в метод идентификатором родительского объекта.
pAdded: Добавленный объект типа Drawable.
parentID: Идентификатор объекта, который является родительским по отношению к добавленному объекту pAdded.  Тип long.

Teigha.GraphicsSystem.Model.OnAdded(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждом добавлении объекта типа Drawable к данному объекту Model.
Данные о родительском объекте добавленного объекта передаются указателем на объект типа Drawable.
Метод реализует уведомление о каждом добавлении объекта типа Drawable к данному объекту Model.
Данные о родительском объекте добавленного объекта передаются указателем на объект типа Drawable.
pAdded: Добавленный объект типа Drawable.
pParent: Родительский объект добавленного объекта pAdded.  Тип Drawable.

Teigha.GraphicsSystem.Model.OnErased(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждом удалении объекта типа Drawable из данного объекта Model.
Данные о родительском объекте удаленного объекта передаются в метод идентификатором родительского объекта.
Метод реализует уведомление о каждом удалении объекта типа Drawable из данного объекта Model.
Данные о родительском объекте удаленного объекта передаются в метод идентификатором родительского объекта.
pErased: Удаленный объект типа Drawable.
parentID: Идентификатор объекта, который является родительским по отношению к удаленному объекту pErased.  Тип long.

Teigha.GraphicsSystem.Model.OnErased(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждом удалении объекта типа Drawable из данного объекта Model.
Данные о родительском объекте удаленного объекта передаются указателем на объект типа Drawable.
Метод реализует уведомление о каждом удалении объекта типа Drawable из данного объекта Model.
Данные о родительском объекте удаленного объекта передаются указателем на объект типа Drawable.
pErased: Удаленный объект типа Drawable.
pParent: Родительский объект удаленного объекта pErased.  Тип Drawable.

Teigha.GraphicsSystem.Model.OnModified(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждом изменении объекта типа Drawable в данном объекте Model.
Информация о родительском объекте измененного объекта передается идентификатором родительского объекта.
Метод реализует уведомление о каждом изменении объекта типа Drawable в данном объекте Model.
Информация о родительском объекте измененного объекта передается идентификатором родительского объекта.
pModified: Измененный объект типа Drawable.
parentID: Идентификатор объекта, который является родительским по отношению к измененному объекту pModified.  Тип long.

Teigha.GraphicsSystem.Model.OnModified(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждом изменении объекта типа Drawable в данном объекте Model.
Информация о родительском объекте измененного объекта передается указателем на объект типа Drawable.
Метод реализует уведомление о каждом изменении объекта типа Drawable в данном объекте Model.
Информация о родительском объекте измененного объекта передается указателем на объект типа Drawable.
pModified: Измененный объект типа Drawable.
pParent: Родительский объект измененного объекта pModified.  Тип Drawable.

Teigha.GraphicsSystem.Model.OnUnerased(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждой отмене удаления объекта типа Drawable в данном объекте Model.
Информация о родительском объекте восстановленного объекта передается идентификатором родительского объекта.
Метод реализует уведомление о каждой отмене удаления объекта типа Drawable в данном объекте Model.
Информация о родительском объекте восстановленного объекта передается идентификатором родительского объекта.
pUnerased: Восстановленный объект типа Drawable.
parentID: Идентификатор объекта, который является родительским по отношению к восстановленному объекту pUnerased.  Тип long.

Teigha.GraphicsSystem.Model.OnUnerased(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждой отмене удаления объекта типа Drawable в данном объекте Model.
Информация о родительском объекте восстановленного объекта передается идентификатором родительского объекта.
Метод реализует уведомление о каждой отмене удаления объекта типа Drawable в данном объекте Model.
Информация о родительском объекте восстановленного объекта передается идентификатором родительского объекта.
pUnerased: Восстановленный объект типа Drawable.
pParent: Родительский объект восстановленного объекта pUnerased. Тип Drawable.

Teigha.GraphicsSystem.Model.setSectioning(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d)
Метод позволяет задать активное сечение для данного объекта Model.
Аргументы метода определяют плоскость сечения и границу области сечения.
После определения сечения его следует активировать, используя свойство EnableSectioning.
Метод позволяет задать активное сечение для данного объекта Model.
Плоскость сечения задается 3D-вектором upVector.
Граница области сечения задается коллекцией копланарных 3D-точек Point3dCollection, лежащих в плоскости сечения.
Определенное данным методом сечение следует активировать, используя свойство EnableSectioning.
Notes
Если первая и последняя точки массива points совпадают, область сечения является замкнутой.
Вектор upVector используется также для указания отрезанной и неотрезанной сторон сечения.
Неотрезанная сторона определяется направлением векторного произведения первого сегмента границы области сечения и вектора upVector.
points: Коллекция копланарных точек, определяющих плоскую границу области сечения. Тип Point3dCollection.
upVector: Вектор, задающий ориентацию плоскости области сечения. Тип Vector3d.
Returns: Возвращает true, если если указанное сечение является допустимым.
Возвращает false, если указанное сечение недействительно или сформировано неправильно.

Teigha.GraphicsSystem.Model.setSectioning(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,System.Double,System.Double)
Метод позволяет задать активное сечение для данного объекта Model.
Рассечение ограничено по вертикали с использованием заданных значений высот сверху и снизу.
После определения сечения его следует активировать, используя свойство EnableSectioning.
Метод позволяет задать активное сечение для данного объекта Model.
Плоскость сечения задается 3D-вектором upVector.
Граница области сечения задается коллекцией копланарных 3D-точек Point3dCollection, лежащих в плоскости сечения.
Рассечение ограничено по вертикали с использованием заданных значений высот сверху и снизу.
Определенное данным методом сечение следует активировать, используя свойство EnableSectioning.
Notes
Если первая и последняя точки массива points совпадают, область сечения является замкнутой.
Вектор upVector используется также для указания отрезанной и неотрезанной сторон сечения.
Неотрезанная сторона определяется направлением векторного произведения первого сегмента границы области сечения и вектора upVector.
points: Коллекция копланарных точек, определяющих плоскую границу области сечения. Тип Point3dCollection.
upVector: Вектор, задающий ориентацию плоскости области сечения. Тип Vector3d.
dTop: Высота, ограничивающая сечение сверху. Тип double.
dBottom: Высота, ограничивающая сечение снизу.  Тип double.
Returns: Возвращает true, если если указанное сечение является допустимым.
Возвращает false, если указанное сечение недействительно или сформировано неправильно.

Teigha.GraphicsSystem.Model.Background
Свойство Background представляет идентификатор объекта, определяющего фон вида.
Свойство Background представляет идентификатор объекта, определяющего фон вида.
Если фон не задан, возвращается ObjectId.kNull.
Returns: Возвращает идентификатор объекта, определяющего фон вида. Тип DatabaseServices.ObjectId. Если фон не задан, возвращает ObjectId.kNull.

Teigha.GraphicsSystem.Model.EnableLightsInBlocks
Свойство EnableLightsInBlocks позволяет определить, используются ли при визуализации содержащиеся в блоках источники света.
Свойство EnableLightsInBlocks позволяет определить, используются ли при визуализации содержащиеся в блоках источники света.
Returns: Возвращает true, если источники света, содержащиеся в блоках, используются при визуализации.
В противном случае возвращает false.

Teigha.GraphicsSystem.Model.EnableLinetypes
Свойство EnableLinetypes позволяет определить, активирован ли в данном объекте Model режим использования типов линий.
Свойство EnableLinetypes позволяет определить, активен ли в данном объекте Model режим использования типов линий.
Returns: Возвращает true, если режим использования типов линий включен.
В противном случае возвращает false.

Teigha.GraphicsSystem.Model.EnableSectioning
Свойство EnableSectioning позволяет определить, включено ли использование текущего определения сечения на видах, на которых представлен данный объект Model.
Свойство EnableSectioning позволяет определить, включено ли использование текущего описания сечения на видах, на которых представлен данный объект Model.  Описание сечения реализует метод setSectioning.
Returns: Возвращает true, если отображение сечения включено.
В противном случае возвращает false.

Teigha.GraphicsSystem.Model.EnableViewExtentsCalculation
Свойство EnableViewExtentsCalculation позволяет определить, включено ли вычисление габаритных границ видов.
Свойство EnableViewExtentsCalculation позволяет определить, включено ли вычисление габаритных границ видов.
Returns: Возвращает true, если вычисление габаритных границ видов включено.
В противном случае возвращает false.

Teigha.GraphicsSystem.Model.RenderModeOverride
Свойство RenderModeOverride представляет переопределенный режим рендеринга данного объекта Model.
Свойство RenderModeOverride представляет переопределенный режим рендеринга данного объекта Model.
Returns: Возвращает переопределенный режим рендеринга.
Тип RenderMode.

Teigha.GraphicsSystem.Model.RenderType
Свойство RenderType представляет тип рендеринга данного объекта Model.
Свойство RenderType представляет тип рендеринга данного объекта Model.
Returns: Возвращает тип рендеринга данного объекта.
Тип GraphicsSystem.RenderType.

Teigha.GraphicsSystem.Model.SectioningVisualStyle
Свойство SectioningVisualStyle представляет визуальный стиль, который будет использоваться для объектов на отрезанной стороне сечения.
Передача нулевого идентификатора объекта (это стиль по умолчанию) указывает на то, что отрезанная сторона отображаться не должна.
Стиль по умолчанию — null.
Свойство SectioningVisualStyle представляет визуальный стиль для отображения объектов на отрезанной стороне сечения.
Передача нулевого идентификатора объекта (это стиль по умолчанию) указывает на то, что отрезанную сторону отображать не следует.
Returns: Возвращает идентификатор визуального стиля.
Тип DatabaseServices.ObjectId.

Teigha.GraphicsSystem.Model.Selectable
Свойство Selectable представляет доступ к переменной Selectable, которая определяет, можно ли выделять данный объект Model.
Свойство Selectable представляет доступ к переменной Selectable, которая определяет, можно ли выделять данный объект Model.
Returns: Возвращает true, если выделение допустимо.
В противном случае возвращает false.

Teigha.GraphicsSystem.Model.Transform
Свойство Transform представляет матрицу базового геометрического преобразования для данного объекта Model.
Свойство Transform представляет матрицу базового геометрического преобразования для данного объекта Model.
Если преобразование не задано, матрица будет единичной.
Returns: Возвращает матрицу геометрического преобразования модели.
Тип Matrix3d.

Teigha.GraphicsSystem.Model.ViewClippingOverride
Свойство ViewClippingOverride позволяет определить, учитываются ли на видах передняя и задняя плоскости отсечения.
Свойство ViewClippingOverride позволяет определить, учитываются ли на видах передняя и задняя плоскости отсечения.
По умолчанию плоскости отсечения учитываются.
Returns: Возвращает true, если геометрическим элементам модели позволено игнорировать плоскости отсечения вида (если таковые определены).
Значение false гарантирует, что модель учитывает плоскости отсечения вида (это поведение по умолчанию).

Teigha.GraphicsSystem.Model.ViewSectioningOverride
Свойство ViewSectioningOverride позволяет определить, должна ли геометрия данного объекта Model игнорировать переднюю и заднюю плоскости отсечения вида (если определены) и 3D-отсечение для видового экрана (если задано).
Свойство ViewSectioningOverride позволяет определить, должна ли геометрия данного объекта Model игнорировать переднюю и заднюю плоскости отсечения вида (если определены) и 3D-отсечение для видового экрана (если задано).
Returns: Возвращает false, если плоскости отсечения вида и 3D-отсечение для видового экрана разрешены данным объектом Model.
В противном случае возвращает true.

Teigha.GraphicsSystem.Model.VisualStyle
Свойство VisualStyle представляет непостоянный визуальный стиль отображения данного объекта Model.
Свойство VisualStyle представляет непостоянный визуальный стиль отображения данного объекта Model.
Returns: Возвращает стиль отображения данной модели.
Тип GraphicsInterface.VisualStyle.

Teigha.GraphicsSystem.Model.VisualStyleId
Свойство VisualStyleId представляет постоянный визуальный стиль отображения модели.
Свойство VisualStyleId представляет постоянный визуальный стиль отображения модели.
По умолчанию модель отображается на виде в визуальном стиле, который назначен виду.
Данное свойство позволяет переопределить стиль отображения модели.
Если присвоить свойству значение ObjectId.kNull, происходит возврат к визуальному стилю вида по умолчанию.
Returns: Возвращает идентификатор объекта постоянного визуального стиля отображения модели.
Тип DatabaseServices.ObjectId.