Teigha.GraphicsInterface.FaceColorMode.Tint
Значение: 4.
Все грани объекта получают значения оттенка и насыщенности своего цвета, сопоставленные с соответствующими значениями оттенка и насыщенности некоторого заданного цвета, что дает эффект дополнительного «тонирования». Яркость остается без изменений.