Teigha.DatabaseServices.SectionHeight
Данное перечисление определяет типы высоты индикатора секущей плоскости выше или ниже линии сечения.
Данное перечисление определяет типы высоты секущей плоскости выше или ниже линии сечения.
Если типом секущей плоскости является плоскость или граница, возвращаемая высота является высотой индикатора  секущей плоскости (или границы).
Если типом секущей плоскости является объем, возвращается высота разреза.