Teigha.DatabaseServices.SectionSubItem
Данное перечисление определяет флаги попадания точки на индикатор секущей плоскости,
которые возвращает метод Section.HitTest().
Данное перечисление определяет флаги попадания точки на индикатор секущей плоскости.
Значения из этого перечисления возвращает метод Section.HitTest().