Teigha.DatabaseServices.LinkedData
Класс представляет в базе данных объекты LinkedData и обеспечивает связывание данных.
Класс представляет в базе данных объекты LinkedData и обеспечивает связывание данных.

Teigha.DatabaseServices.LinkedData.IsEmpty
Свойство позволяет проверить, содержит ли этот объект какие-либо данные.
Должно быть реализовано в производных классах.
Свойство позволяет проверить, содержит ли этот объект какие-либо данные.
Должно быть реализовано в производных классах.
Returns: Возвращает true, если данный объект содержит данные.
В противном случае возвращает false.

Teigha.DatabaseServices.LinkedData.Name
Свойство представляет наименование связываемых данных.
Свойство представляет наименование связываемых данных.
Returns: Возвращает наименование данных. Тип String.