Teigha.DatabaseServices.ImageBackground
Этот класс представляет в базе данных объекты фона, основанные на изображениях.
Этот класс представляет в базе данных объекты фона, основанные на изображениях.

Teigha.DatabaseServices.ImageBackground.#ctor
Конструктор по умолчанию класса ImageBackground.
Конструктор по умолчанию класса ImageBackground.

Teigha.DatabaseServices.ImageBackground.FitToScreen
Свойство позволяет проверить, должен ли данный фон на основе изображения быть вписанным в экран.
Свойство позволяет проверить, должен ли данный фон на основе изображения быть вписанным в экран.
Returns: Возвращает true, если фон должен быть вписан в экран.
В противном случае возвращает false.

Teigha.DatabaseServices.ImageBackground.ImageFileName
Свойство представляет полный путь к файлу изображения, на базе которого создан данный объект.
Свойство представляет полный путь к файлу изображения, на базе которого создан данный объект.
Returns: Возвращает полный путь к файлу изображения. Тип String.

Teigha.DatabaseServices.ImageBackground.MaintainAspectRatio
Свойство позволяет выяснить, следует ли сохранять соотношение сторон исходного изображения в данном объекте.
Свойство позволяет выяснить, следует ли сохранять соотношение сторон исходного изображения в данном объекте.
Returns: Возвращает true, если соотношение сторон исходного изображения должно сохраняться.
В противном случае возвращает false.

Teigha.DatabaseServices.ImageBackground.Offset
Свойство предоставляет доступ к вектору смещения исходного изображения в данном объекте.
Свойство предоставляет доступ к вектору смещения исходного изображения в данном объекте.
Returns: Возвращает вектор смещения исходного изображения. Тип Vector2d.

Teigha.DatabaseServices.ImageBackground.Scale
Свойство предоставляет доступ к масштабу исходного изображения в данном объекте.
Свойство предоставляет доступ к масштабу исходного изображения в данном объекте.
Returns: Возвращает масштаб исходного изображения. Тип Scale2d.

Teigha.DatabaseServices.ImageBackground.UseTiling
Свойство позволяет проверить, является ли мозаичным данный фон на основе изображения.
Свойство позволяет проверить, является ли мозаичным данный фон на основе изображения.
Returns: Возвращает true, если фоновое изображение выкладывается мозаикой.
В противном случае возвращает false.