Teigha.Geometry.NurbCurve3dFitData
Класс NurbCurve3dFitData представляет данные, возвращаемые свойством Teigha.Geometry.NurbCurve3d.FitData.
Класс NurbCurve3dFitData представляет данные, возвращаемые свойством Teigha.Geometry.NurbCurve3d.FitData.

Teigha.Geometry.NurbCurve3dFitData.Equals(Object)
Метод позволяет проверить, идентичен ли данный объект входному объекту.
Метод позволяет проверить, идентичен ли данный объект входному объекту obj.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с сохранением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать NurbCurve3dFitData.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, проверяемый на равенство.  Тип Object.
Returns: Возвращает true, если входной объект не является нулевым и идентичен данному объекту.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3dFitData.IsEqualTo(Teigha.Geometry.NurbCurve3dFitData)
Метод позволяет проверить, идентичны ли данные аппроксимации NURB кривой в данном объекте соответствующим данным аппроксимации NURB кривой во входном объекте.
Метод позволяет проверить, идентичны ли данные аппроксимации NURB кривой в данном объекте соответствующим данным аппроксимации NURB кривой во входном объекте.
Идентичность объектов NurbCurve3dFitData означает одновременное выполнение следующих условий:
* Определяющие точки совпадают;
* Равны степени обеих кривых;
* Данные касательных присутствуют или отсутствуют для обеих кривых;
* Равны начальные векторы касательных;
* Равны конечные векторы касательных.
a: Данные 3D-аппроксимации NURB кривой. Тип NurbCurve3dFitData.
Returns: Возвращает true, если сравниваемые объекты идентичны.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3dFitData.!=(Teigha.Geometry.NurbCurve3dFitData,Teigha.Geometry.NurbCurve3dFitData)
Оператор неравенства для структуры NurbCurve3dFitData. Проверяет неидентичность двух экземпляров структуры.
Оператор неравенства для структуры NurbCurve3dFitData. Проверяет неидентичность двух экземпляров структуры.
Неравенство двух объектов NurbCurve3dFitData означает невыполнение по крайней мере одного из следующих условий:
* Определяющие точки совпадают;
* Равны степени обеих кривых;
* Данные касательных присутствуют или отсутствуют для обеих кривых;
* Равны начальные векторы касательных;
* Равны конечные векторы касательных.
a: Левый операнд. Тип NurbCurve3dFitData.
b: Правый операнд. Тип NurbCurve3dFitData.
Returns: Возвращает true, если операнды a и b не равны.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3dFitData.==(Teigha.Geometry.NurbCurve3dFitData,Teigha.Geometry.NurbCurve3dFitData)
Оператор равенства для структуры NurbCurve3dFitData. Проверяет идентичность двух экземпляров структуры.
Оператор равенства для структуры NurbCurve3dFitData. Проверяет идентичность двух экземпляров структуры.
Идентичность двух объектов NurbCurve3dFitData означает одновременное выполнение следующих условий:
* Определяющие точки совпадают;
* Равны степени обеих кривых;
* Данные касательных присутствуют или отсутствуют для обеих кривых;
* Равны начальные векторы касательных;
* Равны конечные векторы касательных.
a: Левый операнд. Тип NurbCurve3dFitData.
b: Правый операнд. Тип NurbCurve3dFitData.
Returns: Возвращает true, если операнды a и b равны.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3dFitData.Degree
Свойство Degree представляет степень NURB кривой.
Свойство Degree представляет степень NURB кривой.
Returns: Возвращает степень NURB кривой.  Тип int.

Teigha.Geometry.NurbCurve3dFitData.EndTangent
Свойство EndTangent представляет конечный вектор касательной.
Свойство EndTangent представляет конечный вектор касательной.
Returns: Возвращает конечный вектор касательной. Тип Vector3d.

Teigha.Geometry.NurbCurve3dFitData.FitPoints
Свойство FitPoints представляет массив определяющих точек NURB кривой.
Свойство FitPoints представляет массив определяющих точек NURB кривой.
Returns: Возвращает массив определяющих точек NURB кривой.
Тип Point3dCollection.

Teigha.Geometry.NurbCurve3dFitData.FitTolerance
Свойство FitTolerance представляет точность аппроксимации в определяющих точках.
Свойство FitTolerance представляет точность аппроксимации в определяющих точках.
Returns: Возвращает точность аппроксимации в определяющих точках.  Тип Tolerance.

Teigha.Geometry.NurbCurve3dFitData.KnotParam
Свойство KnotParam представляет использованный метод узловой параметризации сплайна.
Свойство KnotParam представляет использованный метод узловой параметризации сплайна.
Returns: Возвращает метод узловой параметризации сплайна.
Перечисление KnotParameterizationEnum.

Teigha.Geometry.NurbCurve3dFitData.StartTangent
Свойство StartTangent представляет начальный вектор касательной.
Свойство StartTangent представляет начальный вектор касательной.
Returns: Возвращает начальный вектор касательной.
Тип Vector3d.

Teigha.Geometry.NurbCurve3dFitData.TangentsExist
Свойство TangentsExist позволяет проверить существование данных о касательных.
Свойство TangentsExist позволяет проверить существование данных о касательных.
Returns: Возвращает true, если данные о касательных присутствуют.
В противном случае возвращает false.