HostMgd.PlottingServices.PlotToFileCapability.PlotToFileAllowed
Значение: 1.
Устройство поддерживает печать в файл. Если текущая конфигурация устройства настроена на печать в файл,
то свойство PlotConfig.IsPlotToFile возвращает значение true.