Teigha.DatabaseServices.RasterImageDef.UpdateEntities
Заставляет перерисовать геометрические объекты RasterImage
текущего чертежа, которые зависят от этого объекта, когда
данный объект будет закрыт. Этот метод требует, чтобы
определения изображения были открыты на запись.
Note
Геометрические объекты-изображения будут обновлены
автоматически после любой операции, изменяющей RasterImageDef
(например, загрузка, выгрузка, закрытие изображения).
Требуется вызвать этот метод только, если приложение изменило
лежащие в основе растровые изображения с помощью
OdGiRasterImage после выполнения открытия изображения по
полученному указателю на данные изображения.