Teigha.Geometry.EllipticalCylinder.EllipticalCylinder.#ctor
Конструктор по умолчанию класса EllipticalCylinder.
Конструктор по умолчанию класса EllipticalCylinder.
Notes
Создает экземпляр эллиптического цилиндра по умолчанию, с началом координат в точке (0,0,0) мировой системы координат (МСК),
осью симметрии, ориентированной в направлении (0,1,0) МСК,
направлением большой оси (1,0,0), большим и малым радиусами величиной 2.0.