Teigha.DatabaseServices.PlotStyleData
Структура PlotStyleData представляет данные для стиля печати.
Структура PlotStyleData представляет данные для объекта PlotStyle для одного цвета (или цвета объекта).

Teigha.DatabaseServices.PlotStyleData.!=(Teigha.DatabaseServices.PlotStyleData,Teigha.DatabaseServices.PlotStyleData)
Оператор неравенства для структуры PlotStyleData.
Оператор неравенства для структуры PlotStyleData.
a: Левый  операнд. Тип PlotStyleData.
b: Правый операнд. Тип PlotStyleData.
Returns: Возвращает true только в случае неравенства левого и правого операндов.
Тип bool.

Teigha.DatabaseServices.PlotStyleData.==(Teigha.DatabaseServices.PlotStyleData,Teigha.DatabaseServices.PlotStyleData)
Оператор равенства для структуры PlotStyleData.
Оператор равенства для структуры PlotStyleData.
a: Левый  операнд. Тип PlotStyleData.
b: Правый операнд. Тип PlotStyleData.
Returns: Возвращает true только в случае равенства левого и правого операндов.
Тип bool.

Teigha.DatabaseServices.PlotStyleData.AdaptiveLinetype
Свойство AdaptiveLinetype позволяет определить, является ли тип линии адаптивным в данном объекте.
Свойство AdaptiveLinetype позволяет определить, является ли тип линии LineType адаптивным для данного объекта PlotStyleData.
Returns: Возвращает true только в том случае, если тип линии LineType является адаптивным.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotStyleData.Color
Свойство Color представляет текущий цвет для данного объекта PlotStyleData.
Свойство Color представляет текущий цвет для данного объекта PlotStyleData.
Returns: Возвращает текущий цвет.
Тип Colors.EntityColor.

Teigha.DatabaseServices.PlotStyleData.ColorPolicy
Свойство ColorPolicy представляет битовые флаги, определяющие использование цвета стилем печати цвета для отображения объектов чертежа.
Свойство ColorPolicy представляет битовые флаги, определяющие использование цвета стилем печати цвета для отображения объектов чертежа.
Предусмотрено использование следующих значений:
* kDither = 1,
* kGrayScale    = 2,
* kNotUseObject = 4.
Returns: Возвращает битовые флаги, определяющие использование цвета для отображения объектов чертежа.
Тип int.

Teigha.DatabaseServices.PlotStyleData.DitherOn
Свойство DitherOn позволяет определить, включено ли в настройках стиля печати использование дизеринга.
Свойство DitherOn позволяет определить, включено ли в данном объекте PlotStyleData использование дизеринга.
Returns: Возвращает true, если использование дизеринга включено.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotStyleData.FillStyle
Свойство FillStyle представляет стиль заливки в данном объекте.
Свойство FillStyle представляет текущий стиль заливки в данном объекте PlotStyleData.
Returns: Возвращает стиль заливки. Перечисление DatabaseServices.FillStyle.

Teigha.DatabaseServices.PlotStyleData.GrayScaleOn
Свойство GrayScaleOn позволяет определить, включен ли режим GrayScale.
Свойство GrayScaleOn позволяет определить, включен ли в данном объекте режим GrayScale отображения объектов в полутонах серого..
Returns: Возвращает true, если в данном объекте включен режим отображения GrayScale.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotStyleData.LineEndStyle
Свойство LineEndStyle представляет текущий стиль концов линий, используемый в данном объекте.
Свойство LineEndStyle представляет текущий стиль концов линий, используемый в данном объекте.
Returns: Возвращает текущий стиль концов линий. Перечисление DatabaseServices.LineEndStyle.

Teigha.DatabaseServices.PlotStyleData.LineJoinStyle
Свойство LineJoinStyle представляет текущий стиль соединения линий, используемый в данном объекте.
Свойство LineJoinStyle представляет текущий стиль соединения линий, используемый в данном объекте.
Returns: Возвращает стиль соединения линий. Перечисление DatabaseServices.LineJoinStyle.

Teigha.DatabaseServices.PlotStyleData.LinePatternSize
Свойство LinePatternSize представляет размер шаблона линии в данном объекте.
Свойство LinePatternSize представляет размер шаблона линии в данном объекте.
Returns: Возвращает размер используемого шаблона линии.
Тип double.

Teigha.DatabaseServices.PlotStyleData.LineType
Свойство LineType представляет тип линии для данного объекта PlotStyleData.
Свойство LineType представляет тип линии для данного объекта PlotStyleData.
Returns: Возвращает тип линии из перечисления DatabaseServices.LineType.

Teigha.DatabaseServices.PlotStyleData.Lineweight
Свойство Lineweight представляет вес (толщину) линии в данном объекте.
Свойство Lineweight представляет вес (толщину) линии в данном объекте.
Returns: Возвращает вес (толщину) линии.
Тип double.

Teigha.DatabaseServices.PlotStyleData.PhysicalPenNumber
Свойство PhysicalPenNumber представляет номер физического пера для данного объекта.
Свойство PhysicalPenNumber представляет номер физического пера, использование которого предусмотрено данным объектом.
Returns: Возвращает номер физического пера.
Тип int.

Teigha.DatabaseServices.PlotStyleData.Screening
Свойство Screening представляет текущее значение скрининга в данном объекте.
Свойство Screening представляет текущее значение скрининга в данном объекте.
Диапазон допустимых значений этого свойства: [0.0 .. 100.0].
* 0 соответствует белому цвету.
* 100 означает использование цветов в их полной интенсивности.
Returns: Возвращает текущее значение скрининга.
Тип int.

Teigha.DatabaseServices.PlotStyleData.VirtualPenNumber
Свойство VirtualPenNumber представляет номер виртуального пера для данного объекта.
Свойство VirtualPenNumber представляет номер виртуального пера для данного объекта.
Returns: Возвращает номер виртуального пера.
Тип int.