Teigha.DatabaseServices.DrawLeaderOrderType
Данное перечисление определяет последовательность отрисовки линии выноски объекта MLeader.
Данное перечисление определяет последовательность отрисовки линии выноски объекта MLeader.