Teigha.BoundaryRepresentation.Element2dNodeCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель данной коллекции.
Тип Element2dNodeEnumerator.