Teigha.DatabaseServices.ShadePlotResLevel
Данное перечисление определяет доступные уровни разрешения при тонированной печати.
Данное перечисление определяет доступные уровни разрешения при печати растрированных и тонированных видовых экранов.