Teigha.Runtime.DynamicLinker.ModuleUnloadAborted
Событие ModuleUnloadAborted создается, когда динамический компоновщик прерывает неудачную попытку выгрузить модуль приложения.
Событие ModuleUnloadAborted создается, когда динамический компоновщик прерывает неудачную попытку выгрузить модуль приложения.