Teigha.Geometry.ExternalSurface
Класс ExternalSurface представляет неограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
Класс ExternalSurface представляет неограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
С экземплярами ExternalSurface можно работать как с любыми объектами Surface.
Доступ к ExternalSurface можно получить как к соответствующей поверхности Surface, если она существует.
Кроме того, возможно получить доступ к внешним данным в их нативной форме (что может оказаться более эффективным).
Одним из примеров использования ExternalSurface является доступ к поверхности ACIS.

Teigha.Geometry.ExternalSurface.#ctor
Конструктор по умолчанию класса ExternalSurface.
Конструктор по умолчанию класса ExternalSurface.
Создает пустой экземпляр с нулевым указателем на определение поверхности, неопределенным типом поверхности (другими словами, нет информации о системе, в которой была создана внешняя поверхность) и опцией предотвращения копирования внешней поверхности.

Teigha.Geometry.ExternalSurface.#ctor(IntPtr,Geometry.ExternalEntityKind)
Конструктор класса ExternalSurface.
Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
Конструктор класса ExternalSurface.
Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
surfaceDefinition: Входное определение внешней поверхности. Тип IntPtr.
surfaceKind: Информация о системе, в которой было создано определение внешней поверхности. Перечисление ExternalEntityKind.

Teigha.Geometry.ExternalSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип ExternalSurface.

Teigha.Geometry.ExternalSurface.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Текущее определение данного объекта удаляется.
surfaceDef: Указатель на определение внешней поверхности. Тип IntPtr.
surfaceKind: Информация о системе, в которой было создано определение внешней поверхности. Перечисление ExternalEntityKind.

Teigha.Geometry.ExternalSurface.ExternalSurfaceDefiniton
Свойство ExternalSurfaceDefiniton представляет определение внешней поверхности, связанной с данным объектом.
Свойство ExternalSurfaceDefiniton представляет определение внешней поверхности, связанной с данным объектом.
Returns: Возвращает определение внешней поверхности, связанной с данным объектом.
Тип IntPtr.

Teigha.Geometry.ExternalSurface.ExternalSurfaceKind
Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней поверхности.
Свойство ExternalSurfaceKind представляет информацию о системе, в которой было создано определение внешней поверхности.
Returns: Возвращает информацию о системе, в которой было создано определение внешней поверхности.
Перечисление ExternalEntityKind.

Teigha.Geometry.ExternalSurface.IsCone
Свойство IsCone позволяет проверить, является ли данная внешняя поверхность конусом.
Свойство IsCone определяет тип данной внешней поверхности и возвращает true, если она является конусом.
Returns: Возвращает true, если данная внешняя поверхность является конусом.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsCylinder
Свойство IsCylinder позволяет проверить, является ли данная внешняя поверхность цилиндром.
Свойство IsCylinder определяет тип данной внешней поверхности и возвращает true, если она является цилиндром.
Returns: Возвращает true, если данная внешняя поверхность является цилиндром.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsDefined
Свойство IsDefined позволяет проверить, является ли данный объект определенным.
Свойство IsDefined позволяет проверить, сформировано ли в данном объекте определение поверхности.
Returns: Возвращает true, если данный объект имеет определение поверхности.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsEllipCone
Свойство IsEllipCone позволяет проверить, является ли данная внешняя поверхность эллиптическим конусом.
Свойство IsEllipCone определяет тип данной внешней поверхности и возвращает true, если она является эллиптическим конусом.
Returns: Возвращает true, если данная внешняя поверхность является эллиптическим конусом.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsEllipCylinder
Свойство IsEllipCylinder позволяет проверить, является ли данная внешняя поверхность эллиптическим цилиндром.
Свойство IsEllipCylinder определяет тип данной внешней поверхности и возвращает true, если она является эллиптическим цилиндром.
Returns: Возвращает true, если данная внешняя поверхность является эллиптическим цилиндром.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsNativeSurface
Свойство IsNativeSurface позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней поверхности.
Свойство IsNativeSurface позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней поверхности.
Returns: Возвращает true, если геометрическая библиотека платформы поддерживает нативное представление данной внешней поверхности.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsNurbSurface
Свойство IsNurbSurface позволяет проверить, может ли данный экземпляр внешней поверхности быть представлен определением, которое является нативным для графической системы платформы.
Свойство IsNurbSurface позволяет проверить, может ли данный экземпляр внешней поверхности быть представлен определением, которое является нативным для графической системы платформы.
Returns: Возвращает true, если данный экземпляр внешней поверхности может быть представлен нативным определением в графической системе платформы.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsOwnerOfSurface
Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
Returns: Возвращает true, если данный объект является владельцем данных своего определения.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsPlane
Свойство IsPlane позволяет проверить, является ли данная внешняя поверхность плоскостью.
Свойство IsPlane определяет тип данной внешней поверхности и возвращает true, если она является плоскостью.
Returns: Возвращает true, если данная внешняя поверхность является плоскостью.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsSphere
Свойство IsSphere позволяет проверить, является ли данная внешняя поверхность сферой.
Свойство IsSphere определяет тип данной внешней поверхности и возвращает true, если она является сферой.
Returns: Возвращает true, если данная внешняя поверхность является сферой.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.IsTorus
Свойство IsTorus позволяет проверить, является ли данная внешняя поверхность тором.
Свойство IsTorus определяет тип данной внешней поверхности и возвращает true, если она является тором.
Returns: Возвращает true, если данная внешняя поверхность является тором.
В противном случае возвращает false.

Teigha.Geometry.ExternalSurface.nativeSurface
Свойство nativeSurface обеспечивает доступ к нативному представлению данной внешней поверхности в графической системе платформы.
Свойство nativeSurface обеспечивает доступ к нативному представлению данной внешней поверхности в графической системе платформы.
Returns: Возвращает нативное представление данной внешней поверхности в графической системе платформы.
Тип Surface.