Teigha.DatabaseServices.LayoutPaperPE.GetClass
Метод предоставляет класс, связанный с данным расширением протокола.
Метод предоставляет класс, связанный с данным расширением протокола.
Returns: Возвращает класс, связанный с данным расширением протокола.
Тип RXClass.