HostMgd.PlottingServices.PlotConfigInfoCollection.Item
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
index: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля и должно иметь допустимое значение.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип HostMgd.PlottingServices.PlotConfigInfo.