Teigha.DatabaseServices.FeatureControlFrame.GetDimstyleData
Метод позволяет получить запись таблицы размерных стилей с настройками размерного стиля (включая переопределения) этого объекта.
Метод позволяет получить запись таблицы размерных стилей с настройками размерного стиля (включая переопределения) этого объекта.
Returns: Возвращает запись таблицы размерных стилей.  Тип DimStyleTableRecord.