Teigha.Runtime.ProgressMeter.Start
Метод инициализирует индикатор прогресса начальным значением и делает его видимым.
Метод инициализирует индикатор прогресса начальным значением и делает его видимым.