HostMgd.EditorInput.Editor.SelectPrevious
Метод возвращает набор объектов, использованных в предыдущей команде,
если такой набор существует.
Метод используется для получения множества объектов,
которые были выбраны или задействованы в последней выполненной команде.
Это позволяет повторно использовать выборку без необходимости
заново выделять объекты вручную.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, если предыдущий набор объектов найден, и Cancel, если нет активной выборки).
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) объектов из предыдущей команды (если статус равен OK).
* StringResult — строковое значение (обычно не используется в данном контексте).
Если предыдущая команда не оставила выборку объектов, результат будет иметь статус Cancel.
Example
C#