Teigha.Geometry.PolylineCurve3d
Класс PolylineCurve3d представляет кусочно-линейные сплайны в трехмерном пространстве.
Класс PolylineCurve3d представляет кусочно-линейные сплайны в трехмерном пространстве.

Teigha.Geometry.PolylineCurve3d.#ctor
Конструктор по умолчанию класса PolylineCurve3d.
Создает новый объект без каких-либо реальных данных.
Конструктор по умолчанию класса PolylineCurve3d.
Создает новый объект без каких-либо реальных данных.

Teigha.Geometry.PolylineCurve3d.#ctor(Teigha.Geometry.Curve3d,System.Double)
Конструктор класса PolylineCurve3d.
Создает полилинию, которая аппроксимирует указанную трехмерную кривую с заданной точностью.
Конструктор класса PolylineCurve3d.
Создает полилинию, аппроксимирующую трехмерную кривую curve в пределах заданной точности epsilon.
curve: Кривая, которую требуется аппроксимировать полилинией. Тип Curve3d.
epsilon: Точность аппроксимации. Тип double.

Teigha.Geometry.PolylineCurve3d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection)
Конструктор класса PolylineCurve3d.
Создает полилинию с указанными управляющими вершинами и узловым вектором.
Конструктор класса PolylineCurve3d.
Создает полилинию с указанными управляющими вершинами controlPoints и узловым вектором knots.
knots: Входной узловой вектор. Тип KnotCollection.
controlPoints: Входные управляющие вершины. Тип Point3dCollection.

Teigha.Geometry.PolylineCurve3d.#ctor(Teigha.Geometry.Point3dCollection)
Конструктор класса PolylineCurve3d.
Создает полилинию по заданному массиву определяющих точек.
Конструктор класса PolylineCurve3d.
Создает полилинию по заданному массиву определяющих точек points.
points: Входная коллекция определяющих точек.  Тип Point3dCollection.

Teigha.Geometry.PolylineCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип PolylineCurve3d.

Teigha.Geometry.PolylineCurve3d.FitPointAt(System.Int32)
Метод предоставляет определяющую точку с указанным индексом.
Метод предоставляет определяющую точку данного сплайна с индексом i.
i: Входной индекс определяющей точки. Индексация начинается с нуля. Тип int.
Returns: Возвращает определяющую точку сплайна с индексом i. Тип Point3d.

Teigha.Geometry.PolylineCurve3d.SetFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод переопределяет определяющую точку сплайна с указанным индексом.
Метод переопределяет координаты определяющей точки сплайна с индексом i.
i: Входной индекс определяющей точки. Тип int.
point: Новые координаты определяющей точки с указанным индексом. Тип Point3d.

Teigha.Geometry.PolylineCurve3d.NumberOfFitPoints
Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
Returns: Возвращает количество определяющих точек сплайна. Тип int.