Teigha.DatabaseServices.DataTable.GetColumnTypeAt
Метод позволяет получить тип столбца с указанным индексом.
Метод позволяет получить тип столбца с указанным индексом.
index: Индекс искомого столбца. Тип int.
Returns: Возвращает тип  столбца. Тип CellType.
Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.