Teigha.Geometry.LinearEntity2d.GetLine
Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
Notes
В случае таких объектов как LineSeg2d или Ray2d этот метод позволяет получить бесконечную линию из ограниченного линейного объекта.
Returns: Возвращает бесконечную линию, коллинеарную данному линейному объекту.
Тип Line2d.