Teigha.DatabaseServices.DwgFiler.ReadHardPointerId
Метод предназначен для получения идентификатора жесткого указателя (HardPointerId) из текущего элемента данного объекта Filer.
Метод предназначен для получения идентификатора жесткого указателя (HardPointerId) из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатор жесткого указателя (HardPointerId). Тип ObjectId.