Teigha.GraphicsInterface.Drawable
Класс представляет графические объекты, как временные, так и постоянные, которые реализуют интерфейс графического отображения.
Все графические объекты, как временные, так и постоянные, реализуют интерфейс графического отображения.  Благодаря этому интерфейсу объекты способны отрисовать себя, используя Draw API.
Все отображаемые объекты являются производными от класса Drawable.  Этот класс реализует протокол, с помощью которого графическая система (GS) может запрашивать объекты об их геометрии, атрибутах, указателях кэша и идентификаторах в базе данных.
Объекты класса Drawable не обязаны непременно иметь графическое представление.  Некоторые объекты Drawable влияют только на атрибуты, геометрические преобразования или области обрезки; другие служат контейнерами для других объектов Drawable, не имея собственной геометрии или атрибутов. Подобными примерами являются классы LayerTableRecord и BlockTableRecord.
Объект класса Drawable не обязан быть объектом базы данных. Двумя примерами непостоянных объектов Drawable являются значок ПСК и сетка (Grid). Это визуальные элементы редактора nanoCAD, не принадлежащие базе данных.

Teigha.GraphicsInterface.Drawable.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.GraphicsInterface.Drawable.#ctor
Конструктор класса Teigha.GraphicsInterface.Drawable.
Конструктор класса Teigha.GraphicsInterface.Drawable.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool..

Teigha.GraphicsInterface.Drawable.SetAttributes(GraphicsInterface.DrawableTraits)
Метод устанавливает значения графических атрибутов для подобъектов текущего объекта, используя входной объект DrawableTraits.
Метод SetAttributes() принимает входной объект DrawableTraits и устанавливает значения графических атрибутов для подобъектов текущего объекта.
Метод вызывается графической системой (GS) для установки атрибутов по умолчанию у отображаемого объекта.
Текущее состояние рендеринга будет использовать эти внешние атрибуты до выполнения методов WorldDraw() и ViewportDraw() (а в случае 3D-GS — до отрисовки их кэшированной геометрии).
traits: Входной объект GraphicsInterface.DrawableTraits, который необходимо задать. Атрибуты заполняются значениями атрибутов подобъектов вызывающих объектов.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.SubSetAttributes(GraphicsInterface.DrawableTraits)
Метод устанавливает значения графических атрибутов подобъектов этого объекта и возвращает их вместе с графическими атрибутами подобъектов вызывающего объекта.
Метод принимает входной объект DrawableTraits, устанавливает значения графических атрибутов подобъектов этого объекта. и возвращает их вместе с атрибутами подобъектов вызывающего объекта.
traits: Входной объект GraphicsInterface.DrawableTraits, который необходимо задать. Атрибуты заполняются значениями атрибутов подобъектов вызывающих объектов.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.SubViewportDraw(GraphicsInterface.ViewportDraw)
Метод вычисляет объект и обеспечивает корректное отображение его геометрии в заданном видовом экране.
Метод используется для построения зависимой от видового представления части графики объекта.
Метод вызывается из ViewportDraw() и вычисляет объект для обеспечения корректного отображения геометрии в заданном видовом экране.
Отрисовывает объект в видовых экранах листа.  Ничего не делает в текущей реализации.
vd: Входной интерфейс ViewportDraw.  Тип GraphicsInterface.ViewportDraw.

Teigha.GraphicsInterface.Drawable.SubViewportDrawLogicalFlags(GraphicsInterface.ViewportDraw)
Метод предоставляет комбинацию атрибутных флагов, используемых для регенерации логического набора элементов отображаемой геометрии объекта, которая зависит от видовых представлений.
Метод возвращает комбинацию атрибутных флагов GraphicsInterface.AttributesFlags, используемых для регенерации логического набора элементов отображаемой геометрии объекта, которая зависит от видовых представлений.
Этот метод может быть переопределен в производных классах (которые наследуют Drawable), в реализации по умолчанию возвращает 1, что соответствует значению DrawableIsAnEnitity перечисления Teigha.GraphicsInterface.AttributesFlags.
Переданный в метод контекст ViewportDraw может использоваться отображаемым объектом, чтобы определить, какой именно логический набор регенерируется.
vd: Входной интерфейс ViewportDraw. Тип GraphicsInterface.ViewportDraw.
Returns: Возвращает логическую комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.ViewportDraw(GraphicsInterface.ViewportDraw)
Метод реализует отрисовку объекта в видовом экране с использованием входного интерфейса GraphicsInterface.ViewportDraw.
При вызове ViewportDraw() отрисовываемый объект использует переданный в метод интерфейс ViewportDraw для описания своей геометрии, которая зависит от видового экрана.
Метод вызывается для каждого видового экрана. Его результаты могут кэшироваться, но 3D GS гарантирует, что будет вызывать ViewportDraw() (если указано возвращаемым значением из WorldDraw()) для каждого вида и после всякого изменения параметров вида.
vd: Входной интерфейс ViewportDraw.  Тип GraphicsInterface.ViewportDraw.

Teigha.GraphicsInterface.Drawable.ViewportDrawLogicalFlags(GraphicsInterface.ViewportDraw)
Метод предназначен для доступа к флагам атрибутов отрисовки текущего видового экрана.
Метод предназначен для доступа к флагам атрибутов отрисовки текущего видового экрана из перечисления GraphicsInterface.AttributesFlags.
В частности, графическая система отслеживает флаг DrawableRegenTypeDependantGeometry, который указывает, что объект в этом логическом наборе использует изолинии.
Переданный в метод контекст ViewportDraw может использоваться отображаемым объектом, чтобы определить, какой именно логический набор регенерируется.
vd: Входной интерфейс ViewportDraw.  Тип GraphicsInterface.ViewportDraw.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.WorldDraw(GraphicsInterface.WorldDraw)
Метод реализует отрисовку объекта в пространстве модели с использованием входного интерфейса GraphicsInterface.WorldDraw.
При вызове WorldDraw() отображаемый объект использует переданный в метод интерфейс WorldDraw для описания своей геометрии, которая одинаково отображается в любых видовых экранах.
3D GS гарантирует, что данный метод будет вызван по крайней мере один раз, но последующие обновления экрана могут кэшироваться.
Что бы сделать недействительным любой кэш, который GS связала с отображаемым объектом, используйте вызов
.OnModified().
Тогда метод WorldDraw() будет снова вызван при очередном обновлении экрана.
wd: Входной интерфейс WorldDraw.  Тип GraphicsInterface.WorldDraw.
Returns: Возвращает true, только если геометрическое представление объекта не зависит от видового экрана.
Возвращаемое значение false указывает, что какая-то часть графики объекта зависит от видового представления, поэтому 3D GS должна дополнительно вызвать ViewportDraw(), чтобы для такого объекта получить законченную геометрию и полный набор атрибутов.

Teigha.GraphicsInterface.Drawable.SubWorldDraw(GraphicsInterface.WorldDraw)
Метод создает независимое от видовых представлений геометрическое представление этого объекта.
Метод создает независимое от видовых представлений геометрическое представление этого объекта.
Ничего не делает в текущей реализации.
Эту функцию можно переопределить в пользовательских классах.
wd: Входной интерфейс WorldDraw.  Тип GraphicsInterface.WorldDraw.
Returns: Возвращает true, только если геометрическое представление объекта не зависит от видового экрана. Возвращаемое значение false указывает, что какая-то часть графики объекта зависит от видового представления, поэтому 3D GS должна вызвать ViewportDraw(), чтобы для такого объекта получить законченную геометрию и полный набор атрибутов.

Teigha.GraphicsInterface.Drawable.Bounds
Свойство предоставляет доступ к границам отображаемого объекта, если они доступны.
Свойство предоставляет доступ к границам отображаемого объекта, если они доступны.
Возвращает значение null, если отображаемый объект не имеет границ, или границы не могут быть вычислены.
Returns: Возвращает границы отображаемого объекта или null, если границы недоступны или не существуют.
Тип System.Nullable.

Teigha.GraphicsInterface.Drawable.DrawableType
Свойство предоставляет доступ к типу текущего отображаемого объекта.
Свойство предоставляет доступ к типу текущего отображаемого объекта.
Returns: Возвращает тип текущего отображаемого объекта из перечисления GraphicsInterface.DrawableType.

Teigha.GraphicsInterface.Drawable.Id
Свойство возвращает идентификатор в базе данных, соответствующий этому отображаемому объекту (если этот объект является постоянным).
Свойство возвращает идентификатор в базе данных, соответствующий этому отображаемому объекту (если этот объект является постоянным).
Returns: Возвращает идентификатор отображаемого объекта в базе данных. Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.Drawable.IsPersistent
Свойство позволяет установить, является ли объект Drawable резидентным в базе данных.
Свойство позволяет установить, является ли объект Drawable резидентным в базе данных.
Возвращает true, если объект Drawable является резидентным в базе данных (принадлежит объекту Model, который требует использования функций открытия и закрытия).
Возвращает false, если объект Drawable не является постоянным (non-persistent); доступ к таким объектам осуществляется напрямую через их указатели на Drawable.
Returns: Возвращает true, если объект Drawable является резидентным в базе данных. В противном случае возвращает false.