Teigha.DatabaseServices.DataLinkManager
Класс предназначен для управления внешними ссылками в базе данных.
Класс предназначен для управления внешними ссылками в базе данных.

Teigha.DatabaseServices.DataLinkManager.AddDataLink(Teigha.DatabaseServices.DataLink)
Добавляет в данный менеджер указанный объект внешней ссылки.
Добавляет в данный менеджер указанный объект внешней ссылки.
dataLink: Добавляемый объект внешней ссылки. Тип DataLink.
Returns: Возвращает идентификатор внешней ссылки.  Тип ObjectId.

Teigha.DatabaseServices.DataLinkManager.GetDataLink(String)
Метод позволяет получить идентификатор объекта ObjectId внешней ссылки с указанным именем.
Метод позволяет получить идентификатор объекта ObjectId внешней ссылки с указанным именем.
name: Имя внешней ссылки. Тип String.
Returns: Возвращает идентификатор объекта внешней ссылки. Тип ObjectId.

Teigha.DatabaseServices.DataLinkManager.RemoveDataLink(Teigha.DatabaseServices.ObjectId)
Метод удаляет внешнюю ссылку с указанным идентификатором объекта.
Метод удаляет внешнюю ссылку с указанным идентификатором объекта ObjectId.
idDataLink: Идентификатор удаляемой внешней ссылки.  Тип ObjectId.

Teigha.DatabaseServices.DataLinkManager.RemoveDataLink(String)
Метод удаляет внешнюю ссылку с указанным именем.
Метод удаляет внешнюю ссылку с указанным именем.
name: Имя удаляемой внешней ссылки.  Тип String.
Returns: Возвращает идентификатор ObjectId уделенной внешней ссылки.

Teigha.DatabaseServices.DataLinkManager.Update(Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод обновляет данные для указанных внешних ссылок в данном экземпляре DataLinkManager.
Метод обновляет данные для указанных внешних ссылок в данном экземпляре DataLinkManager.
dataIds: Коллекция ID обновляемых внешних ссылок. Тип ObjectIdCollection.
direction: Направление обновления. Тип UpdateDirection.
option: Опции обновления. Тип UpdateOption.

Teigha.DatabaseServices.DataLinkManager.Update(Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод обновляет данные всех внешних ссылок в данном экземпляре DataLinkManager.
Метод обновляет данные всех внешних ссылок в данном экземпляре DataLinkManager.
direction: Направление обновления. Тип UpdateDirection.
option: Опции обновления. Тип UpdateOption.

Teigha.DatabaseServices.DataLinkManager.DataLinkCount
Свойство обеспечивает доступ к количеству внешних ссылок в данном эекземпляре DataLinkManager.
Свойство обеспечивает доступ к количеству внешних ссылок в данном эекземпляре DataLinkManager.
Returns: Возвращает количество внешних ссылок. Тип int.