Teigha.DatabaseServices.ObjectOverrule.SetNoFilter
Метод отключает использование любых методов предварительной фильтрации объектов перед вызовом переопределений (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также IsApplicable).
Метод отключает использование любых методов предварительной фильтрации объектов перед вызовом переопределений (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также IsApplicable).