Teigha.DatabaseServices.Database.Wblock
Создает новый объект типа база данных, и затем использует
механизм wblockClone для записи содержимого геометрических
объектов базы данных, из которой вызывается метод, в новую
базу данных.