Teigha.Geometry.Curve3d.IsClosed
Метод проверяет,является ли данная кривая замкнутой.
Метод проверяет,является ли данная кривая замкнутой.  Фактически метод проверяет совпадение начальной и конечной точек кривой.
Реализация метода вызывает Curve3d.IsClosed(Tolerance tolerance) с допуском, равным Tolerance.Global.
Returns: Возвращает true, если начальная и конечная точки кривой совпадают. В противном случае возвращает false.