Teigha.DatabaseServices.BlockEnd
Класс представляет объекты BlockEnd в базе данных.
Класс представляет объекты BlockEnd в базе данных.
Эти объекты создаются и обрабатываются автоматически для каждой записи BlockTableRecord и не имеют связанной с ними геометрии.
Клиентские приложения могут свободно добавлять к объектам BlockEnd расширенные данные (xdata) или словари расширений, но не должны создавать или удалять их.  Не следует создавать классы, производные от класса BlockEnd.

Teigha.DatabaseServices.BlockEnd.#ctor
Конструктор по умолчанию класса BlockEnd.
Конструктор по умолчанию класса BlockEnd.