Teigha.BoundaryRepresentation.ValidationLevel
Перечисление ValidationLevel определяет уровни проверки для объекта BREP.
Перечисление ValidationLevel определяет уровни проверки для объекта BREP.
Пообъектный подход при установке уровней проверки предотвращает любые конфликты между одновременно загруженными приложениями.