Teigha.Geometry.CurveBoundaryData
Структура CurveBoundaryData представляет данные, которые определяют объект CurveBoundary.
Структура CurveBoundaryData представляет данные, которые определяют объект CurveBoundary.

Teigha.Geometry.CurveBoundaryData.Equals(Object)
Метод предназначен для проверки идентичности данного объекта указанному объекту.
Метод предназначен для проверки идентичности данного объекта переданному объекту obj.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, с которым выполняется сравнение. Тип Object.
Returns: Возвращает true, если данный объект идентичен объекту obj.
В противном случае возвращает false.

Teigha.Geometry.CurveBoundaryData.IsEqualTo(Teigha.Geometry.CurveBoundaryData)
Метод предназначен для сравнения 2D- и 3D-ориентаций, а также 2D- и 3D-кривых в этом определении границы с данными в указанном объекте CurveBoundaryData.
Метод предназначен для сравнения 2D- и 3D-ориентаций, а также 2D- и 3D-кривых в этом определении границы с данными в указанном объекте CurveBoundaryData.
a: Входной объект, с которым выполняется сравнение. Тип CurveBoundaryData.
Returns: Возвращает true, если сравнение подтверждает идентичность 2D- и 3D-ориентаций, а также 2D- и 3D-кривых для сравниваемых объектов.
В противном случае возвращает false.

Teigha.Geometry.CurveBoundaryData.!=(Teigha.Geometry.CurveBoundaryData,Teigha.Geometry.CurveBoundaryData)
Оператор неравенства структуры CurveBoundaryData.
Оператор неравенства структуры CurveBoundaryData.
a: Левый  операнд. Тип CurveBoundaryData.
b: Правый операнд. Тип CurveBoundaryData.
Returns: Возвращает true, если данные определений границ a и b отличаются.
В противном случае возвращает false.

Teigha.Geometry.CurveBoundaryData.==(Teigha.Geometry.CurveBoundaryData,Teigha.Geometry.CurveBoundaryData)
Оператор равенства структуры CurveBoundaryData.
Оператор равенства структуры CurveBoundaryData.
a: Левый  операнд. Тип CurveBoundaryData.
b: Правый операнд. Тип CurveBoundaryData.
Returns: Возвращает true, если данные определений границ a и b идентичны.
В противном случае возвращает false.

Teigha.Geometry.CurveBoundaryData.Orientation2d
Свойство Orientation2d позволяет проверить логическую ориентацию 2D-кривых в параметрическом пространстве.
Свойство Orientation2d позволяет проверить логическую ориентацию 2D-кривых в параметрическом пространстве.
Returns: Возвращает true, если ориентация 2D-кривых является нормальной.
В случае обратной ориентации возвращает false.

Teigha.Geometry.CurveBoundaryData.Orientation3d
Свойство Orientation3d позволяет проверить логическую ориентацию 3D-кривых в данном объекте.
Свойство Orientation3d позволяет проверить логическую ориентацию 3D-кривых в данном объекте.
Returns: Возвращает true, если ориентация 3D-кривых является нормальной.
В случае обратной ориентации возвращает false.