Teigha.DatabaseServices.HatchStyle.Normal
Значение: 0. Штриховка переключается на каждой границе.
Стиль штрихования Normal штрихует внутрь от внешнего цикла границы.
При столкновении с внутренним пересечением штрихование отключается до тех пор, пока не встретится другое пересечение.
Таким образом, области, отделенные от внешней стороны заштрихованной области нечетным числом пересечений, штрихуются, а области, отделенные четным числом пересечений, — нет.