Teigha.DatabaseServices.MlineStyleElement
Эта структура инкапсулирует данные о цвете, смещении и типе линий, используемые объектами MlineStyle.
Эта структура инкапсулирует данные о цвете, смещении и типе линий, используемые объектами MlineStyle.

Teigha.DatabaseServices.MlineStyleElement.#ctor(System.Double,Teigha.Colors.Color,Teigha.DatabaseServices.ObjectId)
Конструктор класса MlineStyleElement.
Создает элемент стиля с указанным смещением, цветом и идентификатором типа линии.
Конструктор класса MlineStyleElement.
Создает элемент стиля с указанным смещением, цветом и идентификатором типа линии.
offset: Смещение элемента. 		Тип double.
color: Цвет элемента. 			Тип Color.
linetypeId: Идентификатор типа линии. 	Тип ObjectId.

Teigha.DatabaseServices.MlineStyleElement.ToString(IFormatProvider)
Метод формирует эквивалентное представление данного объекта в виде текстовой строки, которое учитывает предписанные языковые и региональные настройки.
Метод формирует эквивалентное представление данного объекта в виде текстовой строки, которое учитывает предписанные языковые и региональные настройки.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает текстовою строку, представляющую данный объект. Тип String.

Teigha.DatabaseServices.MlineStyleElement.Color
Свойство возвращает цвет данного элемента стиля.
Свойство возвращает цвет данного элемента стиля.
Returns: Возвращает цвет элемента стиля. Тип Colors.Color.

Teigha.DatabaseServices.MlineStyleElement.LinetypeId
Свойство возвращает идентификатор объекта типа линий, используемого как часть элемента стиля.
Свойство возвращает идентификатор объекта типа линий, используемого как часть элемента стиля.
Returns: Возвращает идентификатор объекта типа линий. Тип ObjectId.

Teigha.DatabaseServices.MlineStyleElement.Offset
Свойство возвращает смещение для данного элемента стиля.
Свойство возвращает смещение для данного элемента стиля.
Returns: Возвращает смещение для данного элемента стиля. Тип double.