HostMgd.PlottingServices.PageCancelledEventHandler
Делегат PageCancelledEventHandler предназначен для обработки события PlotReactorManager.PageCancelled,
возникающего, когда пользователь отменил вывод на плоттер текущей страницы.
Делегат PageCancelledEventHandler предназначен для обработки события PlotReactorManager.PageCancelled,
возникающего, когда пользователь отменил вывод на плоттер текущей страницы.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события,
а аргумент e содержит параметры события.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип EventArgs.