Teigha.DatabaseServices.LinkedTableData.GetDataLink
Метод позволяет получить коллекцию всех идентификаторов объектов внешних ссылок.
Метод позволяет получить коллекцию всех идентификаторов объектов внешних ссылок.
Returns: Возвращает коллекцию идентификаторов внешних ссылок. Тип DatabaseServices.ObjectIdCollection.