Teigha.DatabaseServices.MeshDataCollection
Структура MeshDataCollection предназначена для хранения результатов метода
Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
Структура MeshDataCollection предназначена для хранения результатов метода
Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
Это представление сети содержит массивы вершин, граней, цветов граней и материалов.

Teigha.DatabaseServices.MeshDataCollection.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Int32Collection,Teigha.Colors.EntityColorCollection,Teigha.DatabaseServices.ObjectIdCollection)
Конструктор структуры MeshDataCollection.
Конструктор структуры MeshDataCollection.
pts: Массив вершин сети. Тип Point3dCollection.
faces: Массив граней сети. Тип Int32Collection.
colors: Массив цветов граней. Тип EntityColorCollection.
materialIds: Массив идентификаторов материалов. Тип ObjectIdCollection.

Teigha.DatabaseServices.MeshDataCollection.ColorArray
Свойство представляет коллекцию цветов граней сети.
Свойство представляет коллекцию цветов граней сети.
Returns: Возвращает массив цветов граней.  Тип EntityColorCollection.

Teigha.DatabaseServices.MeshDataCollection.FaceArray
Свойство представляет коллекцию граней сети.
Свойство представляет коллекцию граней сети.
Returns: Возвращает массив граней сети. Тип Int32Collection.

Teigha.DatabaseServices.MeshDataCollection.MaterialIdArray
Свойство представляет коллекцию идентификаторов материалов.
Свойство представляет коллекцию идентификаторов материалов.
Returns: Возвращает массив идентификаторов объектов-материалов.
Тип ObjectIdCollection.

Teigha.DatabaseServices.MeshDataCollection.VertexArray
Свойство представляет коллекцию 3D-точек в вершинах сети.
Свойство представляет коллекцию 3D-точек в вершинах сети.
Returns: Возвращает коллекцию 3D-точек в вершинах сети.
Тип Point3dCollection.