HostMgd.EditorInput.PromptIntegerResultEventHandler
Делегат предназначен для обработки событий,
возникающих после завершения операции ввода
целого числа пользователем в редакторе nanoCAD.
Делегат используется как сигнатура метода-обработчика для событий,
связанных с вводом целочисленных значений через интерактивные команды
— такие как GetInteger(). Он позволяет получать результат ввода,
проверять статус операции и выполнять дальнейшие действия
на основе введённого пользователем значения.
Делегат передаёт данные события через объект PromptIntegerResultEventArgs,
который содержит значение числа, статус выполнения (OK, Cancel, Error)
и строковое представление ввода.
Этот тип делегата применяется в надстройках и плагинах,
где требуется реагировать на завершение ввода целого числа,
например, при запросе количества копий, номера слоя
или любого другого параметра, ограниченного диапазоном
16-битного целого (от -32768 до +32767).
sender: Источник события, обычно представляет экземпляр редактора (Editor),
e: Объект, содержащий данные о результате ввода