Teigha.DatabaseServices.AssocManager
Этот класс представляет менеджер ассоциативных связей, который глобально управляет структурой ассоциативных связей.
Этот класс представляет менеджер ассоциативных связей.
Этот класс глобально управляет структурой ассоциативных связей.
Для каждой базы данных существует только один экземпляр этого класса.

Teigha.DatabaseServices.AssocManager.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.AssocManager.AddGlobalEvaluationCallback(Object,System.Int32)
Метод добавляет указанный обратный вызов в глобальный объект AssocEvaluationMultiCallback. Не реализован.
Метод добавляет указанный объект обратного вызова в глобальный объект AssocEvaluationMultiCallback. Дополнительно задается порядок order этого обратного вызова. На данный момент не реализован.
callback: Пользовательский обратный вызов, на который будет ссылаться объект AssocEvaluationMultiCallback. Тип Object.
order: Порядок выполнения пользовательских обратных вызовов. Тип int.

Teigha.DatabaseServices.AssocManager.AuditAssociativeData(Teigha.DatabaseServices.Database,System.Boolean)
Метод проверяет ассоциативные данные в базе данных и пытается устранить ошибки в случае их обнаружения. Не реализован.
Метод проверяет ассоциативные данные в базе данных и пытается устранить ошибки в случае их обнаружения.
Дополнительно логическим аргументом traverseWholeDatabase в метод можно передать указание проверять все объекты в базе данных и, следовательно, загружать их в память.
На данный момент не реализован.
database: База данных, в которой необходимо проверять ассоциативные данные.
traverseWholeDatabase: Если принимает значение true, то будут загружаться в память и проверяться все объекты в базе данных. Тип bool.

Teigha.DatabaseServices.AssocManager.EvaluateTopLevelNetwork(Teigha.DatabaseServices.Database,Object,System.Int32)
Метод обновляет ассоциативную сеть верхнего уровня (представленную объектом AssocNetwork) указанной базы данных, используя обратный вызов глобального обновления.
Метод обновляет ассоциативную сеть верхнего уровня (представленную объектом AssocNetwork) указанной базы данных, используя обратный вызов глобального обновления.
В большинстве случаев клиентскому коду не требуется явно обновлять ассоциативную сеть верхнего уровня. Это происходит автоматически при изменении режима блокировки документа, а также в ходе операций перетаскивания.
database: База данных, ассоциативную сеть верхнего уровня требуется обновить (перевычислить).
callback: Пользовательский обратный вызов, на который будет ссылаться объект AssocEvaluationMultiCallback.
callbackOrder: Порядок выполнения пользовательских обратных вызовов. Чем меньше значение порядка, тем раньше выполняется обратный вызов.  Тип int.
Returns: Возвращает true, если обновление ассоциативной сети завершается успешно.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocManager.HasAssocNetwork(Teigha.DatabaseServices.Database)
Метод проверяет, имеет ли указанная база данных глобальную ассоциативную сеть (представленную объектом AssocNetwork). Не реализован.
Метод проверяет, имеет ли указанная база данных глобальную ассоциативную сеть (представленную объектом AssocNetwork). На данный момент не реализован.
database: Проверяемая база данных. Тип Teigha.DatabaseServices.Database.
Returns: Возвращает true, если база данных database имеет глобальную ассоциативную сеть.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocManager.RemoveGlobalEvaluationCallback(Object)
Метод удаляет указанный пользовательский обратный вызов обновления из глобального объекта AssocEvaluationMultiCallback.
Метод удаляет указанный пользовательский обратный вызов обновления из глобального объекта AssocEvaluationMultiCallback.
callback: Удаляемый пользовательский обратный вызов. Тип Object.