Teigha.DatabaseServices.FieldCodeFlags.EvaluatedChildren
Значение: 4.
Получает код поля с вычисленным текстом дочерних элементов.
Этот флаг комбинируется с FieldCode.
Неприменим при задании кода поля и будет игнорироваться в этом контексте.