HostMgd.EditorInput.SelectionTextInputEventArgs
Класс, обеспечивающий данными события KeywordInput и
KeywordInput класса PromptSelectionOptions.

HostMgd.EditorInput.SelectionTextInputEventArgs.AddObjects(array)
Добавляет объекты в выбранный набор.
ids: Массив Id добавляемых объектов

HostMgd.EditorInput.SelectionTextInputEventArgs.Input
Возвращает ввод пользователя в виде строки.

HostMgd.EditorInput.SelectionTextInputEventArgs.SetErrorMessage(System.String)
Задает сообщение об ошибке, которое отображается
пользователю.
errorMessage: Тест сообщения об ошибке