Teigha.GraphicsSystem.SelectionReactor
Класс SelectionReactor является базовым для пользовательских классов, которые получают из графической системы уведомления о событиях выбора объектов.
Класс SelectionReactor является базовым для пользовательских классов, которые получают из графической системы уведомления о событиях выбора объектов.

Teigha.GraphicsSystem.SelectionReactor.#ctor
Конструктор по умолчанию класса SelectionReactor.
Конструктор по умолчанию класса SelectionReactor.

Teigha.GraphicsSystem.SelectionReactor.Selected(Teigha.GraphicsSystem.DrawableDesc)
Метод уведомления, который вызывается всякий раз, когда выбран объект DrawableDesc.
Метод уведомления, который вызывается всякий раз, когда выбран объект DrawableDesc.
Позволяет реализовать кастомизированную логику реагирования на выбор объекта.
pDrawableDesc: Входной объект, который оказался выбранным. Тип DrawableDesc.
Returns: Возвращает значение true только в том случае, если операция должна быть продолжена.
В противном случае возвращает false.

Teigha.GraphicsSystem.SelectionReactor.Selected(GraphicsInterface.PathNode,GraphicsInterface.Viewport)
Метод уведомления, который вызывается всякий раз, когда в указанном видовом экране выбран объект с указанным узлом пути к объекту.
Метод уведомления, который вызывается всякий раз, когда в указанном видовом экране выбран объект с указанным узлом пути к объекту.
Позволяет реализовать кастомизированную логику реагирования на выбор объекта.
A_0: Узел пути к выбранному объекту. Тип GraphicsInterface.PathNode.
A_1: Видовой экран, в котором выбран узел пути к объекту A_0. Тип GraphicsInterface.Viewport.
Returns: Возвращает реакцию на выделение объекта как значение из перечисления SelectionReactorResult (продолжить обработку, прервать выбор, пропустить выбор объекта, ...).