Teigha.BoundaryRepresentation.Element2dNodeCollection
Класс Element2dNodeCollection представляет коллекцию узлов объекта Element2d.
Класс Element2dNodeCollection представляет коллекцию узлов объекта Element2d.