HostMgd.ApplicationServices.XrefFileLock.ReloadFile
Перезагрузка соответствующего файла (ов) внешней ссылки по
списку ID записей таблицы блоков (рассинхронизированных) для
текущего чертежа. После этого (т.е. после перезагрузки самих
файлов внешних ссылок) файлы внешних ссылок будут снова
синхронизированы для всех внешних ссылок.
Этот вариант метода использует внутренний список ID
рассинхронизированных записей.