Teigha.DatabaseServices.OleDvAspect.Thumbnail
Значение: 2. Представление объекта в виде миниатюры, позволяющее этому объекту отображаться в инструменте просмотра.
Миниатюра представляет собой аппаратно-независимое растровое изображение, возможно, вставленное в метафайл.
Рекомендуется использовать 16 цветов, характерный размер - примерно 120 х 120 пикселей.