HostMgd.EditorInput.SelectionSetDelayMarshalled.GetEnumerator
Метод возвращает итератор коллекции класса.

HostMgd.EditorInput.SelectionSetDelayMarshalled.GetEnumerator
Метод предоставляет перечислитель для данного набора выделенных объектов чертежа.
Не реализован.
Метод предоставляет перечислитель для данного набора выделенных объектов чертежа.
В текущей версии не реализован.
Returns: Возвращает перечислитель для данного набора объектов.
Тип System.Collections.IEnumerator.