Teigha.DatabaseServices.LayerStateManager.AbortLayerStateRename
Это событие создается, если прерван процесс переименования состояния слоя.
Это событие создается, если прерван процесс переименования состояния слоя.