Teigha.DatabaseServices.UnderlayItemCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции.
Тип Collections.IEnumerator.