Teigha.DatabaseServices.TransactionManager.GetAllObjects
Метод выполняет поиск всех существующих на данный момент объектов транзакции и возвращает коллекцию с указателями на все найденные объекты.
Метод выполняет поиск всех существующих на данный момент объектов транзакции и возвращает коллекцию с указателями на все найденные объекты.