Teigha.DatabaseServices.AssocAction.ObjectThatOwnsNetworkInstance
Метод позволяет найти объект, владеющий сетью AssocNetwork, которой принадлежит данное действие AssocAction.
Метод позволяет найти ObjectId объекта DBObject, владеющего сетью AssocNetwork, которой принадлежит данное действие AssocAction.
Начиная с данного действия AssocAction, этот метод проверяет как само это действие, так и его владельцев (в смысле "физической" принадлежности объектов в базе данных nanoCAD) до тех пор, пока не будет найдена сеть AssocNetwork, владельцем которой в "базе данных" не является другая сеть AssocNetwork.  Затем решается обратная задача по отношению к методу AssocNetwork.GetInstanceFromObject(), т.е. находится такой объект DBObject, для которого метод GetInstanceFromObject() возвращает сеть AssocNetwork.
Returns: Возвращает ObjectId объекта DBObject, владеющего сетью AssocNetwork, которой принадлежит данное действие AssocAction.
Тип DatabaseServices.ObjectId.