Teigha.GraphicsInterface.DisplayStyle.Clone
Метод предназначен для клонирования текущего стиля отображения.
Метод клонирует текущий стиль отображения.
Returns: Возвращает клонированный объект. Тип DisplayStyle.