Teigha.Geometry.Vector2dCollection.ToArray
Метод создает массив объектов Vector2d, содержащий копии всех элементов данной коллекции.
Метод создает массив объектов Vector2d, содержащий копии всех элементов данной коллекции.
Returns: Возвращает массив, содержащий копии всех элементов данной коллекции.
Тип Vector2d[].