Teigha.GraphicsInterface.GIRasterImage.ScanLines
Метод позволяет извлечь из данного растрового объекта массив строк развертки в формате BMP.
Метод позволяет извлечь из данного растрового объекта массив строк развертки в формате BMP.
Returns: Возвращает массив строк развертки растрового изображения в формате BMP.
Тип unsigned char[].