Teigha.DatabaseServices.Solid3d.SeparateBody
Метод позволяет разделить данное 3D-тело на массив твердых тел, представляющих дополнительные непересекающиеся объемы.
Метод позволяет разделить данное 3D-тело на массив твердых тел, представляющих дополнительные непересекающиеся объемы.
Данный объект редуцируется в одно из этих твердых тел. Для сохранения других тел массива ваше приложение должно добавить их в базу данных документа.
Этот метод реализован только в среде пространственного моделирования.
Returns: Возвращает массив твердых тел с непересекающимися объемами. Тип Solid3d[].