Teigha.Colors.TransparencyCollection.ToArray
Метод создает массив объектов Transparency, содержащий копии всех элементов данной коллекции.
Метод создает массив объектов Transparency, содержащий копии всех элементов данной коллекции.
Returns: Возвращает массив, содержащий копии всех элементов данной коллекции.
Тип Transparency[].