HostMgd.EditorInput.JigPrompts.Result
Набор данных, полученных от пользователя после запроса
Значение свойства меняется во время работы технологии Jig при каждом изменении положения курсора мыши на экране
либо при вводе с клавиатуры. После ввода с клавиатуры, свойство DragStatus
примет значение DragEnd и изменение объекта или группы объектов завершится с введенными данными.
Returns: Возвращает набор данных, полученных от пользователя после запроса угла, расстояния, точки или текста.