Teigha.GraphicsInterface.LinetypeCollection
Класс LinetypeCollection представляет коллекцию типов линий.
Класс LinetypeCollection представляет коллекцию типов линий.

Teigha.GraphicsInterface.LinetypeCollection.#ctor
Конструктор по умолчанию класса LinetypeCollection.
Создает пустую коллекцию типов линий.
Конструктор по умолчанию класса LinetypeCollection.
Создает пустую коллекцию типов линий.

Teigha.GraphicsInterface.LinetypeCollection.Add(Teigha.GraphicsInterface.Linetype)
Метод предназначен для добавления в коллекцию нового типа линий.
Метод предназначен для добавления в коллекцию нового типа линий.
value: Входной тип линий, добавляемый в коллекцию.  Тип Linetype.
Returns: Возвращает индекс вновь созданного элемента коллекции.
Тип int.

Teigha.GraphicsInterface.LinetypeCollection.Contains(Teigha.GraphicsInterface.Linetype)
Метод позволяет проверить, содержится ли в данной коллекции указанный тип линии.
Метод позволяет проверить, содержится ли в данной коллекции тип линии value.
value: Проверяемый тип линии. Тип Linetype.
Returns: Возвращает true, если тип линии value уже содержится в данной коллекции.
В противном случае возвращает false.

Teigha.GraphicsInterface.LinetypeCollection.IndexOf(Teigha.GraphicsInterface.Linetype)
Метод предоставляет индекс элемента коллекции, который соответствует указанному в аргументе типу линии.
Метод предоставляет индекс элемента коллекции, который соответствует указанному в аргументе типу линии value.
value: Проверяемый тип линии. Тип Linetype.
Returns: Возвращает индекс типа линии value в коллекции. Тип int.
Если тип линии value в коллекции отсутствует, метод возвращает -1.

Teigha.GraphicsInterface.LinetypeCollection.Insert(System.Int32,Teigha.GraphicsInterface.Linetype)
Метод вставляет указанный тип линии в коллекцию по указанному индексу.
Метод вставляет указанный тип линии в коллекцию по указанному индексу.
Notes
Метод выбрасывает исключение ArgumentOutOfRangeException, если указанный индекс index оказывается недействительным.
index: Входное значение индекса для вставляемого типа линии value. Тип int.
value: Вставляемый в коллекцию тип линии. Тип Linetype.

Teigha.GraphicsInterface.LinetypeCollection.Remove(Teigha.GraphicsInterface.Linetype)
Метод удаляет из коллекции указанный тип линии.
Метод удаляет из коллекции указанный в аргументе тип линии.
value: Удаляемый тип линии. Тип Linetype.

Teigha.GraphicsInterface.LinetypeCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции тип линии, содержащийся в коллекции по указанному индексу.
Метод удаляет из коллекции тип линии, содержащийся в коллекции по указанному индексу index.
Notes
Метод выбрасывает исключение ArgumentOutOfRangeException, если указанный индекс index оказывается недействительным.
index: Индекс удаляемого из коллекции типа линии. Тип int.

Teigha.GraphicsInterface.LinetypeCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет текущее количество элементов в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип int.

Teigha.GraphicsInterface.LinetypeCollection.IsFixedSize
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Returns: Возвращает true, если размер коллекции является фиксированным.
В противном случае возвращает false.

Teigha.GraphicsInterface.LinetypeCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, доступна ли эта коллекция только для чтения.
Свойство IsReadOnly позволяет проверить, доступна ли эта коллекция только для чтения.
Returns: Возвращает true, если данная коллекция доступна только для чтения.
В противном случае возвращает false.

Teigha.GraphicsInterface.LinetypeCollection.Item
Свойство Item представляет элемент коллекции с указанным индексом.
Свойство Item представляет элемент коллекции с указанным индексом.
index: Индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции под индексом index.
Тип Linetype.