Teigha.DatabaseServices.DataCell.SetDouble
Метод устанавливает для этой ячейки значение типа double.
Метод устанавливает для этой ячейки значение типа double, заданное входным аргументом value.
value: Входное значение для ячейки. Тип double.