HostMgd.EditorInput.PromptDoubleOptions
Класс предоставляет параметры для настройки интерактивного ввода
вещественного числа в nanoCAD, такие как сообщение, диапазон значений
и значение по умолчанию.
Класс является запечатанным (sealed) и наследуется от PromptNumericalOptions.
Он используется при вызове методов ввода чисел с плавающей точкой — например,
GetDouble() — для настройки поведения команды ввода. С его помощью можно задать:
* текст приглашения (Message),
* значение по умолчанию (DefaultValue),
* режимы ввода (AllowNone, AllowNegative, AllowZero и др.).
Этот класс позволяет гибко управлять пользовательским интерфейсом при вводе чисел,
обеспечивая контроль над допустимыми значениями и улучшая взаимодействие с пользователем.
Example
C#

HostMgd.EditorInput.PromptDoubleOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса с заданным
приглашающим сообщением для ввода вещественного числа.
Конструктор создаёт объект класса PromptDoubleOptions,
который используется при вызове метода GetDouble() или других команд,
требующих интерактивного ввода вещественного числа в nanoCAD.
Он устанавливает текст приглашения, отображаемый пользователю в командной строке,
а все остальные параметры (например, DefaultValue, LowerLimit, AllowNone)
инициализируются значениями по умолчанию.
Этот конструктор является основным способом задания начального сообщения,
которое подсказывает пользователю, какое значение требуется ввести — например,
"Введите коэффициент масштабирования:" или "Укажите толщину линии:".
После создания объекта его параметры можно дополнительно
настроить перед передачей в команду ввода.
message: Текст приглашения, отображаемый в командной строке
Пример: "Введите значение угла (в градусах)

HostMgd.EditorInput.PromptDoubleOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением,
включающим локальные и глобальные ключевые слова.
Конструктор создаёт объект класса PromptDoubleOptions, используемый при настройке
интерактивного ввода вещественного числа — например, через метод GetDouble().
Он позволяет задать:
* сообщение приглашения , в которое можно включить локальные ключевые слова в формате
[Ключ1/Ключ2] (например: "Введите значение [Быстро/Медленно]:"),
* глобальные ключевые слова , которые остаются доступными на протяжении всей команды
и не зависят от контекста ввода (например: "Cancel Exit").
Этот конструктор особенно полезен при разработке команд, где пользователь
может выбирать между режимами или выполнять системные действия (например, отмена операции)
в любой момент.
messageAndKeywords: Строка, содержащая текст приглашения и, опционально,
globalKeywords: Строка, содержащая глобальные ключевые слова, разделённые пробелом.

HostMgd.EditorInput.PromptDoubleOptions.DefaultValue
Свойство возвращает или устанавливает значение по умолчанию,
которое будет использовано при нажатии Enter без ввода других данных.
Свойство типа double используется в классе PromptDoubleOptions
для задания значения, которое автоматически применяется при интерактивном
вводе вещественного числа, если пользователь нажимает Enter ,
не вводя другого значения. Это позволяет ускорить выполнение команд,
предоставляя разумное значение по умолчанию, соответствующее
типичному сценарию использования.
Свойство доступно как для чтения, так и для записи, что даёт возможность
динамически изменять его в зависимости от контекста — например,
на основе предыдущих действий или параметров чертежа.
Важно: Чтобы значение по умолчанию применялось, необходимо установить AllowNone = true,
чтобы разрешить завершение ввода без указания значения.
Returns: Возвращает значение типа double, представляющее собой число,
используемое по умолчанию. Если значение не задано, возвращается 0.0.
Example
C#