HostMgd.EditorInput.Editor.SelectAll
Метод выбирает все объекты в текущем пространстве чертежа и возвращает их набор в виде результата выбора.
Метод используется для программного выделения всех видимых и доступных для выбора объектов
в текущем пространстве модели или листа. Он имитирует действие команды выбора всех объектов,
часто используемой при массовых операциях — перемещении, удалении, изменении свойств и т. д.
Результат возвращается в виде объекта PromptSelectionResult, который содержит набор выбранных
объектов или информацию о прерванной операции.
Returns: Возвращает объект типа PromptSelectionResult, который содержит:
* Status — статус выполнения операции (OK, Cancel, Error и др.). Если объекты успешно выбраны, статус будет равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) всех выбранных объектов.
* InputString — строковое значение, если операция была прервана с помощью клавиатуры.
Если выборка успешна, через Value можно получить количество и идентификаторы всех выбранных объектов.
Example
C#