Teigha.BoundaryRepresentation.ComplexShellCollection.GetEnumerator
Метод предоставляет перечислитель данной коллекции оболочек комплекса.
Метод предоставляет перечислитель данной коллекции оболочек комплекса.
Returns: Возвращает перечислитель коллекции оболочек комплекса.
Тип ComplexShellEnumerator.