Teigha.DatabaseServices.TableHitTestType
Данное перечисление определяет возможные результаты проверки попадания в таблицу.
Данное перечисление определяет возможные результаты проверки попадания в таблицу.