HostMgd.EditorInput.PickPointSelectedSubObject
Класс, описывающий объект, выбранный методом выбора по точке
выбора.

HostMgd.EditorInput.PickPointSelectedSubObject.PickPoint
Возвращает точку, которая была использована при выборе
подобъекта.

HostMgd.EditorInput.PickPointSelectedSubObject.#ctor(Teigha.DatabaseServices.FullSubentityPath,HostMgd.EditorInput.SelectionMethod,System.Int32,HostMgd.EditorInput.PickPointDescriptor)
Конструктор.
path: Полный путь к геометрическому подобъекту
method: Метод выбора
gsMarker: GS маркеры
descriptor: Описание точки выбора