Teigha.GraphicsInterface.Viewport
Этот класс представляет характеристики текущего видового экрана, используемые механизмами векторизации графического интерфейса.
Эти характеристики представляют интерес для оптимизации графического представления пользовательских объектов с учетом конкретной конфигурации видового экрана.
Этот класс представляет характеристики текущего видового экрана, используемые механизмами векторизации графического интерфейса.
Эти характеристики представляют интерес для оптимизации графического представления пользовательских объектов с учетом конкретной конфигурации видового экрана.

Teigha.GraphicsInterface.Viewport.DoInversePerspective(Teigha.Geometry.Point3d)
Метод выполняет обратное преобразование перспективы для указанной точки из нормализованных координат устройства в координаты EyeSpace.
Метод выполняет обратное преобразование перспективы для указанной точки из нормализованных координат устройства в координаты EyeSpace.
value: Исходная точка. Тип Point3d.
Returns: Возвращает преобразованную точку.  Тип Point3d.

Teigha.GraphicsInterface.Viewport.DoPerspective(Teigha.Geometry.Point3d)
Метод применяет к указанной точке текущее преобразование перспективы.
Метод применяет к указанной точке текущее преобразование перспективы.
Точка преобразуется из координат EyeSpace в нормализованные координаты устройства.
value: Исходная точка.  Тип Point3d.
Returns: Возвращает преобразованную точку. Тип Point3d.

Teigha.GraphicsInterface.Viewport.GetNumPixelsInUnitSquare(Teigha.Geometry.Point3d)
Метод вычисляет плотность пикселей дисплея  для данного объекта Viewport в указанной точке WCS.
Метод вычисляет плотность пикселей дисплея  для данного объекта Viewport в указанной точке WCS.
Данный метод полезен для установления факта, что размер объекта, отображаемый в данном видовом экране, оказывается меньше размера одного пикселя.
В режиме перспективной проекции единичный квадрат в мировой системе координат (WCS) уменьшается по мере удаления от камеры и требует для отображения всё меньше пикселей, тогда как в режиме ортогональной (праллельной) проекции отображаемый размер единичного квадрата остается неизменным независимо от удаления от камеры.
Таким образом, если в видовом экране включен режим перспективной проекции, то в качестве центра единичного квадрата используется точка givenWorldPoint, чтобы размер в пикселях отражал удаление точки от камеры.
Если режим перспективной проекции отключен, то потребность в givenWorldPoint отпадает, поскольку размер объекта в пикселях не зависит от расстояния до камеры.
Данный метод обычно используется для отслеживания удаления от камеры, при котором отображаемый размер геометрии оказывается близким к размеру пикселя. В такой ситуации можно получить прирост производительности и экономию памяти за счет использования упрощенных схем представления геометрии, поскольку наблюдатель все равно не в состоянии заметить никакой разницы.
givenWorldPoint: Центр единичного квадрата в системе координат WCS. Тип Point3d.
Returns: Возвращает точку, которая представляет плотность пикселей. Тип Point2d.

Teigha.GraphicsInterface.Viewport.LayerVisible(DatabaseServices.ObjectId)
Метод позволяет проверить, не заморожен ли указанный слой глобально или в данном видовом экране.
Метод позволяет проверить, не заморожен ли указанный слой глобально или в данном видовом экране.
Возвращает true, если слой не заморожен ни в данном видовом экране, ни глобально.
Это означает, что геометрия на этом слое подлежит регенерации.
Состояние слоя ON/OFF на возвращаемое значение не влияет.
idLayer: Постоянный идентификатор объекта слоя. Тип DatabaseServices.ObjectId.
Returns: Возвращает true, если слой idLayer не заморожен ни в данном видовом экране, ни глобально.
В противном случае возвращает false.

Teigha.GraphicsInterface.Viewport.AcadWindowId
Свойство возвращает индекс видового экрана, в котором выполняется отрисовка.
Свойство возвращает индекс видового экрана, в котором выполняется отрисовка.
Этот же индекс хранится в системной переменной CVPORT.
Таким образом, если видовой экран,в котором выполняется отрисовка, является текущим видовым экраном в nanoCAD, то значение системной переменной CVPORT будет соответствовать значению, возвращаемому этим свойством.
Возвращаемый индекс уникален для каждого видового экрана лишь в пределах своего пространства (т.е. пространства модели или пространства листа). См. также свойство Viewport.ViewportId.
Returns: Возвращает индекс видового экрана. Тип int.

Teigha.GraphicsInterface.Viewport.CameraLocation
Свойство возвращает положение камеры видового экрана в мировой системе координат.
Свойство возвращает положение камеры видового экрана в мировой системе координат.
Оно соответствует положению "глаза" видового экрана в мировой системе координат.
Returns: Возвращает положение камеры в WCS. Тип Point3d.

Teigha.GraphicsInterface.Viewport.CameraTarget
Свойство возвращает положение целевой точки камеры видового экрана в мировой системе координат.
Свойство возвращает положение целевой точки камеры видового экрана в мировой системе координат.
Это точка, в которую направлен «глаз» видового экрана в WCS.
Returns: Возвращает целевую точку камеры видового экрана в WCS. Тип Point3d.

Teigha.GraphicsInterface.Viewport.CameraUpVector
Свойство возвращает вектор направления «вверх» камеры видового экрана в WCS.
Свойство возвращает вектор направления «вверх» камеры видового экрана в WCS.
Это вектор в WCS, по которому выравнивается «глаз» камеры видового экрана.
Returns: Возвращает вектор направления «вверх» камеры. Тип Vector3d.

Teigha.GraphicsInterface.Viewport.DeviceContextViewportCorners
Свойство возвращает границы видового экрана, по которым выравниваются положения геометрических объектов (например, иконок обозначений), которые должны оставаться в зафиксированных положениях или иметь постоянный размер в окне видового экрана.
Свойство возвращает границы видового экрана, по которым выравниваются положения геометрических объектов (например, иконок обозначений), которые должны оставаться в зафиксированных положениях или иметь постоянный размер в окне видового экрана.
Returns: Возвращает границы видового экрана. Тип DatabaseServices.Extents2d.

Teigha.GraphicsInterface.Viewport.EyeToModelTransform
Свойство возвращает матрицу геометрического преобразования текущих координат "глаза" камеры в координаты пространства модели.
Свойство возвращает матрицу геометрического преобразования текущих координат "глаза" камеры в координаты пространства модели.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Viewport.EyeToWorldTransform
Свойство возвращает матрицу преобразования текущих координат "глаза" камеры в координаты мировой системы координат WCS.
Свойство возвращает матрицу преобразования текущих координат "глаза" камеры в координаты мировой системы координат WCS.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Viewport.FrontAndBackClipping
Свойство возвращает информацию о наличии и расположении передней и задней плоскостей отсечения дисплея.
Свойство возвращает информацию о наличии и расположении передней и задней плоскостей отсечения дисплея.
Плоскости отсечения всегда перпендикулярны вектору цели камеры видового экрана.
В случае использования этих плоскостей всякая геометрия перед передней плоскостью отсечения или позади задней плоскости отсечения не отображается.
Returns: Возвращает объект GraphicsInterface.FrontAndBackClipping с данными о плоскостях отсечения.

Teigha.GraphicsInterface.Viewport.IsPerspective
Свойство позволяет проверить, включен ли режим перспективного проецирования.
Свойство позволяет проверить, включен ли режим перспективного проецирования.
Returns: Возвращает true, если режим перспективного проецирования включен.
В противном случае возвращает false.

Teigha.GraphicsInterface.Viewport.LinetypeGenerationCriteria
Свойство возвращает критерий для определения того, следует ли детально отображать типы линий для данного объекта или уже следует перейти к режиму отрисовки сплошными линиями.
Свойство возвращает критерий для определения того, следует ли детально отображать типы линий для данного объекта или уже следует перейти к режиму отрисовки сплошными линиями.
При обработке типов линий все более мелких объектов достигается момент, когда штрихи на линиях становятся настолько мелкими, что их невозможно отличить от сплошной линии.  Видовой экран определяет специальный критерий для определения того, следует ли и дальше детально отображать тип линий для данного объекта.  Как только расчетная длина всего паттерна в WCS оказывается меньше этого порогового значения, то вместо исходного типа линий  начинает использоваться непрерывный тип.  Видовой экран должен определить это значение на основе максимального увеличения, при котором теряется смысл поддерживать типы линий.
Returns: Возвращает критерий для перехода к детализированному отображению типов линий.
Тип double.

Teigha.GraphicsInterface.Viewport.LinetypeScaleMultiplier
Свойство возвращает масштабный множитель типа линий данного видового экрана.
Свойство возвращает масштабный множитель типа линий данного видового экрана.
Это значение представляет собой дополнительный множитель, который влияет на все типы линий, отображаемые в этом видовом экране.
Значение 2 гарантирует, что паттерн будет вдвое больше, чем по умолчанию.
Множитель берется из конфигурации видового экрана.
Например, в видовом экране пространства листа может быть указано значение, отличное от единицы.
Если вы не уверены в этом значении, просто верните единицу.
Returns: Возвращает масштабный множитель типа линий. Тип double.

Teigha.GraphicsInterface.Viewport.ModelToEyeTransform
Свойство возвращает матрицу геометрического преобразования координат точки пространства модели в координаты точки "глаза" камеры видового экрана.
Свойство возвращает матрицу геометрического преобразования координат точки пространства модели в координаты точки "глаза" камеры видового экрана.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Viewport.ViewDirection
Свойство возвращает текущее направление просмотра видового экрана.
Свойство возвращает текущее направление просмотра видового экрана.
Это значение определяется положением точек цели и камеры в WCS.
Returns: Возвращает направление просмотра видового экрана. Тип Vector3d.

Teigha.GraphicsInterface.Viewport.ViewportId
Свойство возвращает идентификатор видового экрана, используемый в графическом интерфейсе.
Свойство возвращает идентификатор видового экрана. Это внутренний идентификатор графического интерфейса, который не имеет отношения к системной переменной CVPORT. Этот идентификатор используется методом ViewportDraw.isValidId() для проверки, действителен ли видовой экран.
Возвращаемый этим свойством идентификатор уникален для каждого видового экрана в nanoCAD (включая видовые экраны пространства листа и объединенные видовые экраны, когда TILEMODE == 1), во многом так же, как дескриптор объекта.
Returns: Возвращает идентификатор видового экрана. Тип IntPtr.

Teigha.GraphicsInterface.Viewport.WorldToEyeTransform
Свойство возвращает матрицу геометрического преобразования из координат точки в WCS в координаты  "глаза" камеры видового экрана.
Свойство возвращает матрицу геометрического преобразования из координат точки в WCS в координаты  "глаза" камеры видового экрана.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.