Teigha.DatabaseServices.DxfFiler.ReadVector2d
Метод возвращает 2D-вектор из текущего элемента этого объекта Filer.
Метод возвращает 2D-вектор из текущего элемента этого объекта Filer.
Returns: Возвращает 2D-вектор. Тип Vector2d.