Teigha.GraphicsInterface.PixelBGRA32.init
Метод инициализирует данный объект с нулевыми значениями синей, красной и зеленой компонент и значением 255 для альфа-канала.
Метод инициализирует данный объект с нулевыми значениями синей, красной и зеленой компонент и значением 255 для альфа-канала.