Teigha.Geometry.Point2d.ToArray
Метод создает массив, содержащий значения координат данной точки.
Метод позволяет получить массив из двух элементов, содержащий значения координат X и Y данной точки.
Returns: Возвращает массив из двух элементов, содержащий значения координат X и Y данной точки. Тип double[].