Teigha.DatabaseServices.DrawOrderTable
Класс DrawOrderTable предназначен для управления порядком отрисовки объектов, принадлежащих записи таблицы блоков.
Класс DrawOrderTable предназначен для управления порядком отрисовки объектов, принадлежащих записи таблицы блоков.
Каждое определение блока содержит информацию о порядке отрисовки своих объектов.
В процессе отрисовки объектов конкретной записи таблицы блоков, итератор обходит эту запись в порядке возрастания дескрипторов (handle) объектов.
Порядок отрисовки этих объектов определяется объектом DrawOrderTable, который хранится в словаре расширения записи таблицы блоков.
Если очередному дескриптору объекта в DrawOrderTable поставлен в соответствие объект HandlePair, то отрисовывается объект, на который указывает HandlePair.
В отсутствие объекта HandlePair, отрисовывается сам объект, на который ссылается итератор.
Для настройки последовательности отрисовки объектов предусмотрены методы MoveAbove, MoveBelow, MoveToBottom, MoveToTop, SwapOrder и т.д.

Teigha.DatabaseServices.DrawOrderTable.#ctor(IntPtr,System.Boolean)
Конструктор класса DrawOrderTable.
Конструктор класса DrawOrderTable.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.DrawOrderTable.FirstEntityIsDrawnBeforeSecond(DatabaseServices.ObjectId,DatabaseServices.ObjectId)
Метод предназначен для проверки, отображается ли первый объект раньше второго согласно последовательности, предусмотренной  данным объектом DrawOrderTable.
Метод предназначен для проверки, отображается ли первый объект раньше второго согласно последовательности, предусмотренной  данным объектом DrawOrderTable.
first: Идентификатор первого объекта. Тип DatabaseServices.ObjectId.
second: Идентификатор второго объекта. Тип DatabaseServices.ObjectId.
Returns: Возвращает true, если данный экземпляр DrawOrderTable предполагает отрисовку сначала первого объекта, а потом второго.
В противном случае возвращает false.

Teigha.DatabaseServices.DrawOrderTable.GetFullDrawOrder(unsigned char)
Метод предназначен для получения коллекции идентификаторов объектов в связанной записи таблицы блоков в DrawOrder, порядок в которой определяется данным объектом DrawOrderTable.
Метод предназначен для получения коллекции идентификаторов объектов в связанной записи таблицы блоков в DrawOrder, порядок в которой определяется данным объектом DrawOrderTable.
honorSortEntitiesMask: Маска порядка сортировки.  Тип unsigned char.
Returns: Возвращает упорядоченную коллекцию идентификаторов объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.GetRelativeDrawOrder(unsigned char)
Метод предназначен для получения коллекции идентификаторов объектов, относительный порядок которых определяется данным объектом DrawOrderTable.  Ничего не делает в текущей реализации.
Метод предназначен для получения коллекции идентификаторов объектов, относительный порядок которых определяется данным объектом DrawOrderTable.
Ничего не делает в текущей реализации.
honorSortEntitiesMask: Маска порядка сортировки.  Тип unsigned char.
Returns: Возвращает упорядоченную коллекцию идентификаторов объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.GetSortHandle(DatabaseServices.ObjectId)
Метод предназначен для получения дескриптора, определяющего порядок отрисовки объекта с указанным идентификатором.
Метод предназначен для получения дескриптора, определяющего порядок отрисовки объекта с указанным идентификатором.
Объекты с меньшими значениями дескрипторов отображаются раньше объектов с более высокими значениями дескрипторов.
Этот дескриптор фактически играет роль ключа сортировки и не имеет ничего общего с идентификатором объекта в базе данных.
В DrawOrderTable используется лишь его числовое значения.
id: Идентификатор объекта, для которого требуется получить дескриптор. Тип DatabaseServices.ObjectId.
Returns: Возвращает дескриптор указанного объекта. Тип DatabaseServices.Handle.

Teigha.DatabaseServices.DrawOrderTable.MoveAbove(Teigha.DatabaseServices.ObjectIdCollection,DatabaseServices.ObjectId)
Метод предназначен для перемещения объектов с указанными идентификаторами выше целевого объекта в последовательности отрисовки данного объекте DrawOrderTable.
Метод предназначен для перемещения объектов с указанными идентификаторами выше целевого объекта в последовательности отрисовки данного объекта DrawOrderTable.
Относительный порядок отрисовки в пределах группы перемещаемых объектов не изменяется.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
target: Идентификатор целевого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DrawOrderTable.MoveBelow(Teigha.DatabaseServices.ObjectIdCollection,DatabaseServices.ObjectId)
Метод предназначен для перемещения указанной группы объектов ниже целевого объекта в последовательности отрисовки данного объекта DrawOrderTable.
Метод предназначен для перемещения объектов с указанными идентификаторами ниже целевого объекта в последовательности отрисовки данного объекта DrawOrderTable.  Относительный порядок отрисовки в пределах группы перемещаемых объектов не изменяется.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
target: Идентификатор целевого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DrawOrderTable.MoveToBottom(Teigha.DatabaseServices.ObjectIdCollection)
Метод помещает все указанные объекты в начало последовательности отрисовки данной таблицы DrawOrderTable.
Метод помещает все указанные объекты в начало последовательности отрисовки данной таблицы DrawOrderTable.
Относительный порядок отрисовки в пределах группы перемещаемых объектов не изменяется.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.MoveToTop(Teigha.DatabaseServices.ObjectIdCollection)
Метод помещает все указанные объекты в конец последовательности отрисовки данной таблицы DrawOrderTable.
Метод помещает все указанные объекты в конец последовательности отрисовки данной таблицы DrawOrderTable.
Относительный порядок отрисовки в пределах группы перемещаемых объектов не изменяется.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.SetRelativeDrawOrder(Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет задать иной относительный порядок отрисовки указанных объектов в этой таблице DrawOrderTable.
Порядок отрисовки других объектов не изменяется.
Метод позволяет задать иной относительный порядок отрисовки указанных объектов в этой таблице DrawOrderTable.
Относительный порядок отрисовки других объектов не изменяется.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.SwapOrder(DatabaseServices.ObjectId,DatabaseServices.ObjectId)
Метод позволяет поменять на обратный порядок отрисовки двух указанных объектов в данной таблице DrawOrderTable.
Метод позволяет поменять на обратный порядок отрисовки двух указанных объектов в данной таблице DrawOrderTable.
id1: Идентификатор первого объекта. Тип DatabaseServices.ObjectId.
id2: Идентификатор второго объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DrawOrderTable.BlockId
Свойство обеспечивает доступ к идентификатору записи BlockTableRecord, которой принадлежит данный экземпляр DrawOrderTable.
Свойство обеспечивает доступ к идентификатору записи BlockTableRecord, которой принадлежит данный экземпляр DrawOrderTable.
Returns: Возвращает идентификатор объекта BlockTableRecord. Тип DatabaseServices.ObjectId.