Teigha.DatabaseServices.PolyFaceMeshVertex
Класс PolyFaceMeshVertex представляет в базе данных вершины сети PolyFaceMesh.
Класс PolyFaceMeshVertex представляет в базе данных вершины сети PolyFaceMesh.

Teigha.DatabaseServices.PolyFaceMeshVertex.#ctor
Конструктор по умолчанию класса PolyFaceMeshVertex.
Конструктор по умолчанию класса PolyFaceMeshVertex.

Teigha.DatabaseServices.PolyFaceMeshVertex.#ctor(Teigha.Geometry.Point3d)
Конструктор класса PolyFaceMeshVertex. Создает экземпляр класса в заданной пространственной точке.
Конструктор класса PolyFaceMeshVertex. Создает экземпляр класса в заданной пространственной точке.
point: Координаты вершины в мировой системе координат (WCS). Тип Point3d.

Teigha.DatabaseServices.PolyFaceMeshVertex.Position
Свойство Position представляет позицию данной вершины в мировой системе координат (WCS).
Свойство Position представляет позицию данной вершины в мировой системе координат (WCS).
Returns: Возвращает точку, в которой располагается вершина. Тип Point3d.