Teigha.BoundaryRepresentation.VertexEdgeCollection
Класс VertexEdgeCollection представляет набор ребер, с которыми связана вершина.
Класс VertexEdgeCollection представляет набор ребер, с которыми связана вершина.