HostMgd.EditorInput.Editor.LeavingQuiescentState
Событие возникает, когда пользователь выходит из состояния покоя и начинает новую активность в редакторе.
Событие генерируется в момент, когда редактор nanoCAD выходит из спокойного (ожидающего) состояния
— например, при поступлении нового пользовательского ввода после завершения предыдущей команды.
Оно позволяет отслеживать начало новой операции и выполнять необходимые действия для подготовки
к взаимодействию с чертежом. Это событие особенно полезно в надстройках и плагинах, где требуется
реагировать на начало активности пользователя.
Notes
Событие реализовано как стандартный EventHandler, не передающий дополнительных данных (EventArgs.Empty).
Example
C#