HostMgd.GraphicsSystem.Manager.GsToBeUnloaded
Событие GsToBeUnloaded выпускается непосредственно перед выгрузкой графической системы из памяти.
Событие GsToBeUnloaded выпускается непосредственно перед выгрузкой графической системы из памяти.
Returns: Возвращает делегат типа Teigha.GraphicsSystem.GsToBeUnloadedEventHandler.