Teigha.BoundaryRepresentation.Element2dNodeEnumerator
Класс Element2dNodeEnumerator представляет перечислитель узлов объекта Element2d.
Класс Element2dNodeEnumerator представляет перечислитель узлов объекта Element2d.

Teigha.BoundaryRepresentation.Element2dNodeEnumerator.Current
Свойство Current представляет текущий элемент данного перечислителя.
Свойство Current представляет текущий элемент данного перечислителя.
Returns: Возвращает текущий элемент перечислителя.
Тип Node.