Teigha.GraphicsInterface.Polyline
Класс Polyline реализует эквивалент облегченной полилинии, которая используется для передачи геометрии полилиний в подсистему векторизации платформы nanoCAD.
Класс Polyline реализует эквивалент облегченной полилинии (lightweight polyline), которая используется для передачи геометрии полилиний в подсистему векторизации платформы nanoCAD.

Teigha.GraphicsInterface.Polyline.#ctor
Конструктор по умолчанию класса Polyline.
Создает пустую полилинию.
Конструктор по умолчанию класса Polyline.
Создает пустую полилинию.

Teigha.GraphicsInterface.Polyline.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,IntPtr)
Конструктор класса Polyline.
Создает полилинию, используя маркер подобъекта, список вершин полилинии и направление нормали плоскости, в которой располагается полилиния.
Конструктор класса Polyline.
Создает полилинию, используя маркер подобъекта, список вершин полилинии и направление нормали плоскости, в которой располагается полилиния.
pPoints: Список вершин полилинии. Тип Point3dCollection.
normal: Нормаль плоскости, в которой лежит полилиния. Тип Vector3d.
pBaseSubEntMarker: Маркер подобъекта. Тип IntPtr.

Teigha.GraphicsInterface.Polyline.BaseSubEntMarker
Свойство BaseSubEntMarker предоставляет доступ к маркеру подобъекта.
Свойство BaseSubEntMarker предоставляет доступ к маркеру подобъекта.
Returns: Возвращает маркер подобъекта.
Тип IntPtr.

Teigha.GraphicsInterface.Polyline.Normal
Свойство Normal предоставляет доступ к направлению нормали плоскости полилинии.
Свойство Normal предоставляет доступ к направлению нормали плоскости полилинии.
Returns: Возвращает нормаль плоскости полилинии.
Тип Vector3d.

Teigha.GraphicsInterface.Polyline.Points
Свойство Points предоставляет доступ к коллекции вершин полилинии.
Свойство Points предоставляет доступ к коллекции вершин полилинии.
Returns: Возвращает коллекцию вершин полилинии.
Тип Point3dCollection.