HostMgd.PlottingServices.PreviewEndPlotStatus.Normal
Значение: 0.
Предварительный просмотр завершен стандартно, и пользователь не инициировал вывод на печать непосредственно из пользовательского интерфейса предварительного просмотра.