Teigha.Editor.CommandContext.database
Метод предоставляет базу данных для использования в пользовательской команде.
Метод предоставляет базу данных для использования в пользовательской команде.
Returns: Возвращает базу данных. Тип Database.