Teigha.GraphicsInterface.VisualStyleOperation
Данное перечисление определяет типы операций, выполняемых с визуальными стилями.
Данное перечисление определяет типы операций, выполняемых с визуальными стилями.