Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection
Класс представляет коллекцию свойств вхождений динамических блоков DynamicBlockReferenceProperty.
Класс DynamicBlockReferencePropertyCollection представляет коллекцию свойств вхождений динамических блоков DynamicBlockReferenceProperty.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.CopyTo(array,System.Int32)
Метод предназначен для копирования данной коллекции в указанный массив по указанному индексу.
Метод предназначен для копирования данной коллекции в указанный массив по указанному индексу.
a: Массив, в который копируется коллекция. Тип DynamicBlockReferenceProperty[].
index: Индекс, начиная с которого в массиве сохраняется коллекция.  Тип int.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.  Тип int.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.Item
Свойство Item представляет элемент коллекции по указанному индексу.
Свойство Item представляет элемент коллекции по указанному индексу.
A_0: Индекс элемента коллекции.  Тип int.
Returns: Возвращает элемент коллекции свойств. Тип DynamicBlockReferenceProperty.