Teigha.DatabaseServices.TableCopyOptions.TableCopyRowHeight
Значение: 16777216 = 0x1000000.
При копировании ячеек копировать высоту строки.
Применимо только при копировании ячеек.
Игнорируется, если установлен флаг TableCopySkipGeometry или когда копируется вся таблица целиком.