Teigha.DatabaseServices.FieldCodeFlags.StripOptions
Значение: 64.
Если этот флаг установлен, стандартные опции, такие как идентификатор вычислителя, формат и информация о гиперссылке, удаляются из кода поля.
Например, если код поля имеет вид %%, стандартные параметры удаляются и возвращается только код поля %%.
Этот флаг можно комбинировать с FieldCode или EvaluatedChildren.
Флаг неприменим при задании кода поля и будет игнорироваться в этом контексте.