HostMgd.PlottingServices.PlotProgressDialog.PlotMsgString
С помощью этого свойства можно предварительно установить строковые значения в форме.
Использование этого свойства напрямую в языках C++ и C# невозможно. Для получения и присвоения значений необходимо использовать
методы set_PlotMsgString и get_PlotMsgString
Порядок изображения элементов на форме ( сверху вниз ) :
- DialogTitle - заголовок формы
- SheetName   - наименование страницы. SheetNameToolTip - выпадающая подсказка
- Status
- SheetProgressCaption
- CancelSheetButtonMessage = текст кнопки отмены печати страницы