Teigha.DatabaseServices.RevolveOptionsBuilder
Класс RevolveOptionsBuilder предназначен для редактирования свойств класса RevolveOptions, который является неизменяемым типом значения.
Класс RevolveOptionsBuilder предназначен для редактирования свойств класса RevolveOptions, который является неизменяемым типом значения.

Teigha.DatabaseServices.RevolveOptionsBuilder.#ctor
Конструктор по умолчанию класса RevolveOptionsBuilder.
Конструктор по умолчанию класса RevolveOptionsBuilder.

Teigha.DatabaseServices.RevolveOptionsBuilder.#ctor(Teigha.DatabaseServices.RevolveOptions)
Конструктор класса RevolveOptionsBuilder.
Создает экземпляр с заданными настройками операции вращения.
Конструктор класса RevolveOptionsBuilder.
Создает экземпляр с настройками операции вращения, которые передаются в конструктор параметром типа RevolveOptions.
value: Настройки операции вращения. Тип RevolveOptions.

Teigha.DatabaseServices.RevolveOptionsBuilder.CloseToAxis
Свойство CloseToAxis задает опцию замыкания на ось вращения концов незамкнутого профиля перед выполнением операции вращения.
Свойство CloseToAxis задает опцию замыкания на ось вращения концов незамкнутого профиля перед выполнением операции вращения. Работает со связанным объектом RevolveOptions.
Returns: Возвращает true, если опция включена.
В противном случае возвращает false.

Teigha.DatabaseServices.RevolveOptionsBuilder.DraftAngle
Свойство DraftAngle представляет угол сужения профиля с увеличением угла поворота вокруг оси вращения.
Свойство DraftAngle представляет угол сужения профиля с увеличением угла поворота вокруг оси вращения.
Измеряется в радианах. Работает со связанным объектом RevolveOptions.
Returns: Возвращает угол сужения вращаемого профиля в радианах. Тип double.

Teigha.DatabaseServices.RevolveOptionsBuilder.TwistAngle
Свойство TwistAngle представляет угол закручивания профиля при повороте вокруг оси вращения.
Свойство TwistAngle представляет угол закручивания профиля при повороте вокруг оси вращения.
Измеряется в радианах. Работает со связанным объектом RevolveOptions.
Returns: Возвращает угол закручивания в радианах. Тип double.