Teigha.DatabaseServices.HatchStyle.Outer
Значение: 1. Штриховка отключается после встречи с первым внутренним циклом.
Стиль штрихования Outer штрихует внутрь от внешнего цикла границы.
При столкновении с внутренним пересечением штрихование отключается и больше не включается.
Поскольку этот процесс начинается с обоих концов каждой линии штриховки, штрихуется только самый внешний уровень структуры, оставляя внутреннюю структуру пустой.