Teigha.DatabaseServices.OsnapPointRef.EvalPoint
Метод вычисляет текущие координаты точки привязки размера.
Метод вычисляет текущие координаты точки привязки объекта размера.
Returns: Возвращает текущее положение точки привязки размера.
Тип Geometry.Point3d.