Teigha.DatabaseServices.TextAttachmentType
Данное перечисление определяет варианты расположения точки прикрепления выносной линии к многострочному тексту.
Данное перечисление определяет варианты расположения точки прикрепления выносной линии к многострочному тексту.