Teigha.DatabaseServices.XrefOperation.XrefXBindOperation
Значение: 1.
Операция обеспечивает связывание записей таблицы внешних ссылок, идентификаторы объектов которых находятся в списке symbolIds.  Аналогична команде XBIND nanoCAD.