HostMgd.EditorInput.Editor.SwitchToPaperSpace
Метод выполняет программное переключение текущего пространства чертежа в пространство листа.
Метод используется для смены активного контекста редактора из пространства модели (model space)
в пространство листа (paper space), где обычно создаются видовые экраны, оформляется и печатается чертёж.
Метод позволяет автоматически переключаться между пространствами без участия пользователя,
что удобно при реализации команд, требующих работы именно в пространстве листа.
Example
C#