Teigha.DatabaseServices.MLeader.GetPlane
Метод возвращает плоскость, в которой располагается данный объект MLeader.
Метод возвращает плоскость в мировой системе координат (WCS), в которой располагается данный объект MLeader.
Returns: Возвращает плоскость в мировой системе координат (WCS). Тип Plane.