Teigha.Geometry.Interval.GetBounds
Метод предоставляет границы данного интервала.
Метод предоставляет границы данного интервала в виде массива из двух элементов (для нижней и верхней границ, соответственно).
Возвращаемые значения имеют смысл, только если интервал является ограниченным в соответствующем направлении.
Returns: Возвращает массив из двух элементов. Тип double[].
Элемент с нулевым индексом определяет нижнюю границу, а следующий элемент определяет верхнюю.