HostMgd.EditorInput.PromptDoubleResult
Класс содержит результат интерактивного ввода вещественного числа,
такого как угол или расстояние, после выполнения соответствующего приглашения пользователю.
Класс наследуется от базового класса PromptResult и используется для хранения результата операций ввода
значений типа double, например, после вызова методов GetAngle(), GetDistance() или других команд,
где требуется ввести число с плавающей точкой. Он предоставляет информацию о статусе завершения ввода
(успешно, отменено, ошибка), а также само значение, введённое пользователем.
Этот класс применяется совместно с событиями, такими как PromptedForAngle, PromptedForDistance и др.,
и позволяет обрабатывать результаты ввода пользователя, выполнять проверки,
либо продолжать выполнение команд на основе полученного значения.
Example
C#

HostMgd.EditorInput.PromptDoubleResult.ToString(IFormatProvider)
Метод возвращает строковое представление вещественного числа,
введённого пользователем, с учётом формата, заданного провайдером локализации.
Метод переопределяет стандартный метод и предоставляет возможность
отформатировать значение вещественного числа (например, угла или расстояния)
в зависимости от текущих региональных настроек или указанного провайдера форматирования.
Это позволяет корректно отображать числовые значения с нужным разделителем десятичной точки
или запятой, а также в нужной системе единиц. Метод используется при выводе результатов ввода
в командную строку или интерфейс, где важен язык и формат представления данных.
provider: Объект, предоставляющий информацию о правилах форматирования чисел — например,
Returns: Возвращает значение типа string, представляющее собой текстовое отображение вещественного числа
с учётом заданного формата. Например, число 3.1415 может быть преобразовано в "3.14" или "3,14",
в зависимости от региональных настроек, переданных через provider.
Если операция была отменена или значение не определено,
может вернуть пустую строку или специальное сообщение об ошибке.
Example
C#

HostMgd.EditorInput.PromptDoubleResult.Value
Свойство предоставляет значение вещественного числа,
введённого пользователем в ходе интерактивной операции ввода угла или расстояния.
Свойство используется для получения числового значения,
введённого пользователем при выполнении команд, таких как GetAngle(), GetDistance()
и другие, которые возвращают результат в виде объекта PromptDoubleResult.
Это свойство доступно только для чтения и содержит значение
после успешного завершения операции ввода.
Например, при запросе угла — возвращает значение в радианах,
при запросе расстояния — в единицах чертежа.
Returns: Возвращает значение типа double, представляющее собой число, введённое пользователем.
Возможные значения зависят от контекста:
* Для угла : значение в радианах.
* Для расстояния : числовое значение в текущих единицах чертежа.
Если операция была прервана (например, пользователь нажал Esc) или ввод не был выполнен,
значение может быть неопределённым или равным 0, в зависимости от реализации.
Example
C#