HostMgd.EditorInput.DragCallback
Делегат DragCallback используется для геометрического преобразования отображаемого объекта в процессе операции перетаскивания.
Делегат DragCallback используется в интерактивных командах отрисовки и редактирования, где объект динамически перемещается, поворачивается или масштабируется в ответ на перемещения курсора мыши (например, при реализации Jig).
Делегат вызывается системой nanoCAD на каждом шаге изменения положения курсора, чтобы вычислить новую матрицу преобразования на основе текущей позиции.
На входе делегат получает текущую координату курсора current и ссылку на матрицу геометрического преобразования xform, которую необходимо обновить. Система использует эту матрицу для отображения объекта в его промежуточном положении ("резиновая линия", динамическая вставка блока и т.п.).
Этот механизм обеспечивает плавную и отзывчивую визуализацию в процессе перетаскивания объекта чертежа.
current: Текущая позиция курсора в мировой системе координат (WCS), в которой определено геометрическое преобразование. Тип Point3d.
xform: Матрица геометрического аффинного преобразования для отображаемого объекта (перемещение, вращение, масштабирование и т.п.), которое определяет делегат. Тип Matrix3d.
Returns: Возвращает статус операции перетаскивания как значение из перечисления SamplerStatus (OK, NoChange или Cancel).
Example
C#