Teigha.DatabaseServices.PolygonMeshVertex
Класс PolygonMeshVertex представляет в базе данных вершины сети PolygonMesh.
Класс PolygonMeshVertex представляет в базе данных вершины сети PolygonMesh.

Teigha.DatabaseServices.PolygonMeshVertex.#ctor
Конструктор по умолчанию класса PolygonMeshVertex.
Конструктор по умолчанию класса PolygonMeshVertex.
Типом вершины по умолчанию является Vertex3dType.SimpleVertex.

Teigha.DatabaseServices.PolygonMeshVertex.#ctor(Teigha.Geometry.Point3d)
Конструктор класса PolygonMeshVertex. Создает экземпляр класса в заданной пространственной точке.
Конструктор класса PolygonMeshVertex. Создает экземпляр класса в заданной пространственной точке.
point: Координаты создаваемой вершины в мировой системе координат (WCS).

Teigha.DatabaseServices.PolygonMeshVertex.Position
Свойство Position представляет позицию данной вершины в мировой системе координат (WCS).
Свойство Position представляет позицию данной вершины в мировой системе координат (WCS).
Returns: Возвращает точку, в которой располагается вершина. Тип Point3d.

Teigha.DatabaseServices.PolygonMeshVertex.VertexType
Свойство VertexType представляет тип данной вершины.
Свойство VertexType представляет тип данной вершины.
Returns: Возвращает тип вершины как значение из перечисления Vertex3dType.