Teigha.BoundaryRepresentation.VertexEdgeCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции ребер.
Метод позволяет получить перечислитель данной коллекции ребер.
Returns: Возвращает перечислитель коллекции ребер.
Тип VertexEdgeEnumerator.