Teigha.DatabaseServices.LineJoinStyle.LjsBevel
Значение: 1. Срезанный угол.
Стиль соединения, при котором острый угол между двумя линиями срезается по прямой.
Позволяет избегать проблем с очень острыми углами.