Teigha.DatabaseServices.AssocDependency.Evaluate
Метод обновляет зависимости ассоциативного действия, которые нуждаются в перевычислении.
Метод обновляет зависимости ассоциативного действия, которые нуждаются в перевычислении.
Вызывается методом AssocAction.EvaluateDependencies().
Для выполнения реальной работы метод Evaluate() вызывает метод AssocDependencyBody.EvaluateOverride().
Если у зависимости отсутствует собственный объект тела AssocDependencyBody, реализация по умолчанию вызывает метод AssocAction.EvaluateDependency(), т.е. делегирует работу действию-владельцу зависимости.
Реализация по умолчанию метода AssocAction.EvaluateDependency() просто устанавливает статус зависимости IsUpToDateAssocStatus из перечисления AssocStatus.  Это делегирование можно отключить, используя вызов IsDelegatingToOwningAction(false).
Пользовательские классы зависимостей могут реализовывать кэширование релевантных данных для фильтрации ненужных уведомлений или выполнения какой-либо иной работы.