HostMgd.EditorInput.PromptDoubleResultEventArgs
Класс предоставляет данные для событий, возникающих после завершения
пользовательского ввода числового значения типа double, например, угла или расстояния.
Класс наследуется от EventArgs и используется в .NET API nanoCAD как тип данных события,
связанных с интерактивным вводом чисел. Он содержит информацию о результате операции:
значение типа double, статус выполнения (успех, отмена, ошибка), а также строковое представление
введённого значения. Объект этого класса передаётся обработчику события, такого как PromptedForAngle,
PromptedForDistance и другие, предоставляя разработчику доступ к результату ввода пользователя.
Notes
Этот класс применяется совместно с делегатом PromptDoubleResultEventHandler
и используется для анализа или обработки результата ввода числа в контексте редактора nanoCAD.
Example
C#

HostMgd.EditorInput.PromptDoubleResultEventArgs.Result
Свойство предоставляет результат интерактивного ввода числового значения типа double,
такого как угол или расстояние, после завершения операции.
Свойство возвращает объект типа PromptDoubleResult, содержащий информацию о результате
пользовательского ввода числа (значения с плавающей точкой), выполненного через такие методы,
как GetAngle(), GetDistance() и другие. Оно используется внутри событий, таких как PromptedForAngle,
чтобы получить значение, статус операции и дополнительные данные. Свойство доступно только для чтения
и обновляется автоматически при завершении интерактивной команды ввода.
Returns: Возвращает экземпляр класса PromptDoubleResult, который содержит:
* Status — статус завершения операции (OK, Cancel, Error и др.).
* Value — числовое значение, введённое пользователем (в радианах для угла, в единицах чертежа для расстояния).
* StringResult — строковое представление введённого пользователем значения.
* Options — параметры ввода, использованные при вызове команды.
Если операция не была выполнена или произошла ошибка, возвращается null или объект со статусом Cancel.
Example
C#