Teigha.DatabaseServices.DBObjectCollection.GetEnumerator
Метод создает объект перечислителя для данной коллекции.
Метод создает объект перечислителя для данной коллекции.
Returns: Возвращает объект перечислителя IEnumerator для данной коллекции.