Teigha.Runtime.StreamBuf.Read
Метод считывает из данного буфера байт в текущей позиции файлового указателя.
Метод считывает из данного буфера байт в текущей позиции файлового указателя.
Returns: Возвращает прочитанный байт. Тип char.