Teigha.DatabaseServices.EdgeRef
Класс EdgeRef представляет ссылку на ребро.
Класс EdgeRef представляет ссылку на ребро.

Teigha.DatabaseServices.EdgeRef.#ctor
Конструктор класса EdgeRef по умолчанию.
Конструктор класса EdgeRef по умолчанию.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.FullSubentityPath)
Конструктор класса EdgeRef. Создает ссылку на ребро на базе указанного полного пути к подобъекту.
Конструктор класса EdgeRef. Создает ссылку на ребро на базе указанного полного пути к подобъекту.
path: Полный путь к подобъекту, который используется для создания ссылки на ребро.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId)
Конструктор класса EdgeRef. Создает ссылку на ребро на основе указанного составного объекта CompoundObjectId.
Конструктор класса EdgeRef. Создает ссылку на ребро на основе указанного составного объекта CompoundObjectId.
compoundObjectId: Идентификатор составного объекта, который используется для создания ссылки на ребро. Тип CompoundObjectId.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId)
Конструктор класса EdgeRef.
Создает ссылку на ребро на основе полного пути к подобъекту ребра указанного составного объекта.
Конструктор класса EdgeRef.
Создает ссылку на ребро на основе полного пути к подобъекту ребра указанного составного объекта.
compoundObjectId: Идентификатор составного объекта. Тип CompoundObjectId.
edgeSubentId: Идентификатор подобъекта-ребра. Тип SubentityId.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.SubentityId)
Конструктор класса EdgeRef.
Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта.
Конструктор класса EdgeRef.
Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта.
compoundObjectId: Идентификатор составного объекта. Тип CompoundObjectId.
edgeSubentId: Идентификатор подобъекта-ребра. Тип SubentityId.
faceSubentId: Идентификатор подобъекта-грани.  Тип SubentityId.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Curve3d)
Конструктор класса EdgeRef.
Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта и кривую Curve3d.
Конструктор класса EdgeRef.
Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта и кривую Curve3d.
compoundObjectId: Идентификатор составного объекта. Тип CompoundObjectId.
edgeSubentId: Идентификатор подобъекта-ребра. Тип SubentityId.
faceSubentId: Идентификатор подобъекта-грани.  Тип SubentityId.
curve: 3D-кривая, используемая для создания этой ссылки на ребро. Тип Curve3d.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.Geometry.Curve3d)
Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанную кривую Curve3d.
Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанную кривую Curve3d.
curve: 3D-кривая, используемая для создания этой ссылки на ребро. Тип Curve3d.

Teigha.DatabaseServices.EdgeRef.#ctor(DatabaseServices.Entity)
Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанный объект чертежа Entity.
Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанный объект чертежа Entity.
entity: Объект чертежа, используемый для создания этой ссылки на ребро. Тип DatabaseServices.Entity.

Teigha.DatabaseServices.EdgeRef.Curve
Свойство Curve задает или возвращает кривую Curve3d, на основе которой была создана данная ссылка на ребро.
Свойство Curve задает или возвращает кривую Curve3d, на основе которой была создана данная ссылка на ребро.
Returns: Возвращает кривую, на основе которой была создана данная ссылка на ребро. Тип Curve3d.

Teigha.DatabaseServices.EdgeRef.FaceSubentity
Свойство FaceSubentity обеспечивает доступ к идентификатору подобъекта-грани составного объекта, использованной для создания данной ссылки на ребро.
Свойство FaceSubentity обеспечивает доступ к идентификатору подобъекта-грани составного объекта, использованной для создания данной ссылки на ребро.
Returns: Возвращает идентификатор подобъекта. Тип SubentityId.