HostMgd.PlottingServices.DsdEntry
Класс DsdEntry представляет информацию для настройки публикации листа в составе подшивки листов.
В текущей версии не реализован.
Класс DsdEntry представляет информацию для настройки публикации листа в составе подшивки листов.
Коллекция объектов DsdEntry входит в объект HostMgd.PlottingServices.DsdData, который используется для настройки процесса публикации подшивок.
В текущей версии не реализован.

HostMgd.PlottingServices.DsdEntry.#ctor
Конструктор по умолчанию класса DsdEntry.
Не реализован.
Конструктор по умолчанию класса DsdEntry.
В текущей версии не реализован.

HostMgd.PlottingServices.DsdEntry.DwgName
Свойство DwgName представляет имя файла DWG, в котором содержится лист, подлежащий публикации.
Не реализовано.
Свойство DwgName представляет имя файла DWG, в котором содержится лист, подлежащий публикации.
В текущей версии не реализовано.
Returns: Возвращает имя файла DWG.
Тип System.String.

HostMgd.PlottingServices.DsdEntry.Layout
Свойство Layout представляет имя листа в файле DWG с именем DwgName.
Не реализовано.
Свойство Layout представляет имя публикуемого листа в файле DWG, имя которого возвращает свойство DwgName.
В текущей версии не реализовано.
Returns: Возвращает имя листа в файле DWG.
Тип System.String.

HostMgd.PlottingServices.DsdEntry.Nps
Свойство Nps представляет именованную строку настроек страницы.
Не реализовано.
Свойство Nps представляет именованную строку настроек страницы (Nps = named page setup).
В текущей версии не реализовано.
Returns: Возвращает именованную строку настроек страницы.
Тип System.String.

HostMgd.PlottingServices.DsdEntry.NpsSourceDwg
Свойство NpsSourceDwg представляет путь к файлу чертежа с именованной строкой настроек страницы, которую возвращает свойство Nps.
Не реализовано.
Свойство NpsSourceDwg представляет путь к файлу чертежа с именованной строкой настроек страницы, которую возвращает свойство Nps.
В текущей версии не реализовано.
Returns: Возвращает путь к файлу DWG, в котором содержится именованная строка настроек страницы.
Тип System.String.

HostMgd.PlottingServices.DsdEntry.OriginalSheetPath
Свойство OriginalSheetPath представляет путь к исходному листу, который подлежит публикации.
Не реализовано.
Свойство OriginalSheetPath представляет путь к исходному листу, который подлежит публикации.
В текущей версии не реализовано.
Returns: Возвращает путь к исходному листу, который подлежит публикации.
Тип System.String.

HostMgd.PlottingServices.DsdEntry.Title
Свойство Title представляет заголовок записи DsdEntry в в файле конфигурации DSD.
Не реализовано.
Свойство Title представляет заголовок записи DsdEntry в в файле конфигурации DSD.
Заголовок является уникальным именем раздела записи DsdEntry в файле конфигурации DSD.
Записи с одинаковым заголовком перезапишут друг друга.
В текущей версии не реализовано.
Returns: Возвращает заголовок записи DsdEntry.
Тип System.String.