HostMgd.ApplicationServices.LispWillStartEventHandler
Делегат предназначен для обработки события LispWillStart класса Document, возникающего перед началом исполнения кода интерпретатором AutoLISP.
Делегат LispWillStartEventHandler предназначен для обработки события LispWillStart класса Document, возникающего перед началом исполнения кода интерпретатором AutoLISP.
Контекст события передается через параметры sender и e, где sender определяет объект Document, а e передает первую строку Lisp-процедуры, которую надлежит выполнить.
sender: Объект, инициировавший событие. Как правило это Document.  Тип Object.
e: Аргументы события. Тип LispWillStartEventArgs.