Teigha.GraphicsInterface.PolylineCollection
Класс PolylineCollection представляет коллекцию облегченных полилиний GraphicsInterface.Polyline.
Класс PolylineCollection представляет коллекцию облегченных полилиний GraphicsInterface.Polyline.

Teigha.GraphicsInterface.PolylineCollection.#ctor
Конструктор по умолчанию класса PolylineCollection.
Создает пустую коллекцию емкостью 10 элементов.
Конструктор по умолчанию класса PolylineCollection.
Создает пустую коллекцию емкостью 10 элементов.

Teigha.GraphicsInterface.PolylineCollection.#ctor(System.Int32)
Конструктор класса PolylineCollection.
Создает пустую коллекцию облегченных полилиний с заданной емкостью.
Конструктор класса PolylineCollection.
Создает пустую коллекцию облегченных полилиний с указанной емкостью size.
size: Входная емкость создаваемой коллекции. Тип int.

Teigha.GraphicsInterface.PolylineCollection.Add(Teigha.DatabaseServices.Polyline)
Метод добавляет новый элемент в конец данной коллекции.
Метод добавляет новый элемент в конец данной коллекции.
При необходимости емкость коллекции будет увеличена.
value: Добавляемая в коллекцию облегченная полилиния.  Тип Polyline.
Returns: Возвращает индекс вновь созданного элемента коллекции.
Тип int.

Teigha.GraphicsInterface.PolylineCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции облегченную полилинию с заданным индексом.
Метод удаляет из коллекции облегченную полилинию с заданным индексом.
index: Входной индекс удаляемого из коллекции элемента.

Teigha.GraphicsInterface.PolylineCollection.Count
Свойство Count представляет текущее количество элементов в этой коллекции.
Свойство Count представляет текущее количество элементов в этой коллекции.
Returns: Возвращает текущее количество полилиний в данной коллекции.
Тип int.

Teigha.GraphicsInterface.PolylineCollection.Item
Свойство Item предоставляет доступ к элементам коллекции по их индексу.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
index: Входной индекс элемента коллекции. Тип int.
Returns: Возвращает элемент, хранящийся в коллекции под индексом index.
Тип Polyline.