HostMgd.PlottingServices.PlotInfo
Сервисный класс, который предоставляет свойства, определяющие печать.
Связан с классом Layout

HostMgd.PlottingServices.PlotInfo.IsCompatibleDocument(HostMgd.PlottingServices.PlotInfo)
Возвращает true если параметр объекта класса PlotInfo совместим с этим объектом.