Teigha.DatabaseServices.AnnotativeStates
Это перечисление предоставляет значения для состояний аннотации (существует она или нет).
Это перечисление предоставляет значения для состояний аннотации (существует она или нет).