Teigha.DatabaseServices.RevolveOptions
Вспомогательный класс RevolveOptions представляет настраиваемые опции операции создания тел и поверхностей вращения.
Вспомогательный класс RevolveOptions представляет настраиваемые опции операции создания тел и поверхностей вращения.
Эти опции позволяют управлять формой получаемой геометрии.

Teigha.DatabaseServices.RevolveOptions.#ctor
Конструктор по умолчанию класса RevolveOptions.
Конструктор по умолчанию класса RevolveOptions.

Teigha.DatabaseServices.RevolveOptions.#ctor(Teigha.DatabaseServices.RevolveOptions)
Конструктор класса RevolveOptions. Позволяет создать новый экземпляр как копию предоставленного объекта данного класса.
Конструктор класса RevolveOptions. Позволяет создать новый экземпляр как копию предоставленного объекта данного класса.
opts: Входной объект для копирования. Тип RevolveOptions.

Teigha.DatabaseServices.RevolveOptions.CheckRevolveCurve(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Boolean)
Метод реализует проверку на допустимость указанного объекта чертежа для операции вращения вокруг указанной оси.
Метод реализует проверку на допустимость указанного объекта чертежа для операции вращения вокруг указанной оси.
Результатом проверки является объект RevolveOptionsCheckRevolveCurveOut, свойства которого служат индикаторами следующих состояний.
* Входной геометрический объект представляет собой замкнутую область (регион).
* Кривая образующей является незамкнутой, и ее конечные точки располагаются на оси вращения.
* Кривая образующей является плоской.
ent: Объект чертежа, проверяемый на допустимость для операции вращения. Тип Entity.
axisPnt: Точка на оси вращения.  Тип Point3d.
axisDir: Направляющий вектор оси вращения. Тип Vector3d.
displayErrorMessages: Входной флаг, определяющий, следует ли выводить сообщения об ошибках в случае их обнаружения.
Returns: Возвращает результат проверки в виде объекта типа RevolveOptionsCheckRevolveCurveOut.
Notes
Эта проверка всегда выполняется методами CreateRevolvedSurface() и CreateRevolvedSolid(), поэтому приложению не обязательно вызывать этот метод непосредственно.

Teigha.DatabaseServices.RevolveOptions.CloseToAxis
Свойство CloseToAxis позволяет определить, следует ли замкнуть на ось вращения концы незамкнутого профиля перед выполнением операции вращения.
Свойство CloseToAxis позволяет определить, следует ли замкнуть на ось вращения концы незамкнутого профиля перед выполнением операции вращения.
Значение по умолчанию для этой опции — false.
Returns: Возвращает true, если опция дотягивания концов кривой до оси вращения включена.
В противном случае возвращает false.

Teigha.DatabaseServices.RevolveOptions.DraftAngle
Свойство DraftAngle представляет угол сужения при вращении.
Свойство DraftAngle представляет угол сужения вращаемого профиля с увеличением угла поворота.
Измеряется в радианах. Значение по умолчанию 0.
Returns: Возвращает угол сужения в радианах. Тип double.

Teigha.DatabaseServices.RevolveOptions.TwistAngle
Свойство TwistAngle представляет угол закручивания при вращении.
Свойство TwistAngle представляет угол закручивания в радианах.
Это угол, на который профиль закручивается при вращении вокруг оси вращения.
Returns: Возвращает угол закручивания в радианах.
Тип double.