Teigha.DatabaseServices.TransformOverrule.SetNoFilter
Метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.
Метод отключает перед применением объектных переопределений все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable.