Teigha.DatabaseServices.ScaleEstimationMethod.ScaleEstMethodUserDefined
Значение: 2. Данный алгоритм использует некоторый пользовательский постоянный масштабный коэффициент для коррекции искажений масштаба сетки, вносимых проецированием, на котором основана система координат сетки.