Teigha.GraphicsInterface.FaceData.GetMappers
Метод предоставляет массив мапперов, назначенных данному объекту FaceData.
Метод предоставляет массив мапперов, назначенных данному объекту FaceData.
См. также метод FaceData.SetMappers().
Returns: Возвращает массив мапперов.
Тип Mapper[].