HostMgd.EditorInput.PromptAngleOptionsEventArgs
Класс предоставляет данные для события PromptingForAngle,
включая параметры ввода угла и контекст операции.
Класс наследуется от EventArgs и используется в .NET API nanoCAD для передачи данных
при начале интерактивного ввода угла. Он применяется совместно с событием PromptingForAngle
и делегатом PromptAngleOptionsEventHandler, чтобы дать разработчику возможность изменить
параметры команды ввода угла — такие как начальное значение, сообщение, допустимый диапазон и другие.
Этот класс предоставляет доступ к объекту PromptAngleOptions,
который содержит настройки, передаваемые в команду ввода угла,
и может включать точку (Point3d), если она уже определена в контексте ввода.
Example
C#

HostMgd.EditorInput.PromptAngleOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при интерактивном вводе угла.
Свойство предоставляет доступ к объекту типа PromptAngleOptions,
который содержит настройки приглашения, переданные в команду ввода угла.
Оно позволяет разработчикам надстроек nanoCAD динамически изменять
или дополнять параметры команды — например, устанавливать начальное значение,
задавать ограничения по минимальному и максимальному углу,
изменять текст приглашения или управлять режимами ввода.
Свойство используется, в частности, в событии PromptingForAngle,
чтобы модифицировать поведение команды GetAngle() или других методов,
связанных с вводом угла, в зависимости от текущего контекста или состояния чертежа.
Returns: Возвращает объект типа PromptAngleOptions, содержащий параметры,
переданные в команду ввода угла.
Если параметры не были заданы или произошла ошибка, возвращается null.
* Message — текст, отображаемый в командной строке.
* DefaultValue — начальное значение угла по умолчанию (в радианах).
* AllowNone, AllowZero и другие настройки выбора угла.
Example
C#