Teigha.Geometry.CurveBoundaryData.GetCurve2ds
Метод предоставляет массив 2D-кривых в параметрическом пространстве для данного объекта.
Метод предоставляет массив 2D-кривых в параметрическом пространстве для данного объекта.
Returns: Возвращает массив 2D-кривых для данного объекта.
Тип Curve2d[].