Teigha.GraphicsInterface.MaterialSpecularComponent
Структура MaterialSpecularComponent представляет компонент зеркального отражения материала (блики).
Структура MaterialSpecularComponent представляет компонент зеркального отражения материала (блики).

Teigha.GraphicsInterface.MaterialSpecularComponent.#ctor(Teigha.GraphicsInterface.MaterialColor,Teigha.GraphicsInterface.MaterialMap,System.Double)
Конструктор структуры MaterialSpecularComponent.
Создает экземпляр структуры с указанными цветом отражения, степенью глянца и картой материала.
Конструктор структуры MaterialSpecularComponent.
Создает экземпляр структуры с указанными цветом отражения, степенью глянца и картой материала (которая определяет, как отображаются блики).
color: Цвет материала.  Тип MaterialColor.
map: Карта материала. Тип MaterialMap.
gloss: Степень глянца.  Тип double.

Teigha.GraphicsInterface.MaterialSpecularComponent.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialSpecularComponent.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки.
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки.
Результирующая строка включает карту материала, цвет отражения и степень глянца.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.

Teigha.GraphicsInterface.MaterialSpecularComponent.!=(Teigha.GraphicsInterface.MaterialSpecularComponent,Teigha.GraphicsInterface.MaterialSpecularComponent)
Оператор неравенства структуры MaterialSpecularComponent.
Оператор неравенства структуры MaterialSpecularComponent.
Позволяет установить факт неравенства двух экземпляров MaterialSpecularComponent.
Notes
Критерием неравенства двух экземпляров структуры MaterialSpecularComponent является невыполнение хотя бы одного из следующих условий:
* Карты материалов операндов равны (либо обе равны null);
* Степени глянца операндов равны;
* Цвета отражения операндов равны.
a: Левый операнд.  Тип MaterialSpecularComponent.
b: Правый операнд. Тип MaterialSpecularComponent.
Returns: Возвращает true, если левый операнд не равен правому.
В противном случае возвращает false

Teigha.GraphicsInterface.MaterialSpecularComponent.==(Teigha.GraphicsInterface.MaterialSpecularComponent,Teigha.GraphicsInterface.MaterialSpecularComponent)
Оператор равенства структуры MaterialSpecularComponent.
Оператор равенства структуры MaterialSpecularComponent.
Позволяет установить факт равенства двух экземпляров MaterialSpecularComponent.
Notes
Критерием равенства двух экземпляров структуры MaterialSpecularComponent является совместное выполнение следующих условий:
* Карты материалов операндов равны (либо обе равны null);
* Степени глянца операндов равны;
* Цвета отражения операндов равны.
a: Левый операнд.  Тип MaterialSpecularComponent.
b: Правый операнд. Тип MaterialSpecularComponent.
Returns: Возвращает true, если левый операнд равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialSpecularComponent.Color
Свойство Color представляет цвет отражения материала.
Свойство Color представляет цвет отражения материала.
Returns: Возвращает цвет отражения материала.
Тип MaterialColor.

Teigha.GraphicsInterface.MaterialSpecularComponent.Gloss
Свойство Gloss представляет степень глянца материала.
Свойство Gloss представляет степень глянца материала.
Returns: Возвращает степень глянца материала.
Тип double.

Teigha.GraphicsInterface.MaterialSpecularComponent.Map
Свойство Map представляет карту материала, связанную с данным объектом.
Свойство Map представляет карту материала, связанную с данным объектом.
Returns: Возвращает карту материала.
Тип MaterialMap.