Teigha.DatabaseServices.PatternDefinition.GetDashes
Метод предоставляет коллекцию значений, определяющих штрихи в определении штриховки.
Метод предоставляет коллекцию значений, определяющих штрихи в определении штриховки.
Returns: Возвращает коллекцию штрихов. Тип DoubleCollection.