Teigha.DatabaseServices.Field.GetChildren
Метод позволяет получить дочерние поля данного объекта.
Метод позволяет получить дочерние поля данного объекта.
Если данный объект является текстовым полем, дочерними являются поля, внедренные в текст.
Если данный объект не является текстовым полем, дочерние поля представляют собой вложенные поля.
Returns: Возвращает массив дочерних полей данного объекта. Тип Field[].
Notes
Возвращаемый объект поля открывается в предписанном режиме, если это поле является резидентным в базе данных.
За закрытие объекта поля после его использования отвечает вызывающее приложение.