Teigha.Geometry.EllipticalArc2d
Класс EllipticalArc2d представляет эллиптические дуги и полные эллипсы в двумерном пространстве.
Класс EllipticalArc2d представляет эллиптические дуги и полные эллипсы в двумерном пространстве.
Notes
Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса.  Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
У полного эллипса разница между начальным и конечным углами составляет 2 x Pi.

Teigha.Geometry.EllipticalArc2d.#ctor
Конструктор по умолчанию класса EllipticalArc2d.
Конструктор по умолчанию класса EllipticalArc2d создает полный эллипс с центром в начале координат (0,0), большая и малая оси которого совпадают с осями X и Y, а большой и малый радиусы равны 1.
Начальное и конечное значения параметра равны нулю и 2 х PI, соответственно.
Таким образом, построенный эллипс геометрически представляет собой единичную окружность с центром в начале координат.

Teigha.Geometry.EllipticalArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double)
Конструктор класса EllipticalArc2d.
Создает эллипс с указанными центром, осями и радиусами.
Конструктор класса EllipticalArc2d.
Создает эллипс с указанными центром, большой и малой осями, большим и малым радиусами.
center: Центр эллипса. Тип Point2d.
majorAxis: Большая ось эллипса. Тип Vector2d.
minorAxis: Малая ось эллипса. Тип Vector2d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса. Тип double.

Teigha.Geometry.EllipticalArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса EllipticalArc2d.
Создает эллипс или эллиптическую дугу с указанными центром, осями, радиусами, а также начальным и конечным углами.
Конструктор класса EllipticalArc2d.
Создает эллипс или эллиптическую дугу с указанными центром, большой и малой осями, большим и малым радиусами, а также начальным и конечным углами.
Notes
Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром  эллипса, а радиус равен большому радиусу этого эллипса.  Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
У полного эллипса разница между EndAngle и StartAngle составляет 2 x Pi.
center: Центр эллипса.          Тип Point2d.
majorAxis: Большая ось эллипса.    Тип Vector2d.
minorAxis: Малая ось эллипса.      Тип Vector2d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса.   Тип double.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип double.

Teigha.Geometry.EllipticalArc2d.#ctor(Teigha.Geometry.CircularArc2d)
Конструктор класса EllipticalArc2d.
Создает эллиптическую дугу на базе указанной круглой дуги.
Конструктор класса EllipticalArc2d.
Создает эллиптическую дугу на базе указанной круглой дуги.
arc: Входная круглая дуга. Тип CircularArc2d.

Teigha.Geometry.EllipticalArc2d.Create(IntPtr,System.Boolean)
Метод создает эллипс или эллиптическую дугу на основе переданного неуправляемого указателя.
Метод создает эллипс или эллиптическую дугу на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип EllipticalArc2d.

Teigha.Geometry.EllipticalArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d)
Метод вычисляет точки пересечения данного объекта с указанным линейным объектом.
Используется геометрическая точность по умолчанию.
Метод вычисляет точки пересечения данного объекта с указанным линейным объектом.
Результатом является массив точек пересечения (если они существуют).
Используется вызов метода EllipticalArc2d.IntersectWith(LinearEntity2d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
Notes
В случае отсутствия точек пересечения метод возвращает null.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity2d.
Returns: Возвращает массив из двух элементов. Тип Point2d[].
Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данного объекта с указанным линейным объектом, используя заданную геометрическую точность.
Метод вычисляет точки пересечения данного объекта с указанным линейным объектом, используя заданную геометрическую точность.
Результатом является массив точек пересечения (если они существуют).
Notes
В случае отсутствия точек пересечения метод возвращает null.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив из двух элементов. Тип Point2d[].
Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc2d.IsCircular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах указанной геометрической точности данную эллиптическую дугу можно считать круглой.
В противном случае возвращает false.

Teigha.Geometry.EllipticalArc2d.IsInside(Teigha.Geometry.Point2d)
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию.
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию.
Используется вызов метода EllipticalArc2d.IsInside(Point2d point, Tolerance tolerance) с геометрической точностью, равной Tolerance.Global.
point: Проверяемая точка. Тип Point2d.
Returns: Возвращает true, если в пределах точности по умолчанию можно считать, что точка point находится в пределах полного эллипса.
В противном случае возвращает false.

Teigha.Geometry.EllipticalArc2d.IsInside(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет убедиться, что указанная точка находится внутри полного эллипса в пределах заданной геометрической точности.
Метод позволяет убедиться, что указанная точка находится внутри полного эллипса в пределах заданной геометрической точности.
point: Проверяемая точка. Тип Point2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной геометрической точности можно считать, что точка point находится внутри полного эллипса. В противном случае возвращает false.

Teigha.Geometry.EllipticalArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double)
Метод позволяет переопределить у данного объекта точку центра, оси и радиусы.
Метод позволяет переопределить у данного объекта точку центра, большую и малую оси, большой и малый радиусы.
center: Центр эллипса. Тип Point2d.
majorAxis: Большая ось эллипса. Тип Vector2d.
minorAxis: Малая ось эллипса. Тип Vector2d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса. Тип double.

Teigha.Geometry.EllipticalArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Метод позволяет переопределить данный объект, используя указанные центр, оси, радиусы, а также начальный и конечный углы.
Метод позволяет переопределить данный эллипс или эллиптическую дугу, используя указанные точку центра, большую и малую оси, большой и малый радиусы, а также начальный и конечный углы.
Notes
Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром  эллипса, а радиус равен большому радиусу этого эллипса.  Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки, является углом этой точки на эллипсе.
У полного эллипса разница между EndAngle и StartAngle составляет 2 x Pi.
center: Центр эллипса.          Тип Point2d.
majorAxis: Большая ось эллипса.    Тип Vector2d.
minorAxis: Малая ось эллипса.      Тип Vector2d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса.   Тип double.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип double.

Teigha.Geometry.EllipticalArc2d.Set(Teigha.Geometry.CircularArc2d)
Метод позволяет переопределить данный объект, используя указанную круглую дугу.
Метод позволяет переопределить данный объект, используя указанную круглую дугу.
arc: Входная круглая дуга. Тип CircularArc2d.

Teigha.Geometry.EllipticalArc2d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы у данного объекта.
Метод позволяет переопределить начальный и конечный углы у данной эллиптической дуги.
Notes
Метод проверяет, чтобы конечный угол превышал начальный, и в случае необходимости меняет местами переданные значения.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип double.

Teigha.Geometry.EllipticalArc2d.SetAxes(Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
majorAxis: Новое направление большой оси эллиптической дуги. Тип Vector2d.
minorAxis: Новое направление малой   оси эллиптической дуги. Тип Vector2d.

Teigha.Geometry.EllipticalArc2d.Center
Свойство Center предоставляет доступ к точке центра данной эллиптической дуги.
Свойство Center предоставляет доступ к точке центра данной эллиптической дуги.
Returns: Возвращает точку центра дуги. Тип Point2d.

Teigha.Geometry.EllipticalArc2d.EndAngle
Свойство EndAngle представляет конечный угол данной эллиптической дуги.
Свойство EndAngle представляет конечный угол данной эллиптической дуги.
Returns: Возвращает конечный угол эллиптической дуги. Тип double.

Teigha.Geometry.EllipticalArc2d.EndPoint
Свойство EndPoint представляет конечную точку данной эллиптической дуги.
Свойство EndPoint представляет конечную точку данной эллиптической дуги.
Returns: Возвращает конечную точку эллиптической дуги. Тип Point2d.

Teigha.Geometry.EllipticalArc2d.IsClockWise
Свойство IsClockWise представляет направление данной эллиптической дуги (по часовой стрелке или против).
Свойство IsClockWise представляет направление данной эллиптической дуги (по часовой стрелке или против).
Returns: Возвращает true, если эллиптическая дуга имеет направление по часовой стрелке.
В противном случае возвращает false.

Teigha.Geometry.EllipticalArc2d.MajorAxis
Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
Returns: Возвращает направление большой оси эллиптической дуги.  Тип Vector2d.

Teigha.Geometry.EllipticalArc2d.MajorRadius
Свойство MajorRadius предоставляет доступ к значению большого радиуса данной эллиптической дуги.
Свойство MajorRadius предоставляет доступ к значению большого радиуса данной эллиптической дуги.
Returns: Возвращает значение большого радиуса эллиптической дуги.
Тип double.

Teigha.Geometry.EllipticalArc2d.MinorAxis
Свойство MinorAxis представляет направление малой оси данной эллиптической дуги.
Свойство MinorAxis представляет направление малой оси данной эллиптической дуги.
Returns: Возвращает направление малой оси эллиптической дуги.
Тип Vector2d.

Teigha.Geometry.EllipticalArc2d.MinorRadius
Свойство MinorRadius предоставляет доступ к значению малого радиуса данной эллиптической дуги.
Свойство MinorRadius предоставляет доступ к значению малого радиуса данной эллиптической дуги.
Returns: Возвращает значение малого радиуса данной эллиптической дуги.
Тип double.

Teigha.Geometry.EllipticalArc2d.StartAngle
Свойство StartAngle представляет значение начального угла данной эллиптической дуги.
Свойство StartAngle представляет значение начального угла данной эллиптической дуги.
Returns: Возвращает значение начального угла эллиптической дуги.
Тип double.

Teigha.Geometry.EllipticalArc2d.StartPoint
Свойство StartPoint представляет положение начальной точки данной эллиптической дуги.
Свойство StartPoint представляет положение начальной точки данной эллиптической дуги.
Returns: Возвращает начальную точку эллиптической дуги.
Тип Point2d.