HostMgd.EditorInput.PromptSelectionResultEventHandler
Делегат предназначен для обработки событий,
возникающих после завершения операции выбора
одного или нескольких объектов в редакторе nanoCAD.
Делегат используется как сигнатура метода-обработчика для событий,
связанных с выбором геометрических объектов на чертеже.
Он применяется, например, при работе с событием PromptedForSelection,
которое вызывается после завершения интерактивного выделения объектов
— мышью, рамкой или программно.
Делегат позволяет получить доступ к результату выборки через параметр e,
который содержит:
* набор выделенных объектов (SelectionSet),
* статус выполнения операции (PromptStatus.OK, PromptStatus.Cancel и др.),
* параметры команды ввода ,
* строковое представление введённых данных .
Этот тип делегата играет ключевую роль при разработке плагинов,
где требуется обрабатывать множественный выбор объектов перед
выполнением массовых операций — таких как удаление, модификация
или анализ свойств.
sender: Источник события, обычно представляет собой экземпляр редактора (Editor),
e: Объект, содержащий данные о результате выборки