HostMgd.ApplicationServices.InplaceTextEditor.OtherSymbol
Метод предназначен для вызова диалогового окна настройки другого символа.
В текущей версии не реализован.
Метод предназначен для вызова диалогового окна настройки другого символа.
В текущей версии метод не реализован.