Teigha.DatabaseServices.TableCopyOptions.OverwriteFormatModifiedAfterUpdate
Значение: 2097152 = 0x200000.
Если формат целевой ячейки претерпел изменения с момента последнего обновления, перезаписать.
Этот параметр применим только для ячеек с внешними ссылками.