Teigha.DatabaseServices.SweepOptions
Класс SweepOptions  предназначен для управления параметрами, которые используются при создании поверхностей и твердых тел вытягиванием по траектории такими методами как SweptSurface.CreateSweptSurface() или Solid3d.CreateSweptSolid().
Класс SweepOptions  предназначен для управления параметрами, которые используются при создании поверхностей и твердых тел вытягиванием по траектории такими методами как SweptSurface.CreateSweptSurface() или Solid3d.CreateSweptSolid().
Параметры вытягивания по траектории используются для настройки формы получаемой поверхности или твердого тела.

Teigha.DatabaseServices.SweepOptions.#ctor
Конструктор по умолчанию класса SweepOptions.
Конструктор по умолчанию класса SweepOptions.

Teigha.DatabaseServices.SweepOptions.#ctor(Teigha.DatabaseServices.SweepOptions)
Конструктор класса SweepOptions. Создает экземпляр класса как копию указанного объекта.
Конструктор класса SweepOptions. Создает экземпляр класса, являющийся копией переданного в аргументе объекта SweepOptions.
opts: Экземпляр класса, копию которого требуется создать. Тип SweepOptions.

Teigha.DatabaseServices.SweepOptions.CheckPathCurve(Teigha.DatabaseServices.Entity,System.Boolean)
Метод предоставляет возможность проверить, является ли указанный геометрический объект допустимым в качестве траектории вытягивания.
Метод предоставляет возможность проверить, является ли указанный геометрический объект допустимым в качестве траектории вытягивания.
pathEnt: Кривая траектории. Тип Entity.
displayErrorMessages: Флаг, определяющий, следует ли отображать сообщения о выявленных ошибках. Тип bool.

Teigha.DatabaseServices.SweepOptions.CheckSweepCurve(Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет проверить допустимость указанного объекта для операции вытягивания по траектории.
Метод позволяет проверить допустимость указанного объекта для операции вытягивания по траектории.
Возвращаемый экземпляр SweepOptionsCheckSweepCurveOut представляет результаты анализа входного объекта, например, состояние флага планарности объекта, точка на контуре или точка на линии, замкнутость контура , приблизительная длина контура и т.д.
sweepEnt: Кривая, область или плоская поверхность для вытягивания по траектории. Тип Entity.
displayErrorMessages: Флаг, определяющий, следует ли отображать сообщения о выявленных ошибках. Тип bool.
Returns: Возвращает экземпляр класса SweepOptionsCheckSweepCurveOut с результатами метода.

Teigha.DatabaseServices.SweepOptions.Align
Свойство Align представляет выравнивание вытягиваемого объекта относительно траектории.
Свойство Align представляет выравнивание вытягиваемого объекта относительно траектории.
Returns: Возвращает вариант выравнивания относительно траектории. Тип SweepOptionsAlignOption.

Teigha.DatabaseServices.SweepOptions.AlignAngle
Свойство AlignAngle представляет величину угла выравнивания в радианах.
Свойство AlignAngle представляет величину угла выравнивания в радианах.
Returns: Возвращает угол выравнивания в радианах. Тип double.

Teigha.DatabaseServices.SweepOptions.AlignStart
Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
Returns: Возвращает true, если применяется выравнивание относительно начала траектории.
В случае false используется выравнивание относительно конца траектории.

Teigha.DatabaseServices.SweepOptions.Bank
Свойство Bank позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
Свойство Bank позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
Returns: Возвращает true, если вытягиваемая грань или кривая располагается вдоль траектории.
В противном случае возвращает false.

Teigha.DatabaseServices.SweepOptions.BasePoint
Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
Returns: Возвращает базовую точку. Тип Point3d.

Teigha.DatabaseServices.SweepOptions.CheckIntersections
Свойство CheckIntersections позволяет определить состояние опции проверки самопересечения.
Свойство CheckIntersections позволяет определить состояние опции проверки самопересечения.
Если эта опция отключена, может быть создана поверхность или твердое тело с самопересечениями.
Returns: Возвращает true, если проверка самопересечений включена.
В противном случае возвращает false.

Teigha.DatabaseServices.SweepOptions.DraftAngle
Свойство DraftAngle представляет угол сужения (расширения), на который профиль будет сужаться по мере вытягивания вдоль траектории.
Свойство DraftAngle представляет угол сужения (расширения), на который профиль будет сужаться по мере вытягивания вдоль траектории.
Returns: Возвращает угол сужения (в радианах). Тип double.

Teigha.DatabaseServices.SweepOptions.EndDraftDist
Свойство EndDraftDist представляет расстояние, на котором сужение/расширение вытягиваемого объекта прекращается.
Свойство EndDraftDist представляет расстояние, на котором сужение/расширение вытягиваемого объекта прекращается.
Returns: Возвращает расстояние, на котором сужение/расширение прекращается. Тип double.

Teigha.DatabaseServices.SweepOptions.PathEntityTransform
Свойство PathEntityTransform представляет матрицу преобразования для системы координат в начале/конце траектории вытягивания.
Свойство PathEntityTransform представляет матрицу преобразования для системы координат в начале/конце траектории вытягивания.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.DatabaseServices.SweepOptions.ScaleFactor
Свойство ScaleFactor представляет масштабный коэффициент.
Свойство ScaleFactor представляет масштабный коэффициент.
Returns: Возвращает масштабный коэффициент. Тип double.

Teigha.DatabaseServices.SweepOptions.StartDraftDist
Свойство StartDraftDist представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
Свойство StartDraftDist представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
Returns: Возвращает расстояние, на котором начинается сужение/расширение вытягиваемого объекта. Тип double.

Teigha.DatabaseServices.SweepOptions.SweepEntityTransform
Свойство SweepEntityTransform представляет матрицу преобразования системы координат вытягиваемого объекта.
Свойство SweepEntityTransform представляет матрицу преобразования системы координат вытягиваемого объекта.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.DatabaseServices.SweepOptions.TwistAngle
Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
Returns: Возвращает угол кручения профиля. Тип double.