Teigha.BoundaryRepresentation.Face.GetSurfaceAsNurb
Метод позволяет получить базовую поверхность данной грани как подмножество объектов NurbSurface.
Метод позволяет получить базовую поверхность данной грани как подмножество объектов NurbSurface, к каждому из которых применена вся последовательность геометрических преобразований из пути подобъекта.
При необходимости поверхность преобразуется в NURB (используется обратный масштабный коэффициент из вложенных геометрических преобразований, чтобы находиться в том же пространстве вычислений, что и эта грань) с использованием глобально заданной точности аппроксимации и подмножества диапазона UV, который получается проецированием граничного бокса грани в пространстве модели на сеть пространства параметров UV поверхности.
В качестве достигнутой точности используется глобальная установка.
Returns: Возвращает базовую NURB поверхность для данной грани.
Тип Geometry.NurbSurface.