Teigha.GraphicsInterface.OrientationBehavior
Перечисление OrientationBehavior определяет варианты преобразования ориентации временной графики (transient graphics).
Перечисление OrientationBehavior определяет варианты преобразования ориентации временной графики (transient graphics).