HostMgd.ApplicationServices.DrawingOpenEventArgs
Класс DrawingOpenEventArgs представляет данные события EndDwgOpen класса Document.
Класс DrawingOpenEventArgs представляет контекст события
Document.EndDwgOpen, позволяя передать в обработчик события имя открываемого файла и ссылку на объект базы данных чертежа.

HostMgd.ApplicationServices.DrawingOpenEventArgs.Database
Свойство Database представляет базу данных открываемого чертежа.
Свойство Database представляет базу данных открываемого чертежа.
Returns: Возвращает базу данных nanoCAD.
Тип Database.

HostMgd.ApplicationServices.DrawingOpenEventArgs.FileName
Свойство FileName представляет имя открываемого файла чертежа.
Свойство FileName представляет имя открываемого файла чертежа.
Returns: Возвращает имя открываемого файла.
Тип String.