Teigha.DatabaseServices.ObjectContextManager
Класс ObjectContextManager предназначен для управления коллекцией доступных в чертеже типов контекста.
Класс предназначен для управления коллекцией доступных в чертеже типов контекста.
Каждая база данных предоставляет экземпляр ObjectContextManager, который можно использовать для регистрации, отмены регистрации и перечисления пользовательских коллекций контекстов.

Teigha.DatabaseServices.ObjectContextManager.#ctor
Конструктор по умолчанию класса ObjectContextManager.
Конструктор по умолчанию класса ObjectContextManager.

Teigha.DatabaseServices.ObjectContextManager.GetContextCollection(String)
Метод предоставляет коллекцию контекстов, зарегистрированную в данном менеджере контекстов под указанным именем.
Метод предоставляет коллекцию контекстов, зарегистрированную в данном менеджере контекстов под указанным именем.
collectionName: Имя контекста.  Тип String.
Returns: Возвращает зарегистрированную коллекцию контекстов. Тип ObjectContextCollection.
В случае отсутствия такой коллекции, возвращает нулевой указатель.

Teigha.DatabaseServices.ObjectContextManager.RegisterContextCollection(String,Teigha.DatabaseServices.ObjectContextCollection)
Метод позволяет зарегистрировать в данном менеджере контекстов коллекцию контекстов под указанным именем.
Метод позволяет зарегистрировать в данном менеджере контекстов коллекцию контекстов под указанным именем.
collectionName: Имя для регистрации коллекции контекстов. Тип String.
collection: Коллекция контекстов. Тип ObjectContextCollection.

Teigha.DatabaseServices.ObjectContextManager.UnregisterContextCollection(String)
Метод предназначен для отмены регистрации коллекции контекстов в данном менеджере контекстов.
Метод предназначен для отмены регистрации коллекции контекстов в данном менеджере контекстов.
collectionName: Имя коллекции контекстов. Тип String.