Teigha.DatabaseServices.DynamicDimensionChangedEventArgs
Этот класс предоставляет данные для функции OnDimensionValueChanged класса Jig.
Этот класс предоставляет данные для функции OnDimensionValueChanged класса Jig.

Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.#ctor(System.Int32,System.Double)
Этот конструктор создает новый объект класса с указанными индексом и значением.
Этот конструктор создает новый объект класса с указанными индексом и значением.
index: Индекс размера. Тип int.
value: Значение размера. Тип double.

Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.Index
Свойство обеспечивает доступ к значению индекса.
Свойство обеспечивает доступ к значению индекса.
Returns: Возвращает текущее значение индекса. Тип int.

Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.Value
Свойство обеспечивает доступ к текущему значению размера.
Свойство обеспечивает доступ к текущему значению размера.
Returns: Возвращает текущее значение размера. Тип double.