Teigha.DatabaseServices.Graph.GetOutgoing
Метод позволяет получить коллекцию всех исходящих узлов данного графа.
Метод позволяет получить коллекцию всех исходящих узлов данного графа.
Каждый узел встречается в коллекции только один раз.
Returns: Возвращает коллекцию исходящих узлов данного графа.  Тип GraphNodeCollection.