Teigha.DatabaseServices.Polyline2d.CurveFit
Метод создает гладкую кривую, состоящую из пар дуг, соединяющих каждую пару вершин. Эта операция эквивалентна коменде PEDIT с опцией "Fit".
Метод создает гладкую кривую, состоящую из пар дуг, соединяющих каждую пару вершин.
Кривая проходит через все вершины полилинии и использует любые направления касательной, заданные отдельными вершинами.
Эта операция эквивалентна коменде PEDIT с опцией "Fit".