HostMgd.EditorInput.ObjectSnapMasks.Near
Значение: 512 (0x200).
Привязка к ближайшей точке объекта, например, дуги, окружности, эллипса, эллиптической дуги, отрезка, точки как объекта, полилинии, луча, сплайна или прямой.