Teigha.GraphicsSystem.ImpDevice.CreateModel
Метод создает новый объект Model и связывает его с данным устройством.
Метод создает новый объект Model и связывает его с данным устройством.
Returns: Возвращает дескриптор созданной модели.
Тип Model.