Teigha.DatabaseServices.MeshPointMap
Структура MeshPointMap хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMashPointMap().
Структура MeshPointMap хранит данные, возвращаемые методом Teigha.DatabaseServices.GeoLocationData.GetMashPointMap().

Teigha.DatabaseServices.MeshPointMap.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор структуры MeshPointMap.
Конструктор структуры MeshPointMap.
sourcePt: Исходная точка.   Тип Point2d.
destPt: Точка назначения. Тип Point2d.

Teigha.DatabaseServices.MeshPointMap.DestPoint
Свойство DestPoint представляет точку назначения.
Свойство DestPoint представляет точку назначения.
Returns: Возвращает точку назначения. Тип Point2d.

Teigha.DatabaseServices.MeshPointMap.SourcePoint
Свойство SourcePoint представляет исходную точку.
Свойство SourcePoint представляет исходную точку.
Returns: Возвращает исходную точку. Тип Point2d.