Teigha.DatabaseServices.OsnapPointRef.IsGeomErased
Метод позволяет проверить, удалена ли геометрия данного объекта.
Метод позволяет проверить, удалена ли геометрия данного объекта.
Returns: Возвращает true, если геометрия данного объекта удалена.
В противном случае возвращает false.