Teigha.BoundaryRepresentation.LoopType
Данное перечисление определяет допустимые типы циклов граней.
Данное перечисление определяет допустимые типы циклов граней в граничных представлениях - внешнее, внутреннее и т.д.