Teigha.DatabaseServices.LayerStateMasks.CurrentViewport
Указывает настройки пользователя относительно того, следует ли восстанавливать текущие настройки VPLAYER видового экрана во время операции восстановления состояния слоя. CurrentViewport = 0x200.