Teigha.Geometry.Vector3d.IsZeroLength
Метод позволяет проверить, является ли данный вектор нулевым.
Метод позволяет проверить, является ли данный вектор нулевым.
Реализация использует вызов Vector3d.IsZeroLength(Tolerance tolerance) со значением аргумента tolerance, равным Tolerance.Global.
Метод возвращает true, если это условие выполнено, и false в противном случае.
Returns: Возвращает true, если данный вектор можно считать нулевым. В противном случае возвращает false.