Teigha.DatabaseServices.DBObject.ObjectClosed
Событие происходит непосредственно перед закрытием объекта.
Событие происходит непосредственно перед закрытием объекта.
Returns: Тип данных ObjectClosedEventHandler, представляющий обработчик события.