Teigha.GraphicsInterface.GIRasterImageDesc.SupportedParams
Метод предоставляет битовые флаги для поддерживаемых параметров.
Метод предоставляет битовые флаги для поддерживаемых интерфейсом параметров.
Returns: Возвращает битовые флаги. Тип int.