Teigha.GraphicsInterface.Geometry
Класс Geometry абстрагирует общее между классами ViewportGeometry и WorldGeometry.
Класс Geometry абстрагирует общее между классами ViewportGeometry и WorldGeometry.
Для сохранения своих исходных сигнатур, классы WorldGeometry и ViewportGeometry являются производными от Geometry.

Teigha.GraphicsInterface.Geometry.Circle(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает графический примитив в виде окружности, построенной по трем несовпадающим точкам, которые лежат на окружности.
Метод отображает графический примитив в виде окружности, построенной по трем несовпадающим точкам (firstPoint, secondPoint и thirdPoint), которые лежат на окружности.
firstPoint: Первая точка на окружности. Тип Point3d.
secondPoint: Вторая точка на окружности. Тип Point3d.
thirdPoint: Третья точка на окружности. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Circle(Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d)
Метод отображает графический примитив в виде окружности с указанными центром и радиусом, которая лежит в заданной плоскости.
Метод отображает графический примитив в виде окружности с центром center и радиусом radius.
Окружность располагается в плоскости, определяемой вектором нормали normal и точкой центра окружности center.
center: Точка центра окружности. Тип Point3d.
radius: Радиус окружности. Тип double.
normal: Вектор нормали к плоскости окружности. Тип Vector3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.CircularArc(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.GraphicsInterface.ArcType)
Метод отображает графический примитив в виде дуги с типом из перечисления ArcType, определяемой тремя точками: точками начала и конца, а также точкой, лежащей на дуге.
Метод отображает графический примитив в виде дуги с типом из перечисления ArcType, определяемой тремя точками: точками начала и конца, а также точкой, лежащей на дуге.
start: Входная точка начала дуги. Тип Point3d.
point: Входная точка, лежащая на дуге. Тип Point3d.
endingPoint: Входная точка конца дуги. Тип Point3d.
arcType: Требуемый тип дуги. Значение из перечисления ArcType.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.CircularArc(Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,Teigha.GraphicsInterface.ArcType)
Метод отображает графический примитив в виде дуги, определяемой центром дуги, ее радиусом, вектором нормали плоскости, вектором от центра дуги до начальной точки дуги, углом раствора дуги и типом дуги из перечисления ArcType.
Метод отображает графический примитив в виде дуги, определяемой центром дуги, ее радиусом, вектором нормали плоскости, вектором от центра дуги до начальной точки дуги startVector, углом раствора дуги sweepAngle и типом дуги из перечисления ArcType.
center: Точка центра дуги. Тип Point3d.
radius: Радиус дуги. Тип double.
normal: Вектор нормали плоскости, в которой лежит дуга. Тип Vector3d.
startVector: Вектор, направленный из центра дуги к ее начальной точке. Тип Vector3d.
sweepAngle: Угол раствора дуги (в радианах). Тип double.
arcType: Требуемый тип дуги. Значение из перечисления ArcType.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Draw(Teigha.GraphicsInterface.Drawable)
Метод дает команду графической системе регенерировать графическое представление входного значения как компонента данного объекта.
Метод дает команду графической системе регенерировать графическое представление входного значения как компонента данного объекта.
Например, определение блока (BlockTableRecord) использует этот метод для отрисовки входящих в блок объектов.  Всякий объект-владелец другого объекта должен использовать этот метод, чтобы этот подобъект рисовал сам себя (в отличие от прямого вызова метода WorldDraw() подобъекта).
Это позволяет графической системе кэшировать графику объекта.  Прямой вызов WorldDraw() предотвратит этот тип кэширования.
Возврат false вызывающей программе будет означать, что запрос вами не обработан.
value: Входной объект Drawable, который должен быть отрисован.
Returns: Возвращает true, если отрисовка завершилась успешно. В противном случае возвращает false.
Example
В качестве примера приведен фрагмент кода, где используется метод Draw() класса Geometry. Наиболее распространенным случаем использования этого метода в .NET API nanoCAD является технология Jig.
Jig использует метод WorldDraw, у которого входным параметром является переменная типа Teigha.GraphicsInterface.WorldDraw. У этого типа есть свойство Geometry типа Teigha.GraphicsInterface.Geometry, через которое можно получить доступ к методу Draw():
C#

Teigha.GraphicsInterface.Geometry.EllipticalArc(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double,System.Double,Teigha.GraphicsInterface.ArcType)
Метод реализует отрисовку эллиптической дуги или полного эллипса, с заливкой или без заливки.
Метод реализует отрисовку эллиптической дуги или полного эллипса, с заливкой или без заливки.
center: Центр дуги. Тип Point3d.
normal: Вектор нормали к плоскости, в которой располагается дуга/эллипс. Тип Vector3d.
majorAxisLength: Длина большой оси эллипса. Тип double.
minorAxisLength: Длина малой оси эллипса. Тип double.
startDegreeInRads: Начальный угол в радианах. Тип double.
endDegreeInRads: Конечный угол в радианах. Тип double.
tiltDegreeInRads: Угол наклона большой оси эллипса. Тип double.
arcType: Тип отображения дуги. Значение из перечисления ArcType.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Image(Teigha.GraphicsInterface.ImageBGRA32,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод реализует отрисовку прозрачного изображения ImageBGRA32, используя переданные в метод параметры.
Изображение будет растянуто, если его "родные" размеры не равны заявленным.
Метод реализует отрисовку прозрачного изображения, используя переданные в метод параметры.
Изображение будет растянуто, если его "родные" размеры не равны заявленным.
imageSource: Входное прозрачное изображение. Тип ImageBGRA32.
position: Точка вставки изображения. Тип Point3d. Используется система координат дисплея.
u: Требуемая ширина прямоугольного изображения. Тип Vector3d.
v: Требуемая высота прямоугольного изображения. Тип Vector3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Image(Teigha.GraphicsInterface.ImageBGRA32,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.GraphicsInterface.TransparencyMode)
Метод реализует отрисовку прозрачного изображения ImageBGRA32, используя переданные в метод параметры. Изображение будет растянуто, если его "родные" размеры не равны заявленным. Метод позволяет задать режим прозрачности для изображения TransparencyMode.
Метод реализует отрисовку прозрачного изображения, используя переданные в метод параметры.
Изображение будет растянуто, если его "родные" размеры не равны заявленным.
imageSource: Входное прозрачное изображение. Тип ImageBGRA32.
position: Точка вставки изображения. Тип Point3d. Используется система координат дисплея.
u: Требуемая ширина прямоугольного изображения. Тип Vector3d.
v: Требуемая высота прямоугольного изображения. Тип Vector3d.
transparencyMode: Режим прозрачности при отрисовке изображения. Значение из перечисления TransparencyMode.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Mesh(System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.GraphicsInterface.EdgeData,Teigha.GraphicsInterface.FaceData,Teigha.GraphicsInterface.VertexData,System.Boolean)
Метод предназначен для создания и отображения примитива сети, характеристики которой определяются объектами, переданными в метод в качестве параметров.
Метод Mesh предназначен для создания и отображения примитива сети, характеристики которой определяются объектами, переданными в метод в качестве параметров.
Аргумент edgeData указывает на объект EdgeData, который содержит массивы цвета, слоя, видимости, типа линии и настройки маркера выделения ребер сети.  Каждый из массивов в указанном объекте EdgeData должен иметь значение NULL или содержать (row - 1) x column + row x (column -1) элементов.
Аргумент faceData указывает на объект FaceData, который содержит массивы цвета, слоя, видимости, типа линии и настройки маркера выделения граней. Каждый из массивов в указанном объекте FaceData должен иметь значение NULL или содержать (row -1) x (column - 1) элементов.
Аргумент vertexData указывает на существующий объект VertexData, который содержит флаг ориентации вершин и указатель на массив нормалей в вершинах. Массив нормалей в вершинах сети должен быть либо NULL, либо содержать (row x column) элементов.
Следует отметить, что метод не изменяет и не удаляет массив параметров или объекты. За используемую ими память отвечает вызывающая программа.
rows: Количество строк в сети. Тип int.
columns: Количество столбцов в сети. Тип int.
points: Входной массив вершин. Размерность массива определяется произведением rows x columns. Тип Point3dCollection.
edgeData: Входной объект EdgeData для данных о ребрах. Тип EdgeData.
faceData: Входной объект FaceData для данных о гранях. Тип FaceData.
vertexData: Входной объект VertexData для данных о вершинах. Тип VertexData.
bAutoGenerateNormals: Входной флаг, который определяет, должна ли система отображения автоматически генерировать нормали для вершин и граней, если они не передаются через массивы vertexData и faceData. Тип bool.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.OwnerDraw(Teigha.GraphicsInterface.GdiDrawObject,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет вызвать отрисовку объекта-владельца GDI.
Метод позволяет вызвать отрисовку объекта-владельца GDI.
gdiDrawObject: Входной объект gdiDrawObject объекта-владельца GDI. Тип GdiDrawObject.
position: Точка начала (точка вставки) для отрисовки объекта-владельца GDI. Тип Point3d.
u: Входная ориентация и ширина окна отрисовки.
v: Входная ориентация и высота окна отрисовки.
Returns: Возвращает false , если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.PolyPolygon(Teigha.Geometry.UInt32Collection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.UInt32Collection,Teigha.Geometry.Point3dCollection,Teigha.Colors.EntityColorCollection,Teigha.GraphicsInterface.LinetypeCollection,Teigha.Colors.EntityColorCollection,Colors.TransparencyCollection)
Метод вводит несколько полигонов в контекст векторизации с соответствующей настройкой их свойств (форма, непрозрачность, контуры и т.д.).
Метод вводит несколько полигонов в контекст векторизации.
Эти полигоны могут быть определены с настройкой различных свойств, таких как форма, непрозрачность, контуры и т.д.
Метод может одновременно рисовать несколько одинаковых и несколько различных полигонов.
Если какие-то параметры не указаны, они берутся из текущих свойств объекта SubEntityTraits.
numPolygonPositions: Массив, элементы которого хранят количество полигонов каждого типа. Тип UInt32Collection.
polygonPositions: Массив позиций полигонов (смещения для каждого полигона). Тип Point3dCollection.
numPolygonPoints: Массив с количествами вершин у полигонов. Тип UInt32Collection.
polygonPoints: Массив вершин каждого полигона. Тип Point3dCollection.
outlineColors: Массив цветов контуров для типов полигонов, по одному цвету на каждый индекс полигона. Тип EntityColorCollection.
outlineTypes: Массив типов контуров для каждого типа полигонов, по одному типу на каждый индекс полигона. Тип LinetypeCollection.
fillColors: Массив цветов заливки для каждого типа полигонов, по одному цвету fillColor на каждый индекс полигона. Тип EntityColorCollection.
fillOpacities: Массив объектов непрозрачности для полигонов, по одному fillOpacity на каждый индекс полигона. Тип Colors.TransparencyCollection.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.
Example
Пример вызова метода (здесь квадратные скобки обозначают массив):
polyPolygon (
[100, 7],
[100 + 7 = 107 общее количество позиций],
[4, 6],
[4 + 6 = 10 всего точек],
[outlinecolor0, outlinecolor1],
[pattern0, pattern1],
[fillcolor0, fillcolor1],
[opacity0, opacity1]
);

Teigha.GraphicsInterface.Geometry.PolyPolyline(Teigha.GraphicsInterface.PolylineCollection)
Метод вводит несколько полилиний в контекст векторизации.
Метод вводит несколько полилиний в контекст векторизации.
polylineCollection: Входная коллекция полилиний. Тип PolylineCollection.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polygon(Teigha.Geometry.Point3dCollection)
Метод вводит в контекст векторизации новый полигон с указанными вершинами.
Метод вводит в контекст векторизации новый полигон с указанными вершинами.
points: Входная коллекция вершин полигона (минимум три). Тип Point3dCollection.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polyline(GraphicsInterface.Polyline)
Метод рисует указанную полилинию.
Метод рисует указанную полилинию.
polylineObj: Входная полилиния. Тип GraphicsInterface.Polyline.
Returns: Возвращаемое значение true означает, что операция выполнена успешно.
В противном случае возвращает false.

Teigha.GraphicsInterface.Geometry.Polyline(DatabaseServices.Polyline,System.Int32,System.Int32)
Метод использует входной объект Polyline для создания отображаемой геометрии указанной последовательности сегментов полилинии.
Метод использует входной объект Polyline для создания отображаемой геометрии указанной последовательности сегментов полилинии, начиная с сегмента с индексом fromIndex.
value: Входной существующий объект полилинии. Тип DatabaseServices.Polyline.
fromIndex: Индекс начального отображаемого сегмента полилинии. Тип int.
segments: Входное количество отображаемых сегментов. Тип int.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polyline(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,IntPtr)
Метод создает отображаемую геометрию полилинии, позволяя вызывающему объекту задать последовательные маркеры подобъектов для сегментов полилинии.
Метод создает отображаемую геометрию полилинии, позволяя вызывающему объекту задать последовательные маркеры подобъектов для сегментов полилинии.
Если subEntityMarker 'n' больше нуля, то сегментам полилинии будут назначены маркеры, начинающиеся с 'n' и увеличивающиеся на единицу для каждого сегмента.
points: Входная последовательность вершин полилинии (минимум две). Тип Point3dCollection.
normal: Входной вектор нормали. Тип Vector3d.
subEntityMarker: Входной маркер подобъекта для первого сегмента полилинии. Тип IntPtr.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polypoint(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.IntPtrCollection)
Метод создает отображаемую геометрию полилинии, используя переданные в метод коллекции вершин, нормалей и маркеров подобъектов полилинии.
Метод создает отображаемую геометрию полилинии, используя переданные в метод коллекции вершин, нормалей и маркеров подобъектов полилинии.
points: Входная коллекция вершин полилинии. Тип Point3dCollection.
normals: Входная коллекция нормалей полилинии. Тип Vector3dCollection.
subentityMarkers: Входная коллекция маркеров подобъектов.  Тип IntPtrCollection.
Returns: Возвращает true, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polypoint(Teigha.Geometry.Point3dCollection,Teigha.Colors.EntityColorCollection,Teigha.Colors.TransparencyCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.IntPtrCollection,System.Int32)
Метод отображает полилинию, используя входные коллекции вершин, цветов, прозрачностей, нормалей и маркеров подобъектов.
Метод отображает полилинию, используя входные коллекции вершин, цветов, прозрачностей, нормалей и маркеров подобъектов.
points: Входная коллекция вершин. Тип Point3dCollection.
colors: Входная коллекция цветов. Тип EntityColorCollection.
transparency: Входная коллекция объектов Transparency. Тип TransparencyCollection.
normals: Входная коллекция нормалей. Тип Vector3dCollection.
subentityMarkers: Входная коллекция маркеров подобъектов. Тип IntPtrCollection.
pointSize: Отображаемый размер вершины. Тип int.
Returns: Возвращает true, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polypoint(Teigha.Geometry.Point3dCollection,Teigha.Colors.EntityColorCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.IntPtrCollection)
Метод отображает полилинию, используя входные коллекции вершин, цветов, нормалей и маркеров подобъектов.
Метод отображает полилинию, используя входные коллекции вершин, цветов, нормалей и маркеров подобъектов.
points: Входная коллекция вершин. Тип Point3dCollection.
colors: Входная коллекция цветов. Тип EntityColorCollection.
normals: Входная коллекция нормалей. Тип Vector3dCollection.
subentityMarkers: Входная коллекция маркеров подобъектов. Тип IntPtrCollection.
Returns: Возвращает true, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.PushClipBoundary(Teigha.GraphicsInterface.ClipBoundary)
Метод помещает в стек новую границу обрезки.
Вхождения блоков используют границы обрезки для обрезки своего содержимого. Этот метод помещает новую границу в стек, возможно, влияя на отображение последующих примитивов, пока граница не будет удалена с помощью метода PopClipBoundary().
Если вызов метода PushClipBoundary() завершился успешно, вы должны вызвать метод PopClipBoundary().
boundary: Входная граница обрезки для помещения в стек. Тип ClipBoundary.
Returns: Возвращает true в случае успешного завершения. В случае ошибки генерирует соотетствующее исключение.

Teigha.GraphicsInterface.Geometry.PushClipBoundary(Teigha.GraphicsInterface.ClipBoundary,Teigha.GraphicsInterface.AbstractClipBoundary)
Метод помещает в стек новую границу обрезки вместе с дополнительной информацией об этой обрезке.
Метод помещает в стек новую границу обрезки вместе с дополнительной информацией об этой обрезке.
boundary: Входная граница обрезки. Тип ClipBoundary.
abstrClip: Дополнительная информация об обрезке. Тип AbstractClipBoundary.

Teigha.GraphicsInterface.Geometry.PushModelTransform(Teigha.Geometry.Matrix3d)
Метод помещает указанную матрицу геометрического преобразования модели в текущий стек геометрических преобразований.
Метод помещает матрицу matrix геометрического преобразования модели в текущий стек геометрических преобразований.
Новое преобразование объединяется с текущим преобразованием модели, которое первоначально являлось тождественным.
С этого момента результирующее преобразование модели применяется ко всей геометрии, введенной в этот контекст векторизации, пока не будет вызван метод popModelTransform().
matrix: Входная матрица геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushModelTransform(Teigha.Geometry.Vector3d)
Метод помещает геометрическое преобразование трансляции модели на заданный 3D-вектор в текущий стек геометрических преобразований.
Метод помещает геометрическое преобразование трансляции модели на заданный 3D-вектор в текущий стек геометрических преобразований.
Новое преобразование объединяется с текущим преобразованием модели, которое первоначально являлось тождественным.
С этого момента результирующее преобразование модели применяется ко всей геометрии, введенной в этот контекст векторизации, пока не будет вызван метод popModelTransform().
normal: Входной вектор трансляции модели. Тип Vector3d.

Teigha.GraphicsInterface.Geometry.PushOrientationTransform(Teigha.GraphicsInterface.OrientationBehavior)
Метод помещает в текущий стек преобразований новое преобразование ориентации, сформированное в соответствии с входным значением OrientationBehavior, и возвращает результирующую матрицу.
Метод помещает в текущий стек преобразований новое преобразование ориентации, сформированное в соответствии с входным значением OrientationBehavior, и возвращает результирующую матрицу.
behavior: Вариант ориентационного поведения из перечисления OrientationBehavior.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushPositionTransform(Teigha.GraphicsInterface.PositionBehavior,Teigha.Geometry.Point2d)
Метод помещает в текущий стек преобразований новое преобразование позиции, сформированное в соответствии с входным значением PositionBehavior. Положение задается объектом Point2d. Метод возвращает результирующую матрицу.
Метод помещает в текущий стек преобразований новое преобразование позиции, сформированное в соответствии с входным значением PositionBehavior. Положение задается объектом Point2d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании положения. Значение из перечисления PositionBehavior.
offset: Входное смещение. Тип Point2d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushPositionTransform(Teigha.GraphicsInterface.PositionBehavior,Teigha.Geometry.Point3d)
Метод помещает в текущий стек преобразований новое преобразование позиции, сформированное в соответствии с входным значением PositionBehavior. Положение задается объектом Point3d. Метод возвращает результирующую матрицу.
Метод помещает в текущий стек преобразований новое преобразование позиции, сформированное в соответствии с входным значением PositionBehavior. Положение задается объектом Point3d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании положения. Значение из перечисления PositionBehavior.
offset: Входное смещение. Тип Point3d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushScaleTransform(Teigha.GraphicsInterface.ScaleBehavior,Teigha.Geometry.Point2d)
Метод помещает в текущий стек преобразований новое преобразование масштаба, сформированное в соответствии с входным значением ScaleBehavior. Масштабирование задается объектом Point2d. Метод возвращает результирующую матрицу.
Метод помещает в текущий стек преобразований новое преобразование масштаба, сформированное в соответствии с входным значением ScaleBehavior. Масштабирование задается объектом Point2d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании масштаба. Значение из перечисления ScaleBehavior.
extents: Входные значения масштаба.  Тип Point2d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushScaleTransform(Teigha.GraphicsInterface.ScaleBehavior,Teigha.Geometry.Point3d)
Метод помещает в текущий стек преобразований новое преобразование масштаба, сформированное в соответствии с входным значением ScaleBehavior. Масштабирование задается объектом Point3d. Метод возвращает результирующую матрицу.
Метод помещает в текущий стек преобразований новое преобразование масштаба, сформированное в соответствии с входным значением ScaleBehavior. Масштабирование задается объектом Point3d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании масштаба. Значение из перечисления ScaleBehavior.
extents: Входные значения масштаба.  Тип Point3d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.Ray(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает луч, построенный по двум 3D-точкам.
Метод отображает луч, который начинается в точке point1 и проходит через точку point2.
point1: Начальная точка луча. Тип Point3d.
point2: Точка, через которую проходит луч. Не должна совпадать с начальной точкой. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.RowOfDots(System.Int32,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод отображает последовательность равноудаленных точек вдоль заданного направления.
Метод отображает последовательность равноудаленных точек вдоль заданного направления.
count: Входное количество точек. Тип int.
start: Начальная точка. Тип Point3d.
step: Шаг точек. Тип Vector3d.
Returns: Возвращает true в случае успешного завершения.  В противном случае возвращает false.

Teigha.GraphicsInterface.Geometry.Shell(Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection,Teigha.GraphicsInterface.EdgeData,Teigha.GraphicsInterface.FaceData,Teigha.GraphicsInterface.VertexData,System.Boolean)
Метод создает примитив оболочки и вводит его в контекст векторизации.
Метод предназначен для создания и отображения примитива оболочки, характеристики которой определяются входными параметрами метода.
Оболочка представляет собой набор граней, возможно с отверстиями, который соответствует многогранной сети.
По умолчанию эта сеть принимает текущий цвет. Цветом, типом линий и другими ее свойствами можно управлять, передавая соответствующие данные через аргументы edgeData, faceData и vertexData.
В аргументе edgeData передается объект EdgeData, который содержит массивы цветов, слоев, видимости, типов линий и настройки маркера выделения ребер. Каждый из массивов должен либо иметь значение NULL, либо включать количество элементов, равное количеству ребер.
В аргументе faceData передается объект FaceData, который содержит массивы цветов, слоев, видимости, типов линий и настройки маркера выделения граней.  Каждый из массивов должен либо иметь значение NULL, либо включать количество элементов, равное количеству граней.
В аргументе vertexData передается объект VertexData, который содержит флаг, указывающий ориентацию вершин на гранях, и указатель на массив нормалей в вершинах.  Массив нормалей в вершинах должен либо иметь значение NULL, либо включать количество элементов, равное количеству вершин.
Следует отметить, что данный метод не изменяет и не удаляет массив параметров или объекты.  Ответственность за используемую память лежит на вызывающей стороне.
Геометрия оболочки основана на наборе вершин, которые используются для создания граней (и отверстий в гранях).  Как минимум, необходимо указать список вершин и список того, как грани создаются с использованием вершин.  Грани могут иметь общие вершины с другими гранями.
Преимущество оболочки перед сетью состоит в том, что сеть не может иметь отверстий, непересекающихся областей и n-сторонних граней.  В оболочке всё это допустимо.
Данные о ребрах, гранях и вершинах являются необязательными параметрами, но если имеются данные по граням, следует передать также и данные по ребрам.  Если предоствляются данные по вершинам, следует передать в метод также и данные по ребрам и граням.  Используйте NULL для неиспользуемых параметров, если они требуются.
Грани в списке граней определяют как сами грани, так и и любые возможные отверстия в гранях.  Каждая грань в списке представлена последовательностью чисел.  Первое число определяет количество вершин грани, а следующие числа должны быть индексами вершин, составляющих грань.  Если грань представляет собой отверстие, то количество ее вершин должно быть введено как отрицательное.  Любые отверстия на грани должны строго соответствовать определению содержащей их грани.  Отверстие должно быть копланарным и полностью находиться внутри грани (не касаясь края), иначе результат будет непредсказуемым.
Ребро определяется обходом грани в порядке, используемом в списке граней. Например, если список граней содержит значения 3, 0, 1, 2, это будет определять грань, имеющую 3 вершины: вершину 0, вершину 1 и вершину 2., и которая имеет ребра от вершины 0 до 1, от вершины 1 до 2. и от вершины 2 до 0.
В списке ребер конкретной оболочки ребра перечислены последовательно от грани (или отверстия) к грани (или отверстию) в том порядке, который установлен в списке граней.
Порядок данных по граням у оболочки совпадает с порядком в списке граней, но не учитывает возможные отверстия.
Предупреждение. Вы потеряете все данные о ребрах, гранях или вершинах, которые вы могли применить к оболочке, если грань оболочки имеет 5 или более ребер или имеет какие-либо отверстия. Когда оболочка подготавливается к отображению, она подвергается триангуляции, которая выполняется медленно.
points: Входная коллекция вершин. Тип Point3dCollection.
faces: Входная целочисленная коллекция, описывающая грани оболочки. Тип IntegerCollection.
edgeData: Входной существующий объект EdgeData с дополнительной информацией о ребрах.
faceData: Входной существующий объект FaceData с дополнительной информацией о гранях.
vertexData: Входной существующий объект VertexData с дополнительной информацией о вершинах.
bAutoGenerateNormals: Входной флаг, который определяет, должна ли система отображения автоматически генерировать нормали для вершин и граней, если они не передаются через аргументы vertexData и faceData. Тип bool.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.
Этот метод также генерирует соответствующее исключение в случае ошибки.

Teigha.GraphicsInterface.Geometry.Text(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,String,System.Boolean,Teigha.GraphicsInterface.TextStyle)
Метод предназначен для отображения указанного текста в заданной ориентации и в заданном стиле.
Метод предназначен для отображения указанного текста в заданной ориентации и в заданном стиле.
Метод использует объект TextStyle для определения шрифта, размера символов и т.д., которые будут использоваться для текста.
Аргументы position, normal и direction определяют своего рода локальную систему координат текста в мировой системе координат, где position — это начало координат, direction — ось X, а normal — ось Z.
В message используется копия текстовой строки, поэтому за выделение памяти для передаваемой в метод строки отвечает вызывающее приложение.
Значение длины -1 означает, что строка message является нуль-терминированной. Значение больше 0 указывает длину сообщения в байтах.
Аргумент raw со значением true указывает, что не следует интерпретировать escape-коды {%%U, %%d, %%P и %%nnn}.
position: Точка вставки текста. Тип Point3d.
normal: Вектор нормали плоскости текста. Тип Vector3d.
direction: Направление текста. Тип Vector3d.
message: Отображаемый текст. Тип String.
raw: Флаг, определяющий, следует ли интерпретировать escape-коды. Тип bool.
textStyle: Существующий текстовый стиль, который следует применить при отображении текста. Тип TextStyle.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Text(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,String)
Метод предназначен для отображения указанного текста в заданной ориентации и с заданными высотой, шириной и углом наклона символов.
Метод предназначен для отображения указанного текста в заданной ориентации и с заданными высотой, шириной и углом наклона символов.
При создании примитива текстовой графики метод использует текущий текстовый стиль TextStyle.  При первом вызове worldDraw() для объекта TextStyle устанавливается текстовый стиль STANDARD, встроенный в платформу (а не стиль STANDARD в чертеже).
Аргументы position, normal и direction определяют своего рода локальную систему координат текста в мировой системе координат, где position — это начало координат, direction — ось X, а normal — ось Z.
Угол наклона определяет наклон к вертикали каждого символа примерно так, как это принято в тексте курсивом.
В message используется копия текстовой строки, поэтому за выделение памяти для передаваемой в метод строки отвечает вызывающее приложение.
Предупреждение. Векторы direction и normal должны быть взаимно перпендикулярными, иначе результаты будут непредсказуемыми.
position: Точка вставки текста. Тип Point3d.
normal: Вектор нормали плоскости текста. Тип Vector3d.
direction: Направление текста. Тип Vector3d.
height: Высота текста. Тип double.
width: Ширина текста. Тип double.
oblique: Угол наклона текста. Тип double.
message: Отображаемый текст. Тип String.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.WorldLine(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает линию, проходящую между двумя точками, заданными в мировой системе координат.
Метод отображает линию, проходящую между двумя указанными точками startPoint и endPoint. Точки задаются в мировой системе координат.
startPoint: Начальная точка линии. Тип Point3d.
endPoint: Конечная точка линии. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Xline(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает конструкционную линию xline, проходящую через две заданных точки.
Метод отображает конструкционную линию xline, проходящую через две заданных точки.
point1: Первая точка, через которую проходит линия. Тип Point3d.
point2: Вторая точка, через которую проходит линия. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.ModelToWorldTransform
Свойство позволяет получить матрицу геометрического преобразования из системы координат модели в мировую систему координат.
Свойство позволяет получить матрицу геометрического преобразования из системы координат модели непосредственно в мировую систему координат.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.WorldToModelTransform
Свойство позволяет получить матрицу геометрического преобразования из мировой системы координат в систему координат модели.
Свойство позволяет получить матрицу геометрического преобразования из мировой системы координат в систему координат модели.
Это обратное преобразование тому, которое возвращает свойство ModelToWorldTransform.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.