Teigha.DatabaseServices.Polyline3d.SplineFit
Метод выполняет аппроксимацию полилинии сплайном. Эта операция эквивалентна команде PEDIT с опцией "Spline fit".
Метод выполняет аппроксимацию полилинии сплайном.
Сначала метод удаляет все существующие вершины сплайна или аппроксимирующей кривой, все оставшиеся вершины преобразует в контрольные вершины сплайна и генерирует новый набор вершин аппроксимирующего сплайна.
Результирующая полилиния аппроксимируется сплайном с использованием нового набора вершин.
Эта операция эквивалентна команде PEDIT с опцией "Spline fit".