Teigha.DatabaseServices.XrefOperation.XrefUnloadOperation
Значение: 7.
Выгружает заданный по имени блок внешней ссылки.
Предполагается, что в базе данных, указанной в HostDb (или в текущем документе, если HostDb имеет значение null), существует валидный блок внешней ссылки с заданным именем.