HostMgd.EditorInput.CursorType
Перечисление, определяющее различные типы курсора. Этот .NET
класс соответствует перечислению NcEdJig::CursorType nanoCAD API.
Члены                       Описание
--------------------------  -----------------------------------
Crosshair = 0               Тип курсора С перекрестием
CrosshairNoRotate           Тип курсора С перекрестием без
= 6                         возможности поворота
EntitySelect =              Тип курсора для выбранного объекта
8
EntitySelectNoPerspective   Тип курсора для выбранного объекта
= 10                        без отображения перспективы
Invisible = 7               Невидимый курсор
NoSpecialCursor             Обычный вид курсора
= -1
Parallelogram               Курсор в виде параллелограма
= 9
PickfirstOrGrips            Курсор в виде указателя или ручки
= 11
RectangularCursor           Курсор в виде прямоугольника
= 1
RotatedCrosshair            Курсор в виде повернутого
= 5                         перекрестия
RubberBand = 2              Курсор при рисовании резиновой
линии
TargetBox = 4               Курсор при указании на цель