Teigha.Geometry.CompositeParameter
Структура CompositeParameter представляет данные, которые определяют параметр точки на составной кривой.
Структура CompositeParameter представляет данные, которые определяют параметр точки на составной кривой.
Эти данные включают значения параметра точки и индекса подкривой, которой принадлежит точка.

Teigha.Geometry.CompositeParameter.#ctor(System.Int32,System.Double)
Конструктор структуры CompositeParameter.
Создает экземпляр структуры с переданным индексом подкривой и значением локального параметра.
Конструктор структуры CompositeParameter.
Создает экземпляр структуры с переданным индексом подкривой и значением локального параметра.
segmentIndex: Индекс подкривой.  Тип int.
localParameter: Значение локального параметра точки на указанной подкривой.  Тип double.

Teigha.Geometry.CompositeParameter.Equals(Object)
Метод предназначен для проверки на равенство данного и переданного объектов.
Метод предназначен для проверки на равенство данного и переданного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, с которым проверяется равенство.  Тип Object.
Returns: Возвращает true, если оба сравниваемых объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Индексы подкривых совпадают.
2. Значения локальных параметров равны.
В противном случае возвращает false.

Teigha.Geometry.CompositeParameter.IsEqualTo(Teigha.Geometry.CompositeParameter)
Метод предназначен для проверки данного объекта на равенство переданному объекту CompositeParameter.
Метод предназначен для проверки данного объекта на равенство переданному объекту CompositeParameter.
a: Входной объект, с которым проверяется равенство. Тип CompositeParameter.
Returns: Возвращает true, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Индексы подкривых совпадают.
2. Значения локальных параметров равны.
В противном случае возвращает false.

Teigha.Geometry.CompositeParameter.IsEqualTo(Teigha.Geometry.CompositeParameter,Teigha.Geometry.Tolerance)
Метод предназначен для проверки данного объекта на равенство переданному объекту CompositeParameter с использованием заданной точности.
Метод предназначен для проверки данного объекта на равенство переданному объекту CompositeParameter с использованием заданной точности.
a: Входной объект, с которым проверяется равенство. Тип CompositeParameter.
tolerance: Заданная точность для сравнения параметров.      Тип Tolerance.
Returns: Возвращает true, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Индексы подкривых совпадают.
2. Значения локальных параметров совпадают в пределах заданной точности tolerance.
В противном случае возвращает false.

Teigha.Geometry.CompositeParameter.!=(Teigha.Geometry.CompositeParameter,Teigha.Geometry.CompositeParameter)
Оператор неравенства структуры CompositeParameter.
Оператор неравенства структуры CompositeParameter.
a: Левый  операнд. Тип CompositeParameter.
b: Правый операнд. Тип CompositeParameter.
Returns: Возвращает true, если если не выполняется хотя бы одно из следующих условий:
1. Индексы подкривых совпадают.
2. Значения локальных параметров равны.
В противном случае возвращает false.

Teigha.Geometry.CompositeParameter.==(Teigha.Geometry.CompositeParameter,Teigha.Geometry.CompositeParameter)
Оператор равенства структуры CompositeParameter.
Оператор равенства структуры CompositeParameter.
a: Левый  операнд. Тип CompositeParameter.
b: Правый операнд. Тип CompositeParameter.
Returns: Возвращает true, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Индексы подкривых совпадают.
2. Значения локальных параметров равны.
В противном случае возвращает false.

Teigha.Geometry.CompositeParameter.LocalParameter
Свойство LocalParameter представляет значение локального параметра у данного объекта.
Свойство LocalParameter представляет значение локального параметра у данного объекта.
Returns: Возвращает значение локального параметра.
Тип double.

Teigha.Geometry.CompositeParameter.SegmentIndex
Свойство SegmentIndex представляет индекс подкривой у данного объекта.
Свойство SegmentIndex представляет индекс подкривой у данного объекта.
Returns: Возвращает индекс подкривой.
Тип int.