Teigha.GraphicsInterface.ShadowMode.Sorted
Значение: 1. Режим отсортированных теней.
Использование предварительной сортировки объектов по глубине улучшает точность представления теней.
Обеспечивает промежуточную производительность между режимами Simple и Segments при умеренной точности.