Teigha.DatabaseServices.LayerTableRecord.RemoveAllOverrides
Метод предназначен для удаления всех переопределений слоя во
всех видовых экранах документа.
В видовых экранах пространства листа можно переопределять
цвет, тип линии, вес линии, прозрачность слоя. После
переопределения параметров слоя в видовом экране будут
применены новые параметры. В каждом видовом экране может быть
своё переопределение параметров слоя.
С помощью метода можно удалить все переопределения параметров
слоя во всех видовых экранах документа.