Teigha.DatabaseServices.SectionGeneration
Перечисление SectionGeneration определяет флаги, используемые для настройки процесса генерации сечения.
Перечисление SectionGeneration определяет флаги генерации сечения, используемые для настройки этого процесса.
Существует две группы флагов: флаги для источников создаваемого сечения и флаги целевых объектов.
Опции генерации формируются как логическое объединение (OR) заданных значений в каждой из групп.
Флаги SourceAllObjects и SourceSelectedObjects используются для указания источника.
Флаги DestinationNewBlock, DestinationReplaceBlock и DestinationFile определяют группу целевых объектов для генерируемой  геометрии.