Teigha.Geometry.OffsetCurve3d
Класс OffsetCurve3d представляет трехмерную кривую, получаемую операцией смещения исходной (базовой) кривой.
Класс OffsetCurve3d представляет трехмерную кривую, получаемую операцией смещения исходной (базовой) кривой.
Объект этого класса хранит указатель на базовую кривую, соответственно, любое изменение базовой кривой вызывает изменение кривой смещения.
Поскольку эта кривая является точным смещением, она может быть самопересекающейся, даже если базовая кривая самопересечений не имеет.
Кривая смещения без самопересечений создается методом Curve2d.GetTrimmedOffset().
Положительное направление смещения в каждой точке базовой кривой перпендикулярно вектору касательной в этой точке.
Таким образом, если касательный вектор в точке базовой кривой равен (x,y), то положительным направлением смещения будет (-y,x). Базовая кривая может быть смещена в любом из двух направлений путем указания положительного или отрицательного значения величины смещения. Допустимо и нулевое смещение, в этом случае смещенная кривая является просто копией базовой кривой.
Notes
Методы, которые изменяют кривую смещения, такие как TransformBy(), GetReverseParameterCurve() и SetInterval(), базовую кривую не изменяют.
Если вызвать метод GetReverseParameterCurve()  для кривой смещения, то направление результирующей кривой смещения будет противоположным направлению базовой кривой.
Если для кривой смещения вызвать метод SetInterval(), то кривая смещения будет представлять смещение указанного параметрического интервала базовой кривой.  Это позволяет создавать семейство кривых смещения, каждая из которых строится на своем параметрическом интервале одной и той же базовой кривой.  Например, если из одной базовой кривой с параметрическим интервалом [0, 1] построить три изначально совпадающие кривые смещения, то затем для каждой из них можно вызвать метод SetInterval(), чтобы изменить их интервалы "происхождения" на что-то вроде [0.1, 0.3], [0.5, 0.6] и [0.7, 0.9].  В дальнейшем любую из этих кривых смещения можно преобразовать или обратить, не затрагивая другие кривые смещения или саму базовую кривую.  Если величину смещения сделать равной 0, то все эти кривые смещения будут геометрически совпадать с соответствующими участками базовой кривой.
В случае ненулевой величины смещения класс гладкости кривой смещения будет на единицу меньше класса гладкости базовой кривой.  Так, если базовая кривая имеет непрерывные первую и вторую производные, но не третью (класс гладкости C2), то кривая смещения будет иметь  непрерывной только первую производную (класс гладкости C1).  Если базовая кривая сама по себе непрерывна, но имеет разрывы в первой производной (класс C0), то кривая смещения может вообще не быть непрерывной.  Таким образом, для гарантии, что кривая смещения будет представлять собой допустимую кривую, базовая кривая должна быть непрерывной по крайней мере в первой производной (класс C1).

Teigha.Geometry.OffsetCurve3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,System.Double)
Конструктор класса OffsetCurve3d.
Создает кривую, которая является точным смещением на заданное расстояние указанной базовой кривой, располагающейся в указанной плоскости.
Конструктор класса OffsetCurve3d.
Создает кривую, которая является точным смещением указанной базовой кривой.
Направление смещения определяется знаком параметра offsetDistance и направлением planeNormal.
Базовая кривая должна быть плоской, а вектор planeNormal должен быть перпендикулярен плоскости базовой кривой.
Из этого правила есть два исключения:
* Если расстояние смещения равно 0, то planeNormal может быть любым вектором, включая нулевой вектор (в случае нулевого смещения он не используется).
* Если базовая кривая линейна, то вектор planeNormal должен быть перпендикулярен линии кривой.
baseCurve: Плоская базовая кривая. Тип Curve3d.
planeNormal: Нормаль плоскости, в которой лежит базовая кривая. Тип Vector3d.
offsetDistance: Величина смещения(со знаком).  Тип double.

Teigha.Geometry.OffsetCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип OffsetCurve3d.

Teigha.Geometry.OffsetCurve3d.Curve
Свойство Curve представляет базовую кривую данной кривой смещения.
Свойство Curve представляет базовую кривую данной кривой смещения.
Returns: Возвращает базовую кривую для данного объекта.
Тип Curve3d.

Teigha.Geometry.OffsetCurve3d.Normal
Свойство Normal представляет направление нормали плоскости базовой кривой.
Свойство Normal представляет направление нормали плоскости базовой кривой.
Returns: Возвращает нормаль плоскости базовой кривой.
Тип Vector3d.

Teigha.Geometry.OffsetCurve3d.OffsetDistance
Свойство OffsetDistance представляет расстояние со знаком, которое определяет текущее смещение данной кривой относительно её базовой кривой.
Свойство OffsetDistance представляет расстояние со знаком, которое определяет текущее смещение данной кривой относительно её базовой кривой.
Returns: Возвращает величину смещения со знаком.
Тип double.

Teigha.Geometry.OffsetCurve3d.ParameterDirection
Свойство ParameterDirection позволяет определить направление изменения параметра у данной кривой относительно направления изменения параметра у базовой кривой.
Свойство ParameterDirection позволяет определить направление изменения параметра у данной кривой относительно направления изменения параметра у базовой кривой.
Returns: Возвращает true, если направления изменения параметра у данной кривой и ее базовой кривой совпадают.
В противном случае возвращает false.

Teigha.Geometry.OffsetCurve3d.Transformation
Свойство Transformation представляет матрицу геометрического преобразования, которое было применено к этой кривой путем вызова метода TransformBy().
Свойство Transformation представляет матрицу геометрического преобразования, которое было применено к этой кривой путем вызова метода TransformBy().
Notes
Если метод TransformBy() никогда не вызывался для этой кривой, возвращаемая матрица будет единичной.
Если метод TransformBy() вызывался более одного раза, возвращаемая матрица будет конкатенацией матриц всех примененных  преобразований.
Returns: Возвращает матрицу геометрического преобразования, которое было применено к данной кривой.
Тип Matrix3d.