HostMgd.ApplicationServices.DocumentLockMode.Write
Значение: 4. Режим блокировки по умолчанию.
Блокировка на запись позволяет контексту выполнения проверять и изменять содержимое данного документа и является разделяемой (shared Write lock).
Несколько контекстов выполнения могут одновременно удерживать разделяемую блокировку записи.
Например, команда может вносить изменения в документ, но когда её выполнение приостановлено, другие команды могут вносить изменения в документ.
Блокировка Write может сосуществовать с блокировками Read, установленными другими контекстами выполнения, а также взаимно исключает другие блокировки Read и ExclusiveWrite.