Teigha.DatabaseServices.MText
Данный класс представляет объекты типа MText в базе данных nanoCAD.
Данный класс представляет объекты типа MText в базе данных nanoCAD.
Объект MTEXT описывает многострочный текстовый объект, который поддерживает автоматический перенос слов в пределах заданной ширины строки.

Teigha.DatabaseServices.MText.#ctor
Конструктор по умолчанию класса MText.
Конструктор по умолчанию класса MText.

Teigha.DatabaseServices.MText.ExplodeFragments(Teigha.DatabaseServices.MTextFragmentCallback)
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
В контексте данного метода под фрагментом понимается часть текста в пределах одной строки до переноса по словам, имеющего определенный набор характеристик (т.е. шрифт, цвет, высота, ширина и т.п.).
Таким образом, каждый перенос слов и всякое изменение характеристик текста начинают новый фрагмент.
Функция обработки получает текстовый фрагмент в виде объекта MTextFragment, который представляет всю информацию о фрагменте. Каждый фрагмент обрабатывается один раз. Используется текущий объект WorldDraw.  Функция обработки должна возвращать 1 для продолжения операции или 0 для завершения работы.
enumerator: Функция обработки текстовых фрагментов. Тип MTextFragmentCallback.

Teigha.DatabaseServices.MText.ExplodeFragments(Teigha.DatabaseServices.MTextFragmentCallback,Object)
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции. Дополнительно метод принимает пользовательские данные, которые позволяют учесть специфику приложения при обработке фрагментов.
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
В контексте данного метода под фрагментом понимается часть текста в пределах одной строки до переноса по словам, имеющего определенный набор характеристик (т.е. шрифт, цвет, высота, ширина и т.п.).
Таким образом, каждый перенос слов и всякое изменение характеристик текста начинают новый фрагмент.
Функция обработки получает текстовый фрагмент в виде объекта MTextFragment, который представляет всю информацию о фрагменте. Каждый фрагмент обрабатывается один раз. Используется текущий объект WorldDraw.  Функция обработки должна возвращать 1 для продолжения операции или 0 для завершения работы.
Аргумент userData предоставляет возможность передать в функцию обработки некоторые специфичные для приложения данные. Пользовательские данные могут быть любыми, они передаются только перечислителю функции обработки.
enumerator: Функция обработки текстовых фрагментов. Тип MTextFragmentCallback.
userData: Произвольные пользовательские данные. Тип Object.

Teigha.DatabaseServices.MText.ExplodeFragments(Teigha.DatabaseServices.MTextFragmentCallback,Object,GraphicsInterface.WorldDraw)
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции. Дополнительно метод принимает пользовательские данные, которые позволяют учесть специфику приложения при обработке фрагментов, а также контекст отрисовки объектов.
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
В контексте данного метода под фрагментом понимается часть текста в пределах одной строки до переноса по словам, имеющего определенный набор характеристик (т.е. шрифт, цвет, высота, ширина и т.п.).
Таким образом, каждый перенос слов и всякое изменение характеристик текста начинают новый фрагмент.
Функция обработки получает текстовый фрагмент в виде объекта MTextFragment, который представляет всю информацию о фрагменте. Каждый фрагмент обрабатывается один раз. Функция обработки должна возвращать 1 для продолжения операции или 0 для завершения работы. Используется контекст отрисовки WorldDraw из аргумента context.
Аргумент userData предоставляет возможность передать в функцию обработки некоторые специфичные для приложения данные. Пользовательские данные могут быть любыми, они передаются только перечислителю функции обработки.
enumerator: Функция обработки текстовых фрагментов. Тип MTextFragmentCallback.
userData: Произвольные пользовательские данные. Тип Object.
context: Контекст отрисовки объектов. Тип GraphicsInterface.WorldDraw.

Teigha.DatabaseServices.MText.GetColumnHeight(System.Int32)
Метод предоставляет высоту указанного столбца данного объекта.
Метод предоставляет высоту указанного столбца (колонки текста) данного объекта.
index: Индекс столбца. Тип int.
Returns: Возвращает высоту столбца. Тип double.

Teigha.DatabaseServices.MText.SetAttachmentMovingLocation(Teigha.DatabaseServices.AttachmentPoint)
Метод позволяет задать тип точки присоединения данного объекта MText.
Метод позволяет задать тип точки присоединения данного объекта MText.
Допускаются следующие типы точек присоединения:
Наименование        Значение
---------------		------------
TopLeft             1
TopCenter           2
TopRight            3
MiddleLeft          4
MiddleCenter        5
MiddleRight         6
BottomLeft          7
BottomCenter        8
BottomRight         9
value: Тип точки присоединения текста. Перечисление AttachmentPoint.

Teigha.DatabaseServices.MText.SetColumnHeight(System.Int32,System.Double)
Метод позволяет задать высоту столбца многострочного текста MText.
Метод позволяет задать высоту столбца (колонки) многострочного текста MText.
Этот метод генерирует исключение eInvalidInput, если указанная высота столбца окажется неположительной.
index: Индекс столбца. Тип int.
height: Новая высота указанного столбца. Тип double.

Teigha.DatabaseServices.MText.SetContentsRtf(String)
Метод позволяет сформировать многострочный текст объекта MText на основе текстовой строки в формате RTF.
Метод позволяет сформировать многострочный текст объекта MText на основе текстовой строки в формате RTF.
* Коды RTF преобразуются в коды MText.
* Шрифты, цвета, табуляция и отступы сохраняются.
* Маркеры и нумерованные списки реализуются с использованием предусмотренных настроек табуляции и отступов.
value: Новый текст в формате RTF. Тип String.
Returns: Возвращает длину текстовой строки, полученной в результате преобразования из формата RTF. Тип int.

Teigha.DatabaseServices.MText.SetDynamicColumns(System.Double,System.Double,System.Boolean)
Метод задает столбцу (колонке текста) тип DynamicColumns с заданными шириной, просветом между столбцами и значением флага автоподбора высоты столбца.
Метод задает столбцу (колонке текста) тип DynamicColumns с заданными шириной, просветом между столбцами и значением флага автоподбора высоты столбца.
width: Ширина столбца. Тип double.
gutter: Расстояние между столбцами текста (column gutter). Тип double.
auto_height: Флаг автоподбора высоты столбцов.  Тип bool. Значение true включает режим автоматического подбора высоты столбца.

Teigha.DatabaseServices.MText.SetStaticColumns(System.Double,System.Double,System.Int32)
Метод задает столбцу (колонке текста) тип StaticColumns с заданными шириной, просветом между столбцами и количеством столбцов.
Метод задает столбцу (колонке текста) тип StaticColumns с заданными шириной, просветом между столбцами и количеством столбцов.
width: Ширина столбца. Тип double.
gutter: Расстояние между столбцами текста (column gutter). Тип double.
count: Количество столбцов (колонок) текста. Тип int.

Teigha.DatabaseServices.MText.ActualHeight
Свойство возвращает фактическую высоту данного объекта MText (зависит от содержимого).
Свойство возвращает фактическую высоту данного объекта MText (зависит от содержимого).
Returns: Возвращает фактическую высоту многострочного текста. Тип double.

Teigha.DatabaseServices.MText.ActualWidth
Свойство возвращает фактическую ширину габаритного бокса для данного объекта MText (зависит от содержимого).
Свойство возвращает фактическую ширину габаритного бокса для данного объекта MText (зависит от содержимого).
Returns: Возвращает фактическую ширину габаритного бокса данного объекта. Тип double.

Teigha.DatabaseServices.MText.AlignChange
Свойство представляет строку изменения выравнивания "\A".
Свойство представляет строку изменения выравнивания "\A".
Может использоваться вместо "\A", чтобы сделать код более понятным.
Returns: Возвращает строку изменения выравнивания. Тип String.

Teigha.DatabaseServices.MText.Ascent
Свойство возвращает высоту максимального верхнего выносного элемента для строчных букв первой строки этого объекта MText.
Свойство возвращает высоту максимального верхнего выносного элемента для строчных букв первой строки этого объекта MText.  Это часть строчной буквы, возвышающаяся над основной строкой, например, "b", "d", "k", "l", "h", "t".
Returns: Возвращает высоту максимального выносного элемента. Тип double.

Teigha.DatabaseServices.MText.Attachment
Свойство представляет тип точки присоединения этого объекта MText.
Свойство представляет тип точки присоединения этого объекта MText.
Returns: Возвращает тип точки присоединения. Перечисление AttachmentPoint.

Teigha.DatabaseServices.MText.BackgroundFill
Свойство позволяет включить или отключить фоновую заливку для данного объекта MText.
Свойство позволяет включить или отключить фоновую заливку для данного объекта MText.
Returns: Возвращает true, если фоновая заливка включена.
В противном случае возвращает false.

Teigha.DatabaseServices.MText.BackgroundFillColor
Свойство представляет  цвет фоновой заливки данного объекта MText.
Свойство представляет  цвет фоновой заливки данного объекта MText.
Returns: Возвращает цвет фоновой заливки. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MText.BackgroundScaleFactor
Свойство представляет масштабный коэффициент для фона данного объекта MText.
Свойство представляет масштабный коэффициент для фона данного объекта MText.
Returns: Возвращает масштабный коэффициент. Тип double.

Teigha.DatabaseServices.MText.BackgroundTransparency
Свойство представляет прозрачность фона данного объекта MText.
Свойство представляет прозрачность фона данного объекта MText.
Returns: Возвращает прозрачность фона. Тип Teigha.Colors.Transparency.

Teigha.DatabaseServices.MText.BlockBegin
Свойство представляет строку начала блока "{".
Свойство представляет строку начала блока "{".
Может использоваться вместо строковой константы "{", чтобы сделать код более понятным.
При использовании в строке, возвращаемой из MText.Contents, "{" указывает на начало блока.
Returns: Возвращает строку начала блока. Тип String.

Teigha.DatabaseServices.MText.BlockEnd
Свойство представляет строку окончания блока "}".
Свойство представляет строку окончания блока "}". Может использоваться вместо строковой константы "}", чтобы сделать код более понятным. При использовании в строке, возвращаемой из MText.Contents, "}" указывает на окончание блока.
Returns: Возвращает строку окончания блока. Тип String.

Teigha.DatabaseServices.MText.ColorChange
Свойство возвращает строку изменения цвета "\C".
Свойство возвращает строку изменения цвета "\C".
Может использоваться вместо строковой константы "\C", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, строка "\C" указывает на изменение цвета.
Returns: Возвращает строку изменения цвета.  Тип String.

Teigha.DatabaseServices.MText.ColumnAutoHeight
Свойство определяет, должны ли динамические столбцы использовать высоту MText или высоту, заданную пользователем для каждого столбца (каждой колонки текста).
Свойство определяет, должны ли динамические столбцы использовать высоту MText или высоту, заданную пользователем для каждого столбца (каждой колонки текста).
Применимо только к динамическим столбцам.
Returns: Возвращает true, если динамические столбцы настроены на автоматическое использование высоты объекта MText.  В противном случае возвращает false.

Teigha.DatabaseServices.MText.ColumnCount
Свойство представляет количество столбцов (текстовых колонок) у данного объекта MText.
Свойство представляет количество столбцов (текстовых колонок) у данного объекта MText.
Returns: Возвращает количество столбцов. Тип int.

Teigha.DatabaseServices.MText.ColumnFlowReversed
Свойство определяет, является ли поток столбцов данного объекта MText обратным.
Эта настройка влияет на способ добавления столбцов.
Свойство определяет, является ли поток столбцов данного объекта MText обратным.
Эта настройка влияет на способ добавления столбцов.
Returns: Возвращает true, если направление потока текстовых столбцов является обратным.
В противном случае возвращает false.

Teigha.DatabaseServices.MText.ColumnGutterWidth
Свойство представляет расстояние между столбцами текста (просвет между текстовыми колонками).
Свойство представляет расстояние между столбцами текста (просвет между текстовыми колонками).
Returns: Возвращает расстояние между столбцами. Тип double.

Teigha.DatabaseServices.MText.ColumnType
Свойство представляет тип текстовых колонок у данного объекта MText.
Свойство представляет тип текстовых колонок (динамические / статические) у данного объекта MText.
Returns: Возвращает текущий тип текстовых колонок. Перечисление DatabaseServices.ColumnType.

Teigha.DatabaseServices.MText.ColumnWidth
Свойство представляет ширину столбца, которая применяется к каждому столбцу данного объекта.
Свойство представляет ширину столбца, которая применяется к каждому столбцу данного объекта.
Returns: Возвращает ширину текстового столбца. Тип double.

Teigha.DatabaseServices.MText.Contents
Свойство представляет копию символьного содержимого данного объекта MText.
Коды форматирования, используемые для управления переносом, удаляются перед копированием строки.
Свойство представляет копию символьного содержимого данного объекта MText.
Коды форматирования, используемые для управления переносом, удаляются перед копированием строки.
Returns: Возвращает копию символьного содержимого данного объекта. Тип String.

Teigha.DatabaseServices.MText.Descent
Свойство возвращает высоту максимального нижнего выносного элемента букв последней строки этого объекта MText.
Свойство возвращает высоту максимального нижнего выносного элемента букв последней строки этого объекта MText. Это часть строчной буквы, расположенная ниже базовой линии строки текста, как например, у букв "ц", "g" и т.д.
Returns: Возвращает высоту максимального нижнего выносного элемента у букв последней строки.
Тип double.

Teigha.DatabaseServices.MText.Direction
Свойство представляет вектор (WCS) направления оси X этого объекта MText.
Свойство представляет вектор (WCS) направления оси X этого объекта MText.
Returns: Возвращает направления оси X этого объекта. Тип Vector3d.

Teigha.DatabaseServices.MText.FlowDirection
Свойство представляет направление потока данного многострочного текста.
Свойство представляет направление потока данного многострочного текста.
Это направление, в котором текстовая строка следует от начала к своему концу.
Returns: Возвращает направление потока текста.
Перечисление DatabaseServices.FlowDirection.

Teigha.DatabaseServices.MText.FontChange
Свойство возвращает строку изменения шрифта "\F".
Свойство возвращает строку изменения шрифта "\F".
Может использоваться вместо строковой константы "\F", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents,  "\F" означает смену шрифта.
Returns: Возвращает строку изменения шрифта. Тип String.

Teigha.DatabaseServices.MText.Height
Свойство представляет высоту ограничивающего бокса данного объекта MText.
Свойство представляет высоту ограничивающего бокса данного объекта MText, т.е. его габаритный размер по высоте.
Returns: Возвращает высоту ограничивающего бокса данного объекта. Тип double.

Teigha.DatabaseServices.MText.HeightChange
Свойство возвращает строку изменения высоты "\H".
Свойство возвращает строку изменения высоты "\H".
Может использоваться вместо строковой константы "\H", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents,  "\H" означает изменение высоты.
Returns: Возвращает строку изменения высоты. Тип String.

Teigha.DatabaseServices.MText.LineBreak
Свойство возвращает строку разрыва строки "\p".
Свойство возвращает строку разрыва строки "\p".
Может использоваться вместо строковой константы "\p", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\p" означает разрыв строки.
Returns: Возвращает строку, означающую разрыв строки. Тип String.

Teigha.DatabaseServices.MText.LineSpaceDistance
Свойство представляет межстрочный интервал в данном объекте.
Свойство представляет межстрочный интервал в данном объекте, т.е. расстояние между базовыми линиями соседних строк текста.
Returns: Возвращает межстрочный интервал. Тип double.

Teigha.DatabaseServices.MText.LineSpacingFactor
Свойство представляет коэффициент межстрочного интервала в диапазоне [0,25 .. 4,0].
Свойство представляет коэффициент межстрочного интервала в диапазоне [0,25 .. 4,0].
Returns: Возвращает коэффициент межстрочного интервала. Тип double.

Teigha.DatabaseServices.MText.LineSpacingStyle
Свойство представляет стиль межстрочного интервала, который определяет применение этого интервала в зависимости от размера символов.
Свойство представляет стиль межстрочного интервала, который определяет применение этого интервала в зависимости от размера символов.
Returns: Возвращает стиль межстрочного интервала. Перечисление DatabaseServices.LineSpacingStyle.

Teigha.DatabaseServices.MText.location
Свойство представляет точку вставки данного объекта MText.
Свойство представляет точку вставки данного объекта MText.
Returns: Возвращает точку вставки данного объекта. Тип Point3d.

Teigha.DatabaseServices.MText.NonBreakSpace
Свойство возвращает строку неразрывного пробела "\~".
Свойство возвращает строку неразрывного пробела "\~".
Может использоваться вместо строковой константы "\~", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\~" означает неразрывный пробел.
Returns: Возвращает строку неразрывного пробела. Тип String.

Teigha.DatabaseServices.MText.Normal
Свойство представляет нормаль плоскости (WCS), в которой располагается данный объект MText.
Свойство представляет нормаль плоскости (WCS), в которой располагается данный объект MText.
Returns: Возвращает нормаль плоскости в мировой системе координат (WCS). Тип Vector3d.

Teigha.DatabaseServices.MText.ObliqueChange
Свойство возвращает строку изменения угла наклона текста "\Q".
Свойство возвращает строку изменения угла наклона текста "\Q".
Может использоваться вместо строковой константы "\Q", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\Q" означает изменения угла наклона текста.
Returns: Возвращает строку изменения угла наклона текста.
Тип String.

Teigha.DatabaseServices.MText.OverlineOff
Свойство возвращает строку перехода к незачёркнутому тексту "\o".
Свойство возвращает строку перехода к незачёркнутому тексту "\o".
Может использоваться вместо строковой константы "\o", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\o" означает переход к незачёркнутому тексту.
Returns: Возвращает строку перехода к незачёркнутому тексту. Тип String.

Teigha.DatabaseServices.MText.OverlineOn
Свойство возвращает строку перехода к зачёркнутому тексту "\O".
Свойство возвращает строку перехода к зачёркнутому тексту "\O".
Может использоваться вместо строковой константы "\O", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\O" означает переход к зачёркнутому тексту.
Returns: Возвращает строку перехода к зачёркнутому тексту. Тип String.

Teigha.DatabaseServices.MText.ParagraphBreak
Свойство возвращает строку перехода к новому абзацу "\P".
Свойство возвращает строку перехода к новому абзацу "\P".
Может использоваться вместо строковой константы "\P", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\P" означает переход к новому абзацу.
Returns: Возвращает строку перехода к новому абзацу. Тип String.

Teigha.DatabaseServices.MText.Rotation
Свойство представляет угол поворота данного объекта MText (в радианах).
Свойство представляет угол поворота данного объекта MText (в радианах).
Returns: Возвращает угол поворота текста. Тип double.

Teigha.DatabaseServices.MText.ShowBorders
Свойство управляет режимом отображения границ многострочного текста.
Свойство управляет режимом отображения границ многострочного текста.
Returns: Возвращает true, если отображение границ многострочного текста включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MText.StackStart
Свойство возвращает строку перехода к дробному тексту "\S".
Свойство возвращает строку перехода к дробному тексту "\S".
Может использоваться вместо строковой константы "\S", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\S" означает переход к дробному тексту.
Returns: Возвращает строку перехода к дробному тексту.
Тип String.

Teigha.DatabaseServices.MText.Text
Свойство представляет текстовое содержимое многострочного текста, очищенное от кодов форматирования.
Свойство представляет текстовое содержимое многострочного текста, очищенное от кодов форматирования.
Returns: Возвращает очищенный от кодов форматирования текст данного объекта. Тип String.

Teigha.DatabaseServices.MText.TextHeight
Свойство представляет номинальную высоту текста в данном объекте MText.
Свойство представляет номинальную высоту текста в данном объекте MText.
Returns: Возвращает номинальную высоту текста. Тип double.

Teigha.DatabaseServices.MText.TextStyle
Свойство представляет идентификатор стиля текста, используемого данным объектом MText.
Устарело. Рекомендуется использовать свойство TextStyleId.
Свойство представляет идентификатор стиля текста, используемого данным объектом MText.
Это свойство устарело. Рекомендуется использовать свойство TextStyleId.
Returns: Возвращает идентификатор стиля текста. Тип ObjectId.

Teigha.DatabaseServices.MText.TextStyleId
Свойство представляет идентификатор объекта стиля текста, используемого данным объектом MText.
Свойство представляет идентификатор объекта стиля текста, используемого данным объектом MText.
Returns: Возвращает идентификатор объекта текстового стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MText.TextStyleName
Свойство представляет имя текстового стиля, используемого данным объектом MText.
Свойство представляет имя текстового стиля, используемого данным объектом MText
Returns: Возвращает имя текстового стиля. Тип String.

Teigha.DatabaseServices.MText.TrackChange
Свойство возвращает строку изменения трекинга "\T", т.е. переход к другому межбуквенному расстоянию.
Свойство возвращает строку изменения трекинга "\T", т.е. переход к другому межбуквенному расстоянию.
Может использоваться вместо строковой константы "\T", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\T" означает изменение межбуквенного расстояния.
Returns: Возвращает строку изменения трекинга. Тип String.

Teigha.DatabaseServices.MText.UnderlineOff
Свойство возвращает строку отмены подчеркивания текста "\l".
Свойство возвращает строку отмены подчеркивания текста "\l".
Может использоваться вместо строковой константы "\l", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\l" означает отмену подчеркивания текста.
Returns: Возвращает строку отмены подчеркивания текста.
Тип String.

Teigha.DatabaseServices.MText.UnderlineOn
Свойство возвращает строку перехода к подчеркнутому тексту "\L".
Свойство возвращает строку перехода к подчеркнутому тексту "\L".
Может использоваться вместо строковой константы "\L", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\L" означает переход к подчеркнутому тексту.
Returns: Возвращает строку перехода к подчеркнутому тексту. Тип String.

Teigha.DatabaseServices.MText.UseBackgroundColor
Свойство определяет, используется ли цвет фона экрана в качестве цвета фона этого объекта MText.
Свойство определяет, используется ли цвет фона экрана в качестве цвета фона этого объекта MText.
Returns: Возвращает true, если цвет фона многострочного текста совпадает с цветом фона экрана.
В противном случае возвращает false.

Teigha.DatabaseServices.MText.Width
Свойство представляет ширину абзаца многострочного текста.
Свойство представляет ширину абзаца многострочного текста.
Если длина отдельного слова текста превышает ширину абзаца, то такое слово не переносится, а выходит за границы абзаца.
Returns: Возвращает ширину абзаца. Тип double.

Teigha.DatabaseServices.MText.WidthChange
Свойство возвращает строку перехода к другой ширине текста "\W".
Свойство возвращает строку перехода к другой ширине текста "\W".
Может использоваться вместо строковой константы "\W", чтобы сделать код более понятным.
При использовании в строке, возвращаемой свойством MText.Contents, "\W" означает переход к другой ширине текста.
Returns: Возвращает строку перехода к другой ширине текста. Тип String.