Teigha.Geometry.Point3d.ToArray
Метод создает массив, содержащий значения координат данной точки.
Метод позволяет получить массив из трех элементов, содержащий значения координат X, Y и Z данной точки.
Returns: Возвращает массив из трех элементов, содержащий значения координат X, Y и Z данной точки. Тип double[].