Teigha.Geometry.Curve2dCollection
Класс Curve2dCollection представляет коллекцию объектов Curve2d.
Класс Curve2dCollection представляет коллекцию объектов Curve2d.

Teigha.Geometry.Curve2dCollection.#ctor
Конструктор по умолчанию класса Curve2dCollection.
Конструктор по умолчанию класса Curve2dCollection.

Teigha.Geometry.Curve2dCollection.Add(Teigha.Geometry.Curve2d)
Метод добавляет в данную коллекцию новую кривую Curve2d.
Метод добавляет в данную коллекцию новую кривую Curve2d.
value: Входная кривая, которая добавляется в коллекцию.
Returns: Возвращает индекс добавленной кривой в данной коллекции.
Тип int.

Teigha.Geometry.Curve2dCollection.Contains(Teigha.Geometry.Curve2d)
Метод позволяет проверить, содержится ли в коллекции указанная кривая.
Метод позволяет проверить, содержится ли в коллекции указанная кривая.
value: Проверяемая кривая.
Returns: Возвращает true, если кривая value содержится в коллекции.
В противном случае возвращает false.

Teigha.Geometry.Curve2dCollection.CopyTo(array,System.Int32)
Метод копирует элементы этой коллекции в предоставленный массив, начиная с указанного индекса.
Метод копирует элементы этой коллекции в массив array, начиная с индекса index.
array: Массив, в который следует копировать элементы коллекции.  Тип Curve2d[].
index: Индекс в массиве, начиная с которого в массив копируются элементы коллекции.  Тип int.

Teigha.Geometry.Curve2dCollection.IndexOf(Teigha.Geometry.Curve2d)
Метод позволяет найти индекс указанной кривой в данной коллекции.
Метод позволяет найти индекс указанной кривой value в данной коллекции.
value: Искомая кривая.  Тип Curve2d.
Returns: Возвращает индекс элемента value в коллекции.
Тип int.

Teigha.Geometry.Curve2dCollection.Insert(System.Int32,Teigha.Geometry.Curve2d)
Метод вставляет в коллекцию указанный элемент в позицию с заданным индексом.
Метод вставляет в коллекцию указанный элемент value в позицию с заданным индексом index.
index: Позиция вставляемого элемента в коллекции.  Тип int.
value: Вставляемый в коллекцию элемент. Тип Curve2d.

Teigha.Geometry.Curve2dCollection.Remove(Teigha.Geometry.Curve2d)
Метод предназначен для удаления указанного элемента из коллекции, если он там существует.
Метод предназначен для удаления указанного элемента из коллекции, если он там существует.
value: Удаляемый элемент.  Тип Curve2d.

Teigha.Geometry.Curve2dCollection.RemoveAt(System.Int32)
Метод предназначен для удаления из коллекции элемента в позиции с указанным индексом, если он существует.
Метод предназначен для удаления из коллекции элемента в позиции с указанным индексом index, если он существует.
index: Индекс удаляемого элемента.  Тип int.

Teigha.Geometry.Curve2dCollection.Count
Свойство Count представляет количество объектов в данной коллекции.
Свойство Count представляет количество объектов в данной коллекции.
Returns: Возвращает текущее количество объектов в коллекции.
Тип int.

Teigha.Geometry.Curve2dCollection.IsFixedSize
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Свойство IsFixedSize позволяет проверить, является ли размер данной коллекции фиксированным.
Returns: Возвращает true, если размер коллекции является фиксированным.
В противном случае возвращает false.

Teigha.Geometry.Curve2dCollection.IsReadOnly
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Свойство IsReadOnly позволяет проверить, доступна ли данная коллекция только на чтение.
Returns: Возвращает true, если данная коллекция доступна только на чтение.
В противном случае возвращает false.

Teigha.Geometry.Curve2dCollection.Item
Свойство Item представляет элемент коллекции с указанным индексом.
Свойство Item представляет элемент коллекции с указанным индексом.
index: Входной индекс элемента коллекции.  Тип int.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип Curve2d.