Teigha.GraphicsInterface.Method
Перечисление Method определяет метод назначения цвета (наследование или переопределение), используемый цветами материалов.
Перечисление Method определяет метод назначения цвета (наследование или переопределение), используемый цветами материалов.