Teigha.GraphicsInterface.EdgeStyleApply.ApplyToDefault
Значение: 0.
Стиль ребер применяется только к элементам геометрии, для которых не был задан собственный стиль и, соответственно, предполагается использование стиля по умолчанию.