Teigha.GraphicsInterface.ScaleBehavior.Viewport
Значение: 1.
Преобразование масштаба выполняется в нормализованной 2D-системе координат видового экрана.
Координаты X и Y определены на интервале [0.0 .. 1.0].
Точки в левом нижнем и в правом верхнем углах видового экрана имеют координаты (0.0, 0.0) и (1.0, 1.0), соответственно.