HostMgd.EditorInput.PromptOptions.Keywords
Коллекция ключевых слов запроса.
Возвращает коллекцию ключевых слов для запроса, которая отображается в приглашающем сообщении.
Returns: Возвращает коллекцию ключевых слов.