HostMgd.EditorInput.PromptDragOptions
Этот класс позволяет определить пользовательские настройки,
отображаемые в командной строке перед операцией
перетаскивания.

HostMgd.EditorInput.PromptDragOptions.AllowArbitraryInput
Разрешить произвольный ввод.

HostMgd.EditorInput.PromptDragOptions.AllowNone
Устанавливает или возвращает признака разрешения ввода только
клавиши Enter после приглашения.

HostMgd.EditorInput.PromptDragOptions.Callback
Возвращает или устанавливает делегат события.

HostMgd.EditorInput.PromptDragOptions.Cursor
Возвращает тип курсора при перетаскивании.

HostMgd.EditorInput.PromptDragOptions.#ctor(Teigha.Editor.SelectionSet,String,HostMgd.EditorInput.DragCallback)
Конструктор.
selection: Выбранное множество
message: Приглашающее сообщение
callback: Событие перетаскивания

HostMgd.EditorInput.PromptDragOptions.#ctor(Teigha.Editor.SelectionSet,String,String,HostMgd.EditorInput.DragCallback)
Конструктор.
selection: Выбранное множество
messageAndKeywords: Приглашающее сообщение с ключевыми
globalKeywords: Список ключевых слов (их глобальные
callback: Событие перетаскивания

HostMgd.EditorInput.PromptDragOptions.Selection
Возвращает выбранные пользователем объекты.