Teigha.GraphicsInterface.EdgeStyle.Clone
Метод клонирует текущий стиль отображения ребер.
Метод предназначен для клонирования текущего стиля отображения ребер.
Returns: Возвращает клонированный объект. Тип EdgeStyle.