Teigha.DatabaseServices.ScaleEstimationMethod.ScaleEstMethodUnity
Значение: 1. Данный алгоритм не делает ничего в предположении, что с точки зрения искажения масштаба сетки проектные координаты совпадают с координатами сетки.