Teigha.DatabaseServices.TextHorizontalMode.TextMid
Значение: 4. Текст центрируется по горизонтали относительно заданной точки вставки. Часто используется в сочетании с настройками вертикального выравнивания для точного позиционирования текста в пределах фигур или объектов
(см. перечисление Teigha.DatabaseServices.TextVerticalMode).