Teigha.DatabaseServices.TableEnumeratorOption.SkipMerged
Значение: 64. Пропускать ячейки, скрытые вследствие слияния. При этом будут пропущены все ячейки в диапазоне слияния, кроме верхней левой ячейки.