Teigha.DatabaseServices.ObjectTypeAttribute
Этот класс сообщает тип объекта.
Этот класс сообщает тип объекта.

Teigha.DatabaseServices.ObjectTypeAttribute.#ctor(Type)
Конструктор класса ObjectTypeAttribute.
Конструктор класса ObjectTypeAttribute.
type: Входной тип объекта.  Тип Type.

Teigha.DatabaseServices.ObjectTypeAttribute.ObjectType
Свойство представляет тип объекта.
Свойство представляет тип объекта.
Returns: Возвращает тип объекта.  Тип Type.