HostMgd.PlottingServices.PreviewEndPlotStatus
Данное перечисление определяет состояния завершения предварительного просмотра листа перед выводом на печать.
Перечисление PreviewEndPlotStatus представляет состояния завершения предварительного просмотра листа перед выводом на печать.