HostMgd.EditorInput.Editor.PromptForEntityEnding
Событие возникает после завершения операции выбора геометрического объекта, но до фиксации результата.
Событие не реализовано.
Событие вызывается в момент завершения операции выбора объекта пользователем
— например, при использовании методов GetEntity, GetPoint или других команд,
где требуется указание на геометрический объект.
Оно является вторым в последовательности событий, связанных с выбором объекта:
* PromptingForEntity — начало запроса.
* PromptForEntityEnding — завершение выборки, можно получить и модифицировать результат.
* PromptedForEntity — пост-обработка после завершения выбора.
Это событие позволяет обработать данные о выбранном объекте перед тем,
как он будет использован в дальнейших операциях, например, изменить его параметры,
проверить допустимость выбора или выполнить дополнительные действия.
Notes
Событие реализуется через делегат PromptForEntityEndingEventHandler
и может быть использовано для работы с PromptEntityResult.
Событие особенно полезно при разработке надстроек, где необходимо отслеживать
или изменять поведение при выборе объектов в чертеже.
Example
C#