Teigha.BoundaryRepresentation.VertexEdgeEnumerator
Класс VertexEdgeEnumerator представляет перечислитель ребер, связанных с вершиной.
Класс VertexEdgeEnumerator представляет перечислитель ребер, связанных с вершиной.

Teigha.BoundaryRepresentation.VertexEdgeEnumerator.Current
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.  Тип Edge.