Teigha.GraphicsSystem.RenderType.HighlightSelection
Значение: 4.
Режим отрисовки на устройстве напрямую с использованием стиля подсветки (минуя буфер кадра и Z-буфер).
Относится к группе основных предопределенных типов рендеринга.