Teigha.DatabaseServices.TypedValue.ToString
Метод предназначен для получения строкового представления данного объекта.
Метод предназначен для получения строкового представления данного объекта.
Returns: Возвращает представление данного объекта в виде строки. Тип String.