Teigha.Geometry.NurbCurve3d
Класс NurbCurve3d представляет неоднородные рациональные B-сплайны (NURBS) в трехмерном пространстве.
Класс NurbCurve3d представляет неоднородные рациональные B-сплайны (NURBS) в трехмерном пространстве.

Teigha.Geometry.NurbCurve3d.#ctor
Конструктор по умолчанию класса NurbCurve3d.
Создаваемые им объекты не содержат никаких данных.
Конструктор по умолчанию класса NurbCurve3d.
Создаваемые им объекты не содержат никаких данных.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.EllipticalArc3d)
Конструктор класса NurbCurve3d.
Создает трехмерную NURBS кривую, которая интерполирует указанную трехмерную эллиптическую дугу.
Конструктор класса NurbCurve3d.
Создает трехмерную NURBS кривую, которая интерполирует указанную трехмерную эллиптическую дугу.
ellipse: Входная эллиптическая дуга. Тип EllipticalArc3d.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.LineSegment3d)
Конструктор класса NurbCurve3d.
Создает трехмерную NURBS кривую, которая интерполирует указанный линейный сегмент.
Конструктор класса NurbCurve3d.
Создает трехмерную NURBS кривую, которая интерполирует указанный линейный сегмент.
lineSegment: Входной линейный сегмент. Тип LineSegment3d.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection)
Конструктор класса NurbCurve3d.
Создает трехмерную NURBS кривую, которая в пределах точности по умолчанию интерполирует указанный массив трехмерных точек.
Конструктор класса NurbCurve3d.
Создает трехмерную NURBS кривую, которая в пределах точности по умолчанию интерполирует указанный массив трехмерных точек.
fitPoints: Входная коллекция определяющих точек. Тип Point3dCollection.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Tolerance)
Конструктор класса NurbCurve3d.
Создает трехмерную NURBS кривую, которая с заданной точностью интерполирует указанный массив трехмерных точек.
Создает трехмерную NURBS кривую, которая с заданной точностью интерполирует указанный массив трехмерных точек.
fitPoints: Входная коллекция определяющих точек. Тип Point3dCollection.
fitTolerance: Входная точность интерполяции. Тип Tolerance. Ограничивает максимальное отклонение интерполирующей кривой от определяющих точек.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean)
Конструктор класса NurbCurve3d.
Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
Конструктор класса NurbCurve3d.
Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
Используется вызов  NurbCurve3d.NurbCurve3d(ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam, Tolerance fitTolerance) с точностью, равной Tolerance.Global.
Notes
Если флаг startTangentDefined снят (равен false), аргумент startTangent игнорируется, а вектор касательной в начальной точке вычисляется конструктором. Соответственно, если снят флаг endTangentDefined (равен false), то игнорируется аргумент endTangent, а вектор касательной в конечной точке вычисляется конструктором.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке.  Тип Vector3d.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент startTangent. Тип bool.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент endTangent.   Тип bool.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean,Teigha.Geometry.Tolerance)
Конструктор класса NurbCurve3d.
Создает трехмерную кривую, которая с предписанной точностью интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
Конструктор класса NurbCurve3d.  Создает трехмерную кривую, которая с предписанной точностью интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
Notes
Если флаг startTangentDefined снят (равен false), аргумент startTangent игнорируется, а вектор касательной в начальной точке вычисляется конструктором. Соответственно, если снят флаг endTangentDefined (равен false), то игнорируется аргумент endTangent, а вектор касательной в конечной точке вычисляется конструктором.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке.  Тип Vector3d.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент startTangent. Тип bool.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент endTangent.   Тип bool.
fitTolerance: Заданная точность интерполяции. Тип Tolerance.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean,Teigha.Geometry.KnotParameterizationEnum)
Конструктор класса NurbCurve3d.
Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
Конструктор класса NurbCurve3d.
Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
Используется вызов NurbCurve3d.NurbCurve3d(ref Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam, Tolerance fitTolerance) с точностью, равной Tolerance.Global.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке.  Тип Vector3d.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент startTangent. Тип bool.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент endTangent.   Тип bool.
knotParam: Метод узловой параметризации сплайна. Перечисление KnotParameterizationEnum.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean,Teigha.Geometry.KnotParameterizationEnum,Teigha.Geometry.Tolerance)
Конструктор класса NurbCurve3d.
Создает трехмерную кривую, которая с заданной точностью интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
Конструктор класса NurbCurve3d.
Создает трехмерную кривую, которая с заданной точностью интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке.  Тип Vector3d.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент startTangent. Тип bool.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент endTangent.   Тип bool.
knotParam: Метод узловой параметризации сплайна. Перечисление KnotParameterizationEnum.
fitTolerance: Заданная точность интерполяции. Тип Tolerance.

Teigha.Geometry.NurbCurve3d.#ctor(System.Int32,Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,System.Boolean)
Конструктор класса NurbCurve3d.
Создает NURBS кривую заданной степени с указанными узловым вектором и массивом управляющих вершин.
Конструктор класса NurbCurve3d.
Создает опционально замкнутую NURBS кривую заданной степени с указанными узловым вектором и массивом управляющих вершин.
Notes
Более высокие значения степени обеспечивают более гибкую кривую.
Например, степень 1 используется для определения линейного сегмента, степень 2 используется для определения NURBS окружностей и дуг (кривых постоянной кривизны) и т.д.
Узловой вектор задает последовательность значений параметров, которая определяет, где и как управляющие вершины влияют на кривую.
Узловой вектор делит параметрическое пространство на интервалы, обычно называемые узловыми интервалами.
Последовательность значений в узлах должна быть неубывающей.
Например, последовательность (0, 0, 0, 1, 2, 3, 3, 3) является допустимой, в то время как (0, 0, 2, 0, 3, 1, 3, 3) недопустима.
Управляющие вершины определяют положение кривой и её форму.
Количество управляющих вершин должно быть больше, либо равно (degree + 1).
Если periodic имеет значение false, длина узлового вектора knots должна быть равна (controlPoints.length() + degree + 1).
Если periodic имеет значение true, то длина узлового вектора должна быть равна длине массива controlPoints, а первая и последняя управляющие вершины должны совпадать.
degree: Степень NURBS кривой. Тип int.
knots: Узловой вектор. Тип KnotCollection.
controlPoints: Коллекция управляющих вершин. Тип Point3dCollection.
periodic: Флаг, который определяет, следует ли создавать периодическую (и замкнутую) кривую. Тип bool.

Teigha.Geometry.NurbCurve3d.#ctor(System.Int32,Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,System.Boolean)
Конструктор класса NurbCurve3d.
Создает опционально замкнутую NURBS кривую заданной степени с указанными узловым вектором и массивами управляющих вершин и значений весов.
Конструктор класса NurbCurve3d.
Создает опционально замкнутую NURBS кривую заданной степени с указанными узловым вектором и массивами управляющих вершин и значений весов.
Notes
Более высокие значения степени обеспечивают более гибкую кривую.
Например, степень 1 используется для определения линейного сегмента, степень 2 используется для определения NURBS окружностей и дуг и т.д.
Узловой вектор задает последовательность значений параметров, которая определяет, где и как управляющие вершины влияют на кривую.
Узловой вектор делит параметрическое пространство на интервалы, обычно называемые узловыми интервалами.
Последовательность значений в узлах должна быть неубывающей.
Например, последовательность (0, 0, 0, 1, 2, 3, 3, 3) является допустимой, в то время как (0, 0, 2, 0, 3, 1, 3, 3) недопустима.
Управляющие вершины определяют положение кривой и её форму.
Количество управляющих вершин должно быть больше, либо равно (degree + 1).
Чем ближе к нулю значение веса, тем ближе кривая к прямой линии вблизи соответствующей управляющей вершины.
Чем больше вес, тем ближе располагается кривая к соответствующей управляющей вершине. И наоборот, с уменьшением веса кривая отдаляется от соответствующей управляющей вершины.
Если periodic имеет значение false, длина узлового вектора knots должна быть равна (controlPoints.length() + degree + 1).
Если periodic имеет значение true, то длина узлового вектора должна быть равна длине массива controlPoints, а первая и последняя управляющие вершины должны совпадать.
degree: Степень NURBS кривой. Тип int.
knots: Узловой вектор. Тип KnotCollection.
controlPoints: Коллекция управляющих вершин. Тип Point3dCollection.
weights: Коллекция весов. Тип DoubleCollection.
periodic: Флаг, который определяет, следует ли создавать периодическую (и замкнутую) кривую. Тип bool.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,System.Boolean)
Конструктор класса NurbCurve3d.
Конструктор класса NurbCurve3d.
Создает трехмерную полиномиальную кривую, которая интерполирует заданный массив трехмерных точек.
Используется вызов NurbCurve3d.NurbCurve3d(ref Point3dCollection fitPoints, ref Vector3dCollection fitTangents, Tolerance fitTolerance, bool periodic)
с точностью, равной Tolerance.Global.
Notes
Если флаг periodic равен true, должны совпадать первая и последняя определяющие точки в коллекции fitPoints, а также первый и последний векторы производных в коллекции fitTangents.
fitPoints: Массив определяющих точек для интерполирующей кривой.  Тип Point3dCollection.
fitTangents: Векторы, интерполирующие производные кривой в определяющих точках.  Тип Vector3dCollection.
periodic: Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип bool.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.Tolerance,System.Boolean)
Конструктор класса NurbCurve3d. Создает экземпляр класса с указанными параметрами.
Конструктор класса NurbCurve3d. Создает экземпляр класса с указанными параметрами.
fitPoints: Массив определяющих точек для интерполирующей кривой.  Тип Point3dCollection.
fitTangents: Векторы, интерполирующие производные кривой в определяющих точках.  Тип Vector3dCollection.
fitTolerance: Заданная точность интерполяции. Тип Tolerance. Ограничивает максимальное отклонение интерполирующей кривой от определяющих точек.
periodic: Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип bool.

Teigha.Geometry.NurbCurve3d.#ctor(System.Int32,Teigha.Geometry.PolylineCurve3d,System.Boolean)
Конструктор класса NurbCurve3d.
Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
Конструктор класса NurbCurve3d.
Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
Notes
Более высокие значения степени делают кривую более гибкой. Например, степень 1 используется для определения полилинии, степень 2 используется для определения NURBS окружностей и круглых дуг (кривых постоянной кривизны) и т.д.
degree: Входная степень NURBS кривой. Тип int.
fitPolyline: 3D-полилиния, вершины которой служат определяющими точками для NURBS кривой. Тип PolylineCurve3d.
periodic: Флаг, указывающий, что требуется получить периодическую (и замкнутую) NURBS кривую. Тип bool.

Teigha.Geometry.NurbCurve3d.AddControlPointAt(System.Double,Teigha.Geometry.Point3d,System.Double)
Метод добавляет управляющую вершину в указанном узле.
Метод добавляет управляющую вершину в указанном узле.
newKnot: Параметр узла, в котором добавляется новая управляющая вершина. Тип double.
point: Координаты добавляемой управляющей вершины. Тип Point3d.
weight: Значение веса, которое присваивается управляющей вершине. Тип double.

Teigha.Geometry.NurbCurve3d.AddFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет вставить определяющую точку с заданным индексом.
Метод позволяет вставить определяющую точку с заданным индексом.
Notes
Если сплайн не был создан методом определяющих точек, метод возвращает false.
В противном случае новая определяющая точка добавляется по указанному индексу.
При этом прежняя определяющая точка с индексом index и все последующие увеличивают свой индекс на единицу.
Значение индекса должно быть неотрицательным и должно быть меньше количества определяющих точек.
index: Индекс определяющей точки. Тип int.
point: Координаты определяющей точки. Тип Point3d.
Returns: Возвращает true, если сплайн был создан методом определяющих точек, и добавление новой определяющей точки с заданным индексом завершилась успешно.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3d.AddKnot(System.Double)
Метод добавляет новый узел в узловой вектор сплайна.
Метод добавляет новый узел в узловой вектор сплайна.
Если значение newKnot уже является узлом, то этот метод не делает ничего.
newKnot: Новый узел. Тип double.

Teigha.Geometry.NurbCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип NurbCurve3d.

Teigha.Geometry.NurbCurve3d.DeleteControlPointAt(System.Int32)
Метод удаляет управляющую вершину с указанным индексом.
Метод удаляет управляющую вершину с указанным индексом.
index: Индекс удаляемой управляющей вершины.  Тип int.

Teigha.Geometry.NurbCurve3d.DeleteFitPointAt(System.Int32)
Метод удаляет определяющую точку с указанным индексом.
Метод удаляет определяющую точку с указанным индексом.
index: Индекс удаляемой определяющей точки. Тип int.
Returns: Возвращает true в случае успешного удаления определяющей точки.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3d.ElevateDegree(System.Int32)
Метод увеличивает степень сплайна на указанную величину.
Метод увеличивает степень сплайна на величину plusDegree.
plusDegree: Величина, на которую увеличивается степень сплайна.  Тип int.

Teigha.Geometry.NurbCurve3d.GetFitPointAt(System.Int32)
Метод предоставляет определяющую точку с указанным индексом.
Метод предоставляет определяющую точку с указанным индексом.
index: Индекс определяющей точки. Тип int.
Returns: Возвращает определяющую точку с индексом index. Тип Point3d.

Teigha.Geometry.NurbCurve3d.GetParametersOfC1Discontinuity(Teigha.Geometry.Tolerance)
Метод предоставляет значения параметра всех точек сплайна, где в пределах указанной точности нарушена C1 непрерывность (неравные касательные векторы слева и справа от точки).
Метод предоставляет значения параметра всех точек сплайна, где в пределах указанной точности нарушена C1 непрерывность.
В таких точках касательные векторы слева и справа от точки хотя и коллинеарны, но отличаются по модулю.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью.
Тип DoubleCollection.

Teigha.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity(Teigha.Geometry.Tolerance)
Метод предоставляет значения параметра всех точек сплайна с нарушенной в пределах заданной точности G1 непрерывностью (неколлинеарность  касательных векторов слева и справа от точки).
Метод предоставляет значения параметра всех точек сплайна, в которых  в пределах заданной точности нарушается G1 непрерывность.
В таких точках касательные векторы слева и справа от точки не коллинеарны.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью.
Тип DoubleCollection.

Teigha.Geometry.NurbCurve3d.GetWeightAt(System.Int32)
Метод предоставляет вес управляющей вершины с указанным индексом.
Метод предоставляет значение веса для управляющей вершины с указанным индексом.
index: Индекс управляющей вершины. Тип int.  Должен быть неотрицательным и меньше количества управляющих вершин.
Returns: Возвращает значение веса по указанному индексу.
Тип double.

Teigha.Geometry.NurbCurve3d.HardTrimByParams(System.Double,System.Double)
Метод позволяет обрезать данную NURBS кривую, задав ей новые значения начального и конечного параметров.
Метод позволяет обрезать данную NURBS кривую, задав ей новые значения начального и конечного параметров.
Это делается путем добавления и удаления управляющих вершин и узлов, а не просто изменением параметрического интервала, на котором определен сплайн.
newStartParameter: Новое начальное значение параметра. Тип double.
newEndParameter: Новое конечное  значение параметра. Тип double.

Teigha.Geometry.NurbCurve3d.InsertKnot(System.Double)
Метод вставляет новый узел в узловой вектор данной кривой.
Метод вставляет новый узел в узловой вектор данной кривой.
Если значение newKnot уже имеется в узловом векторе, то кратность этого узла увеличивается на единицу.
newKnot: Новый узел.

Teigha.Geometry.NurbCurve3d.JoinWith(Teigha.Geometry.NurbCurve3d)
Метод дополняет данную кривую указанным сплайном и перевычисляет результирующую кривую.
Метод дополняет данную кривую указанным сплайном curve с последующим перевычислением результирующей кривой.
Ни один из сплайнов не может быть замкнутым.
Начальная точка сплайна curve должна совпадать с конечной точкой данного сплайна.
curve: Сплайн, который требуется присоединить к данной кривой.

Teigha.Geometry.NurbCurve3d.MakeRational(System.Double)
Метод позволяет преобразовать данную кривую в рациональный сплайн.
Каждой управляющей вершине назначается указанный вес.
Метод позволяет преобразовать данную кривую в рациональный сплайн.
Каждой управляющей вершине назначается указанный вес.
weight: Вес, который назначается каждой управляющей вершине. Тип double.

Teigha.Geometry.NurbCurve3d.SetEvaluateMode(System.Boolean)
Метод задает режим вычислений, включающий или отключающий внутреннюю оптимизацию.
Метод задает режим вычислений, включающий или отключающий внутреннюю оптимизацию.
Notes
Вычисления без оптимизации обычно следует использовать, только если требуется перевычислить одно-два значения на интервал между двумя последовательными узлами.
Включение оптимизации дает более высокую производительность, если вычисляются три или более значений на интервал между узлами.
evaluateMode: Режим вычислений NURBS кривой. Тип bool.

Teigha.Geometry.NurbCurve3d.SetFitData(System.Int32,Teigha.Geometry.Point3dCollection)
Метод перевычисляет сплайн, используя указанные определяющие точки и степень сплайна, а также точность по умолчанию.
Метод перевычисляет сплайн, используя указанные определяющие точки и степень сплайна.
Используется вызов метода NurbCurve3d.SetFitData(int degree, Point3dCollection fitPoints, Tolerance fitTolerance)
с точностью по умолчанию, равной Tolerance.Global.
Notes
Чем выше степень, тем более гибким получается сплайн. Степень 1 определяет полилинии, а степень 2 определяет NURBS кривые постоянной кривизны (окружности и круглые дуги) и т.д.
degree: Степень сплайна. Тип int.
fitPoints: Массив определяющих точек сплайна. Тип Point3dCollection.

Teigha.Geometry.NurbCurve3d.SetFitData(System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Tolerance)
Метод перевычисляет сплайн, используя указанные определяющие точки, степень сплайна и точность интерполяции.
Метод перевычисляет сплайн, используя указанные определяющие точки fitPoints, степень сплайна degree и точность интерполяции fitTolerance.
Notes
Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить через определяющие точки.
Но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
Чем выше степень, тем более гибким получается сплайн. Степень 1 определяет полилинии, а степень 2 определяет NURBS кривые постоянной кривизны (окружности и круглые дуги) и т.д.
degree: Степень сплайна. Тип int.
fitPoints: Массив определяющих точек сплайна. Тип Point3dCollection.
fitTolerance: Заданная геометрическая точность. Тип Tolerance.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean)
Метод пересчитывает сплайн, используя указанные определяющие точки, векторы касательных в начальной и конечной точках и точность по умолчанию.
Метод пересчитывает сплайн, используя указанные определяющие точки, векторы касательных в начальной и конечной точках и точность по умолчанию.
Аргумент fitKnots передает узловой вектор для нового сплайна.
Установленный флаг periodic делает новый сплайн периодическим, так что первая и последняя определяющие точки должны совпадать.
Используется вызов метода NurbCurve3d.SetFitData(KnotCollection fitKnots, Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, Tolerance fitTolerance, Boolean periodic) с точностью по умолчанию, которая равна Tolerance.Global.
fitKnots: Узловой вектор нового сплайна. Тип KnotCollection.
fitPoints: Массив определяющих точек. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке. Тип Vector3d.
periodic: Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип bool.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance,System.Boolean)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
Опционально сплайн может быть построен периодическим.
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
Аргумент fitKnots передает узловой вектор для нового сплайна.
Установленный флаг periodic делает новый сплайн периодическим, так что первая и последняя определяющие точки должны совпадать.
Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
fitKnots: Узловой вектор нового сплайна. Тип KnotCollection.
fitPoints: Массив определяющих точек. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке. Тип Vector3d.
fitTolerance: Геометрическая точность. Тип Tolerance.
periodic: Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип bool.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
Используется вызов метода NurbCurve3d.SetFitData(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, Tolerance fitTolerance) с точностью по умолчанию, равной Tolerance.Global.
fitPoints: Определяющие точки. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной  точке. Тип Vector3d.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
fitPoints: Определяющие точки. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке.  Тип Vector3d.
fitTolerance: Геометрическая точность. Тип Tolerance.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.KnotParameterizationEnum,Teigha.Geometry.Tolerance)
Метод задает новые определяющие данные в этом объекте и перевычисляет сплайн.
Метод заменяет все существующие данные сплайна (определяющие данные или данные NURBS) новыми определяющими точками, векторами касательных на концах, включая метод узловой параметризации и точность интерполяции.
Если аргумент fitTolerance не равен 0, то построенный сплайн может не проходить точно через определяющие точки, но максимальное отклонение построенного сплайна от любой определяющей точки не будет превышать fitTolerance.
fitPoints: Определяющие точки. Тип Point3dCollection.
startTangent: Вектор касательной в начальной точке. Тип Vector3d.
endTangent: Вектор касательной в конечной точке.  Тип Vector3d.
knotParam: Метод узловой параметризации сплайна. Тип KnotParameterizationEnum.
fitTolerance: Геометрическая точность интерполяции. Тип Tolerance.

Teigha.Geometry.NurbCurve3d.SetFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод изменяет определяющую точку с указанным индексом.
Метод изменяет координаты определяющей точки с указанным индексом и перевычисляет сплайн.
index: Индекс определяющей точки. Тип int.
point: Новые координаты определяющей точки. Тип Point3d.
Returns: Возвращает true, если перевычисление сплайна после изменения определяющей точки завершилось успешно.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3d.SetFitTangents(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить направления касательных на концах сплайна.
Метод позволяет переопределить направления касательных на концах сплайна.
startTangent: Направление касательной в начальной точке сплайна. Тип Vector3d.
endTangent: Направление касательной в конечной  точке сплайна. Тип Vector3d.
Returns: Возвращает true, если перевычисление сплайна с новыми касательными завершилось успешно.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3d.SetWeightAt(System.Int32,System.Double)
Метод позволяет задать вес управляющей вершины сплайна с указанным индексом.
Метод позволяет задать вес управляющей вершины сплайна с указанным индексом.
Notes
Чем выше значение веса, тем ближе к управляющей вершине проходит кривая, и наоборот.
Чем ближе вес к нулю, тем ближе к прямой линии становится кривая около соответствующей управляющей вершины.
index: Индекс управляющей вершины. Тип int. Индекс должен быть больше или равен 0 и меньше количества управляющих вершин.
value: Новое значение веса. Тип double.

Teigha.Geometry.NurbCurve3d.DefinitionData
Свойство DefinitionData возвращает все данные, определяющие сплайн.
Свойство DefinitionData возвращает все данные, определяющие сплайн.
Если сплайн не является рациональным, массив весов будет пустым.
Returns: Возвращает данные, определяющие этот сплайн.
Тип NurbCurve3dData.

Teigha.Geometry.NurbCurve3d.EvalMode
Свойство EvalMode позволяет узнать текущий режим вычисления сплайна.
Свойство EvalMode позволяет узнать текущий режим вычисления сплайна.
Returns: Возвращает true, если внутренняя оптимизация включена.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve3d.FitData
Свойство FitData представляет все определяющие данные, использованные для построения сплайна.
Свойство FitData представляет все определяющие данные, использованные для построения сплайна.
Returns: Возвращает определяющие данные, использованные для построения сплайна.
Тип NurbCurve3dFitData.

Teigha.Geometry.NurbCurve3d.FitKnotParameterization
Свойство FitKnotParameterization представляет метод узловой параметризации данного сплайна.
Свойство FitKnotParameterization представляет метод узловой параметризации данного сплайна.
Returns: Возвращает текущий метод узловой параметризации сплайна.
Тип KnotParameterizationEnum.

Teigha.Geometry.NurbCurve3d.FitTolerance
Свойство FitTolerance представляет точность интерполяции для данного сплайна.
Свойство FitTolerance представляет точность интерполяции для данного сплайна.
Returns: Возвращает текущее значение геометрической точности интерполяции для данного сплайна.
Тип Tolerance.

Teigha.Geometry.NurbCurve3d.NumFitPoints
Свойство NumFitPoints представляет количество определяющих точек, использованных для построения сплайна.
Свойство NumFitPoints представляет количество определяющих точек, использованных для построения сплайна.
Returns: Возвращает количество определяющих точек сплайна.
Тип int.

Teigha.Geometry.NurbCurve3d.NumWeights
Свойство NumWeights представляет количество значений веса, определенных у этого сплайна.
Свойство NumWeights представляет количество значений веса, определенных у этого сплайна.
Returns: Если сплайн является рациональным, возвращаемое значение равно количеству управляющих вершин. В противном случае свойство возвращает 0.
Тип int.