HostMgd.EditorInput.Editor.EnteringQuiescentState
Событие возникает, когда редактор переходит в состояние покоя —
то есть пользователь завершил все действия и ожидает нового ввода.
Событие генерируется при переходе редактора nanoCAD в спокойное (неактивное) состояние,
что означает, что текущая команда завершена, и система ожидает новых действий от пользователя.
Это событие может быть использовано для выполнения фоновых операций,
очистки временных данных или подготовки к следующей команде.
Оно особенно полезно в надстройках, где требуется реагировать на момент завершения активности пользователя.
Notes
Событие не предоставляет дополнительных данных (EventArgs.Empty) и реализовано как стандартный EventHandler.
Example
C#