Teigha.Geometry.Surface.IsClosedInV
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V.
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V.
Предполагает реализацию в производных классах.
Notes
Используется вызов метода Surface.IsClosedInV(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
Returns: Возвращает true, если в пределах точности Tolerance.Global
данную поверхность можно считать замкнутой в направлении V.
В противном случае возвращает false.