HostMgd.PlottingServices.EndPageEventArgs
Класс EndPageEventArgs предоставляет данные, специфичные для вывода листа на печать и необходимые для события PlotReactorManager.EndPage.
Класс EndPageEventArgs является наследником класса System.EventArgs и в .NET API nanoCAD
предоставляет данные, специфичные для вывода листа на печать и необходимые для события PlotReactorManager.EndPage. Эти данные включают состояние флага SheetCancelStatus. Используется совместно с делегатом HostMgd.PlottingServices.EndPageEventHandler.

HostMgd.PlottingServices.EndPageEventArgs.#ctor(HostMgd.PlottingServices.SheetCancelStatus)
Конструктор класса EndPageEventArgs.
Создает экземпляр класса с указанным значением флага HostMgd.PlottingServices.SheetCancelStatus.
Конструктор класса EndPageEventArgs.
Создает экземпляр класса с указанным значением флага HostMgd.PlottingServices.SheetCancelStatus.
status: Входное значение из перечисления HostMgd.PlottingServices.SheetCancelStatus.

HostMgd.PlottingServices.EndPageEventArgs.Status
Свойство Status возвращает текущее значение флага SheetCancelStatus.
Свойство Status возвращает текущее значение флага SheetCancelStatus.
Returns: Возвращает текущее значение флага отмены печати листа.
Значение из перечисления HostMgd.PlottingServices.SheetCancelStatus.