Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionRanges
Метод предоставляет параметрические интервалы, на которых вычисляются точки пересечения кривых.
Метод предоставляет параметрические интервалы, на которых вычисляются точки пересечения кривых.
Returns: Возвращает массив параметрических интервалов. Тип Interval[]. Массив содержит ровно два элемента, которые представляют параметрические интервалы для первой и второй кривой, соответственно.