HostMgd.EditorInput.PromptOptions.AppendKeywordsToMessage
Признак отображения ключевых слов в приглашающем сообщении.
Возвращает или устанавилвает значение признака отображения ключевых слов в приглашающем сообщении.
При значении равном true ключевые слова будут отображаться в приглашающем сообщении.
При значении равном false ключевые слова не будут отображаться в приглашающем сообщении.
Returns: Возвращает признак отображения ключевых слов в приглашающем сообщении.