Teigha.GraphicsInterface.MaterialOpacityComponent.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Оно хранит карту материала и значение непрозрачности.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.