Teigha.DatabaseServices.DwgFiler.ReadUInt32
Метод предназначен для получения 32-разрядного целого числа без знака (UInt32) из текущего элемента данного объекта Filer.
Метод предназначен для получения 32-разрядного целого числа без знака (UInt32) из текущего элемента данного объекта Filer.
Returns: Возвращает значение 32-разрядного целого числа без знака. Тип uint.