Teigha.Runtime.DynamicLinker.ModuleLoadAborted
Событие ModuleLoadAborted создается, когда динамический компоновщик прерывает неудачную попытку загрузить модуль приложения.
Событие ModuleLoadAborted создается, когда динамический компоновщик прерывает неудачную попытку загрузить модуль приложения.