Teigha.Geometry.NurbCurve3d.MakeClosed
Метод позволяет сделать данную кривую замкнутой, если она еще не замкнута.
Метод позволяет сделать данную кривую замкнутой, если она еще незамкнутая.
Если кривая уже является замкнутой, метод не делает ничего.
Замкнутый сплайн получается путем создания плавного сплайна между последней и первой точками с последующим присоединением полученной кривой к исходному сплайну.