Teigha.Geometry.CubicSplineCurve2d
Класс CubicSplineCurve2d представляет интерполяционный кубический сплайн в двумерном пространстве.
Класс CubicSplineCurve2d представляет интерполяционный кубический сплайн в двумерном пространстве.

Teigha.Geometry.CubicSplineCurve2d.#ctor
Конструктор по умолчанию класса CubicSplineCurve2d.
Инициализирует кубический сплайн с пустым списком точек.
Конструктор по умолчанию класса CubicSplineCurve2d.
Инициализирует кубический сплайн с пустым списком точек (т.е. без фактических данных).

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Curve2d,System.Double)
Конструктор класса CubicSplineCurve2d.
Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
Конструктор класса CubicSplineCurve2d.
Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
curve: Кривая, для которой следует создать интерполирующий ее двумерный кубический сплайн.  Тип Curve2d.
epsilon: Заданная точность интерполяции.  Тип double.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2dCollection,System.Boolean)
Конструктор класса CubicSplineCurve2d.
Создает экземпляр класса с указанными определяющими точками, узловым вектором и первыми производными в определяющих точках.
Конструктор класса CubicSplineCurve2d.
Создает экземпляр класса с заданными определяющими точками, первыми производными в них и узловым вектором.
Дополнительно можно потребовать построение периодического (замкнутого) сплайна.
knots: Входной узловой вектор. Тип KnotCollection.
fitPoints: Входная коллекция определяющих точек. Тип Point2dCollection.
firstDerivatives: Входная коллекция векторов первых производных. Тип Vector2dCollection.
periodic: Флаг, указывающий, что сплайн должен быть периодическим (замкнутым). Тип bool.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection)
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки.
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки.
Используется вызов метода CubicSplineCurve2d(ref Point2dCollection fitPoints, Tolerance tolerance) со значением точности Tolerance.Global.
fitPoints: Входной массив определяющих точек сплайна. Тип Point2dCollection.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Tolerance)
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий с заданной точностью через указанные определяющие точки.
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий с заданной точностью через указанные определяющие точки.
fitPoints: Входной массив определяющих точек сплайна. Тип Point2dCollection.
tolerance: Заданная точность интерполяции. Тип Tolerance.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
Используется вызов метода CubicSplineCurve2d(ref Point2dCollection fitPoints, Vector2d startDerivative, Vector2d endDerivative, Tolerance tolerance) с точностью интерполяции Tolerance.Global.
fitPoints: Входной массив определяющих точек сплайна. Тип Point2dCollection.
startDerivative: Первая производная в начальной точке. Тип Vector2d.
endDerivative: Первая производная в конечной точке.  Тип Vector2d.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance)
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий предписанной точностью через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
Конструктор класса CubicSplineCurve2d.
Создает интерполяционный кубический сплайн, проходящий предписанной точностью через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
fitPoints: Входной массив определяющих точек сплайна. Тип Point2dCollection.
startDerivative: Первая производная в начальной точке. Тип Vector2d.
endDerivative: Первая производная в конечной точке.  Тип Vector2d.
tolerance: Заданная точность интерполяции. Тип Tolerance.

Teigha.Geometry.CubicSplineCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект CubicSplineCurve2d на основе переданного указателя.
Метод создает объект CubicSplineCurve2d на основе переданного указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный двумерный кубический сплайн.  Тип CubicSplineCurve2d.

Teigha.Geometry.CubicSplineCurve2d.GetFirstDerivativeAt(System.Int32)
Метод позволяет получить вектор первой производной в определяющей точке этого сплайна с заданным индексом.
Метод позволяет получить вектор первой производной в определяющей точке этого сплайна с заданным индексом.
index: Индекс определяющей точки, в которой требуется вычислить вектор первой производной.
Returns: Возвращает вектор первой производной в указанной определяющей точке сплайна.
Тип Vector2d.

Teigha.Geometry.CubicSplineCurve2d.GetFitPointAt(System.Int32)
Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
index: Индекс искомой определяющей точки данного сплайна.  Тип int.
Returns: Возвращает определяющую точку сплайна с индексом index.  Тип Point2d.

Teigha.Geometry.CubicSplineCurve2d.SetFirstDerivativeAt(System.Int32,Teigha.Geometry.Vector2d)
Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
index: Индекс определяющей точки.  Тип int.
derivative: Новый вектор первой производной в указанной определяющей точке.  Тип Vector2d.

Teigha.Geometry.CubicSplineCurve2d.SetFitPointAt(System.Int32,Teigha.Geometry.Point2d)
Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
index: Индекс определяющей точки.  Тип int.
point: Новые координаты определяющей точки с индексом index. Тип Point2d.

Teigha.Geometry.CubicSplineCurve2d.NumFitPoints
Свойство NumFitPoints представляет количество определяющих точек данного сплайна.
Свойство NumFitPoints представляет количество определяющих точек данного сплайна.
Returns: Возвращает количество определяющих точек сплайна. Тип int.