Teigha.DatabaseServices.OsnapOverrule.SetCustomFilter
Этот метод включает использование метода IsApplicable, чтобы определять применимость объектного переопределения.
Этот метод включает использование метода IsApplicable, чтобы определять применимость объектного переопределения.