Teigha.Geometry.LinearEntity2d
Класс LinearEntity2d является абстрактным базовым классом для всех классов двумерных линейных объектов.
Класс LinearEntity2d является абстрактным базовым классом для всех классов двумерных линейных объектов.

Teigha.Geometry.LinearEntity2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип LinearEntity2d.

Teigha.Geometry.LinearEntity2d.GetPerpendicularLine(Teigha.Geometry.Point2d)
Метод позволяет получить линию, которая перпендикулярна данному объекту и проходит через указанную точку.
Метод позволяет получить линию, которая перпендикулярна данному объекту и проходит через указанную точку point.
point: Точка, через которую должен проходить перпендикуляр к данному объекту.
Returns: Возвращает перпендикуляр к данному объекту, который проходит через точку point.
Тип Line2d.

Teigha.Geometry.LinearEntity2d.IntersectWith(Teigha.Geometry.LinearEntity2d)
Метод вычисляет точку пересечения данного объекта с другим линейным объектом.
Метод вычисляет точку пересечения данного объекта с другим линейным объектом.
Используется вызов метода LinearEnt2d.IntersectWith(LinearEntity2d line, Tolerance tolerance) со значением точности, равным Tolerance.Global.
line: Линейный объект, точку пересечения с которым требуется вычислить.
Returns: Возвращает точку пересечения в виде массива из одного элемента.
Тип Point2d[].

Teigha.Geometry.LinearEntity2d.IntersectWith(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод вычисляет точку пересечения данного объекта с другим линейным объектом с некоторой заданной точностью.
Метод вычисляет точку пересечения данного объекта с другим линейным объектом с некоторой заданной точностью.
line: Линейный объект, точку пересечения с которым требуется вычислить. Тип LinearEntity2d.
tolerance: Входное значение геометрической точности. Тип Tolerance.
Returns: Возвращает точку пересечения в виде массива из одного элемента.
Тип Point2d[].

Teigha.Geometry.LinearEntity2d.IsColinearTo(Teigha.Geometry.LinearEntity2d)
Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту.
Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту.
Используется вызов метода LinearEnt2d.IsColinearTo(LinearEntity2d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Проверяемый линейный объект.  Тип LinearEntity2d.
Returns: Возвращает true, если объект line коллинеарен данному линейному объекту.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity2d.IsColinearTo(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту с некоторой заданной точностью.
Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту с некоторой заданной точностью.
line: Проверяемый линейный объект.  Тип LinearEntity2d.
tolerance: Входное значение геометрической точности. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance можно считать, что данный объект коллинеарен объекту line.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity2d.IsParallelTo(Teigha.Geometry.LinearEntity2d)
Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту.
Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту.
Используется вызов метода LinearEnt2d.IsParallelTo(LinearEntity2d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Проверяемый линейный объект. Тип LinearEntity2d.
Returns: Возвращает true, если в пределах точности по умолчанию можно считать, что данный объект параллелен объекту line.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity2d.IsParallelTo(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту с некоторой заданной точностью.
Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту с некоторой заданной точностью.
line: Проверяемый линейный объект. Тип LinearEntity2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности можно считать, что данный объект параллелен объекту line.
В противном случае возвращает false

Teigha.Geometry.LinearEntity2d.IsPerpendicularTo(Teigha.Geometry.LinearEntity2d)
Метод позволяет проверить, является ли указанный линейный объект перпендикулярным данному линейному объекту.
Метод позволяет проверить, является ли указанный линейный объект перпендикулярным данному линейному объекту.
Используется вызов метода LinearEnt2d.IsPerpendicularTo(LinearEntity2d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Проверяемый линейный объект. Тип LinearEntity2d.
Returns: Возвращает true, если в пределах точности по умолчанию можно считать, что данный объект перпендикулярен объекту line.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity2d.IsPerpendicularTo(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанный линейный объект перпендикулярным данному  объекту с некоторой заданной точностью.
Метод позволяет проверить, является ли указанный линейный объект перпендикулярным данному  объекту с некоторой заданной точностью.
line: Проверяемый линейный объект. Тип LinearEntity2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности можно считать, что данный объект перпендикулярен объекту line.
В противном случае возвращает false

Teigha.Geometry.LinearEntity2d.Overlap(Teigha.Geometry.LinearEntity2d)
Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта.
Метод позволяет определить, перекрывается ли данный объект с указанным линейным объектом, и если да, возвращает линейный объект, который представляет область их перекрытия.
Возвращаемый объект может быть объектом любого производного класса LinearEntity2d, в зависимости от типов сравниваемых линий.
Используется вызов метода  LinearEnt2d.Overlap(LinearEntity2d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Проверяемый линейный объект. Тип LinearEntity2d.
Returns: Возвращает объект, который представляет область перекрытия. Тип LinearEntity2d.

Teigha.Geometry.LinearEntity2d.Overlap(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта, вычисленную с некоторой заданной точностью.
Метод позволяет определить с некоторой заданной точностью, перекрывается ли данный объект с указанным линейным объектом, и если да, возвращает линейный объект, который представляет область их перекрытия.
Возвращаемый объект может быть объектом любого производного класса LinearEntity2d, в зависимости от типов сравниваемых линий.
line: Проверяемый линейный объект. Тип LinearEntity2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает объект, который представляет область перекрытия. Тип LinearEntity2d.

Teigha.Geometry.LinearEntity2d.Direction
Свойство Direction представляет единичный направляющий вектор данного линейного объекта.
Свойство Direction представляет единичный направляющий вектор данного линейного объекта.
Этот вектор ориентирован в направлении увеличения значения параметра.
Returns: Возвращает единичный направляющий вектор. Тип Vector2d.

Teigha.Geometry.LinearEntity2d.PointOnLine
Свойство PointOnLine представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
Свойство PointOnLine представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
Returns: Возвращает точку на данном линейном объекте. Тип Point2d.