Teigha.DatabaseServices.GeoLocationData
Этот класс хранит данные географического местоположения, включая DesignPoint, UpDirection, NorthDirection в пространстве чертежа, а также широту, долготу и высоту в географическом пространстве.
Этот класс представляет данные географического местоположения, включая DesignPoint, UpDirection, NorthDirection в пространстве чертежа, а также широту, долготу и высоту в географическом пространстве.
Экземпляры класса хранятся в словаре расширений записи пространства модели в таблице блоков объекта BlockTableRecord.
GeoLocationData также предоставляет функции преобразования координат между пространством чертежа DWG и географическим пространством.

Teigha.DatabaseServices.GeoLocationData.#ctor
Конструктор класса GeoLocationData.
Конструктор класса GeoLocationData.

Teigha.DatabaseServices.GeoLocationData.AddMeshPointMap(System.Int32,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод добавляет по указанному индексу пару связанных точек - исходную точку и точку назначения.
Метод добавляет по указанному индексу пару связанных точек - исходную точку и точку назначения.
Если указанный индекс недействителен, новая пара добавляется в конец массива сети.
index: Входной индекс.   Тип int.
sourcePt: Исходная точка.   Тип Point2d.
destPt: Точка назначения. Тип Point2d.

Teigha.DatabaseServices.GeoLocationData.GetMeshPointMap(System.Int32)
Метод позволяет получить в виде объекта MeshPointMap связанные между собой исходную точку и точку назначения, хранящиеся в сети по указанному индексу.
Метод позволяет получить в виде объекта MeshPointMap связанные между собой исходную точку и точку назначения, хранящиеся в сети по указанному индексу.
index: Индекс пары связанных точек. Тип int.
Returns: Возвращает объект MeshPointMap, хранящийся в сети по указанному индексу.

Teigha.DatabaseServices.GeoLocationData.SetMeshPointMaps(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Point2dCollection)
Метод позволяет задать для сети GeoMesh новые коллекции исходных точек и точек назначения.
Метод позволяет задать для сети GeoMesh новые коллекции исходных точек и точек назначения.
sourcePts: Входная коллекция исходных точек.   Тип Point2dCollection.
destPts: Входная коллекция точек назначения. Тип Point2dCollection.

Teigha.DatabaseServices.GeoLocationData.TransformFromLonLatAlt(Teigha.Geometry.Point3d)
Метод предназначен для преобразования географической точки в координатах ГИС в эквивалентную точку в координатах DWG.
Метод предназначен для преобразования географической точки в координатах ГИС в эквивалентную точку в координатах DWG.
Значения долготы, широты и высоты исходной геоточки преобразуются, соответственно, в компоненты X, Y и Z точки назначения в координатах модели.
geoPt: Исходная географическая точка в системе координат ГИС. Тип Point3d.
Returns: Возвращает соответствующую точку в координатах модели. Тип Point3d.

Teigha.DatabaseServices.GeoLocationData.TransformToLonLatAlt(System.Double,System.Double,System.Double)
Метод предназначен для преобразования заданных долготы, широты и высоты точки географического пространства в соответствующие
координаты точки DWG.
Метод предназначен для преобразования заданных долготы, широты и высоты точки географического пространства в соответствующие
координаты точки DWG.
x: Долгота исходной геоточки DWG. Тип double.
y: Широта  исходной геоточки DWG. Тип double.
z: Высота  исходной геоточки DWG. Тип double.
Returns: Возвращает объект GeoDataLonLatAltInfo, представляющий значения долготы, широты и высоты соответствующей геоточки в координатах ГИС.

Teigha.DatabaseServices.GeoLocationData.TransformToLonLatAlt(Teigha.Geometry.Point3d)
Метод предназначен для преобразования координат указанной точки DWG в соответствующую точку географического пространства в координатах ГИС.
Метод предназначен для преобразования координат указанной точки DWG в соответствующую точку географического пространства в координатах ГИС.
dwgPt: Исходная точка DWG. Тип Point3d.
Returns: Возвращает точку в координатах ГИС. Тип Point3d.

Teigha.DatabaseServices.GeoLocationData.BlockTableRecordId
Свойство обеспечивает доступ к идентификатору записи пространства модели в таблице блоков.
Свойство обеспечивает доступ к идентификатору ObjectId записи пространства модели в таблице блоков.
Returns: Возвращает запись пространства модели в таблице блоков. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.GeoLocationData.CoordinateProjectionRadius
Свойство предоставляет доступ к значению радиуса кривизны эллипсоида вращения, который используется в алгоритме коррекции высоты над уровнем моря.
Свойство предоставляет доступ к значению радиуса кривизны эллипсоида вращения, который используется в алгоритме коррекции высоты над уровнем моря.
Returns: Возвращает радиус кривизны эллипсоида вращения. Тип double. Измеряется в метрах.

Teigha.DatabaseServices.GeoLocationData.CoordinateSystem
Свойство обеспечивает доступ к строке, представляющей текущую систему координат.
Свойство обеспечивает доступ к строке, представляющей текущую систему координат.
Returns: Возвращает строку, представляющую систему координат. Тип String.

Teigha.DatabaseServices.GeoLocationData.DesignPoint
Свойство обеспечивает доступ к координатам текущей точки DWG данного объекта.
Свойство обеспечивает доступ к координатам текущей точки DWG данного объекта.
Returns: Возвращает текущую 3D-точку.  Тип Point3d.

Teigha.DatabaseServices.GeoLocationData.DoSeaLevelCorrection
Свойство обеспечивает доступ к флагу, который управляет применением поправки на высоту над уровнем моря к горизонтальным координатам в процессе преобразования локальных координат в координаты сети.
Свойство обеспечивает доступ к флагу, который управляет применением поправки на высоту над уровнем моря к горизонтальным координатам в процессе преобразования локальных координат в координаты сети.
Значение флага по умолчанию false.
Returns: Возвращает true, если поправки на высоту над уровнем моря учитываются.
В противном случае возвращает false.

Teigha.DatabaseServices.GeoLocationData.GeoRSSTag
Свойство обеспечивает доступ к строке GeoRSS.
Свойство обеспечивает доступ к строке GeoRSS.
Returns: Возвращает строку GeoRSS. Тип String.

Teigha.DatabaseServices.GeoLocationData.HorizontalUnits
Свойство обеспечивает доступ к горизонтальным единицам измерения.
Свойство обеспечивает доступ к горизонтальным единицам измерения.
Returns: Возвращает горизонтальные единицы измерения.  Значение из перечисления UnitsValue.

Teigha.DatabaseServices.GeoLocationData.HorizontalUnitsScale
Свойство обеспечивает доступ к масштабу для горизонтальных единиц измерения.
Свойство обеспечивает доступ к масштабу для горизонтальных единиц измерения.
Returns: Возвращает масштабный коэффициент. Тип double.

Teigha.DatabaseServices.GeoLocationData.NorthDirection
Свойство возвращает угол направления на истинный север как угловое отклонение от оси X в мировой системе координат.
Свойство возвращает направление на север как угловое отклонение от оси X в мировой системе координат (МСК).
По умолчанию севером считается положительное направление оси Y. Угол измеряется в радианах.
Returns: Возвращает угол в радианах направления на истинный север в WCS. Тип double.

Teigha.DatabaseServices.GeoLocationData.NorthDirectionVector
Свойство обеспечивает доступ к вектору направления на истинный север в проектных координатах DWG.
Свойство обеспечивает доступ к вектору направления на истинный север в проектных координатах DWG.
Returns: Возвращает направление на истинный север. Тип Vector2d.

Teigha.DatabaseServices.GeoLocationData.NumMeshPoints
Свойство возвращает общее количество точек в сети.
Свойство возвращает общее количество точек в сети.
Returns: Возвращает количество точек в сети. Тип int.

Teigha.DatabaseServices.GeoLocationData.ReferencePoint
Свойство обеспечивает доступ к координатам текущей геоточки данного объекта.
Свойство обеспечивает доступ к координатам текущей геоточки данного объекта.
Returns: Возвращает геоточку. Тип Point3d.

Teigha.DatabaseServices.GeoLocationData.ScaleEstimationMethod
Свойство обеспечивает доступ к текущему методу оценки масштаба в данном объекте GeoLocationData.
Свойство обеспечивает доступ к текущему методу оценки масштаба в данном объекте GeoLocationData.
Returns: Возвращает метод оценки масштаба как значение из перечисления Teigha.DatabaseServices.ScaleEstimationMethod.

Teigha.DatabaseServices.GeoLocationData.ScaleFactor
Свойство обеспечивает доступ к масштабному множителю данного объекта.
Свойство обеспечивает доступ к масштабному множителю данного объекта.
Returns: Возвращает масштабный множитель. Тип double.

Teigha.DatabaseServices.GeoLocationData.SeaLevelElevation
Свойство обеспечивает доступ к значению высоты над уровнем моря.
Свойство обеспечивает доступ к значению высоты над уровнем моря.
Returns: Возвращает значение высоты над уровнем моря. Тип double.

Teigha.DatabaseServices.GeoLocationData.TypeOfCoordinates
Свойство обеспечивает доступ к текущему типу проектных координат.
Свойство обеспечивает доступ к текущему типу проектных координат.
Returns: Возвращает тип координат из перечисления Teigha.DatabaseServices.TypeOfCoordinates.

Teigha.DatabaseServices.GeoLocationData.UpDirection
Свойство обеспечивает доступ  к направлению вверх в мировой системе координат DWG.
Свойство обеспечивает доступ  к направлению вверх в мировой системе координат DWG.
Returns: Возвращает направление вверх в мировой системе координат DWG.  Тип Vector3d.

Teigha.DatabaseServices.GeoLocationData.VerticalUnits
Свойство обеспечивает доступ к типу вертикальных единиц измерения.
Свойство обеспечивает доступ к типу вертикальных единиц измерения.
Returns: Возвращает тип единиц измерения из перечисления UnitsValue.

Teigha.DatabaseServices.GeoLocationData.VerticalUnitsScale
Свойство обеспечивает доступ к текущему масштабу вертикальных единиц измерения.
Этот коэффициент используется для умножения координат X или Y в базе данных для получения эквивалентного значения в метрах.
Свойство обеспечивает доступ к текущему масштабу вертикальных единиц измерения.
Этот коэффициент используется для умножения координат X или Y в базе данных для получения эквивалентного значения в метрах.
Returns: Возвращает масштаб вертикальных единиц измерения. Тип double.