Teigha.DatabaseServices.RenderGlobal.Procedure
Данное перечисление определяет доступные для рендеринга типы визуального контента (процедуры рендеринга).
Данное перечисление определяет доступные для рендеринга типы визуального контента (процедуры рендеринга).