HostMgd.PlottingServices.BeginDocumentEventHandler
Делегат BeginDocumentEventHandler предназначен для обработки события PlotReactorManager.BeginDocument,
возникающего перед началом вывода документа на плоттер.
Делегат BeginDocumentEventHandler предназначен для обработки события PlotReactorManager.BeginDocument,
возникающего перед началом вывода документа на плоттер.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события, а e передает объект PlotInfo, имя документа, количество копий, флаг печати в файл и имя файла.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип BeginDocumentEventArgs.