Teigha.DatabaseServices.DxfFiler.PushBackItem
Метод возвращает этот объект Filer на позицию, где он был до прочтения последнего элемента.
Метод возвращает этот объект Filer на позицию, где он был до прочтения последнего элемента.