Teigha.DatabaseServices.DBObject.Reappended
Событие происходит каждый раз, когда повторно
обрабатывается добавление объекта в базу данных.
Событие вызывается каждый раз, когда повторно
обрабатывается добавление объекта в базу данных.
Returns: Тип данных EventHandler, представляющий обработчик события.