Teigha.BoundaryRepresentation.BrepComplexEnumerator
Класс BrepComplexEnumerator представляет перечислитель комплексов, соответствующих объекту BREP.
Класс BrepComplexEnumerator представляет перечислитель комплексов, соответствующих объекту BREP.

Teigha.BoundaryRepresentation.BrepComplexEnumerator.Current
Свойство предоставляет доступ к текущему элементу перечислителя.
Свойство Current предоставляет доступ к текущему элементу перечислителя.
Returns: Возвращает текущий элемент перечислителя.
Тип Complex.