Teigha.DatabaseServices.AbstractViewPE.GetClass
Метод позволяет получить класс, связанный с данным расширением протокола.
Метод позволяет получить класс, связанный с данным расширением протокола.
Returns: Возвращает класс, связанный с данным расширением протокола.
Тип RXClass.