Teigha.DatabaseServices.SelectType
Перечисление SelectType определяет поддерживаемые типы выбора объектов.
Перечисление SelectType определяет поддерживаемые типы выбора объектов (рамкой или секущей рамкой).