Teigha.Geometry.KnotCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции узлов.
Метод предоставляет перечислитель для данной коллекции узлов.
Returns: Возвращает перечислитель для данной коллекции.
Тип IEnumerator.