HostMgd.ApplicationServices.Document
Класс представляет dwg-документ. Каждый чертеж ассоциируется с этим классом.
Класс представляет dwg-документ. Каждый открытый чертёж ассоциируется с объектом Document.
Этот объект содержит такую информацию об открытом чертеже, как имя файла, объект CDocument MFC, текущую базу данных и
формат для сохранения текущего чертежа.
Example

HostMgd.ApplicationServices.Document.CapturePreviewImage(UInt32,UInt32)
Метод предназначен для получения изображения предварительного просмотра документа. Метод не реализован.
Метод позволяет получить изображение предварительного просмотра для любого документа, даже если он не активен и не сохранен.
width: Ширина изображения. Тип UInt32
height: Длина изображения. Тип UInt32

HostMgd.ApplicationServices.Document.CloseAndDiscard
Метод предназначен для закрытия dwg-документа без его сохранения.
Метод закрывает dwg-документ без его сохранения.

HostMgd.ApplicationServices.Document.CloseAndSave(String)
Метод предназначен для закрытия dwg-документа с предварительным сохранением.
Метод сохраняет dwg-документ в файле, заданном именем fileName, и после закрывает документ.
fileName: Полный путь к файлу c его названием. Тип String

HostMgd.ApplicationServices.Document.Create(System.IntPtr)
Метод предназначен для создания нового документа по указателю.
Метод созданет новый безопасноый объект по значению небезопасного указателя.
unmanagedPointer: Небезопасный указатель. Тип IntPtr
Returns: Возвращает созданный объект. Тип Document

HostMgd.ApplicationServices.Document.DowngradeDocOpen(System.Boolean)
Метод предназначен для понижения статуса открытого чертежа с "доступен для записи" до "доступен для чтения".
Метод преобразует статус dwg-документа из "доступный для записи" в "доступен для чтения".
Если параметр bPromptForSave равен true и чертеж был изменен (на основании значеня dbmod), пользователю выдается предупрежедение с возможностью сохранения чертежа.
Если параметр bPromptForSave равен false, а чертеж был изменен, то возвращается ошибка.
bPromptForSave: Параметр, определяющий, необходимо ли предупрежедение о сохранении. Тип bool

HostMgd.ApplicationServices.Document.FromAcadDocument(System.Object)
Метод предназначен для преобразования объекта в тип данных Document. Метод не реализован.
Метод преобразует объект в тип данных Document.
acadDocument: Объект, который необходимо преобразовать. Тип System.Object
Returns: Возвращает преобразованный объект. Тип Document
Notes
Метод не реализован.

HostMgd.ApplicationServices.Document.LockDocument
Метод предназначен для блокировки dwg-документа в режиме .
Метод блокирует dwg-документ от записи, просмотр при таком режиме доступен.
Returns: Возвращает заблокированный документ. Тип DocumentLock

HostMgd.ApplicationServices.Document.LockDocument(HostMgd.ApplicationServices.DocumentLockMode,String,String,System.Boolean)
Метод предназначен для блокировки dwg-документа в заданном режиме, для выполнения указанной команды.
Метод блокирует dwg-документ в режиме, заданном в параметре lockMode. Также, можно указать глобальное и локализованное название команды, которая будет выполняться во время блокировки.
lockMode: Задает режим блокировки с помощью одного из значений, указанных в перечислении DocumentLockMode
globalCommandName: Глобальное имя команды, которая будет выполняться во время блокировки документа. Тип String. Может иметь значение null
localCommandName: Локальное название команды, которая будет выполняться во время блокировки документа. Тип String. Может иметь значение null
promptIfFails: Если документ не может быть заблокирован из-за того, что уже выпоняется команда над этим документом и значение параметра promptIfFails - true,
Returns: Возвращает заблокированный документ в случае его успешной блокировки. Тип DocumentLock

HostMgd.ApplicationServices.Document.LockMode
Метод позволяет приложению определить, установлены ли в dwg-документе какие-либо блокировки.
Метод проверяет, установлены ли в dwg-документе какие-либо блокировки. При проверке учитывается возможность испольняемого контекста переопределить собственные блокировки.
Если контекст имеет право на монопольную запись, он может задать и другую блокировку документа.
Returns: Возвращает самый высокий уровень блокировки, установленный исполняемым контекстом. Тип DocumentLockMode

HostMgd.ApplicationServices.Document.LockMode(System.Boolean)
Метод позволяет приложению определить, установлены ли в dwg-документе какие-либо блокировки с учетом значения параметра bIncludeMyLocks.
Метод проверяет, установлены ли в dwg-документе какие-либо блокировки. При проверке учитывается возможность испольняемого контекста переопределить собственные блокировки.
Если контекст имеет право на монопольную запись, он может задать и другую блокировку документа.
bIncludeMyLocks: Признак, показывающий, должны ли при формировании результата учитываться блокировки собственным контекстом. Тип bool
Returns: Возвращает самый высокий уровень блокировки, установленный исполняемым контекстом. Тип DocumentLockMode
Если bIncludeMyLocks = true, то метод возвращает самый высокий уровень блокировки, установленный любым выполняемым контекстом, включая и само приложение.
Если bIncludeMyLocks = false, то метод возвращает самый высокий уровень блокировки, установленный контекстом, не являющимся собственным для dwg-документа и приложения.

HostMgd.ApplicationServices.Document.PopDbmod
Метод предназначен для копирования верхнего значения из стека значений системной переменной DBMOD в системную переменную DBMOD dwg-документа. Метод не реализован.
Метод извлекает верхнее значение из стека системных переменных DBMOD и копирует это значение в системную переменную DBMOD документа.
Notes
Этот метод должен вызываться после вызова метода PushDbmod().
Не реализован.

HostMgd.ApplicationServices.Document.PushDbmod
Метод предназначен для копирования текущего значения системной переменной DBMOD, доступной только для чтения, в стэк. Метод не реализован.
Метод копирует текущее значение системной переменной DBMOD в стек. Это позволяет сохранить текущее значение системной переменной DBMOD,
доступной только для чтения, для последующего восстановления с помощью метода PopDbmod().
PushDbmod() и PopDbmod() позволяют вашему приложению изменять базу данных, не помечая ее как измененную, как это обычно делается приложениями во время инициализации сеанса редактирования.
Это включает в себя изменение переменных заголовка базы данных или добавление и модификацию объектов в редактируемой базе данных,
что приводит к установке флагов в системной переменной документа DBMOD. Когда значение DBMOD не равно нулю, при попытке пользователя выйти из чертежа выводится запрос "Сохранить ваш чертеж?".
Чтобы избежать этого запроса в вашем приложении, скопируйте текущее значение DBMOD с помощью PushDbmod(), прежде чем начинать изменять базу данных таким образом,
чтобы это не вызывало этого запроса, и восстановите DBMOD с помощью PopDbmod(), когда такие изменения будут завершены.
Notes
Вызовы функции PushDbmod() должны быть сопряжены с вызовами функции PopDbmod().
Чтобы избежать перезаписи флагов DBMOD, установленных другими приложениями,
старайтесь не вводить значение DBMOD, когда ваш код, загружающий приложение,
выполняет какие-либо действия, которые могут привести к загрузке другого приложения,
включая загрузку файлов DWG или DXF, вызов команд, определяемых приложением, и
прямую загрузку программного обеспечения.
Метод не реализован.

HostMgd.ApplicationServices.Document.SendStringToExecute(System.String,System.Boolean,System.Boolean,System.Boolean)
Метод предназначен для вызова команды с помощью строки.
Метод вызывает команду, заданную в виде строки в параметре command.
command: Команда, которая должна быть выполнена. Тип String
activate: Флаг, определяющий, должен ли результирующий документ стать активным. Тип bool
wrapUpInactiveDoc: Флаг, определяющий прекращение обработки очереди незавершенных действий текущего активного документа при очередном событии OnIdle(). Тип bool
echoCommand: Флаг, определяющий, должна ли команда быть отображена в командной строке. Тип bool

HostMgd.ApplicationServices.Document.TryGetDatabase
Метод предназначен для получения базы данных активного dwg-документа. Не реализован.
Метод пытается получить базу данных активного dwg-документа.
Returns: Возвращает базу данных dwg-документа. Тип Database
Notes
Метод не реализован

HostMgd.ApplicationServices.Document.UpgradeDocOpen
Метод предназначен для повышения статуса открытого документа с "для чтения" до "для записи".
Метод преобразует статус открытого dwg-документа из "только чтение" в "доступно для записи", если это возможно.

HostMgd.ApplicationServices.Document.AcadDocument
Свойство предоставляет доступ к COM-объекту активного dwg-документа.
Свойство предоставляет доступ к COM-объекту активного dwg-документа.
Returns: Возвращает интерфейс IDispatch документа. Тип System.Object

HostMgd.ApplicationServices.Document.CommandInProgress
Свойство предназначено для получения названия команды, которая выполняеся в данный момент.
Свойство предназначено для получения названия команды, которая выполняеся в данный момент.
Например, пусть команда определена как cip, а ее локальное имя задано как deucip. Тогда, независимо от того, как команда была введена — , cip, _cip или deucip даннный метод всегда вернет cip.
Returns: Возвращает имя выполняемой команды. Тип String

HostMgd.ApplicationServices.Document.Database
Свойство предоставляет доступ к базе данных dwg-документа.
Свойство предоставляет доступ к базе данных dwg-документа.
Returns: Возвращает базу данных dwg-документа. Тип Database

HostMgd.ApplicationServices.Document.Editor
Свойство предоставляет доступ к редактору dwg-документа.
Свойство предоставляет доступ к редактору dwg-документа.
Returns: Возвращает редактор, ассоциированный с данным документом. Тип Editor

HostMgd.ApplicationServices.Document.GraphicsManager
Метод предоставляет доступ к графическому менеджеру dwg-документа.
Метод предоставляет доступ к графическому менеджеру dwg-документа.
Returns: Возвращает графический менеждер документа. Тип Manager

HostMgd.ApplicationServices.Document.HostDocument
Свойство предоставляет доступ к COM-объекту активного dwg-документа.
Свойство предоставляет доступ к COM-объекту активного dwg-документа.
Returns: Возвращает интерфейс IDispatch dwg-документа. Тип System.Object

HostMgd.ApplicationServices.Document.IsActive
Свойство позволяет проверить, активен ли данный dwg-документ.
Свойство позволяет проверить, активен ли данный dwg-документ.
Returns: Возвращает признак того, активен документ или нет. Тип bool. При значении true документ активен, false - не активен

HostMgd.ApplicationServices.Document.IsNamedDrawing
Свойство позволяет проверить, был ли сохранен чертеж на диске.
Свойство позволяет проверить, был ли сохранен чертеж на диске.
Returns: Возвращает тип bool.
Возвращает значение true, если чертежом для этого документа является именованный файл на диске (в отличие от нового чертежа, который еще не был сохранен).

HostMgd.ApplicationServices.Document.IsReadOnly
Свойство позволяет проверить, доступен ли документ только для чтения.
Свойство позволяет проверить, доступен ли документ только для чтения.
Returns: Возвращает признак того, доступен документ только для чтения или нет. Тип bool

HostMgd.ApplicationServices.Document.Name
Свойство предоставляет полное название dwg-документа.
Свойство предоставляет полное название dwg-документа.
Returns: Полное имя dwg-документа. Тип String

HostMgd.ApplicationServices.Document.StatusBar
Свойство предоставляет доступ к строке состояния dwg-документа. Не реализовано
Свойство предоставляет доступ к строке состояния dwg-документа.
Returns: Свойство возвращает объект - строку состояния dwg-документа. Тип HostMgd.Window.StatusBar

HostMgd.ApplicationServices.Document.TransactionManager
Свойство предоставляет доступ к объекту диспетчера транзакций для этого документа.
Свойство предоставляет доступ к объекту диспетчера транзакций для этого документа.
Если приложение открывает объекты более чем из одного документа одновременно и использует транзакции, оно должно запустить отдельную транзакцию для каждого документа, используя диспетчер транзакций для каждого документа.
Returns: Полученный диспетчер транзакций документа. Тип HostMgd.ApplicationServices.TransactionManager

HostMgd.ApplicationServices.Document.UserData
Свойство предоставляет доступ к пользовательским данным.
Свойство предоставляет доступ к пользовательским данным.
Returns: Возвращает объект, предоставляющий доступ к пользовательским данным — коллекцию пар ключ/значение. Тип System.Collections.Hashtable

HostMgd.ApplicationServices.Document.Window
Свойство предоставляет доступ к окну dwg-документа.
Свойство предоставляет доступ к окну dwg-документа.
Returns: Возвращает окно dwg-документа. Тип HostMgd.Windows.Window

HostMgd.ApplicationServices.Document.BeginDocumentClose
Событие, генерируемое перед закрытием документа.
Событие, генерируемое перед закрытием документа. Позволяет разработчику вызвать метод DocumentBeginCloseEventArgs.Veto() при обработке этого события, чтобы остановить закрытие документа.
Соответствует функции NRX API NcEditorReactor2.docCloseAborted().
Returns: Возвращает тип данных HostMgd.ApplicationServices.DocumentBeginCloseEventHandler

HostMgd.ApplicationServices.Document.CloseAborted
Событие, возникающее после того, как в обработчике ветируется закрытие документа.
Событие, возникающее после того, как в обработчике ветируется закрытие документа. Это событие попадет во все реакторы, которые получают событие beginDocClose.
Соответствует функции NRX API NcEditorReactor2.docCloseAborted().
Returns: Возвращает тип данных EventHandler

HostMgd.ApplicationServices.Document.CloseWillStart
Событие, возникающее тогда же, когда и событие BeginDocumentClose.
Событие, возникающее тогда же, когда и событие BeginDocumentClose.
Соответствует функции NRX API NcEditorReactor2.docCloseWillStart().
Returns: Возвращает тип данных EventHandler

HostMgd.ApplicationServices.Document.CommandCancelled
Событие, означающее, что команда cmdStr была снята пользователем или другим приложением, и не смогла быть успешно завершена.
Событие, означающее, что команда cmdStr была снята пользователем или другим приложением, и не смогла быть успешно завершена.
Соответствует функции NRX API HostEditorReactor.commandcanceled().
Returns: Возвращает тип данных CommandEventHandler

HostMgd.ApplicationServices.Document.CommandEnded
Событие, означающее, что команда cmdStr завершена.
Событие, означающее, что команда cmdStr завершена.
Соответствует функции NRX API HostEditorReactor.commandEnded().
Returns: Возвращает тип данных CommandEventHandler

HostMgd.ApplicationServices.Document.CommandFailed
Событие, означающее что команда cmdStr аварийно завершена.
Событие, означающее что команда cmdStr аварийно завершена.
Соответствует функции NRX API HostEditorReactor.commandFailed().
Returns: Возвращает тип данных CommandEventHandler

HostMgd.ApplicationServices.Document.CommandWillStart
Событие, возникающее перед началом выполнения комманды cmdStr.
Событие, возникающее перед началом выполнения комманды cmdStr.
Соответствует функции NRX API HostEditorReactor.commandWillStart().
Returns: Возвращает тип данных CommandEventHandler

HostMgd.ApplicationServices.Document.ImpliedSelectionChanged
Событие, возникающее при изменении набора предварительно выбранных объектов в документе (pickfirst).
Событие, возникающее при изменении набора предварительно выбранных объектов в документе (pickfirst).
Оно возникает для всех действий, добавляющих или удаляющих объекты из этого набора. Действия, меняющие геометрию или свойства объектов из этого набора (растягивание, передвижение и т.д.) не вызывают этого события.
Соответствует функции NRX API HostEditorReactor.pickfirstModified().
Returns: Возвращает тип данных EventHandler

HostMgd.ApplicationServices.Document.LispCancelled
Событие, возникающее при прерывании выполнения lisp выражения в документе.
Событие, возникающее при прерывании выполнения lisp выражения в документе.
Соответствует функции NRX API HostEditorReactor.lispCancelled().
Returns: Возвращает тип данных EventHandler

HostMgd.ApplicationServices.Document.LispEnded
Событие, возникающее при прерывании выполнения lisp выражения в документе.
Событие, возникающее при прерывании выполнения lisp выражения в документе.
Соответствует функции NRX API HostEditorReactor.lispEnded().
Returns: Возвращает тип данных EventHandler

HostMgd.ApplicationServices.Document.LispWillStart
Событие, возникающее перед началом выполнения lisp выражения
в документе.
Событие, возникающее перед началом выполнения lisp выражения
в документе.
Соответствует функции NRX API HostEditorReactor.lispWillStart().
Returns: Возвращает тип данных LispWillStartEventHandler

HostMgd.ApplicationServices.Document.UnknownCommand
Событие, возникающее при вызове команды, которую nanoCAD не распознает.
Событие, возникающее при вызове команды, которую nanoCAD не распознает.
Соответствует функции NRX API NcEditorReactor.unknownCommand().
Returns: Возвращает тип данных UnknownCommandEventHandler

HostMgd.ApplicationServices.Document.ViewChanged
Событие, возникающее, когда параметры текущего вида были изменены.
Событие возникает, когда параметры текущего вида были изменены.
Returns: Возвращает тип данных EventHandler