Teigha.BoundaryRepresentation.ComplexShellCollection
Класс ComplexShellCollection представляет коллекцию оболочек, соответствующих некоторому комплексу.
Класс ComplexShellCollection представляет коллекцию оболочек, соответствующих некоторому комплексу.