Teigha.DatabaseServices.ResultBuffer.GetEnumerator
Метод предназначен для получения объекта перечислителя буфера результатов ResultBuffer.
Метод предназначен для получения объекта перечислителя буфера результатов ResultBuffer.
Returns: Возвращает объект перечислителя ResultBufferEnumerator.