Teigha.GraphicsSystem.GsModule.CreateDevice
Метод создает новое устройство Device и связывает его с данным объектом.
Метод создает новый объект Device и связывает его с данным объектом GsModule.
Returns: Возвращает новое устройство.
Тип GraphicsSystem.Device.