Teigha.Geometry.LineSegment3d
Класс LineSegment3d представляет линейные сегменты в трехмерном пространстве.
Класс LineSegment3d представляет линейные сегменты в трехмерном пространстве.

Teigha.Geometry.LineSegment3d.#ctor
Конструктор по умолчанию класса LineSegment3d.
Конструктор по умолчанию класса LineSegment3d.
Строит линейный сегмент с концами в точках (0,0,0) и (1,0,0).

Teigha.Geometry.LineSegment3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами.
Строит линейный сегмент с концами в указанных точках.
Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами.
Строит линейный сегмент с концами в точках point1 и point2.
point1: Первая входная точка (начальная).  Тип Point3d.
point2: Вторая входная точка (конечная).   Тип Point3d.

Teigha.Geometry.LineSegment3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами.
Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
Конструктор класса LineSegment3d. Создает экземпляр класса с указанными параметрами.
Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
point1: Начальная точка линейного сегмента.     Тип Point3d.
vector: Направляющий вектор линейного сегмента. Тип Vector3d. Определяет как направление, так и конечную точку линейного сегмента. Не может быть нулевой длины.

Teigha.Geometry.LineSegment3d.BaryComb(System.Double)
Метод вычисляет позицию точки на коллинеарной сегменту прямой, которая определяется средневзвешенным значением координат начальной и конечной точек данного сегмента в зависимости от указанного значения весового коэффициента.
Метод вычисляет позицию точки на коллинеарной сегменту прямой, которая определяется средневзвешенным значением координат начальной и конечной точек данного сегмента в зависимости от значения коэффициента blendCoefficient.
blendCoefficient: Коэффициент, определяющий положение средневзвешенной точки.
Returns: Возвращает средневзвешенную точку. Тип Point3d.
Возможны следующие варианты положения этой точки.
blendCoefficient     Возвращаемая позиция
-----------------------     -----------------------------
0                           Начальная точка.
1                           Конечная точка.
0.5                         Середина линейного сегмента.
0 - 1                       Промежуточная точка на этом сегменте.
1                 Точка лежит вне сегмента, но на коллинеарной ему бесконечной прямой.

Teigha.Geometry.LineSegment3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип LineSegment3d.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить начальную и конечную точки данного линейного сегмента.
Метод позволяет переопределить начальную и конечную точки данного линейного сегмента.
point1: Новая начальная точка.  Тип Point3d.
point2: Новая конечная  точка.  Тип Point3d.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
point: Новая начальная точка.     Тип Point3d.
vector: Новый направляющий вектор. Тип Vector3d. Определяет направление линейного сегмента и его конечную точку.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Point3d,System.Double)
Метод переопределяет данный объект таким образом, чтобы линейный сегмент оказался касательным к указанной кривой и проходил через заданную точку.
Метод позволяет переопределить данный объект таким образом, чтобы линейный сегмент оказался касательным к кривой curve и проходил через точку point.
Входное значение параметра parameter для кривой curve используется в качестве первоначального приближения при вычислении точки касания.
curve: Входная кривая, касательность к которой требуется обеспечить.   Тип Curve3d.
point: Входная точка, через которую должен проходить линейный сегмент. Тип Point3d.
parameter: Входное значение параметра точки на кривой curve, в которой кривая касается линейного сегмента.  Тип double.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,System.Double,System.Double)
Метод переопределяет данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым.
Метод позволяет переопределить данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым.
Входные значения параметров parameter1 для кривой curve1 и parameter2 для кривой curve2 используются в качестве первоначальных приближений при вычислении точек касания.
curve1: Первая входная кривая, касательность к которой требуется обеспечить. Тип Curve3d.
curve2: Вторая входная кривая, касательность к которой требуется обеспечить. Тип Curve3d.
parameter1: Значение параметра точки на кривой curve1, в которой кривая касается линейного сегмента. Тип double.
parameter2: Значение параметра точки на кривой curve2, в которой кривая касается линейного сегмента. Тип double.

Teigha.Geometry.LineSegment3d.EndPoint
Свойство EndPoint представляет конечную точку данного линейного сегмента.
Свойство EndPoint представляет конечную точку данного линейного сегмента.
Returns: Возвращает конечную точку линейного сегмента.
Тип Point3d.

Teigha.Geometry.LineSegment3d.Length
Свойство Length представляет длину данного линейного сегмента.
Свойство Length представляет длину данного линейного сегмента (расстояние между его начальной и конечной точками).
Returns: Возвращает длину линейного сегмента. Тип double.

Teigha.Geometry.LineSegment3d.MidPoint
Свойство MidPoint представляет среднюю точку данного линейного сегмента.
Свойство MidPoint представляет среднюю точку данного линейного сегмента.
Returns: Возвращает среднюю точку линейного сегмента. Тип Point3d.

Teigha.Geometry.LineSegment3d.StartPoint
Свойство StartPoint представляет начальную точку данного линейного сегмента.
Свойство StartPoint представляет начальную точку данного линейного сегмента.
Returns: Возвращает начальную точку линейного сегмента.
Тип Point3d.