Teigha.GraphicsInterface.TileOrder
Перечисление TileOrder определяет доступные последовательности прохождения по тайлам изображения в процессе рендеринга.
Перечисление TileOrder определяет доступные последовательности прохождения по тайлам (фрагментам) изображения в процессе рендеринга.