Teigha.LayerManager.LayerFilter.GetFilterExpressionTree
Метод позволяет получить дерево выражений только для чтения, представляющее данный фильтр.
Метод позволяет получить дерево выражений только для чтения, представляющее данный фильтр.
Может вернуть null, если фильтр не допускает такого представления.
Returns: Возвращает массив логических выражений, связанных операторами AND.
Тип AndExpression[].