Teigha.DatabaseServices.BeginWblockObjectsEventArgs
Класс представляет данные для события BeginWblockObjects базы данных.
Класс представляет данные для события BeginWblockObjects базы данных.

Teigha.DatabaseServices.BeginWblockObjectsEventArgs.From
Свойство возвращает объект базы данных, для которой выполняется операция Wblock.
Свойство возвращает объект базы данных, для которой выполняется операция Wblock.
Returns: Возвращает объект базы данных. Тип Database.

Teigha.DatabaseServices.BeginWblockObjectsEventArgs.IdMapping
Свойство предоставляет доступ к объекту IdMapping, который обеспечивает мэппинг исходных и целевых объектов.
Returns: Возвращает объект мэппинга идентификаторов объектов. Тип DatabaseServices.IdMapping.