Teigha.DatabaseServices.Point3AngularDimension
Класс Point3AngularDimension представляет в базе данных объекты углового размера по трем точкам.
Класс Point3AngularDimension представляет в базе данных объекты углового размера по трем точкам.

Teigha.DatabaseServices.Point3AngularDimension.#ctor
Конструктор по умолчанию класса Point3AngularDimension.
Конструктор по умолчанию класса Point3AngularDimension.
Создает угловой размер с вершиной угла и началами обеих выносных линий в точке (0, 0, 0).

Teigha.DatabaseServices.Point3AngularDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Конструктор класса Point3AngularDimension.
Конструктор класса Point3AngularDimension. Создает новый объект с указанными параметрами.
centerPoint: Точка вершины измеряемого угла. Тип Point3d.
line1Point: Начальная точка первой выносной линии. Тип Point3d.
line2Point: Начальная точка второй выносной линии. Тип Point3d.
arcPoint: Точка, лежащая на размерной дуге. Тип Point3d.
dimensionText: Размерный текст для замены текста измеренного значения. Тип String.
dimensionStyle: Идентификатор ObjectId размерного стиля, который следует использовать для отрисовки данного размера. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Point3AngularDimension.arcPoint
Свойство ArcPoint предоставляет доступ к трехмерным координатам (WCS) точки, располагающейся на дуге  данного размера.
Свойство ArcPoint предоставляет доступ к трехмерным координатам (WCS) точки, располагающейся на дуге  данного размера.
Returns: Возвращает точку на размерной дуге в мировой системе координат (WCS). Тип Point3d.

Teigha.DatabaseServices.Point3AngularDimension.centerPoint
Свойство CenterPoint предоставляет доступ к трехмерным координатам (WCS) вершины угла данного размера.
Свойство CenterPoint предоставляет доступ к трехмерным координатам (WCS) вершины угла данного размера.
Returns: Возвращает точку вершины угла в мировой системе координат (WCS). Тип Point3d.

Teigha.DatabaseServices.Point3AngularDimension.xLine1Point
Свойство XLine1Point представляет начальную точку первой выносной линии углового размера.
Свойство XLine1Point представляет конечную точку первой опорной линии данного размера.
Эта точка определяет начальную точку первой выносной линии углового размера.
Returns: Возвращает начальную точку первой выносной линии размера. Тип Point3d.

Teigha.DatabaseServices.Point3AngularDimension.xLine2Point
Свойство представляет начальную точку второй выносной линии углового размера.
Свойство XLine2Point представляет конечную точку второй опорной линии данного размера.
Эта точка определяет начальную точку второй выносной линии углового размера.
Returns: Возвращает начальную точку второй выносной линии углового размера.
Тип Point3d.