Teigha.DatabaseServices.Polyline3d.GetEnumerator
Метод предназначен для получения перечислителя коллекции.
Метод предназначен для получения перечислителя коллекции.
Returns: Возвращает перечислитель System.Collections.IEnumerator.