Teigha.DatabaseServices.UcsTable
Класс UcsTable реализует таблицу, которая служит контейнером для хранения в базе данных чертежа пользовательских систем координат (UCS).
Класс UcsTable реализует таблицу, которая служит контейнером для хранения в базе данных чертежа записей UCS.
Каждая запись таблицы типизирована классом UcsTableRecord и представляет собой пользовательскую систему координат.
Класс UcsTable наследует базовую функциональность предопределенных таблиц.