HostMgd.EditorInput.Editor.PromptedForNestedEntity
Событие возникает после завершения операции выбора вложенного геометрического объекта
— например, внутри блока или внешней ссылки.
Событие не реализовано.
Событие инициируется системой nanoCAD после завершения выбора вложенного объекта
— элемента, входящего в состав блока или внешней ссылки.
Оно используется в связке с методом GetNestedEntity() и предоставляет разработчикам надстроек
возможность обработать результат выбора, включая идентификатор объекта и точку,
в которой он был выбран.
Событие реализуется через делегат PromptNestedEntityResultEventHandler,
который передаёт объект PromptNestedEntityResultEventArgs, содержащий:
* ObjectId — идентификатор выбранного вложенного объекта.
* PickedPoint — точка выбора в мировой системе координат (WCS).
* Transform — матрица преобразования, применённая к объекту внутри блока.
* Status — статус завершения операции (OK, Cancel, Error и др.).
Example
C#