Teigha.DatabaseServices.HyperLink
Класс HyperLink служит базовым классом для объектов гиперссылок.
Класс HyperLink служит базовым классом для объектов гиперссылок.
Он включает следующие данные:
Наименование	Описание
--------------  --------------------------------------------
Name  			Имя файла или URL.
SubLocation     Вложенная именованная позиция (именованный вид, диапазон ячеек и т.п.).

Teigha.DatabaseServices.HyperLink.#ctor
Конструктор по умолчанию класса HyperLink.
Конструктор по умолчанию класса HyperLink.

Teigha.DatabaseServices.HyperLink.Equals(Object)
Метод предназначен для проверки равенства данного объекта указанному объекту.
Метод предназначен для проверки равенства данного объекта указанному объекту other.
other: Объект, проверяемый на равенство. Тип Object.
Returns: Возвращает true, если объекты равны. В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.HyperLink.Description
Свойство обеспечивает доступ к описанию, связанному с данным объектом HyperLink.
Свойство обеспечивает доступ к описанию, связанному с данным объектом HyperLink.
Returns: Возвращает описание данного объекта. Тип String.

Teigha.DatabaseServices.HyperLink.DisplayString
Свойство возвращает отображаемую строку вида " — ", связанную с этим объектом HyperLink.
Свойство возвращает отображаемую строку, связанную с этим объектом HyperLink.
Эта строка имеет вид " — ", если описание было задано через свойство Description.
Returns: Возвращает отображаемую строку. Тип String.

Teigha.DatabaseServices.HyperLink.IsOutermostContainer
Свойство позволяет определить, связан ли данный объект HyperLink с самым внешним контейнером.
Свойство позволяет определить, связан ли данный объект HyperLink с самым внешним контейнером.
Свойство помогает понять, какие гиперссылки доступны для редактирования в коллекции, содержащей гиперссылки-контейнеры.
Так, в случае объекта, который входит в состав блока, допускается редактировать только гиперссылки, связанные со вставкой блока.
Гиперссылки, связанные с объектом и определениями его блоков, для редактирования недоступны.
Returns: Возвращает true, если гиперссылка связана с самым внешним контейнером.
В противном случае возвращает false.

Teigha.DatabaseServices.HyperLink.Name
Свойство обеспечивает доступ к имени, которое связано с данным объектом HyperLink.
Свойство обеспечивает доступ к имени, которое связано с данным объектом HyperLink.
Returns: Возвращает имя, связанное с данным объектом. Тип String.

Teigha.DatabaseServices.HyperLink.NestedLevel
Свойство позволяет определить уровень вложенности данного объекта HyperLink.
Свойство позволяет определить уровень вложенности данного объекта HyperLink.
Returns: Возвращает уровень вложенности данного объекта. Тип int.

Teigha.DatabaseServices.HyperLink.SubLocation
Свойство обеспечивает доступ к вложенной именованной позиции, связанной с этим объектом HyperLink.
Свойство обеспечивает доступ к вложенной именованной позиции, связанной с этим объектом HyperLink.
Returns: Возвращает вложенную именованную позицию этой гиперссылки. Тип String.