Teigha.Geometry.Cylinder.GetAngles
Метод предоставляет начальный и конечный углы на базовой окружности цилиндра.
Метод предоставляет начальный и конечный углы на базовой окружности цилиндра.
Returns: Возвращает массив из двух элементов, которые определяют начальный и конечный углы, соответственно.
Тип double[].