HostMgd.EditorInput.UserInputControls.AcceptMouseUpAsPoint
Значение: 256 (0x100).
Маска определяет режим "Использовать событие отпускания кнопки мыши в момент, когда курсор находится над точкой".
По умолчанию такие события не используются для указания точек.