Teigha.DatabaseServices.SystemVariableChangedEventArgs
Класс SystemVariableChangedEventArgs представляет свойства, связанные с событиями системных переменных (после изменения системных переменных).
Класс SystemVariableChangedEventArgs представляет свойства, связанные с событиями системных переменных (после изменения системных переменных).

Teigha.DatabaseServices.SystemVariableChangedEventArgs.Changed
Свойство Changed позволяет проверить, успешно ли завершилось изменение системной переменной.
Свойство Changed позволяет проверить, успешно ли завершилось изменение системной переменной.
Returns: Возвращает true, если изменение системной переменной завершилось успешно.
В противном случае возвращает false.

Teigha.DatabaseServices.SystemVariableChangedEventArgs.Name
Свойство Name представляет имя изменённой системной переменной.
Свойство Name представляет имя изменённой системной переменной.
Returns: Возвращает имя изменённой системной переменной.
Тип String.