Teigha.DatabaseServices.Curve.ReverseCurve
Метод изменяет направление параметризации кривой на противоположное - начало кривой становится ее концом и наоборот.
Метод изменяет направление параметризации кривой на противоположное - начало кривой становится ее концом и наоборот.