Teigha.DatabaseServices.ShadePlotType
Данное перечисление определяет типы отображения теней в текущем видовом экране при выводе на печать.
Данное перечисление определяет типы отображения теней в текущем видовом экране при выводе на печать.