Teigha.Geometry.Cylinder
Класс Cylinder представляет прямые круговые цилиндры.
Класс Cylinder представляет прямые круговые цилиндры (цилиндры вращения).
Прямой круговой цилиндр определяется следующими параметрами:
* радиус,
* ось цилиндра,
* начало координат (точка на оси цилиндра),
* интервал параметра U.
Цилиндр формируется вращением образующей линии, параллельной оси симметрии и отстоящей от нее на расстоянии радиуса.
Интервал высоты цилиндра указывается относительно начала координат цилиндра.
Направление возрастания высоты цилиндра совпадает с направлением оси цилиндра.
Интервал высоты может быть неограниченным.
Цилиндр параметризуется следующим образом.
Параметр V представляет угол поворота, который измеряется от некоторого опорного направления ReferenceAxis, перпендикулярного оси цилиндра.
Для замкнутого цилиндра угол поворота определяется интервалом [-PI, +PI).
Положительное направление V определяется по правилу правой руки при движении вдоль направления оси симметрии цилиндра.
Цилиндрическая поверхность периодична по V с периодом 2PI.
Параметр U изменяется вдоль образующей линии.
Он безразмерен и по умолчанию измеряется в единицах радиуса.
Значения U обычно возрастают в направлении оси цилиндра, но может и убывать в случае отрицательной шкалы для U.
Значение U = 0 соответствует основанию цилиндра.
Параметрическая область [umin, umax] x [vmin, vmax] определяет цилиндрическую поверхность, ограниченную двумя прямыми линиями (для углов vmin и vmax) и двумя круглыми дугами (на высотах umin и umax).
В этом определении используются следующие ограничения:
* umin ;
* |vmax - vmin| ;
* радиус > 0.

Teigha.Geometry.Cylinder.#ctor(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса Cylinder.
Создает экземпляр класса с указанными осью цилиндра, началом координат и радиусом.
Конструктор класса Cylinder.
Создает экземпляр класса с указанными осью цилиндра, началом координат и радиусом.
radius: Радиус основания цилиндра. Тип double.
origin: Начало координат цилиндра. Тип Point3d.
axisOfSymmetry: Ось цилиндра. Тип Vector3d.

Teigha.Geometry.Cylinder.#ctor(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Конструктор класса Cylinder.
Создает экземпляр класса с указанными осью цилиндра, началом координат, радиусом, высотой, направлением отсчета углов, начальным и конечным углами.
Конструктор класса Cylinder.
Создает экземпляр класса с указанными осью цилиндра, началом координат, радиусом, высотой, направлением отсчета углов, начальным и конечным углами.
radius: Радиус цилиндра. Тип double.
origin: Точка на оси цилиндра в качестве начала координат. Тип Point3d.
axisOfSymmetry: Ось цилиндра. Тип Vector3d.
referenceAxis: Направление отсчета углов. Тип Vector3d.
height: Высота цилиндра. Тип Interval.
startAngle: Начальный угол. Тип double.
endAngle: Конечный угол. Тип double.

Teigha.Geometry.Cylinder.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Cylinder.

Teigha.Geometry.Cylinder.GetHeightAt(System.Double)
Метод вычисляет высоту цилиндра, которая соответствует переданному значению параметра U.
Метод вычисляет высоту цилиндра, которая соответствует переданному значению параметра U.
parameter: Значение параметра U из области определения цилиндра. Тип double.
Returns: Возвращает значение высоты, которая соответствует переданному значению parameter.
Тип double.

Teigha.Geometry.Cylinder.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя геометрическую точность по умолчанию.
Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом.
Используется вызов метода Cylinder.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) со значением точности, равным Tolerance.Global.
Notes
В случае отсутствия точек пересечения или при возникновении ошибки метод возвращает null.
linearEntity: Входной линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
Returns: Возвращает массив, состоящий из двух элементов, которые соответствуют, соответственно, первой и второй точкам пересечения (если они существуют).
Тип Point3d[].

Teigha.Geometry.Cylinder.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя указанную геометрическую точность.
Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя указанную геометрическую точность.
Найденные точки возвращаются в виде массива.
linearEntity: Входной линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
tolerance: Заданная геометрическая точность вычисления пересечений. Тип Tolerance.
Returns: Возвращает массив, состоящий ровно из двух элементов, которые соответствуют, соответственно, первой и второй точкам пересечения (если они существуют). Тип Point3d[].
Notes
В случае отсутствия точек пересечения или при возникновении ошибки метод возвращает null.

Teigha.Geometry.Cylinder.IsClosed(Teigha.Geometry.Tolerance)
Метод позволяет убедиться, что с переданной в метод точностью основание данного цилиндра можно считать полной окружностью.
Метод позволяет убедиться, что с переданной в метод точностью основание данного цилиндра можно считать полной окружностью.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если с указанной точностью основание данного цилиндра можно считать полной окружностью.
В противном случае возвращает false.

Teigha.Geometry.Cylinder.Set(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод переопределяет данный объект, используя новые ось цилиндра, его радиус и начало координат.
Метод переопределяет данный объект, используя новые ось цилиндра, его радиус и начало координат.
radius: Радиус основания цилиндра. Тип double.
origin: Начало координат цилиндра. Тип Point3d.
axisOfSymmetry: Ось цилиндра. Тип Vector3d.

Teigha.Geometry.Cylinder.Set(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Метод позволяет переопределить данный объект, используя новые ось цилиндра, начало координат, радиус, высоту, направление отсчета углов, а также начальный и конечный углы.
Метод позволяет переопределить данный объект, используя новые ось цилиндра, начало координат, радиус, высоту, направление отсчета углов, а также начальный и конечный углы.
radius: Радиус цилиндра. Тип double.
origin: Точка на оси цилиндра в качестве начала координат. Тип Point3d.
axisOfSymmetry: Ось цилиндра. Тип Vector3d.
referenceAxis: Направление отсчета углов. Тип Vector3d.
height: Высота цилиндра. Тип Interval.
startAngle: Начальный угол. Тип double.
endAngle: Конечный угол. Тип double.

Teigha.Geometry.Cylinder.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы для данного цилиндра.
Метод позволяет переопределить начальный и конечный углы для данного цилиндра.
Notes
Метод анализирует переданные значения и может корректировать начальный и конечный углы, используя их значения (начальный угол не меньше, чем конечный).
startAngle: Начальный угол. Тип double.
endAngle: Конечный угол. Тип double.

Teigha.Geometry.Cylinder.AxisOfSymmetry
Свойство AxisOfSymmetry представляет направление оси цилиндра.
Свойство AxisOfSymmetry представляет направление оси цилиндра.
Returns: Возвращает направление оси цилиндра. Тип Vector3d.

Teigha.Geometry.Cylinder.Height
Свойство Height представляет интервал для высоты данного цилиндра.
Свойство Height представляет интервал для высоты данного цилиндра.
Returns: Возвращает интервал для высоты цилиндра. Тип Interval.

Teigha.Geometry.Cylinder.IsOuterNormal
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль цилиндрической поверхности наружу.
Свойство IsOuterNormal позволяет проверить, направлена ли нормаль цилиндрической поверхности наружу.
Returns: Возвращает true, если нормаль цилиндрической поверхности направлена наружу.
В противном случае возвращает false.

Teigha.Geometry.Cylinder.Origin
Свойство Origin представляет точку начала координат данного цилиндра.
Свойство Origin представляет точку на оси цилиндра, которая служит началом координат данного цилиндра.
Returns: Возвращает точку начала координат цилиндра.
Тип Point3d.

Teigha.Geometry.Cylinder.Radius
Свойство Radius представляет радиус данного цилиндра.
Свойство Radius представляет радиус данного цилиндра.
Returns: Возвращает радиус цилиндра.
Тип double.

Teigha.Geometry.Cylinder.ReferenceAxis
Свойство ReferenceAxis предоставляет доступ к направлению отсчета углов в основании данного цилиндра.
Свойство ReferenceAxis предоставляет доступ к направлению, от которого отсчитываются углы в основании данного цилиндра.
Returns: Возвращает направление отсчета углов в основании цилиндра.
Тип Vector3d.