Teigha.DatabaseServices.FieldResult
Класс FieldResult представляет статус и результата вычисления поля.
Класс FieldResult используется вычислителями для задания статуса и результата вычисления поля.

Teigha.DatabaseServices.FieldResult.setEvaluationStatus(Teigha.DatabaseServices.FieldEvaluationStatus,System.Int32,String)
Метод задает статус вычисления поля.
Метод задает статус вычисления поля, который включает собственно статус, а также код и описание ошибки.
errorStatus: Статус ошибки. Перечисление FieldEvaluationStatus.
errorCode: Код ошибки. Тип int.
errorMessage: Описание ошибки. Тип String.

Teigha.DatabaseServices.FieldResult.SetFieldValue(Object)
Метод задает результат вычисления поля.
Метод задает результат вычисления поля.
pValue: Входное значения поля, которое требуется задать. Тип Object.