Teigha.Colors
Пространство имен Teigha.Colors включает классы и перечисления, которые обеспечивают объекты чертежа функционалом для манипуляций цветами и прозрачностью, а также для преобразования цветов между цветовыми пространствами.
Пространство имен Teigha.Colors включает классы и перечисления, которые обеспечивают объекты чертежа функционалом для манипуляции цветами и прозрачностью, а также для преобразования значений цвета между цветовыми пространствами.