Teigha.DatabaseServices.Sun
Класс Sun представляет свойства, связанные с объектом солнца.
Класс Sun представляет свойства, связанные с объектом солнца.

Teigha.DatabaseServices.Sun.#ctor
Конструктор по умолчанию класса Sun.
Конструктор по умолчанию класса Sun.

Teigha.DatabaseServices.Sun.Altitude
Свойство Altitude представляет высоту солнца над горизонтом.
Свойство Altitude представляет высоту солнца.
Это угол между горизонтом и направлением на солнце, измеряемый от горизонта.
Высота солнца находится в диапазоне от 0 (горизонт) до Pi/2 радиан (зенит).
Returns: Возвращает высоту солнца в радианах. Тип double.

Teigha.DatabaseServices.Sun.Azimuth
Свойство Azimuth представляет азимут солнца.
Свойство Azimuth представляет азимут солнца.
Это угол от истинного севера до направления на солнце по часовой стрелке.
Угол азимута находится в диапазоне от 0 (север) до 2*Pi (север); промежуточные значения — Pi/2 (восток), Pi (юг) и 3*Pi/2 (запад).
Returns: Возвращает азимут солнца (в радианах). Тип double.

Teigha.DatabaseServices.Sun.DateTime
Свойство DateTime представляет дату и время, используемые для калькулятора солнечных углов.
Свойство DateTime представляет дату и время, используемые для калькулятора солнечных углов.
Returns: Возвращает дату и время.
Тип System.DateTime.

Teigha.DatabaseServices.Sun.Intensity
Свойство Intensity представляет значение интенсивности солнечного освещения.
Свойство Intensity представляет значение интенсивности солнечного освещения.
Returns: Возвращает интенсивность солнечного освещения. Тип double.

Teigha.DatabaseServices.Sun.IsDaylightSavingsOn
Свойство IsDaylightSavingsOn представляет статус флага учета перехода на летнее время, который используется калькулятором солнечных углов.
Свойство IsDaylightSavingsOn представляет статус флага учета перехода на летнее время, который используется калькулятором солнечных углов.
Returns: Возвращает true, если учет перехода на летнее время включен.
В противном случае возвращает false.

Teigha.DatabaseServices.Sun.IsOn
Свойство IsOn представляет состояние флага учета солнечного освещения.
Свойство IsOn представляет состояние флага учета солнечного освещения.
Returns: Возвращает true, если солнечное освещение учитывается.
В противном случае возвращает false.

Teigha.DatabaseServices.Sun.ShadowParameters
Свойство ShadowParameters представляет параметры теней, связанных с солнечным освещением.
Свойство ShadowParameters представляет параметры теней, связанных с солнечным освещением.
Returns: Возвращает параметры теней как объект типа GraphicsInterface.ShadowParameters.

Teigha.DatabaseServices.Sun.SunColor
Свойство SunColor представляет цвет солнечного освещения.
Свойство SunColor представляет цвет солнечного освещения.
Returns: Возвращает цвет солнечного освещения. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.Sun.SunDirection
Свойство SunDirection представляет направление от солнца к модели.
Свойство SunDirection представляет направление от солнца к модели.
Returns: Возвращает направление от солнца к модели.  Тип Vector3d.