HostMgd.EditorInput.PromptStringOptionsEventArgs
Класс предоставляет данные для события PromptingForString,
позволяя настроить параметры ввода строки перед её началом.
Класс используется для передачи параметров, применяемых
при начале операции ввода текстовой строки — например,
при вызове метода GetString(). Он предоставляет доступ
к объекту PromptStringOptions, содержащему настройки команды ввода:
* текст приглашения,
* ключевые слова,
* глобальные ключевые слова,
* разрешение на пустой ввод,
* режим ввода (только ключевые слова или произвольный текст) и т.п.
Этот класс применяется в обработчике события PromptingForString,
где разработчик может динамически изменять параметры ввода
в зависимости от контекста — например, задать подсказку, добавить
пользовательские команды или ограничить ввод списком допустимых значений.
Example
C#

HostMgd.EditorInput.PromptStringOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при операции ввода строки.
Свойство предоставляет доступ к настройкам, применяемым к интерактивной команде ввода текста
— например, при вызове метода GetString(). Оно используется в обработчике события PromptingForString,
чтобы дать разработчику возможность изменить параметры ввода до начала взаимодействия с пользователем.
Через это свойство можно настроить:
* текст приглашения,
* ключевые слова,
* глобальные ключевые слова,
* разрешение на пустой ввод,
* режим ввода (только ключевые слова или произвольный текст) и т.п.
Returns: Возвращает объект типа PromptStringOptions. Если параметры не были инициализированы, может вернуть null.
Example
C#