Teigha.DatabaseServices.SolidBackground
Класс SolidBackground представляет сплошной фон.
Класс SolidBackground представляет сплошной фон.

Teigha.DatabaseServices.SolidBackground.#ctor
Конструктор по умолчанию класса SolidBackground.
Конструктор по умолчанию класса SolidBackground.

Teigha.DatabaseServices.SolidBackground.Color
Свойство Color представляет цвет данного фона.
Свойство Color представляет цвет данного фона.
Returns: Возвращает цвет фона. Тип Teigha.Colors.EntityColor.