Teigha.Geometry.Line2d
Класс Line2d представляет бесконечную линию в двумерном пространстве.
Класс Line2d представляет бесконечную линию в двумерном пространстве.

Teigha.Geometry.Line2d.#ctor
Конструктор по умолчанию класса Line2d.
Создает бесконечную линию, совпадающую с осью X системы координат.
Конструктор по умолчанию класса Line2d.
Создает бесконечную линию, совпадающую с осью X системы координат.

Teigha.Geometry.Line2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса Line2d.
Строит линию, проходящую через две заданные несовпадающие точки.
Конструктор класса Line2d.
Строит линию, проходящую через две заданные несовпадающие точки.
point1: Первая заданная точка.  Тип Point2d.
point2: Вторая заданная точка.  Тип Point2d.

Teigha.Geometry.Line2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Конструктор класса Line2d.
Создает бесконечную линию, которая проходит через заданную точку и имеет указанный направляющий вектор.
Конструктор класса Line2d.
Создает бесконечную линию, которая проходит через заданную точку и имеет указанный направляющий вектор.
point: Входная точка. Тип Point2d.
vector: Входной направляющий вектор. Тип Vector2d. Должен иметь ненулевую длину.

Teigha.Geometry.Line2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Line2d.

Teigha.Geometry.Line2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод позволяет переопределить данную прямую, используя две новых опорных точки.
Метод позволяет переопределить данную прямую, используя две новых опорных точки.
point1: Первая точка, через которую проходит прямая. Тип Point2d.
point2: Вторая точка, через которую проходит прямая. Тип Point2d.

Teigha.Geometry.Line2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Метод позволяет переопределить данную прямую, используя новые опорную точку и направляющий вектор.
Метод позволяет переопределить данную прямую, используя новые опорную точку и направляющий вектор.
point: Новая точка, через которую проходит прямая. Тип Point2d.
vector: Новый направляющий вектор прямой. Тип Vector2d.