Teigha.DatabaseServices.MText.ConvertFieldToText
Метод позволяет преобразовать существующие в данном объекта MText поля в обычный текст с последующим удалением полей.
Метод позволяет преобразовать существующие в данном объекта MText поля в обычный текст.
Преобразование завершается удалением полей.
Перед преобразованием поля не перевычисляются.