Teigha.DatabaseServices.BlockTableRecordEnumerator.MoveNext
Метод реализует переход перечислителя к следующему блоку в объекте BlockTableRecord.
Метод реализует переход перечислителя к следующему блоку в объекте BlockTableRecord.
Returns: Возвращает true, если индекс текущего блока  не превышает количество элементов в коллекции. В противном случае возвращает false.