Teigha.DatabaseServices.LayoutManager
Этот интерфейсный класс обслуживает специфичные для базы данных процедуры, которые управляют объектами листа и предоставляют к ним доступ.
Этот интерфейсный класс обслуживает специфичные для базы данных процедуры, которые управляют объектами листа и предоставляют к ним доступ.

Teigha.DatabaseServices.LayoutManager.CloneLayout(String,String,System.Int32)
Метод клонирует заданный объект Layout, присваивает клонированному листу указанное имя и положение соответствующей вкладки.
Метод клонирует заданный объект Layout, присваивает клонированному листу указанное имя и положение соответствующей вкладки.
copyName: Имя клонируемого листа, String.
newName: Имя нового листа, String.
newTabOrder: Опциональный аргумент, определяющий место листа среди вкладок, тип int.

Teigha.DatabaseServices.LayoutManager.CopyLayout(String,String)
Метод копирует существующий объект Layout с именем copyName в новый лист с именем newName.
Метод копирует существующий объект Layout с именем copyName в новый лист с именем newName.
copyName: Имя существующего объекта Layout, копию которого следует создать, тип String.
newName: Имя нового объекта Layout, который должен быть копией листа copyName, тип String.

Teigha.DatabaseServices.LayoutManager.CreateLayout(String)
Метод создает новый объект Layout с уникальным именем листа.
Метод создает новый объект Layout с уникальным именем листа.
Видовые экраны по умолчанию для нового листа не создаются до тех пор, пока этот лист не будет впервые активирован.
newName: Имя нового объекта Layout, тип String.
Returns: Возвращает ObjectId созданного объекта Layout.

Teigha.DatabaseServices.LayoutManager.DeleteLayout(String)
Метод удаляет из текущей базы данных объект Layout с именем deleteName.
Метод удаляет из текущей базы данных объект Layout с именем deleteName.
deleteName: Имя удаляемого объекта Layout, тип string.

Teigha.DatabaseServices.LayoutManager.GetLayoutId(String)
Метод возвращает ObjectId объекта Layout, заданного по имени.
Метод возвращает ObjectId объекта Layout с указанным именем name.
По умолчанию возвращаемый объект не открыт ни для чтения из базы данных, ни для записи в нее.</p
name: Имя искомого объекта Layout, тип String.
Returns: Возвращает ObjectId объекта Layout с именем name.

Teigha.DatabaseServices.LayoutManager.GetNonRectangularViewportIdFromClipId(Teigha.DatabaseServices.ObjectId)
Метод определяет ObjectId непрямоугольного видового экрана, связанного с указанным clipId.
Возвращает NULL, если данный объект не является допустимым контуром подрезки.
Метод определяет ObjectId непрямоугольного видового экрана, связанного с указанным clipId.
Возвращает NULL, если данный объект не является допустимым контуром подрезки.
clipId:
name: ObjectId контура подрезки, из которого нужно получить идентификатор непрямоугольного видового экрана, тип ObjectId.
Returns: Возвращает ObjectId для непрямоугольного видового экрана, ассоциированного с указанным clipId.

Teigha.DatabaseServices.LayoutManager.RenameLayout(String,String)
Метод присваивает новое имя newName объекту Layout с именем oldName.
Метод присваивает новое имя newName объекту Layout с именем oldName.
oldName: Текущее имя объекта Layout, тип String.
newName: Новое имя объекта Layout, тип String.

Teigha.DatabaseServices.LayoutManager.Current
Свойство предоставляет доступ к текущему менеджеру листов LayoutManager.
Свойство предоставляет доступ к текущему менеджеру листов LayoutManager.
Returns: Возвращает объект типа LayoutManager.

Teigha.DatabaseServices.LayoutManager.CurrentLayout
Свойство предоставляет имя текущего листа.
Свойство предоставляет имя текущего листа.
Returns: Возвращает имя текущего листа, тип string.

Teigha.DatabaseServices.LayoutManager.LayoutCount
Свойство предоставляет доступ к текущему количеству листов.
Свойство предоставляет доступ к текущему количеству листов.
Returns: Возвращает текущее количество листов, тип int.