HostMgd.EditorInput.JigPrompts.AcquireDistance
Метод запрашивает у пользователя расстояние.
Метод предназначен для запроса у пользователя расстояния. В основном применяется для интерактивного увеличения или уменьшения
объекта или группы объектов, либо их перемещения. После вызова создает пустой экземпляр класса JigPromptDistanceOptions и
вызывает свою перегрузку JigPrompts.AcquireDistance(JigPromptDistanceOptions options).
Returns: Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши
и значений настроек, выбранных пользователем, либо посредством ввода с клавиатуры.