HostMgd.ApplicationServices.ProfileEventHandler
Делегат предназначен для обработки событий класса UserConfigurationManager, возникающих в процессах управления пользовательскими профилями.
Делегат ProfileEventHandler определяет тип обработчика события класса UserConfigurationManager, таких как
CurrentProfileChanged, CurrentProfileReset и др., возникающих в процессах управления пользовательскими профилями, а также связанными с ними диалоговыми разделами реестра Windows для хост-приложений nanoCAD.
Контекст события передается через параметры sender и e, где e содержит имя профиля.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип ProfileEventArgs.