HostMgd.ApplicationServices.InplaceTextEditorSettings.EntityType
Данное перечисление определяет поддерживаемые типы исходных объектов для встроенного текстового редактора.
Перечисление EntityType определяет поддерживаемые типы исходных объектов для встроенного текстового редактора.
Notes
В случае сложного исходного объекта, например, ячейки таблицы или многострочного атрибута, можно создавать копию объекта MTEXT в памяти.