HostMgd.EditorInput.PromptStringOptions
Класс предоставляет параметры для настройки интерактивного ввода строки
в nanoCAD, такие как сообщение, ключевые слова и режимы ввода.
Класс используется при вызове метода GetString()
для настройки поведения команды ввода текстовой строки.
С его помощью можно задать:
* текст приглашения,
* локальные ключевые слова, отображаемые в формате [Ключ1/Ключ2],
* глобальные ключевые слова,
* разрешение на пустой ввод,
* режим ввода — только из списка ключевых слов или с разрешением произвольного текста.
Класс используется совместно с событиями PromptingForString и PromptedForString,
что позволяет как настраивать параметры до ввода, так и обрабатывать результат после завершения.
Example
C#

HostMgd.EditorInput.PromptStringOptions.#ctor(System.String)
Конструктор инициализирует новый экземпляр класса
с заданным приглашающим сообщением для ввода строки.
Конструктор создаёт объект класса PromptStringOptions,
используемый при настройке операции ввода текстовой строки —
например, через метод GetString(). Он устанавливает основное сообщение,
отображаемое в командной строке, которое подсказывает пользователю,
какое значение следует ввести. После создания объекта
можно дополнительно настроить параметры ввода, такие как
ключевые слова, разрешение на пустой ввод или глобальные команды.
message: Текст приглашения, отображаемый пользователю в командной строке.
Пример: "Введите имя слоя

HostMgd.EditorInput.PromptStringOptions.AllowSpaces
Свойство определяет, разрешены ли пробелы во вводимой пользователем строке.
Свойство указывает, может ли введённая пользователем строка
содержать пробелы. По умолчанию ввод строк в командной строке
nanoCAD завершается при нажатии пробела или Enter, что делает
пробел разделителем. Если AllowSpaces установлено в true,
пробелы в строке разрешаются, и ввод продолжается до нажатия Enter,
что позволяет вводить многословные имена — например,
"Главный чертёж", "Описание проекта", "Секция A — Пояснения".
Если AllowSpaces = false (по умолчанию), пробел завершает ввод,
и строка обрезается до первого пробела.
Returns: Возвращает значение типа bool:
* true — пробелы разрешены во вводимой строке.
* false — пробелы не разрешены, ввод строки
завершается при первом пробеле.
Example
C#

HostMgd.EditorInput.PromptStringOptions.DefaultValue
Свойство возвращает или устанавливает значение по умолчанию,
используемое при вводе строки, если пользователь нажимает Enter без ввода текста.
Свойство позволяет задать строку, которая будет применена
как результат ввода, если пользователь завершает команду
нажатием Enter, не вводя собственное значение.
Это особенно полезно при реализации команд, где требуется ввод текста,
но допустимо использование стандартного значения — например,
при задании имени слоя, стиля, комментария или метки.
Для того чтобы значение по умолчанию применялось,
необходимо также установить AllowNone = true,
что разрешает завершение ввода без явного ввода.
Returns: Возвращает строку (string), установленную как значение по умолчанию.
* Если значение задано — оно будет использовано при нажатии Enter без ввода.
* Если null или пустая строка — по умолчанию будет возвращена пустая строка
или ввод будет отклонён, если AllowNone = false.
Example
C#

HostMgd.EditorInput.PromptStringOptions.UseDefaultValue
Свойство определяет, будет ли использоваться значение по умолчанию
при вводе строки, если пользователь нажмёт Enter без ввода текста.
Свойство указывает, должно ли значение, заданное в свойстве DefaultValue,
применяться автоматически, когда пользователь завершает ввод нажатием Enter
без ввода собственной строки.
Если UseDefaultValue = true, и DefaultValue задано, оно будет возвращено как результат ввода.
Если UseDefaultValue = false, значение по умолчанию игнорируется, даже если оно задано.
Для корректной работы необходимо также установить AllowNone = true,
чтобы разрешить завершение ввода без текста.
Returns: Возвращает значение типа bool:
* true — значение по умолчанию (DefaultValue) будет использовано при пустом вводе.
* false — значение по умолчанию игнорируется, даже если оно задано.
Example
C#