Teigha.DatabaseServices.DwfReference
Этот класс представляет ссылки на подложки DWF на чертеже.
Этот класс представляет ссылки на подложки DWF на чертеже.
Подложки аналогичны растровым изображениям, за исключением того, что их контент допускает объектные привязки.

Teigha.DatabaseServices.DwfReference.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.