HostMgd.EditorInput.Transient
Класс Transient представляет временные объекты, создаваемые редактором nanoCAD.
В текущей версии не реализован.
Класс Transient наследует класс Drawable и представляет временные объекты, создаваемые редактором nanoCAD.
В текущей версии не реализован.

HostMgd.EditorInput.Transient.CapturedDrawable
Свойство CapturedDrawable представляет связанный отображаемый объект в графическом интерфейсе.
Не реализовано.
Свойство CapturedDrawable представляет связанный отображаемый объект в графическом интерфейсе.
В текущей версии не реализовано.
Returns: Возвращает связанный отображаемый объект.
Тип Teigha.GraphicsInterface.Drawable.

HostMgd.EditorInput.Transient.Id
Свойство Id представляет идентификатор объекта для данного временного объекта.
Не реализовано.
Свойство Id представляет идентификатор объекта для данного временного объекта.
В текущей версии не реализовано.
Returns: Возвращает идентификатор объекта.
Тип DatabaseServices.ObjectId.

HostMgd.EditorInput.Transient.IsPersistent
Свойство IsPersistent позволяет проверить, связан ли данный объект с постоянным объектом базы данных.
Не реализовано.
Свойство IsPersistent позволяет проверить, связан ли данный объект с постоянным объектом базы данных.
В текущей версии не реализовано.
Returns: Возвращает true, если данный объект связан с постоянным объектом базы данных.
В противном случае возвращает false.