Teigha.Geometry.Vector2d
Структура Vector2d представляет векторы в двумерном пространстве.
Структура Vector2d представляет векторы в двумерном пространстве.
Её экземпляры можно рассматривать как двухэлементный массив[2] чисел двойной точности.

Teigha.Geometry.Vector2d.#ctor(System.Double,System.Double)
Конструктор структуры Vector2d.
Создает новый 2D-вектор с указанными координатами.
Конструктор структуры Vector2d.
Создает новый 2D-вектор с указанными координатами x и y.
x: Координата X нового вектора. Тип double.
y: Координата Y нового вектора. Тип double.

Teigha.Geometry.Vector2d.#ctor(array)
Конструктор структуры Vector2d.
Создает новый 2D-вектор с координатами из указанного массива.
Конструктор структуры Vector2d.
Создает новый 2D-вектор с координатами из первых двух элементов массива xy.
xy: Массив координат создаваемого вектора. Тип double[]. Используются только первые два значения из переданного массива.

Teigha.Geometry.Vector2d.Add(Teigha.Geometry.Vector2d)
Метод реализует векторное сложение данного вектора с другим 2D-вектором.
Метод реализует векторное сложение данного вектора с другим 2D-вектором v.
v: Входной вектор, используемый в качестве второго слагаемого в векторной сумме. Тип Vector2d.
Returns: Возвращает векторную сумму данного вектора и вектора v.  Тип Vector2d.

Teigha.Geometry.Vector2d.DivideBy(System.Double)
Метод реализует деление компонент данного вектора на переданное вещественное значение.
Метод реализует деление компонент данного вектора на переданное вещественное значение.
value: Входное значение делителя. Тип double.
Returns: Возвращает результат деления вектора на вещественное число.
Тип Vector2d.

Teigha.Geometry.Vector2d.DotProduct(Teigha.Geometry.Vector2d)
Метод реализует скалярное произведение данного вектора с указанным 2D-вектором.
Метод реализует скалярное произведение данного вектора с указанным 2D-вектором.
v: Входной 2D-вектор, являющийся сомножителем в скалярном произведении. Тип Vector2d.
Returns: Возвращает результат скалярного произведения векторов.
Тип double.

Teigha.Geometry.Vector2d.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если данный вектор равен входному объекту obj.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.GetAngleTo(Teigha.Geometry.Vector2d)
Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором.
Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором vector.
vector: Входной двумерный вектор. Тип Vector2d.
Returns: Возвращает угол в радианах между двумя двумерными векторами в интервале [0, Pi].
Тип double.

Teigha.Geometry.Vector2d.GetNormal(Teigha.Geometry.Tolerance)
Метод предоставляет единичный вектор, сонаправленный данному вектору в пределах заданной точности.
Метод позволяет получить единичный вектор, сонаправленный данному вектору в пределах заданной точности tolerance.
Notes
Результирующий вектор не нормируется, если длина исходного вектора меньше, чем Tolerance.EqualVector.
В таком случае возвращаемый вектор совпадает с исходным.
tolerance: Заданная точность. Тип Tolerance.
Returns: Возвращает единичный вектор, сонаправленный данному вектору.
Тип Vector2d.

Teigha.Geometry.Vector2d.IsCodirectionalTo(Teigha.Geometry.Vector2d)
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору в пределах точности по умолчанию.
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору vector.
Используется вызов метода Vector2d.IsCodirectionalTo(Vector2d vector, Tolerance tolerance)
с точностью по умолчанию Tolerance.EqualVector.
vector: Входной вектор, сравниваемый на сонаправленность с данным вектором. Тип Vector2d.
Returns: Возвращает true, если в пределах точности по умолчанию векторы можно считать сонаправленными.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsCodirectionalTo(Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору в пределах некоторой заданной точности.
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору vector в пределах некоторой заданной точности.
Notes
Реализация приводит оба вектора к единичной длине, а затем проверяет их совпадение в пределах предписанной точности tolerance.
vector: Входной вектор, сравниваемый на сонаправленность с данным вектором. Тип Vector2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах предписанной точности оба вектора можно считать сонаправленными.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsEqualTo(Teigha.Geometry.Vector2d)
Метод позволяет проверить, совпадает ли входной вектор с данным вектором.
Метод позволяет проверить, совпадает ли входной вектор с данным вектором.
Реализация использует вызов Vector2d.IsEqualTo(Vector2d vector, Tolerance tolerance)
с точностью по умолчанию Tolerance.EqualVector.
Notes
Векторы считаются равными, если совпадают все соответствующие координаты обоих векторов.
vector: Проверяемый вектор. Тип Vector2d.
Returns: Возвращает true, если в пределах используемой точности совпадают все соответствующие координаты обоих векторов.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsEqualTo(Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадает ли входной вектор с данным вектором в пределах некоторой заданной точности.
Метод позволяет проверить, совпадает ли входной вектор с данным вектором в пределах некоторой заданной точности.
Notes
Векторы считаются равными, если в пределах предписанной точности совпадают все соответствующие координаты обоих векторов.
vector: Проверяемый вектор. Тип Vector2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой точности совпадают все соответствующие координаты обоих векторов.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsParallelTo(Teigha.Geometry.Vector2d)
Метод позволяет проверить, параллелен ли входной вектор данному вектору.
Метод позволяет проверить, параллелен ли входной вектор vector данному вектору.
Реализация использует вызов метода Vector2d.IsParallelTo(Vector2d vector, Tolerance tolerance) с точностью по умолчанию Tolerance.EqualVector.
vector: Проверяемый вектор. Тип Vector2d.
Returns: Возвращает true, если в пределах используемой точности входной вектор можно считать параллельным данному вектору.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsParallelTo(Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, параллелен ли входной вектор данному вектору в пределах заданной точности.
Метод позволяет проверить, параллелен ли входной вектор vector данному вектору в пределах заданной точности tolerance.
Notes
Реализация приводит оба вектора к единичной длине. В случае отрицательного скалярного произведения векторов, изменяет направление входного вектора на противоположное. Затем выполняется проверка на совпадение полученных векторов в пределах заданной точности tolerance.
vector: Проверяемый вектор. Тип Vector2d.
tolerance: Заданная точность сравнения. Тип Tolerance.
Returns: Возвращает true, если в пределах указанной точности оба вектора можно считать параллельными.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsPerpendicularTo(Teigha.Geometry.Vector2d)
Метод проверяет перпендикулярность входного вектора данному вектору.
Метод проверяет перпендикулярность входного вектора vector данному вектору.
Реализация использует вызов метода Vector2d.IsPerpendicularTo(Vector2d vector, Tolerance tolerance) с точностью по умолчанию
Tolerance.EqualVector.
vector: Проверяемый вектор. Тип Vector2d.
Returns: Возвращает true, если в пределах используемой точности векторы можно считать перпендикулярными.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsPerpendicularTo(Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance)
Метод проверяет перпендикулярность входного вектора данному вектору в пределах заданной точности.
Метод проверяет перпендикулярность входного вектора vector данному вектору в пределах заданной точности tolerance.
Notes
Реализация приводит оба вектора к единичной длине и вычисляет их скалярное произведение.
Векторы считаются перпендикулярными, если полученное значение по модулю не превышает входное значение tolerance.
vector: Проверяемый вектор. Тип Vector2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой точности векторы можно считать перпендикулярными.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsUnitLength(Teigha.Geometry.Tolerance)
Метод проверяет, является ли данный вектор единичным в пределах указанной точности.
Метод проверяет, является ли данный вектор единичным в пределах указанной точности tolerance.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный вектор можно считать единичным.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.IsZeroLength(Teigha.Geometry.Tolerance)
Метод проверяет, является ли данный вектор нулевым в пределах указанной точности.
Метод проверяет, является ли данный вектор нулевым в пределах указанной точности.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance длина данного вектора равна нулю.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.Mirror(Teigha.Geometry.Vector2d)
Метод позволяет получить вектор, который является результатом зеркального отражения данного вектора относительно заданного направления в той же плоскости.
Метод позволяет получить вектор, который является результатом зеркального отражения данного вектора относительно заданного направления в той же плоскости.
line: Линия зеркального отражения. Тип Vector2d.
Returns: Возвращает зеркальное отражение данного вектора.
Тип Vector2d.

Teigha.Geometry.Vector2d.MultiplyBy(System.Double)
Метод реализует умножение данного вектора на заданное число.
Метод реализует умножение данного вектора на заданное вещественное число value.
value: Входное значение скалярного множителя. Тип double.
Returns: Возвращает результат умножения данного вектора на скаляр value.
Тип Vector2d.

Teigha.Geometry.Vector2d.RotateBy(System.Double)
Метод вращает данный вектор на указанный угол.
Метод вращает данный вектор на указанный угол angle.
Notes
Положительным направлением поворота считается направление вращения от оси X к оси Y.
angle: Заданный угол вращения в радианах. Тип double.
Returns: Возвращает вектор, который является результатом вращения данного вектора на угол angle.
Тип Vector2d.

Teigha.Geometry.Vector2d.Subtract(Teigha.Geometry.Vector2d)
Метод реализует вычитание указанного вектора из данного вектора.
Метод вычитает вектор v из данного вектора.
v: Вычитаемый вектор. Тип Vector2d.
Returns: Возвращает результат векторного вычитания.
Тип Vector2d.

Teigha.Geometry.Vector2d.ToString(IFormatProvider)
Метод реализует эквивалентное строковое представление данного вектора с учетом региональных и языковых настроек.
Метод реализует эквивалентное строковое представление данного вектора с учетом региональных и языковых настроек, определяемых указанным провайдером provider.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данного вектора.
Тип String.

Teigha.Geometry.Vector2d.ToString(String,IFormatProvider)
Метод реализует эквивалентное строковое представление данного вектора в предписанном формате и с учетом региональных и языковых настроек.
Метод реализует эквивалентное представление данного вектора в виде текстовой строки, формат которой задается аргументом format, а региональные и языковые настройки определяются указанным провайдером provider.
format: Входной формат строки.  Тип String.
provider: Провайдер региональных и языковых настроек.  Тип IFormatProvider.
Returns: Возвращает строковое представление данного вектора.
Тип String.

Teigha.Geometry.Vector2d.TransformBy(Teigha.Geometry.Matrix2d)
Метод применяет к данному вектору указанное геометрическое преобразование.
Метод применяет к данному вектору указанное геометрическое преобразование leftSide.
leftSide: Входное геометрическое преобразование.  Тип Matrix2d.
Returns: Возвращает результат геометрического преобразования данного вектора leftSide х vector^T.
Тип Vector2d.

Teigha.Geometry.Vector2d.!=(Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Оператор неравенства для класса Vector2d.
Оператор неравенства для класса Vector2d.
a: Левый операнд.  Тип Vector2d.
b: Правый операнд. Тип Vector2d.
Returns: Возвращает true, если соответствующие координаты векторов не совпадают.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.-(Teigha.Geometry.Vector2d)
Оператор изменяет направление вектора на противоположное.
Оператор возвращает вектор, который противоположен по направлению входному вектору a и имеет координаты (-x, -y).
a: Входной вектор. Тип Vector2d.
Returns: Возвращает вектор, который противоположен по направлению входному вектору a. Тип Vector2d.

Teigha.Geometry.Vector2d.-(Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Оператор вычитания для класса Vector2d.
Оператор реализует операцию векторного вычитания вектора b из вектора a.
a: Левый операнд.  Тип Vector2d.
b: Правый операнд. Тип Vector2d.
Returns: Возвращает 2D-вектор, который является результатом векторного вычитания a - b.
Тип Vector2d.

Teigha.Geometry.Vector2d.*(System.Double,Teigha.Geometry.Vector2d)
Оператор реализует умножение скалярного множителя на 2D-вектор.
Оператор реализует умножение скалярного множителя factor на 2D-вектор a.
factor: Левый операнд.  Тип double.
a: Правый операнд. Тип Vector2d.
Returns: Возвращает результат умножения скалярного множителя factor на 2D-вектор a. Тип Vector2d.

Teigha.Geometry.Vector2d.*(Teigha.Geometry.Matrix2d,Teigha.Geometry.Vector2d)
Оператор геометрического преобразования 2D-вектора.
Оператор геометрического преобразования 2D-вектора.
Оператор возвращает вектор, равный произведению матрицы преобразования a на вектор b, представленный в виде столбца.
a: Левый операнд.  Тип Matrix2d.
b: Правый операнд. Тип Vector2d.
Returns: Возвращает вектор, являющийся результатом произведения a х b^T.
Тип Vector2d.

Teigha.Geometry.Vector2d.*(Teigha.Geometry.Vector2d,System.Double)
Оператор реализует умножение 2D-вектора на скалярный множитель.
Оператор реализует умножение 2D-вектора a на скалярный множитель factor.
a: Левый  операнд. Тип Vector2d.
factor: Правый операнд. Тип double.
Returns: Возвращает результат умножения 2D-вектора a на скалярный множитель factor.
Тип Vector2d.

Teigha.Geometry.Vector2d./(Teigha.Geometry.Vector2d,System.Double)
Оператор деления 2D-вектора на скалярный делитель.
Оператор реализует деление 2D-вектора a на скалярный делитель factor.
a: Левый  операнд. Тип Vector2d.
factor: Правый операнд. Тип double.
Returns: Возвращает вектор, который получен делением 2D-вектора a на скалярный делитель factor.
Тип Vector2d.

Teigha.Geometry.Vector2d.+(Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Оператор сложения для класса Vector2d.
Оператор создает 2D-вектор, который является векторной суммой двух заданных 2D-векторов.
a: Левый операнд.  Тип Vector2d.
b: Правый операнд. Тип Vector2d.
Returns: Возвращает вектор, который является векторной суммой 2D-векторов a + b.
Тип Vector2d.

Teigha.Geometry.Vector2d.==(Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Оператор равенства для класса Vector2d.
Оператор проверяет равенство двух заданных 2D-векторов.
a: Левый операнд.  Тип Vector2d.
b: Правый операнд. Тип Vector2d.
Returns: Возвращает true, если векторы a и b равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.Vector2d.Angle
Свойство Angle представляет угол между данным вектором и осью X.
Свойство Angle представляет угол между данным вектором и осью X в диапазоне [0, 2 * Pi].
Returns: Возвращает угол в радианах между данным вектором и осью X в диапазоне [0, 2 * Pi].
Тип double.

Teigha.Geometry.Vector2d.Coordinate
Свойство Coordinate предоставляет доступ к координате данного вектора с указанным индексом.
Свойство Coordinate предоставляет доступ к координате данного вектора с индексом index.
index: Индекс координаты. Тип int. 0 соответствует координате X, 1 – координате Y.
Returns: Возвращает значение координаты с индексом index.
Тип double.

Teigha.Geometry.Vector2d.Length
Свойство Length представляет длину данного вектора.
Свойство Length представляет евклидову длину данного вектора.
Returns: Возвращает длину данного вектора.
Тип double.

Teigha.Geometry.Vector2d.LengthSqrd
Свойство LengthSqrd представляет квадрат длины данного вектора.
Свойство LengthSqrd представляет квадрат евклидовой длины данного вектора.
Returns: Возвращает квадрат евклидовой длины данного вектора.
Тип double.

Teigha.Geometry.Vector2d.X
Свойство X представляет X-координату данного вектора.
Свойство X представляет значение X-координаты данного вектора.
Returns: Возвращает значение X-координаты данного вектора.
Тип double.

Teigha.Geometry.Vector2d.XAxis
Свойство XAxis представляет направление оси X.
Свойство XAxis представляет направление оси X.
Returns: Возвращает направление оси X. Тип Vector2d.

Teigha.Geometry.Vector2d.Y
Свойство Y представляет Y-координату данного вектора.
Свойство Y представляет значение Y-координаты данного вектора.
Returns: Возвращает значение Y-координаты данного вектора.
Тип double.

Teigha.Geometry.Vector2d.YAxis
Свойство YAxis представляет направление оси Y.
Свойство YAxis представляет направление оси Y.
Returns: Возвращает направление оси Y.
Тип Vector2d.