HostMgd.EditorInput.PromptStatus
Данное перечисление определяет поддерживаемые статусы выполнения запросов на интерактивный ввод данных.
Данное перечисление определяет поддерживаемые статусы выполнения запросов на интерактивный ввод данных.