Teigha.DatabaseServices.JoinStyle
Перечисление JoinStyle определяет поддерживаемые стили отрисовки концов соединяющихся линий.
Перечисление JoinStyle определяет поддерживаемые стили отрисовки концов соединяющихся линий.