Teigha.BoundaryRepresentation.Face
Класс Face является интерфейсным классом для граней BREP.
Класс Face является интерфейсным классом для граней BREP.
Поскольку грани являются основными элементами BREP, они имеют связанную геометрию, представленную поверхностями.
Этот класс участвует в опосредованной связи между классами Geometry, Solid3D, Region и Body.

Teigha.BoundaryRepresentation.Face.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса Face. Создает экземпляр класса на основе указанного пути подобъекта.
Конструктор класса Face. Создает экземпляр класса на основе указанного пути подобъекта.
fullSubentPath: Полный путь подобъекта.

Teigha.BoundaryRepresentation.Face.GetArea(System.Double)
Метод вычисляет площадь грани с указанной требуемой точностью вычислений.
Достигаемая точность вычислений определяется глобальной установкой.
Метод вычисляет площадь грани с указанной требуемой точностью вычислений.
Достигаемая точность вычислений определяется глобальной установкой.
tolRequired: Входная требуемая точность вычислений.  Тип double.
Returns: Возвращает площадь грани.
Тип double.

Teigha.BoundaryRepresentation.Face.GetArea(System.Double,[Out] double%)
Метод вычисляет площадь грани с указанной требуемой точностью вычислений и возвращает фактически достигнутую точность полученной площади.
Метод вычисляет площадь грани с указанной требуемой точностью вычислений.
Метод возвращает также фактически достигнутую точность полученной площади.
tolRequired: Входная требуемая точность вычислений.            Тип double.
tolAchieved: Выходная достигнутая точность вычислений площади. Тип double.
Returns: Возвращает площадь грани.
Тип double.

Teigha.BoundaryRepresentation.Face.GetLoopsStartingFrom(Teigha.BoundaryRepresentation.BoundaryLoop)
Метод предназначен для получения коллекции циклов данной грани BREP, начиная с указанного цикла.
Метод предназначен для получения коллекции циклов данной грани BREP, начиная с указанного цикла.
startFrom: Входной начальный цикл.  Тип BoundaryLoop.
Returns: Возвращает коллекцию циклов грани.
Тип FaceLoopCollection.

Teigha.BoundaryRepresentation.Face.IsOrientToSurface
Свойство IsOrientToSurface позволяет проверить, ориентирована ли внешняя сторона грани в направлении нормали к поверхности.
Свойство IsOrientToSurface позволяет проверить, ориентирована ли внешняя сторона грани в направлении нормали к поверхности.
Returns: Возвращает true, если ориентация грани и поверхности совпадают.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.Face.Loops
Свойство Loops предоставляет доступ ко всем циклам, связанным с данной гранью.
Свойство Loops предоставляет доступ ко всем циклам, связанным с данной гранью.
Returns: Возвращает коллекцию циклов грани.
Тип FaceLoopCollection.

Teigha.BoundaryRepresentation.Face.Surface
Свойство Surface предоставляет доступ к базовой поверхности, связанной с данной гранью.
Свойство Surface предоставляет доступ к базовой поверхности, связанной с данной гранью.
Returns: Возвращает поверхность данной грани.
Тип Geometry.Surface.