Teigha.DatabaseServices.HatchPatternType
Перечисление HatchPatternType определяет доступные типы образцов штриховки.
Перечисление HatchPatternType определяет доступные типы образцов штриховки - стандартный (PreDefined), из линий (UserDefined), пользовательский (CustomDefined).