Teigha.DatabaseServices.GeometryOverrule.SetCustomFilter
Метод делает возможным использование метода IsApplicable базового класса Overrule, чтобы установить применимость объектных переопределений.
Метод делает возможным использование метода IsApplicable базового класса Overrule, чтобы установить применимость объектных переопределений.