Teigha.Geometry.CompositeCurve2d.GetCurves
Метод позволяет получить массив подкривых, которые составляют данную составную кривую.
Метод позволяет получить массив подкривых, которые составляют данную составную кривую.
Returns: Возвращает массив подкривых, составляющих данный объект.
Тип Curve2d[].