Teigha.DatabaseServices.LoftOptionsNormalOption.NoNormal
Значение: 0. Если установлено это значение, лофтинг по нормали к плоскости отключается, и система вычисляет направление поверхности в каждом поперечном сечении индивидуально.