Teigha.DatabaseServices.DBObject.Erase
Метод помечает этот объект, как удалённый, но не удаляет из базы данных.
Метод устанавливает признак удаления объекта.
Notes
Удалённые объекты не удаляются из базы данных или из памяти.
Удалённые объекты не сохраняются при сохранении базы данных или отправке в файл формата DXF.