HostMgd.ApplicationServices.DocumentWindowCollection
Класс DocumentWindowCollection представляет коллекцию окон открытых документов.
Класс DocumentWindowCollection представляет коллекцию окон открытых документов.

HostMgd.ApplicationServices.DocumentWindowCollection.CopyTo(Array,System.Int32)
Метод копирует все элементы этой коллекции в предоставленный массив, начиная с указанного индекса.
Метод копирует все элементы коллекции DocumentWindowCollection в массив a, начиная с индекса index.
a: Входной массив, в который следует копировать элементы коллекции. Тип Array.
index: Индекс в массиве, начиная с которого в массив копируются элементы коллекции. Тип int.

HostMgd.ApplicationServices.DocumentWindowCollection.Count
Свойство Count представляет текущее количество окон открытых документов.
Свойство Count представляет текущее количество окон открытых документов.
Returns: Возвращает текущее количество окон открытых документов.
Тип int.

HostMgd.ApplicationServices.DocumentWindowCollection.IsSynchronized
Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции потокобезопасным.
Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции потокобезопасным.
Returns: Возвращает true, если доступ к этой коллекции является потокобезопасным.
В противном случае возвращает false.

HostMgd.ApplicationServices.DocumentWindowCollection.SyncRoot
Свойство SyncRoot предоставляет объект, используемый для синхронизации доступа к данной коллекции.
Свойство SyncRoot предоставляет объект, используемый для синхронизации доступа к данной коллекции.
Returns: Возвращает объект, используемый для синхронизации доступа к данной коллекции.
Тип Object.