Teigha.DatabaseServices.DwgFiler.ReadInt16
Метод предназначен для получения значения Int16 из текущего элемента данного объекта Filer.
Метод предназначен для получения значения Int16 из текущего элемента данного объекта Filer.
Returns: Возвращает значение из текущего элемента данного объекта Filer. Тип short.