Teigha.DatabaseServices.LineSpacingStyle
Данное перечисление определяет метод определения межстрочного интервала, который используется в многострочном тексте MText.
Данное перечисление определяет метод определения межстрочного интервала, который используется в многострочном тексте MText.