Teigha.Geometry.PointOnCurve3d.IsSingular
Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке.
Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке.
Returns: Возвращает true, если длина вектора первой производной равна нулю; в противном случае возвращает false.