HostMgd.ApplicationServices.InplaceTextEditor.DrawHightlight
Метод предназначен для отрисовки подсвеченного текста в данном редакторе.
В текущей версии не реализован.
Метод предназначен для отрисовки подсвеченного текста в данном редакторе.
В текущей версии метод не реализован.