Teigha.DatabaseServices.UnderlayLayerCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для данной коллекции. Тип Collections.IEnumerator.