Teigha.GraphicsInterface.ShadowMode.Simple
Значение: 0.
Режим простых теней использует базовый алгоритм отрисовки теней, который не учитывает сложные эффекты освещенности объектов, но обеспечивает минимальные вычислительные затраты. Подходит для сцен с небольшим количеством объектов или в режиме тестирования, когда производительность важнее точности.