Teigha.Geometry.Vector2d.ToArray
Метод создает двухэлементный массив типа double, содержащий значения координат X и Y данного вектора.
Метод создает двухэлементный массив типа double, содержащий значения координат X и Y данного вектора.
Returns: Возвращает двухэлементный массив с координатами данного вектора.
Тип double[].