Teigha.DatabaseServices.AssocArrayPolarParameters
Класс предоставляет интерфейс для управления параметрами кругового массива.
Класс предоставляет интерфейс для управления параметрами кругового массива.

Teigha.DatabaseServices.AssocArrayPolarParameters.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.AssocArrayPolarParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double)
Конструктор класса AssocArrayPolarParameters для создания нового объекта с указанными параметрами.
Конструктор. Создает новый объект класса AssocArrayPathParameters с указанными параметрами.
angle: Угол, образуемый двумя соседними элементами из центра кругового массива. Значение указывается в радианах и может варьироваться от 0 до 2PI. Тип double.
rowSpacing: Шаг между рядами кругового массива. Тип double.
levelSpacing: Расстояние между уровнями кругового массива. Тип double.
itemCount: Количество элементов в массиве. Тип int.
rowCount: Количество рядов в массиве. Тип int.
levelCount: Количество уровней в массиве. Тип int.
rowElevation: Приращение отметок между соседними рядами массива. Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.GetAngleBetweenItems([Out] String,[Out] String)
Метод предоставляет угол между соседними элементами кругового массива. Может варьироваться в интервалеот (0, 2PI].
Метод предоставляет угол в радианах между базовыми точками соседних элементов кругового массива. Может варьироваться в интервале от (0, 2PI].
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
Returns: Возвращает угол в радианах между соседними элементами кругового массива. Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.GetFillAngle([Out] String,[Out] String)
Метод позволяет получить угол между первым и последним элементами кругового массива.
Метод позволяет получить угол в радианах между базовыми точками первого и последнего элементов кругового массива, который может варьироваться в интервале (0, 2PI].
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
Returns: Возвращает угол в радианах между первым и последним элементами кругового массива. Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.GetItemCount([Out] String,[Out] String)
Метод позволяет получить текущее количество элементов в круговом массиве.
Метод позволяет получить текущее количество элементов в круговом массиве.
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
Returns: Возвращает количество элементов в круговом массиве. Тип int.

Teigha.DatabaseServices.AssocArrayPolarParameters.GetRadius([Out] String,[Out] String)
Метод позволяет получить радиус кругового массива.
Метод позволяет получить радиус кругового массива.
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
Returns: Возвращает радиус кругового массива. Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.GetStartAngle([Out] String,[Out] String)
Метод позволяет получить начальный угол кругового массива.
Метод позволяет получить начальный угол кругового массива. Угол измеряется в радианах.
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой
Returns: Возвращает начальный угол кругового массива (в радианах). Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.SetAngleBetweenItems(System.Double,String,String)
Метод задает угол между соседними элементами кругового массива.
Метод задает угол в радианах между базовыми точками соседних элементов кругового массива.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
val: Новый угол между соседними элементами кругового массива. Указывается в радианах и должен быть положительным значением, которое укладывается в эквивалентный интервал (0–360] градусов. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой

Teigha.DatabaseServices.AssocArrayPolarParameters.SetFillAngle(System.Double,String,String)
Метод позволяет установить угол между первым и последним элементами кругового массива.
Метод позволяет установить угол в радианах между базовыми точками первого и последнего элементов кругового массива.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
val: Угол между первым и последним элементами кругового массива. Указывается в радианах и должен быть положительным значением, которое укладывается в эквивалентный интервал (0–360] градусов. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой

Teigha.DatabaseServices.AssocArrayPolarParameters.SetItemCount(System.Int32,String,String)
Метод позволяет установить количество элементов в круговом массиве.
Метод позволяет установить количество элементов в круговом массиве.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
count: Количество элементов в круговом массиве. Тип int.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой

Teigha.DatabaseServices.AssocArrayPolarParameters.SetRadius(System.Double,String,String)
Метод позволяет установить новый радиус кругового массива.
Метод позволяет установить новый радиус кругового массива.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
val: Новое значение радиуса кругового массива. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayPolarParameters.SetStartAngle(System.Double,String,String)
Метод позволяет установить новый начальный угол кругового массива.
Метод позволяет установить новый начальный угол кругового массива. Значение указывается в радианах.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
val: Новое значение начального угла кругового массива. Указывается в радианах. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayPolarParameters.AngleBetweenItems
Свойство обеспечивает доступ к углу между соседними элементами кругового массива.
Свойство обеспечивает доступ к углу в радианах между базовыми точками соседних элементов кругового массива.
Returns: Возвращает угол в радианах между соседними элементами кругового массива. Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.Direction
Свойство обеспечивает доступ к направлению кругового массива.
Свойство обеспечивает доступ к направлению кругового массива.
Returns: Возвращает направление кругового массива как значение из перечисления ArcDirection.

Teigha.DatabaseServices.AssocArrayPolarParameters.FillAngle
Свойство обеспечивает доступ к углу между первым и последним элементами кругового массива.
Свойство обеспечивает доступ к углу в радианах между базовыми точками первого и последнего элементов кругового массива.
Returns: Возвращает угол в радианах между первым и последним элементами кругового массива. Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.ItemCount
Свойство обеспечивает доступ к количеству элементов кругового массива.
Свойство обеспечивает доступ к количеству элементов кругового массива.
Returns: Возвращает количество элементов кругового массива. Тип int.

Teigha.DatabaseServices.AssocArrayPolarParameters.Radius
Свойство обеспечивает доступ к радиусу кругового массива.
Свойство обеспечивает доступ к радиусу кругового массива.
Returns: Возвращает радиусу кругового массива. Тип double.

Teigha.DatabaseServices.AssocArrayPolarParameters.RotateItems
Свойство обеспечивает доступ к флагу, который определяет, поворачиваются ли элементы при построении массива.
Свойство обеспечивает доступ к флагу, который определяет, поворачиваются ли элементы при построении массива.
Returns: Возвращает true, если элементы поворачиваются. В противном случае возвращает false.

Teigha.DatabaseServices.AssocArrayPolarParameters.StartAngle
Свойство обеспечивает доступ к углу первого элемента кругового массива.
Свойство обеспечивает доступ к углу в радианах базовой точки первого элемента кругового массива.
Returns: Возвращает угол в радианах базовой точки первого элемента кругового массива.  Тип double.