Teigha.Colors.TransparencyCollection.TrimToSize
Метод приводит ёмкость данной коллекции в соответствие фактическому количеству ее элементов.
Метод переопределяет значение ёмкости данной коллекции, приводя его в соответствие фактическому количеству элементов в коллекции.