Teigha.Geometry.Torus.GetAnglesInU
Метод предоставляет начальный и конечный углы U поворота образующей окружности вокруг оси симметрии тора.
Метод предоставляет начальный и конечный углы U поворота образующей окружности вокруг оси симметрии тора (начальную и конечную долготу).
Notes
Результатом является массив с начальными и конечными углами для параметра U.
Индексы возвращаемого массива:
* 0 — Начальный угол U.
* 1 — Конечный угол U.
Returns: Возвращает двухэлементный массив, в котором нулевой и первый элементы представляют начальное и конечное значения U, соответственно.
Тип double[].