Teigha.GraphicsInterface.TransientDrawingMode.Highlight
Значение: 3.
Режим отрисовки с подсветкой. Для 2D- и 3D-графических систем рендеринг выполняется непосредственно на устройстве с использованием эффекта подсветки устройства.