HostMgd.PlottingServices.HostAppServices
Класс HostAppServices определяет интерфейс для базовых сервисов вывода на печать.
Класс HostAppServices определяет интерфейс,
который должны реализовать хост-приложения, чтобы предоставлять базовые сервисы вывода на печать.
Приложения, наследующие этот интерфейс, предоставляют свою реализацию методов этого класса.

HostMgd.PlottingServices.HostAppServices.UpdatePlotJobStatus(HostMgd.PlottingServices.AppPlotStatus,System.String)
Метод обеспечивает передачу хост-приложению событий, условий и результатов вывода на печать.
Метод обеспечивает передачу хост-приложению событий, условий и результатов вывода на печать.
Подразумевается, что хост-приложение соответствующим образом обновляет элементы пользовательского интерфейса, чтобы визуально отображать текущее состояние задания на печать.
status: Входной статус задания на печать. Перечисление HostMgd.PlottingServices.AppPlotStatus.
message: Входное сообщение печати или имя DWF-файла. Тип System.String.

HostMgd.PlottingServices.HostAppServices.PlotLogger
Свойство PlotLogger возвращает объект логгера печати PlotLogger.
Приложения реализуют это свойство, чтобы возвращать ссылку на объект PlotLogger.
Как правило, за создание экземпляра PlotLogger отвечает хост-приложение.
Returns: Возвращает ссылку на логгер печати. Тип HostMgd.PlottingServices.PlotLogger.