Teigha.BoundaryRepresentation.Brep
Класс Brep представляет собой интерфейсный класс для BREP-описания геометрии объекта в базе данных nanoCAD.
Класс Brep представляет собой интерфейсный класс для BREP-описания геометрии объекта в базе данных nanoCAD.
Этот класс предоставляет интерфейс верхнего уровня для обхода структуры данных BREP в трехмерных объектах.

Teigha.BoundaryRepresentation.Brep.#ctor(Teigha.DatabaseServices.FullSubentityPath)
Конструктор класса Brep. Создает экземпляр класса, используя указанный путь к подобъекту.
Конструктор класса Brep. Создает экземпляр класса, используя указанный путь к подобъекту.
fullPath: Полный путь, используемый для создания описания B-Rep.  Тип FullSubentityPath.

Teigha.BoundaryRepresentation.Brep.#ctor(Teigha.BoundaryRepresentation.Brep)
Конструктор класса Brep. Создает экземпляр класса как копию указанного объекта Brep.
Конструктор класса Brep. Создает экземпляр класса как копию указанного объекта Brep.
br: Входной объект типа Brep, копию которого требуется создать.

Teigha.BoundaryRepresentation.Brep.#ctor(Teigha.DatabaseServices.Entity)
Конструктор класса Brep. Создает экземпляр класса, используя указанный объект чертежа.
Конструктор класса Brep. Создает экземпляр класса, используя указанный объект чертежа.
ent: Входной объект для создания нового экземпляра класса.  Тип Entity.

Teigha.BoundaryRepresentation.Brep.GetComplexsStartingFrom(Teigha.BoundaryRepresentation.Complex)
Метод предназначен для извлечения коллекции комплексов B-Rep.
Метод предназначен для извлечения коллекции комплексов B-Rep.
startFrom: Входной комплекс, начиная с которого формируется выходная коллекция комплексов B-Rep.
Returns: Возвращает коллекцию комплексов B-Rep.
Тип BrepComplexCollection.

Teigha.BoundaryRepresentation.Brep.GetEdgesStartingFrom(Teigha.BoundaryRepresentation.Edge)
Метод предназначен для извлечения коллекции рёбер.
Метод предназначен для извлечения коллекции рёбер.
startFrom: Входное ребро, начиная с которого формируется коллекция рёбер.
Returns: Возвращает коллекцию рёбер.  Тип BrepEdgeCollection.

Teigha.BoundaryRepresentation.Brep.GetFacesStartingFrom(Teigha.BoundaryRepresentation.Face)
Метод предназначен для извлечения коллекции граней.
Метод предназначен для извлечения коллекции граней.
startFrom: Входная грань, начиная с которой формируется коллекция граней.  Тип Face.
Returns: Возвращает коллекцию граней.  Тип BrepFaceCollection.

Teigha.BoundaryRepresentation.Brep.GetShellsStartingFrom(Teigha.BoundaryRepresentation.Shell)
Метод предназначен для извлечения коллекции оболочек.
Метод предназначен для извлечения коллекции оболочек.
startFrom: Оболочка, начиная с которой формируется коллекция оболочек.  Тип Shell.
Returns: Возвращает коллекцию оболочек.  Тип BrepShellCollection.

Teigha.BoundaryRepresentation.Brep.GetVerticesStartingFrom(Teigha.BoundaryRepresentation.Vertex)
Метод предназначен для извлечения коллекции вершин.
Метод предназначен для извлечения коллекции вершин.
startFrom: Вершина, начиная с которой формируется коллекция вершин.  Тип Vertex.
Returns: Возвращает коллекцию вершин.  Тип BrepVertexCollection.

Teigha.BoundaryRepresentation.Brep.HasTransformation([Out]Matrix3d%)
Метод позволяет проверить, имеет ли данный объект Brep не единичную матрицу преобразования.
Метод позволяет проверить, имеет ли данный объект Brep не единичную матрицу преобразования.
matrix: Матрица геометрического преобразования.  Тип Matrix3d.
Returns: Возвращает true, если матрица есть, и она не единичная.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.Brep.Complexes
Свойство Complexes представляет коллекцию всех комплексов, связанных с данным объектом.
Свойство Complexes представляет коллекцию всех комплексов, связанных с данным объектом.
Returns: Возвращает коллекцию комплексов.  Тип BrepComplexCollection.

Teigha.BoundaryRepresentation.Brep.Edges
Свойство Edges представляет коллекцию всех рёбер, связанных с данным объектом.
Свойство Edges представляет коллекцию всех рёбер, связанных с данным объектом.
Returns: Возвращает коллекцию рёбер.  Тип BrepEdgeCollection.

Teigha.BoundaryRepresentation.Brep.Faces
Свойство Faces представляет коллекцию всех граней, связанных с данным объектом.
Свойство Faces представляет коллекцию всех граней, связанных с данным объектом.
Returns: Возвращает коллекцию граней.  Тип BrepFaceCollection.

Teigha.BoundaryRepresentation.Brep.Shells
Свойство Shells представляет коллекцию всех оболочек, связанных с данным объектом.
Свойство Shells представляет коллекцию всех оболочек, связанных с данным объектом.
Returns: Возвращает коллекцию всех оболочек.  Тип BrepShellCollection.

Teigha.BoundaryRepresentation.Brep.Solid
Свойство Solid представляет твердое тело, связанное с данным объектом.
Свойство Solid представляет твердое тело, связанное с данным объектом.
Returns: Возвращает твердое тело.  Тип Teigha.DatabaseServices.Solid3d.

Teigha.BoundaryRepresentation.Brep.Surf
Свойство Surf представляет поверхность, связанную с данным объектом.
Свойство Surf представляет поверхность, связанную с данным объектом.
Returns: Возвращает связанную с данным объектом поверхность.  Тип Teigha.DatabaseServices.Surface.

Teigha.BoundaryRepresentation.Brep.Vertices
Свойство Vertices представляет коллекцию всех вершин, связанных с данным объектом.
Свойство Vertices представляет коллекцию всех вершин, связанных с данным объектом.
Returns: Возвращает коллекцию всех вершин.  Тип BrepVertexCollection.