Teigha.DatabaseServices.PolygonMesh.MakeNOpen
Метод делает сеть PolygonMesh незамкнутой в направлении N.
Метод делает сеть PolygonMesh незамкнутой в направлении N.
Это означает, что сеть будет иметь разрыв между последним и первым столбцами.