Teigha.DatabaseServices.DBDictionary
DBDictionary — это объектный словарь, хранящийся в базе данных и поддерживающий соответствие (мэппинг) текстовых строк и объектов базы данных.
DBDictionary — это объектный словарь, хранящийся в базе данных и поддерживающий соответствие (мэппинг) текстовых строк и объектов базы данных.
Экземпляр этого класса представляет единственный объект, например, таблицу Drawing Symbol Table, в которой можно считывать, добавлять или удалять объекты-наследники класса DBObject.
Записи в DBDictionary должны быть уникальными.
Каждая запись состоит из уникального объекта DBObject и строки с именем ключа записи.
Ключ может быть либо обычной нуль-терминированной строкой, либо строкой со звездочкой ('*') в первом символе для обозначения анонимной записи.
Ключ анонимной записи формируется из звездочки в первой позиции строки, за которой далее идут символ 'A' и уникальное целочисленное значение; например, '*A13'.
В случае добавления в словарь объекта этот словарь становится владельцем объекта, строка ключа ставится в соответствие идентификатору ObjectID объекта, а сам словарь связывается с объектом как постоянный (persistent) реактор, так что в случае удаления объекта словарь получит соответствующее уведомление.
Notes
Имена в словаре должны соответствовать ряду общих правил:
1.	Имена могут быть произвольной длины.
2.	Имена могут содержать дополнительные символы, такие как пробел, апостроф (') и т.п.
3.	Имена обрабатываются без учета регистра символов.
4.	Не допускается использование в именах следующих символов:
* вертикальная черта ('|'),
* звездочка ('*'), за исключением случаев, указанных выше,
* обратная косая черта ('\'),
* двоеточие (':'),
* точка с запятой (';'),
* угловые скобки ('>', '<'),
* вопросительный знак ('?'),
* двойная кавычка ('"'),
* запятая (','),
* знак равенства ('='),
* гравис ('`').
Не рекомендуется жестко привязываться к какой-либо конкретной длине имен записей словаря, если он создан не вами или у кого-то ещё есть возможность изменять имена записей.  При извлечении имён ключей из "чужого" словаря, который может быть обновлен nanoCAD или другими приложениями, следует предусмотреть поддержку имен произвольной длины.
Указатели объектов, извлекаемые из базы данных, представляют собой отдельные объекты, которые в данный момент открыты в указанном режиме доступа.  Статус возврата отражает состояние открываемой записи.  Если объект с заданным идентификатором по какой-либо причине не найден в базе данных, возвращается нулевой указатель (NULL).
При удалении словаря стираются все содержащиеся в нём записи.  В случае отмены удаления словаря восстанавливается и всё его содержимое.

Teigha.DatabaseServices.DBDictionary.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DBDictionary.Contains(DatabaseServices.ObjectId)
Метод определяет, присутствует ли в словаре запись с указанным ObjectId.
Метод Contains определяет, присутствует ли в словаре запись с указанным ObjectId.
objId: Искомый объект с указанным ObjectId .
Returns: Возвращает true, если объект с указанным ObjectId присутствует в словаре, и false в противном случае.

Teigha.DatabaseServices.DBDictionary.Contains(String)
Возвращает true, если объект с указанным ключом присутствует в словаре.
Возвращает true, если объект с указанным ключом присутствует в словаре.
entryName: Имя ключа для искомого объекта.
Returns: Возвращает true, если объект с указанным ObjectId присутствует в словаре, и false в противном случае.

Teigha.DatabaseServices.DBDictionary.CopyTo(array,System.Int32)
Копирует в данный словарь объекты из массива, начиная с указанного индекса.
Копирует в данный словарь объекты из массива, начиная с указанного индекса.
array: Массив объектов DBDictionaryEntry, из которого копируются объекты.
index: Индекс элемента массива, начиная с которого копируются объекты.

Teigha.DatabaseServices.DBDictionary.GetAt(String)
Метод предназначен для поиска в словаре записи с заданным ключом.
Метод GetAt ищет в словаре запись с ключом entryName и в случае успеха возвращает ее ObjectId.
entryName: Строка с именем ключа искомой записи.
Returns: Возвращает ObjectId искомой записи.

Teigha.DatabaseServices.DBDictionary.NameAt(DatabaseServices.ObjectId)
Метод ищет в словаре запись с заданным ObjectId и в случае успеха возвращает имя ключа найденной записи.
Метод ищет в словаре запись с заданным ObjectId и в случае успеха возвращает имя ключа найденной записи.
objId: Идентификатор DObjectId искомого объекта.
Returns: В случае успеха возвращает имя ключа найденной записи.  В противном случае возвращает пустую строку.

Teigha.DatabaseServices.DBDictionary.Remove(DatabaseServices.ObjectId)
Метод удаляет из словаря запись c заданным идентификатором объекта.
Метод Remove удаляет из словаря запись c заданным идентификатором объекта.
objId: Идентификатор ObjectId удаляемого объекта.

Teigha.DatabaseServices.DBDictionary.Remove(String)
Метод удаляет из словаря запись c заданным ключом.
Метод Remove удаляет из словаря запись c заданным ключом.
key: Строка, представляющая ключ (имя) записи в словаре.
Returns: Возвращает идентификатор ObjectId удаляемого объекта.

Teigha.DatabaseServices.DBDictionary.SetAt(String,Teigha.DatabaseServices.DBObject)
Метод создает в словаре новую запись, заданную аргументом newValue, если ключ searchKey в словаре отсутствует.
Если запись с ключом searchKey уже существует, то новая запись заменяет старую.
Метод создает в словаре новую запись, заданную аргументом newValue, если ключ searchKey в словаре отсутствует.
Если запись с ключом searchKey уже существует, то старая запись удаляется, словарь удаляется из ее списка реакторов, а на ее место в словарь добавляется объект newValue.  Имя объекта задается ключом searchKey.  Возвращается идентификатор objectId созданной записи.
searchKey: Строка, представляющая имя ключа заменяемого объекта.
newValue: Новый объект типа DBObject для добавления в словарь.
Returns: Возвращается идентификатор objectId созданной записи.

Teigha.DatabaseServices.DBDictionary.SetName(String,String)
Метод выполняет переименование указанной записи.
Метод переименовывает запись с именем oldName, присваивая ей новое имя newName.
oldName: Строка со старым ключом.
newName: Строка с новым ключом.

Teigha.DatabaseServices.DBDictionary.Count
Предоставляет доступ к  количеству записей в словаре.
Предоставляет доступ к  количеству записей в словаре.
Returns: Возвращает целое число, равное количеству записей в словаре.

Teigha.DatabaseServices.DBDictionary.IncludingErased
Предоставляет доступ ко всем записям словаря, включая стертые.
Возвращает словарь DBDictionary, содержащий все записи данного словаря, включая удаленные.
Returns: Возвращает словарь DBDictionary, содержащий все записи данного словаря, включая удаленные.

Teigha.DatabaseServices.DBDictionary.TreatElementsAsHard
Свойство определяет, защищает ли данный словарь свои элементы от удаления при очистке (purge).
Свойство определяет, защищает ли данный словарь свои элементы от удаления при очистке (purge).
Returns: Возвращает true, если словарь защищает свои элементы от удаления при очистке (purge).

Teigha.DatabaseServices.DBDictionary.Item
Это свойство находит запись в словаре по её ключу key и в случае успеха возвращает соответствующий ObjectId.
Это свойство находит запись в словаре по её ключу key и возвращает свойство Value записи словаря (ObjectId объекта чертежа), свойство Key которой совпадает с указанным параметром key.
Returns: Возвращает ObjectId объекта чертежа.