HostMgd.PlottingServices.PlotCancelStatus
Данное перечисление определяет состояния отмены печати в случае, когда печатается несколько листов.
Перечисление PlotCancelStatus определяет состояния отмены печати в случае, когда печатается несколько листов.