Teigha.DatabaseServices.SurfaceSliceResults
Структура SurfaceSliceResults представляет данные, которые используются
в методах Surface.SliceByPlane() и Surface.SliceBySurface().
Структура SurfaceSliceResults представляет данные, которые используются
в методах Surface.SliceByPlane() и Surface.SliceBySurface().

Teigha.DatabaseServices.SurfaceSliceResults.#ctor(Teigha.DatabaseServices.Surface,Teigha.DatabaseServices.Surface)
Конструктор структуры SurfaceSliceResults.
Создает экземпляр структуры с указанными параметрами.
Конструктор структуры SurfaceSliceResults.
Создает экземпляр структуры с указанными параметрами.
negativeHalfSurface: Другая сторона поверхности, которая разрезана плоскостью или поверхностью. Тип Surface.
newSurface: Положительная половина поверхности, когда поверхность не может быть отредактирована непосредственно, поскольку она наследует геометрию другой поверхности. Тип Surface.

Teigha.DatabaseServices.SurfaceSliceResults.NegativeHalfSurface
Свойство NegativeHalfSurface представляет отрицательную половину поверхности, разрезанной плоскостью или другой поверхностью.
Свойство NegativeHalfSurface представляет отрицательную половину поверхности, разрезанной плоскостью или другой поверхностью.
Returns: Возвращает отрицательную половину разрезанной поверхности.
Тип DatabaseServices.Surface.

Teigha.DatabaseServices.SurfaceSliceResults.NewSurface
Свойство NewSurface представляет положительную половину разрезанной поверхности, когда поверхность не может быть отредактирована непосредственно, поскольку она наследует геометрию другой поверхности Surface.
Свойство NewSurface представляет положительную половину разрезанной поверхности, когда поверхность не может быть отредактирована непосредственно, поскольку она наследует геометрию другой поверхности Surface.
Returns: Возвращает положительную (новую) половину разрезанной поверхности.
Тип SuDatabaseServices.Surfacerface.