Teigha.DatabaseServices.IdMapping
Класс IdMapping используется в операциях глубокого клонирования для сопоставления (мэппинга) идентификаторов исходных объектов и идентификаторов их клонов. Пары идентификаторов (ID исходного объекта - ID его клона) реализуются объектами IdPair.
Класс IdMapping используется в операциях глубокого клонирования для сопоставления (мэппинга) идентификаторов исходных объектов и идентификаторов их клонов. Пары идентификаторов (ID исходного объекта - ID его клона) реализуются объектами IdPair.
Не существует механизма очистки всех сопоставлений в экземпляре IdMapping, поэтому для каждой операции глубокого клонирования необходимо создавать новый экземпляр IdMapping.  Экземпляры IdPair, добавленные в экземпляр IdMapping, уничтожаются вместе с этим экземпляром.

Teigha.DatabaseServices.IdMapping.#ctor
Конструктор по умолчанию класса IdMapping.
Конструктор по умолчанию класса IdMapping.

Teigha.DatabaseServices.IdMapping.Add(Teigha.DatabaseServices.IdPair)
Метод позволяет добавить указанный объект IdPair к данному объекту IdMapping.
Метод позволяет добавить указанный объект IdPair к данному объекту IdMapping.
pairToAdd: Добавляемая пара сопоставленных идентификаторов. Тип IdPair.

Teigha.DatabaseServices.IdMapping.Change(Teigha.DatabaseServices.IdPair)
Метод заменяет существующий в данном IdMapping объект IdPair новым объектом IdPair с тем же ключом.
Метод реализует замену существующего в данном IdMapping объекта IdPair новым объектом IdPair с тем же ключом.
Ключ для поиска предоставляет аргумент pairToChange. В случае успеха найденный объект заменяется на объект pairToChange.
pairToChange: Аргумент предоставляет ключ для поиска и принимает значение.  Тип IdPair.

Teigha.DatabaseServices.IdMapping.Contains(Teigha.DatabaseServices.ObjectId)
Метод позволяет проверить, содержится ли в данном объекте IdMapping объект IdPair с указанным ключом.
Метод позволяет проверить, содержится ли в данном объекте IdMapping объект IdPair с указанным ключом.
key: Идентификатор исходного объекта как ключ для поиска объекта IdPair. Тип ObjectId.
Returns: Возвращает true, если объект IdPair с указанным ключом найден.
В противном случае возвращает false.

Teigha.DatabaseServices.IdMapping.Delete(Teigha.DatabaseServices.ObjectId)
Метод позволяет удалить объект IdPair с указанным ключом из данного объекта IdMapping.
Метод позволяет удалить объект IdPair с ключом key из данного объекта IdMapping.
key: Идентификатор исходного объекта клонирования как ключ удаляемого объекта IdPair. Тип ObjectId.

Teigha.DatabaseServices.IdMapping.Lookup(Teigha.DatabaseServices.ObjectId)
Метод предназначен для поиска в объекте IdMapping объекта IdPair с указанным ключом.
Метод реализует поиск по ключу в данном объекте IdMapping и возвращает найденный объект IdPair с указанным ключом или NULL.
key: Идентификатор исходного объекта клонирования как ключ для поиска объекта IdPair. Тип ObjectId.
Returns: Возвращает объект IdPair с заданным ключом key или NULL, если поиск успехом не увенчался.

Teigha.DatabaseServices.IdMapping.DeepCloneContext
Свойство обеспечивает доступ к типу операции глубокого клонирования DeepCloneType, в которой используется этот объект IdMapping.
Свойство обеспечивает доступ к типу операции глубокого клонирования DeepCloneType, в которой используется этот объект IdMapping.
Returns: Возвращает тип операции глубокого клонирования. Перечисление DatabaseServices.DeepCloneType.

Teigha.DatabaseServices.IdMapping.DestinationDatabase
Свойство предоставляет доступ к целевой базе данных операции глубокого клонирования, использующей этот объект IdMapping.
Свойство предоставляет доступ к целевой базе данных операции глубокого клонирования, использующей этот объект IdMapping.
Returns: Возвращает целевую базу данных операции глубокого клонирования. Тип Database.

Teigha.DatabaseServices.IdMapping.DuplicateRecordCloning
Свойство возвращает тип клонирования повторяющихся записей для этого объекта IdMapping.
Свойство возвращает тип клонирования повторяющихся записей для этого объекта IdMapping.
Returns: Возвращает тип клонирования повторяющихся записей. Тип DuplicateRecordCloning.

Teigha.DatabaseServices.IdMapping.Item
Свойство предоставляет доступ к объекту IdPair по его ключу.
Свойство предоставляет доступ к объекту IdPair по его ключу.
key: Ключ объекта IdPair. Тип ObjectId.
Returns: Возвращает объект IdPair ключом key.

Teigha.DatabaseServices.IdMapping.OriginalDatabase
Свойство обеспечивает доступ к исходной базе данных для операции глубокого клонирования, в которой используется этот объект IdMapping.
Свойство обеспечивает доступ к исходной базе данных для операции глубокого клонирования, в которой используется этот объект IdMapping.
Returns: Возвращает исходную базу данных. Тип Database.