Teigha.Geometry.CurveBoundary.SetToOwnCurves
Метод позволяет сделать данную криволинейную границу владельцем данных своего определения.
Метод позволяет сделать данную криволинейную границу владельцем данных своего определения.
Если текущий экземпляр уже является владельцем, то метод ничего не делает.
В противном случае метод создает копию данных определения и делает данную граничную кривую владельцем скопированных данных.