Teigha.DatabaseServices.GripData
Класс представляет данные ручек для объектов чертежа.
Этот класс описывает конкретную ручку для конкретного объекта чертежа и позволяет приложениям с управлением объектами чертежа посредством ручек реализовать следующий функционал:
* отрисовка ручек с собственными глифами;
* выполнение пользовательских операций, когда пользователь активирует ручку или наводит на нее курсор;
* управление контекстным меню при использовании ручек;
* получение подробных уведомлений об операциях редактирования с использованием ручек.
Когда пользовательский класс реализует метод Entity.GetGripPoints(), он заполняет аргумент GripDataCollection объектами GripData, по одному на каждую точку захвата.
Объект GripData содержит два обязательных элемента, определяющих ручку:
* фактическая 3D-точка ручки,
* указатель на структуру данных пользовательского объекта, который используется в качестве идентификатора ручки.
В объекте GripData представлен также ряд необязательных элементов, содержащих указатели на обратные вызовы, которые вызывающее приложение может вызывать в ходе редактирования ручки, чтобы позволить пользовательскому объекту выполнять обработку событий.
Предусмотрен также ряд необязательных элементов, содержащих указатели на обратные вызовы, которые позволяют реализовать обработку событий пользовательским объектом в ходе редактирования ручки.
Эти указатели могут быть нулевыми, если функциональность не реализована.
Объект также включает опциональную битовую маску, которая позволяет настраивать внешний вид ручки в процессе операций перетаскивания. Эти битовые значения допускают комбинирование посредством операции OR.

Teigha.DatabaseServices.GripData.CallHotGrip(Teigha.DatabaseServices.ObjectId,GripData.Context)
Метод реализует действия при активации (выделении) этой ручки курсором мыши.
Метод реализует действия при активации (выделении) этой ручки курсором мыши.
entityId: Идентификатор объекта чертежа. Тип ObjectId.
contextFlags: Флаги контекста ручки. Перечисление GripData.Context.
Returns: Возвращает результат выполнения операции. Перечисление GripData.ReturnValue.

Teigha.DatabaseServices.GripData.CallHoverGrip(Teigha.DatabaseServices.ObjectId,GripData.Context)
Метод реализует действия при подсветке этой ручки курсором мыши.
Метод реализует действия при подсветке этой ручки курсором мыши.
entityId: Идентификатор объекта чертежа. Тип ObjectId.
contextFlags: Флаги контекста ручки. Перечисление GripData.Context.
Returns: Возвращает результат выполнения операции. Перечисление GripData.ReturnValue.

Teigha.DatabaseServices.GripData.CallViewportDraw(GraphicsInterface.ViewportDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable,System.Int32)
Метод предназначен для отрисовки графики пользовательского глифа ручки, которая зависит от видового экрана.
Метод предназначен для отрисовки графики пользовательского глифа ручки, которая зависит от видового экрана.
worldDraw: Входной интерфейс Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа.  Тип ObjectId.
t: Тип отображения ручки. Перечисление GripData.DrawType.
imageGripPoint: Базовая точка изображения ручки. Тип Point3d?.
gripSizeInPixels: Размер ручки в пикселях. Тип int.

Teigha.DatabaseServices.GripData.CallWorldDraw(GraphicsInterface.WorldDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable,System.Double)
Метод предназначен для отрисовки графики пользовательского глифа ручки, которая не зависит от видового экрана.
Метод предназначен для отрисовки графики пользовательского глифа ручки, которая не зависит от видового экрана.
worldDraw: Входной интерфейс Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа. Тип ObjectId.
t: Тип отображения ручки. Перечисление GripData.DrawType.
imageGripPoint: Базовая точка изображения ручки. Тип Point3d?.
dGripSize: Размер ручки. Тип double.
Returns: Возвращает true в случае успешного завершения операции.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.ChangeGripStatus(Teigha.DatabaseServices.ObjectId,Status)
Метод предназначен для изменения статуса этой ручки.
Метод предназначен для изменения статуса этой ручки.
entityId: Идентификатор объекта чертежа. Тип ObjectId.
newStatus: Новый статус ручки. Перечисление GripData.Status.

Teigha.DatabaseServices.GripData.GetHotGripDimensionData(System.Double)
Метод позволяет получить данные размера с активной ручкой.
Метод позволяет получить данные размера с активной ручкой.
dimScale: Масштаб размера. Тип double.
Returns: Возвращает данные размера. Тип DynamicDimensionDataCollection.

Teigha.DatabaseServices.GripData.GetHoverDimensionData(System.Double)
Метод позволяет получить данные подсвеченного размера.
Метод позволяет получить данные подсвеченного размера.
dimScale: Масштаб размера. Тип double.
Returns: Возвращает данные подсвеченного размера. Тип DynamicDimensionDataCollection.

Teigha.DatabaseServices.GripData.OnGripStatusChanged(Teigha.DatabaseServices.ObjectId,Status)
Метод предназначен для обработки события изменения статуса ручки.
Метод предназначен для обработки события изменения статуса ручки.
entityId: Идентификатор объекта чертежа. Тип ObjectId.
newStatus: Новый статус ручки. Перечисление GripData.Status.

Teigha.DatabaseServices.GripData.OnHotGrip(Teigha.DatabaseServices.ObjectId,Teigha.GraphicsInterface.Context)
Метод предназначен для обработки события, когда ручка становится активной (выделенной).
Метод предназначен для обработки события, когда ручка становится активной (выделенной).
entityId: Идентификатор объекта чертежа. Тип ObjectId.
contextFlags: Флаги контекста ручки. Перечисление Context.
Returns: Возвращает результат выполнения операции. Перечисление GripData.ReturnValue.

Teigha.DatabaseServices.GripData.OnHover(Teigha.DatabaseServices.ObjectId,Teigha.GraphicsInterface.Context)
Метод предназначен для обработки события подсвечивания этой ручки курсором мыши.
Метод предназначен для обработки события подсвечивания этой ручки курсором мыши.
entityId: Идентификатор объекта чертежа. Тип ObjectId.
contextFlags: Флаги контекста ручки. Перечисление Context.
Returns: Возвращает результат выполнения операции. Перечисление GripData.ReturnValue.

Teigha.DatabaseServices.GripData.OnRightClick(Teigha.DatabaseServices.GripDataCollection,Teigha.DatabaseServices.ObjectIdCollection)
Метод предназначен для обработки события нажатия правой кнопки мыши на этой ручке.
Метод предназначен для обработки события нажатия правой кнопки мыши на этой ручке.
hotGrips: Коллекция активных ручек. Тип GripDataCollection.
entities: Коллекция идентификаторов объектов чертежа.  Тип ObjectIdCollection.
Returns: Возвращает интерфейс System.Collections.Generic.IEnumerable.

Teigha.DatabaseServices.GripData.ViewportDraw(GraphicsInterface.ViewportDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable,System.Int32)
Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, зависящей от видового экрана. Возвращаемое значение может быть нулевым.
Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, зависящей от видового экрана. Возвращаемое значение может быть нулевым.
worldDraw: Входной интерфейс Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа. Тип ObjectId.
t: Тип отображения ручки. Перечисление GripData.DrawType.
imageGripPoint: Точка привязки изображения ручки. Тип Point3d?.
gripSizeInPixels: Размер ручки в пикселях. Тип int.
Returns: Возвращает true в случае успешного завершения операции.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.WorldDraw(GraphicsInterface.WorldDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable,System.Double)
Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, не зависящей от видового экрана.
Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, не зависящей от видового экрана.  Возвращаемое значение может быть нулевым.
worldDraw: Входной интерфейс Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа.  Тип ObjectId.
t: Тип отображения ручки. Перечисление GripData.DrawType.
imageGripPoint: Точка привязки ручки. Тип Point3d?.
dGripSize: Размер ручки. Тип double.
Returns: Возвращает true в случае успешного завершения операции.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.AlternateBasePoint
Свойство обеспечивает доступ к альтернативной базовой точке этой ручки.
Свойство обеспечивает доступ к альтернативной базовой точке этой ручки.
Returns: Возвращает базовую точку ручки. Тип Point3d?.

Teigha.DatabaseServices.GripData.AppData
Свойство возвращает данные приложения, связанные с этим объектом ручки.
Свойство возвращает данные приложения, связанные с этим объектом ручки.
Returns: Возвращает указатель на данные этой ручки. Тип IntPtr.

Teigha.DatabaseServices.GripData.DrawAtDragImageGripPoint
Свойство определяет, следует ли отрисовывать глиф ручки в базовой точке перемещаемого изображения ручки.
Свойство определяет, следует ли отрисовывать глиф ручки в базовой точке перемещаемого изображения ручки.
Returns: Возвращает true, если глиф ручки должен отрисовываться.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.ForcedPickOn
Свойство определяет, следует ли идентифицировать все объекты в пределах зоны выделения, независимо от того, получена ли точка и активны ли в данный момент какие-либо конкретные режимы объектной привязки OSNAP.
Свойство определяет, следует ли идентифицировать все объекты в пределах зоны выделения, независимо от того, получена ли точка и активны ли в данный момент какие-либо конкретные режимы объектной привязки OSNAP.
Returns: Возвращает true, если следует идентифицировать все объекты в пределах зоны выделения. В противном случае возвращает false.

Teigha.DatabaseServices.GripData.GizmosEnabled
Свойство определяет, следует ли использовать гизмо для изменения ручки.
Свойство определяет, следует ли использовать гизмо для изменения ручки.
Если это свойство принимает значение true, гизмо появляются при подсвечивании ручки курсором.
Returns: Возвращает true, если гизмо должны появляться при подсвечивании ручки курсором.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.GripPoint
Свойство предоставляет доступ к точке привязки этой ручки.
Свойство предоставляет доступ к базовой точке этой ручки.
Returns: Возвращает базовую точку ручки. Тип Point3d.

Teigha.DatabaseServices.GripData.HotGripInvokesRightClick
Свойство определяет, назначено ли выделение ручки нажатию правой кнопки мыши.
Свойство определяет, назначено ли выделение ручки нажатию правой кнопки мыши.
Returns: Возвращает true, если ручка становится активной при нажатии правой кнопки мыши.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.IsPerViewport
Свойство определяет, используется ли эта ручка в каждом видовом экране.
Свойство определяет, используется ли эта ручка в каждом видовом экране.
Returns: Возвращает true, если ручка используется в каждом видовом экране.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.ModeKeywordsDisabled
Свойство предоставляет возможность отключить активацию ключевых слов.
Свойство предоставляет возможность отключить активацию ключевых слов.
Returns: Возвращает true, если активация ключевых слов отключена.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.RubberBandLineDisabled
Свойство определяет, допускается ли отображать резиновую линию во время любых операций перетаскивания.
Свойство определяет, допускается ли отображать резиновую линию во время любых операций перетаскивания.
Returns: Возвращает true, если отображение резиновой линии не допускается.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.SkipWhenShared
Свойство определяет, следует ли пропускать отрисовку пользовательской графики этой ручки, если ее базовая точка является общей.
Свойство определяет, следует ли пропускать отрисовку пользовательской графики этой ручки, если ее базовая точка является общей.
Returns: Возвращает true, если базовая точка ручки является общей, и отрисовка ручки пропускается.
В противном случае возвращает false.

Teigha.DatabaseServices.GripData.TriggerGrip
Свойство позволяет определить, является ли эта ручка триггерной.
Свойство позволяет определить, является ли эта ручка триггерной.
Returns: Возвращает true, если ручка является триггерной.
В противном случае возвращает false.