Teigha.DatabaseServices.SymbolUtilityServices
Класс SymbolUtilityServices предоставляет различные утилиты для работы с именами символов, записями символов и таблицами символов.
Класс SymbolUtilityServices предоставляет различные утилиты для работы с именами символов, записями символов и таблицами символов.

Teigha.DatabaseServices.SymbolUtilityServices.GetBlockModelSpaceId(Teigha.DatabaseServices.Database)
Метод извлекает идентификатор пространства модели из таблицы предопределенных символов в указанной базе данных.
Метод извлекает идентификатор пространства модели из таблицы предопределенных символов в указанной базе данных.
databasePointer: База данных, в которой ищется идентификатор объекта.
Returns: Возвращает ненулевой идентификатор, представляющий пространство модели в указанной базе данных.
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetBlockNameFromInsertPathName(String)
Метод позволяет извлечь имя блока из указанного имени пути.
Метод позволяет извлечь имя блока из указанного имени пути.
pathName: Имя пути к переданному параметру. Тип String.
Returns: Возвращает строку, которая представляет имя блока. Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.GetBlockPaperSpaceId(Teigha.DatabaseServices.Database)
Метод извлекает идентификатор пространства листа в таблице предопределенных символов из указанной базы данных.
Метод извлекает идентификатор пространства листа в таблице предопределенных символов из указанной базы данных.
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор, представляющий пространство листа в указанной базе данных.
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetInsertPathNameFromBlockName(String)
Метод позволяет извлечь путь из имени блока.
Метод позволяет извлечь путь из имени блока.
Если полученное имя пути не имеет расширения, в конец строки добавляется расширение ".dwg".
blockName: Имя блока, для которого требуется получить путь.
Returns: Возвращает строку с именем блока или пустую строку, если blockName имеет значение NULL.
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.GetLayerDefpointsId(Teigha.DatabaseServices.Database)
Метод предоставляет идентификатор объекта слоя "DEFPOINTS" в указанной базе данных.
Метод предоставляет идентификатор объекта слоя "DEFPOINTS" в указанной базе данных.
database: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор слоя "DEFPOINTS" в базе данных database.
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetLayerZeroId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта слоя "0" .
Метод позволяет извлечь из указанной базы данных идентификатор объекта слоя "0" .
database: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта слоя "0".
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeByBlockId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByBlock".
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByBlock".
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта типа линий "ByBlock".
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeByLayerId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByLayer".
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByLayer".
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта типа линий "ByLayer".
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeContinuousId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "Continuous".
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "Continuous".
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта типа линий "Continuous".
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetMaxSymbolNameLength(System.Boolean,System.Boolean)
Метод предоставляет максимально допустимую длину имен символов.
Метод предоставляет максимально допустимую длину имен символов.
Возвращаемые значения зависят от состояния флага compatibilityMode.
Если установлено значение true, метод возвращает длину 255 символов, в противном случае возвращает 31.
isNewName: Флаг, определяющий, следует извлекать длину для расширенных или устаревших имен символов. Тип bool.
compatibilityMode: Флаг, определяющий, следует обрабатывать расширенные или устаревшие имена символов. Тип bool.
Returns: Возвращает максимально допустимую длину имен символов.
Тип int.

Teigha.DatabaseServices.SymbolUtilityServices.GetPathNameFromSymbolName(String,String)
Метод позволяет извлечь имя пути из указанных имени блока и расширения (или расширений).
Метод позволяет извлечь имя пути из указанных имени блока и расширения (или расширений).
Строка расширения добавляется в конец полученной строки, если она не имеет расширения.
В списке расширения должны разделяться точкой с запятой и не должны иметь точек перед именами расширений, например: "dwg;dxf".
symbolName: Имя блока, из которого требуется получить путь. Тип String.
extensions: Список расширений, для которых выполняется поиск путей. Тип String.
Returns: Возвращает имя пути. Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.GetRegAppAcadId(Teigha.DatabaseServices.Database)
Метод позволяет получить идентификатор объекта зарегистрированного приложения "ACAD" из указанной базы данных.
Метод позволяет получить идентификатор объекта зарегистрированного приложения "ACAD" из указанной базы данных.
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает идентификатор RegApp-объекта "ACAD".
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.GetSymbolNameFromPathName(String,String)
Метод извлекает подходящее имя символа из имени пути.
Метод извлекает подходящее имя символа из имени пути.
Имя символа является частью пути, который представляет имя файла.
Любое из указанных расширений файлов будет удалено.
В случае недопустимого имени пути pathName, имя символа также может быть недопустимым.
Список расширений должен использовать точку с запятой в качестве разделителя.
Расширения не должны иметь точек перед именами расширений, например: "dwg;dxf".
pathName: Имя блока, из которого требуется получить путь. Тип String.
extensions: Список расширений, для которых ищутся имена символов. Тип String.
Returns: Возвращает имя блока. Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.GetTextStyleStandardId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь идентификатор стандартного текстового стиля.
Метод позволяет извлечь идентификатор стандартного текстового стиля.
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор стандартного текстового стиля.
Тип ObjectId.

Teigha.DatabaseServices.SymbolUtilityServices.IsBlockLayoutName(String)
Метод позволяет проверить, соответствует ли переданное имя имени записи в таблице блоков листа или имени основного блока пространства листа.
Метод позволяет проверить, соответствует ли переданное имя имени записи в таблице блоков листа или имени основного блока пространства листа.
Строка нормализуется перед сравнением с предопределенным именем.
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если имя name соответствует имени записи в таблице блоков листа или имени основного блока пространства листа. В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsBlockModelSpaceName(String)
Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства модели.
Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства модели.
Перед сравнением строка нормализуется.
В версии ACAD12 имя пространства модели — "*Model_Space", а для всех остальных версий имя пространства модели — "$Model_Space".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если указанное имя соответствует имени блока пространства модели.
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsBlockPaperSpaceName(String)
Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства листа.
Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства листа.
Перед сравнением строка нормализуется.
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если указанное имя соответствует имени пространства листа.
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsCompatibilityMode(Teigha.DatabaseServices.Database)
Метод позволяет проверить настройку EXTNAMES для указанной базы данных.
Метод позволяет проверить настройку EXTNAMES для указанной базы данных.
database: Проверяемая база данных. Тип Database.
Returns: Возвращает true, если используется режим совместимости.
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsLayerDefpointsName(String)
Метод позволяет проверить, соответствует ли переданная строка имени слоя "Defpoints".
Метод позволяет проверить, соответствует ли переданная строка имени слоя "Defpoints".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если строка name соответствует имени слоя "Defpoints".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsLayerZeroName(String)
Метод позволяет проверить, соответствует ли входная строка имени слоя "0".
Метод позволяет проверить, соответствует ли входная строка имени слоя "0".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если строка name соответствует имени слоя "0".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeByBlockName(String)
Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByBlock".
Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByBlock".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если строка name соответствует имени типа линии "ByBlock".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeByLayerName(String)
Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByLayer".
Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByLayer".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если строка name соответствует имени типа линии "ByLayer".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeContinuousName(String)
Метод позволяет проверить, соответствует ли входная строка имени типа линии "Continuous".
Метод позволяет проверить, соответствует ли входная строка имени типа линии "Continuous".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если строка name соответствует имени типа линии "Continuous".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsRegAppAcadName(String)
Метод позволяет проверить, соответствует ли входная строка имени зарегистрированного приложения "ACAD".
Метод позволяет проверить, соответствует ли входная строка имени зарегистрированного приложения "ACAD".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если строка name соответствует имени имени RegApp-объекта "ACAD".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsTextStyleStandardName(String)
Метод позволяет проверить, соответствует ли входная строка имени стиля текста "Standard".
Метод позволяет проверить, соответствует ли входная строка имени стиля текста "Standard".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если входная строка name соответствует имени стиля текста "Standard".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.IsViewportActiveName(String)
Метод позволяет проверить, соответствует ли входная строка активному имени видового экрана "*Active".
Метод позволяет проверить, соответствует ли входная строка активному имени видового экрана "*Active".
name: Проверяемое имя. Тип String.
Returns: Возвращает true, если входная строка name соответствует активному имени видового экрана "*Active".
В противном случае возвращает false.

Teigha.DatabaseServices.SymbolUtilityServices.MakeDependentName(String,String)
Метод позволяет объединить указанные имя чертежа и имя символа, чтобы получить зависимое имя символа.
Метод позволяет объединить указанные имя чертежа и имя символа, чтобы получить зависимое имя символа.
dwgName: Имя чертежа. Тип String.
symbolName: Имя символа. Тип String.
Returns: Возвращает строку, которая представляет объединение имён параметров name и symbolName.
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.PreValidateSymbolName(String,System.Boolean)
Метод выполняет предварительную подготовку строки к последующей проверке на соответствие наименованию символа.
Метод выполняет предварительную подготовку строки к последующей проверке на соответствие наименованию символа.
Выполняется нормализация наименования, удаляются ведущие и замыкающие пробелы. Если аргумент preserveCase принимает значение false, то вся строка преобразуется в верхний регистр.
symbolName: Наименование символа. Тип String.
preserveCase: Флаг, определяющий, следует ли сохранять регистр алфавитных знаков в строке. Тип bool.
Returns: Возвращает строку, прошедшую предварительную подготовку. Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.RepairPreExtendedSymbolName(String,System.Boolean)
Метод предоставляет строку, являющуюся результатом "восстановления" входной строки для приведения её к виду, когда строка содержит только допустимые символы в соответствии с устаревшими требованиями к именам символов.
Метод предоставляет строку, являющуюся результатом "восстановления" входной строки для приведения её к виду, когда строка содержит только допустимые символы в соответствии с устаревшими требованиями к именам символов.
В случае обнаружения недопустимых знаков они заменяются допустимыми.
Обработка входной строки выполняется аналогично методу ValidatePreExtendedSymbolName().
oldName: Исходное имя символа, подлежащее восстановлению. Тип String.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.
Returns: Возвращает восстановленное имя символа.
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.RepairSymbolName(String,System.Boolean)
Метод обеспечивает "восстановление" входной строки - приведение её к виду, когда она гарантированно содержит только допустимые символы в соответствии с требованиями к расширенным именам символов.
Метод обеспечивает "восстановление" входной строки - приведение её к виду, когда она гарантированно содержит только допустимые символы в соответствии с требованиями к расширенным именам символов.
В случае обнаружения недопустимых знаков они заменяются допустимыми.
Обработка входной строки выполняется аналогично методу  ValidateSymbolName().
oldName: Исходное имя символа, подлежащее восстановлению. Тип String.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.
Returns: Возвращает восстановленное имя символа.
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.ValidateCompatibleSymbolName(String,System.Boolean,System.Boolean,System.Boolean)
Метод позволяет проверить, удовлетворяет ли заданная строка требованиям, предъявляемым к имени символа (в частности, приемлема ли её длина).
Метод позволяет проверить, удовлетворяет ли заданная строка требованиям, предъявляемым к имени символа.
В частности, проверяется, не превышена ли длина имени.
Если isNewName имеет значение true, имя проверяется на соответствие требованиям к имени нового символа.
В противном случае оно проверяется на соответствие требованиям существующего имени символа.
Если compatibilityMode имеет значение true, то используются правила для расширенного имени символа.
В противном случае проверяется старый формат имен (т.е. 31 символ без пробелов, буквы, цифры, знаки доллара, подчеркивания и дефиса).
Заметим, что применяемые правила определяются текущим значением системной переменной EXTNAMES.
Если EXTNAMES=1, используются расширенные правила, а если EXTNAMES=0, то старые правила.
Если allowVerticalBar имеет значение true, в имени символа разрешен знак вертикальной черты.
name: Проверяемое имя. Тип String.
isNewName: Флаг, определяющий, следует ли рассматривать name как имя нового символа или как имя уже существующего. Тип bool.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.
compatibilityMode: Флаг, определяющий, должно ли входное имя name проверяться на соответствие расширенным или устаревшим правилам. Тип bool.
Returns: Возвращает ErrorStatus.OK, если проверка прошла успешно, или соответствующий код ошибки в противном случае.
Тип ErrorStatus.

Teigha.DatabaseServices.SymbolUtilityServices.ValidatePreExtendedSymbolName(String,System.Boolean)
Метод реализует проверку указанного имени на соответствие устаревшим требованиям к именам символов.
Метод реализует проверку указанного имени на соответствие устаревшим требованиям к именам символов.
name: Проверяемое входное имя. Тип String.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.

Teigha.DatabaseServices.SymbolUtilityServices.ValidateSymbolName(String,System.Boolean)
Метод реализует проверку указанного имени на соответствие требованиям к расширенным именам символов.
Метод реализует проверку указанного имени на соответствие требованиям к расширенным именам символов.
name: Проверяемое входное имя. Тип String.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип bool.

Teigha.DatabaseServices.SymbolUtilityServices.BlockModelSpaceName
Свойство BlockModelSpaceName представляет предопределенную запись символа для имени пространства модели.
Свойство BlockModelSpaceName представляет предопределенную запись символа для имени пространства модели.
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя пространства модели.
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.BlockPaperSpaceName
Свойство BlockPaperSpaceName представляет предопределенную запись символа для имени пространства листа.
Свойство BlockPaperSpaceName представляет предопределенную запись символа для имени пространства листа.
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя пространства листа.
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.LayerDefpointsName
Свойство LayerDefpointsName представляет предопределенную запись символа для имени слоя "Defpoints".
Свойство LayerDefpointsName представляет предопределенную запись символа для имени слоя "Defpoints".
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя слоя "Defpoints".
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.LayerZeroName
Свойство LayerZeroName представляет предопределенную запись символа для имени слоя "0".
Свойство LayerZeroName представляет предопределенную запись символа для имени слоя "0".
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя слоя "0".
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.LinetypeByBlockName
Свойство LinetypeByBlockName представляет предопределенную запись символа для имени типа линий "ByBlock".
Свойство LinetypeByBlockName представляет предопределенную запись символа для имени типа линий "ByBlock".
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя типа линий "ByBlock".
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.LinetypeByLayerName
Свойство LinetypeByLayerName представляет предопределенную запись символа для имени типа линий "ByLayer".
Свойство LinetypeByLayerName представляет предопределенную запись символа для имени типа линий "ByLayer".
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя типа линий "ByLayer".
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.LinetypeContinuousName
Свойство LinetypeContinuousName представляет предопределенную запись символа для имени типа линий "Continuous".
Свойство LinetypeContinuousName представляет предопределенную запись символа для имени типа линий "Continuous".
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя типа линий "Continuous".
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.RegAppAcadName
Свойство RegAppAcadName представляет предопределенную запись символа для имени зарегистрированного приложения.
Свойство RegAppAcadName представляет предопределенную запись символа для имени зарегистрированного приложения.
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает имя зарегистрированного приложения.
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.TextStyleStandardName
Свойство TextStyleStandardName представляет предопределенную запись символа для имени текстового стиля "STANDARD".
Свойство TextStyleStandardName представляет предопределенную запись символа для имени текстового стиля "STANDARD".
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает предопределенное имя текстового стиля "STANDARD"
Тип String.

Teigha.DatabaseServices.SymbolUtilityServices.ViewportActiveName
Свойство ViewportActiveName представляет предопределенную запись символа для активного имени видового экрана.
Свойство ViewportActiveName представляет предопределенную запись символа для активного имени видового экрана.
Не может быть ни NULL, ни пустой строкой.
Returns: Возвращает активное имя видового экрана.
Тип String.