Teigha.DatabaseServices.LayerStateManager.AbortLayerStateDelete
Это событие создается, если прерван процесс удаления состояния слоя.
Это событие создается, если прерван процесс удаления состояния слоя.