Teigha.DatabaseServices.TextStyleTableRecord
Класс представляет записи таблицы текстовых стилей TextStyleTable.
Объекты этого класса представляют записи, которые найдены в
TextStyleTable (известной, как таблица "стилей" в DFX).
Каждая из этих записей представляет отдельное множество
параметров текста, таких как фонт, размер по умолчанию,
относительный масштаб по x, является ли он вертикальным или
горизонтальным, и т.д.

Teigha.DatabaseServices.TextStyleTableRecord.#ctor
Конструктор.

Teigha.DatabaseServices.TextStyleTableRecord.BigFontFileName
Обеспечивает доступ к строке имени файла, указывающей на имя
файла крупного шрифта для данного текстового стиля.

Teigha.DatabaseServices.TextStyleTableRecord.FileName
Обеспечивает доступ к строке копии имени файла, указывающей
на имя файла шрифта для данного текстового стиля.

Teigha.DatabaseServices.TextStyleTableRecord.FlagBits
Обеспечивает доступ к значению битовых флагов текстового
стиля. Только второй и третий биты используются. Если второй
бит установлен в 1, то это означает, что текст отображается
справа налево (зеркально по X). Если третий бит установлен в
1, то это означает, что текст отображается снизу вверх
(зеркально по Y).

Teigha.DatabaseServices.TextStyleTableRecord.Font
Возвращает данные определения шрифта из записи текстового
стиля. Возвращаются наименование шрифта, его атрибуты —
полужирный и курсив, множество символов, высота и т.д.

Teigha.DatabaseServices.TextStyleTableRecord.IsShapeFile
Обеспечивает доступ к признаку, равному true, если файл
текстового шрифта интерпретируется как запись формы, и
равному false, если он интерпретируется как текстовая запись.

Teigha.DatabaseServices.TextStyleTableRecord.IsVertical
Обеспечивает доступ к признаку, установленному в true тогда и
только тогда, когда текстовый стиль рисуется вертикально.

Teigha.DatabaseServices.TextStyleTableRecord.ObliquingAngle
Возвращает угол наклона символов для TextStyleTableRecord.
Угол наклона текста представляет собой угол от текстовой
вертикали, т.е. вершина символов наклоняется относительно их
основания, как в курсиве. Положительный угол наклоняет
символы вправо. К отрицательному значению добавляется 2 pi,
чтобы они стали положительными.

Teigha.DatabaseServices.TextStyleTableRecord.PriorSize
Обеспечивает доступ к высоте текста, используемого последним
текстом, созданным с использованием текстового стиля. Эта
величина автоматически обновляется nanoCAD после создания
любого текстового объекта, который ссылается на эту строку
TextStyleTableRecord. Если значение свойства textSize для
этого текстового стиля равно 0, то значение priorSize
является высотой текста по умолчанию для следующего текста,
который будет создан, используя данный текстовый стиль.

Teigha.DatabaseServices.TextStyleTableRecord.TextSize
Возвращает размер текста по умолчанию для текстов,
отображаемых с помощью данного текстового стиля.
Если эта величина равна 0, то каждое использование команд
nanoСAD TEXT и DTEXT приглашает ввести высоту текста для
использования в создаваемом текстовом объекте. Если свойство
textsize не равно 0, то команды TEXT и DTEXT приглашения не
выдают и в качестве высоты текста используется значение
textsize.

Teigha.DatabaseServices.TextStyleTableRecord.XScale
Это свойство обеспечивает доступ к фактору ширины (также
называемому относительным фактором X-масштаба) для
TextStyleTableRecord.
widthFactor применяется к ширине текста, чтобы ширина могла
определяться в зависимости от высоты. Например, если
widthFactor имеет значение 0.8, то текст отображается с
шириной, равной 0.8 от нормальной "непривязанной" ширины.