Teigha.DatabaseServices.OpenCloseTransaction.Abort
Метод позволяет прервать текущую открытую транзакцию. Инициирует откат всех изменений объектов с момента начала транзакции.
Метод позволяет прервать текущую открытую транзакцию. Инициирует откат всех изменений объектов с момента начала транзакции.