Teigha.DatabaseServices.Planarity
Перечисление Planarity определяет плоскостность геометрических объектов (плоский, неплоский, линейный).
Перечисление Planarity определяет плоскостность геометрических объектов.