HostMgd.EditorInput.JigPrompts.AcquirePoint
Метод запрашивает у пользователя точку.
Метод предназначен для запроса у пользователя точки. В основном применяется для интерактивного перемещения
объекта или группы объектов из одной точки в другую. После вызова создает пустой экземпляр класса JigPromptPointOptions и
вызывает свою перегрузку JigPrompts.AcquirePoint(JigPromptPointOptions options).
Returns: Возвращает результат типа , полученный либо из текущего
положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.