Teigha.DatabaseServices.AbstractViewPE.ZoomExtents
Метод зуммирует связанный видовой экран так, чтобы он соответствовал указанным границам в системе координат камеры.
Метод зуммирует связанный видовой экран так, чтобы он соответствовал указанным границам в системе координат камеры.
Returns: Возвращает true в случае успешного завершения метода.
В противном случае возвращает false.