Teigha.Geometry.OffsetSurface
Класс OffsetSurface представляет 3D-поверхность, которая построена как точное смещение другой поверхности.
Класс OffsetSurface представляет 3D-поверхность, которая построена как точное смещение другой поверхности.

Teigha.Geometry.OffsetSurface.#ctor
Конструктор по умолчанию класса OffsetSurface.
Создает новый объект без каких-либо реальных данных (нулевой указатель базовой поверхности и нулевое смещение).
Конструктор по умолчанию класса OffsetSurface.
Инициализирует указатель базовой поверхности значением NULL, а расстояние смещения — значением 0.0.

Teigha.Geometry.OffsetSurface.#ctor(Teigha.DatabaseServices.Surface,System.Double)
Конструктор класса OffsetSurface.
Создает поверхность, являющуюся точным смещением указанной базовой поверхности на заданное расстояние.
Конструктор класса OffsetSurface.
Создает поверхность, являющуюся точным смещением базовой поверхности baseSurface на расстояние offsetDistance.
baseSurface: Входная базовая поверхность.   Тип Surface.
offsetDistance: Величина смещения (со знаком). Тип double.

Teigha.Geometry.OffsetSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип OffsetSurface.

Teigha.Geometry.OffsetSurface.Set(Teigha.DatabaseServices.Surface,System.Double)
Метод позволяет переопределить у данной кривой базовую поверхность и значение смещения.
Метод позволяет переопределить у данной кривой базовую поверхность и значение смещения.
surface: Входная базовая поверхность.   Тип Surface.
offsetDistance: Величина смещения (со знаком). Тип double.

Teigha.Geometry.OffsetSurface.ConstructionSurface
Свойство ConstructionSurface представляет базовую поверхность данного объекта.
Свойство ConstructionSurface представляет базовую поверхность данного объекта.
Returns: Возвращает базовую поверхность.
Тип Geometry.Surface.

Teigha.Geometry.OffsetSurface.IsBoundedPlane
Свойство IsBoundedPlane позволяет определить, является ли поверхность смещения ограниченной плоскостью.
Свойство IsBoundedPlane позволяет определить, является ли поверхность смещения ограниченной плоскостью.
Returns: Возвращает true, если поверхность смещения представлена ограниченной плоскостью.
В противном случае возвращает false.

Teigha.Geometry.OffsetSurface.IsCone
Свойство IsCone позволяет определить, является ли поверхность смещения конусом.
Свойство IsCone позволяет определить, является ли поверхность смещения конусом.
Returns: Возвращает true, если поверхность смещения представлена конусом.
В противном случае возвращает false.

Teigha.Geometry.OffsetSurface.IsCylinder
Свойство IsCylinder позволяет определить, является ли поверхность смещения цилиндром.
Свойство IsCylinder позволяет определить, является ли поверхность смещения цилиндром.
Returns: Возвращает true, если  поверхность смещения представлена цилиндром.
В противном случае возвращает false.

Teigha.Geometry.OffsetSurface.IsPlane
Свойство IsPlane  позволяет определить, является ли поверхность смещения плоскостью.
Свойство IsPlane  позволяет определить, является ли поверхность смещения плоскостью.
Returns: Возвращает true, если поверхность смещения является плоскостью.
В противном случае возвращает false.

Teigha.Geometry.OffsetSurface.IsSphere
Свойство IsSphere позволяет определить, является ли поверхность смещения сферой.
Свойство IsSphere позволяет определить, является ли поверхность смещения сферой.
Returns: Возвращает true, если поверхность смещения является плоскостью.
В противном случае возвращает false.

Teigha.Geometry.OffsetSurface.IsTorus
Свойство IsTorus позволяет определить, является ли поверхность смещения тором.
Свойство IsTorus позволяет определить, является ли поверхность смещения тором.
Returns: Возвращает true, если поверхность смещения является тором.
В противном случае возвращает false.

Teigha.Geometry.OffsetSurface.OffsetDist
Свойство OffsetDist представляет величину смещения (со знаком).
Свойство OffsetDist представляет величину смещения (со знаком).
Returns: Возвращает величину смещения (со знаком). Тип double.

Teigha.Geometry.OffsetSurface.OriginalSurface
Свойство OriginalSurface вычисляет указатель на исходную поверхность.
Свойство OriginalSurface вычисляет указатель на исходную поверхность.
Returns: Возвращает исходную поверхность.
Тип Geometry.Surface.