Teigha.Geometry.Torus.GetAnglesInV
Метод предоставляет начальный и конечный углы V поворота в пределах образующей окружности тора.
Метод предоставляет начальный и конечный углы V поворота в пределах образующей окружности тора (начальную и конечную широту).
Notes
Результатом является массив с начальными и конечными углами для параметра V.
Индексы возвращаемого массива:
* 0 — Начальный угол V.
* 1 — Конечный угол V.
Returns: Возвращает двухэлементный массив, в котором нулевой и первый элементы представляют начальное и конечное значения V, соответственно.
Тип double[].