Teigha.DatabaseServices.LoftOptionsNormalOption.LastNormal
Значение: 2.
Если установлено это значение, направление поверхности в последнем поперечном сечении будет совпадать с нормалью плоскости поперечного сечения.