HostMgd.EditorInput.PointFilterResult
Класс обеспечивает выходными данными событие PointFilter класса Editor.
Он соответтсвует выходным параметрам HostEdInputPointFilter.processInputPoint() nanoCAD API.

HostMgd.EditorInput.PointFilterResult.DisplayObjectSnapGlyph
Если значение свойства С true, nanoCAD будет отображать
значок объектной привязки, даже если вычисленная точка
изменена приложением.

HostMgd.EditorInput.PointFilterResult.NewPoint
Возвращает новую точку, если changedPoint равно true.

HostMgd.EditorInput.PointFilterResult.Retry
Возвращает признак того, нужно ли заставить пользователя
повторить попытку.

HostMgd.EditorInput.PointFilterResult.ToolTipText
Возвращает строку подсказки инструмента.