Teigha.Geometry.Matrix2dInfo
Структура Matrix2dInfo инкапсулирует данные, возвращаемые методом Matrix2d.IsConformal().
Структура Matrix2dInfo инкапсулирует данные, возвращаемые методом Matrix2d.IsConformal().

Teigha.Geometry.Matrix2dInfo.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если указанный объект равен данному объекту.
В противном случае возвращает false.

Teigha.Geometry.Matrix2dInfo.IsEqualTo(Teigha.Geometry.Matrix2dInfo)
Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo.
Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo.
Используется вызов метода Matrix2dInfo.IsEqualTo(Matrix2dInfo a, Tolerance tolerance) с точностью, равной Tolerance.Global.
Notes
Объекты типа Matrix2dInfo считаются равными, если
* Равны масштабные множители;
* Равны углы поворота;
* В обеих матрицах присутствует, либо в обеих отсутствует зеркальное отражение;
* Совпадают направления зеркального отражения.
a: Входной проверяемый объект. Тип Matrix2dInfo.
Returns: Возвращает true, если с используемой точностью объекты можно считать равными.
В противном случае возвращает false.

Teigha.Geometry.Matrix2dInfo.IsEqualTo(Teigha.Geometry.Matrix2dInfo,Teigha.Geometry.Tolerance)
Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo c заданной точностью.
Метод проверяет равенство данного объекта указанному объекту типа Matrix2dInfo c заданной точностью.
Notes
Объекты типа Matrix2dInfo считаются равными, если
* Равны масштабные множители;
* Равны углы поворота;
* В обеих матрицах присутствует, либо в обеих отсутствует зеркальное отражение;
* Совпадают направления зеркального отражения.
a: Входной объект для сравнения. Тип Matrix2dInfo.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если с точностью tolerance объекты можно считать равными.
В противном случае возвращает false.

Teigha.Geometry.Matrix2dInfo.ToString(IFormatProvider)
Метод предоставляет эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Метод предоставляет эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Тип String.

Teigha.Geometry.Matrix2dInfo.!=(Teigha.Geometry.Matrix2dInfo,Teigha.Geometry.Matrix2dInfo)
Оператор неравенства структуры Matrix2dInfo.
Оператор неравенства структуры Matrix2dInfo.
a: Левый  операнд. Тип Matrix2dInfo.
b: Правый операнд. Тип Matrix2dInfo.
Returns: Возвращает true, если операнды не равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.Matrix2dInfo.==(Teigha.Geometry.Matrix2dInfo,Teigha.Geometry.Matrix2dInfo)
Оператор равенства структуры Matrix2dInfo.
Оператор равенства структуры Matrix2dInfo.
a: Левый  операнд. Тип Matrix2dInfo.
b: Правый операнд. Тип Matrix2dInfo.
Returns: Возвращает true, если операнды равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.Matrix2dInfo.Angle
Свойство Angle представляет значение угла поворота в матрице.
Свойство Angle представляет значение угла поворота в матрице.
Returns: Возвращает значение угла поворота. Тип double.

Teigha.Geometry.Matrix2dInfo.IsMirror
Свойство IsMirror позволяет проверить наличие в матрице компоненты зеркального отражения.
Свойство IsMirror позволяет проверить наличие в матрице компоненты зеркального отражения.
Returns: Возвращает true, если в преобразовании присутствует компонента зеркального отражения.
В противном случае возвращает false.

Teigha.Geometry.Matrix2dInfo.Reflex
Свойство Reflex представляет направление оси зеркального отражения в матрице.
Свойство Reflex представляет направление оси зеркального отражения в матрице.
Returns: Возвращает направление оси зеркального отражения.
Тип Vector2d.

Teigha.Geometry.Matrix2dInfo.Scale
Свойство Scale представляет масштабный коэффициент матрицы.
Свойство Scale представляет масштабный коэффициент матрицы.
Возвращаемое значение равно квадратному корню длины вектора-столбца наибольшей длины.
Returns: Возвращает масштабный коэффициент матрицы.
Тип double.