Teigha.DatabaseServices.ViewportTable
Класс предназначен для хранения определений видовых экранов
пространства модели в базе данных чертежа.
Класс предназначен для хранения определений видовых экранов
пространства модели в базе данных чертежа, то есть является
коллекцией/таблицей, в которой каждая запись – это
определение видового экрана, предназначенного для
пространства модели.
Таблица уникальна тем, что может содержать записи с
одинаковыми именами. Записи с одинаковыми именами означают
конфигурацию видовых экранов, которые будут находиться в
пространстве модели одновременно.
Сколько видовых экранов в конфигурации – столько же и записей
в таблице видовых экранов с одинаковым именем. Определение
видового экрана – это набор данных, определяющий его
характеристики: название, яркость, ракурс, номер, фон и пр.
Видовые экраны создаются для компоновки различных фрагментов
или видов чертежа. По умолчанию, в чертеже всегда есть
стандартные конфигурации видовых экранов, которыми можно
воспользоваться либо с помощью меню/ленты (Вид -gt; Видовые
экраны/ Вид -gt; Видовые экраны модели -gt; Конфигурация),
либо при помощи команд:
Стандартные конфигурации видовых экранов пространства модели
в таблице видовых экранов не хранятся. В таблицу входят
только конфигурации, созданные пользователем, и видовые
экраны, которые в настоящее время видны на экране. В
интерфейсе nanoCAD каждое определение конфигурации видовых
экранов (запись в таблице конфигураций видовых экранов)
является конфигурацией в перечне сохраненных(именованных)
конфигураций. Сам перечень именованных конфигураций отражает
всё содержимое таблицы:
Такой перечень можно увидеть несколькими способами:
* Через меню: Вид #45;gt; Видовые экраны #45;gt;
Именованные ВЭ.
* Через ленту: Вид #45;gt; Видовые экраны модели #45;gt;
Кнопка «Видовые экраны»
* Через команду VIEWPORTS или VPORTS, также есть
локализованной вариант
ВИДОВЫЕЭКРАНЫ или ВЭКРАН #45;gt; Вкладка «Именованные
ВЭкраны».
Для определения видового экрана пространства модели
используется класс ViewportTableRecord. Соответственно, все
записи таблицы видовых экранов имеют тип данных
ViewportTableRecord. Итератор таблицы устроен так, что при
переборе строк таблицы перебираются ObjectId каждого
элемента, а не сами записи таблицы. По ObjectId можно открыть
каждую запись и получить подробные данные о видовом экране,
либо изменить их. Для определения видовых экранов
пространства листа используется класс Viewport. Информация о
всех видовых экранах пространства листа хранится в
определении листа (класс Layout).
Example
В качестве примера приведена команда VIEWPORTTABLEREADING,
считывающая содержимое таблицы видовых экранов. Считанная
информация выводится в командную строку nanoCAD.
C#