Teigha.DatabaseServices.UnderlayFile
Класс UnderlayFile реализуется хост-приложениями, которым требуется поддержка подложек.
Класс UnderlayFile реализуется хост-приложениями, которым требуется поддержка подложек.
Используется объектами UnderlayDefinition и UnderlayReference.

Teigha.DatabaseServices.UnderlayFile.Items
Свойство Items представляет элементы, на которые должны быть ссылки.
Свойство Items представляет элементы, на которые должны быть ссылки.
Returns: Возвращает коллекцию элементов, на которые должны быть ссылки. Тип UnderlayItemCollection.