Teigha.DatabaseServices.FullSubentityPath.GetObjectIds
Метод позволяет получить массив идентификаторов всех объектов, которые составляют путь к подобъекту.
Метод позволяет получить массив идентификаторов всех объектов, которые составляют путь к подобъекту.
Returns: Возвращает массив идентификаторов объектов. Тип ObjectId[].