Teigha.GraphicsSystem.Device.Invalidate
Метод предназначен для уведомления о том, что вся отображаемая область стала недействительной и нуждается в обновлении.
Метод предназначен для уведомления о том, что вся отображаемая область стала недействительной и нуждается в обновлении.