Teigha.GraphicsSystem.Device.OnRealizeForegroundPalette
Метод сообщает данному устройству, что его палитру следует переключить в режим переднего плана.
Обычно вызывается, когда окно графического интерфейса получает фокус.
Метод сообщает данному устройству, что его палитру следует переключить в режим переднего плана.
Этот метод обычно вызывается, когда окно графического интерфейса получает фокус.