HostMgd.PlottingServices.PlotInfoValidator
Класс PlotInfoValidator отвечает за формирование набора индикаторов возможных конфликтов при слиянии относящихся к печати настроек из таких объектов как слой, PlotSettings и переопределения устройства вывода, и помогает избежать ошибок, связанных с некорректной конфигурацией печати.
Класс PlotInfoValidator является вспомогательным классом для валидации параметров печати, прежде чем они будут использованы для фактической печати чертежа, и помогает избежать ошибок, связанных с некорректной конфигурацией печати.
Экземпляр PlotInfoValidator представляет объект параметров печати, сформированный на основе относящихся к печати настроек из таких объектов как слой, PlotSettings и переопределения устройства вывода. Он отвечает за формирование набора кодов, служащих индикаторами возможных конфликтов при слиянии таких настроек.
Notes
Валидатор в своем алгоритме проверки поддерживает правила (политики) сопоставления форматов носителей. В зависимости от настройки правил валидатор может попытаться найти подходящий формат бумаги, если на устройстве вывода отсутствует каноническое имя формата, указанное в объекте листа чертежа или в соответствующих переопределениях.  Кроме того, валидатор поддерживает политики создания пользовательского формата бумаги (при возможности) в случае сбоя алгоритма сопоставления.

HostMgd.PlottingServices.PlotInfoValidator.#ctor
Конструктор по умолчанию класса PlotInfoValidator.
Конструктор по умолчанию класса PlotInfoValidator.

HostMgd.PlottingServices.PlotInfoValidator.IsCustomPossible(HostMgd.PlottingServices.PlotInfo)
Метод позволяет проверить возможность создания пользовательского формата бумажного носителя, исходя из заданного объекта PlotInfo.
Метод проверяет, возможно ли создать пользовательский формат (размер) бумажного носителя, исходя из заданного объекта PlotInfo.
Этот метод не выполняет проверку входного объекта, и перед вызовом этого метода валидация объекта не требуется.
Для определения размера страницы и типа устройства, которые будут использоваться для создания нестандартного размера носителя, используются свойства листа (layout), переопределения настроек ввода на плоттер и переопределения устройства, извлекаемые из объекта PlotInfo.
Метод возвращает значение, содержащее побитовую комбинацию флагов из перечисления HostMgd.PlottingServices.CustomSizeResults, которые служат индикаторами возможных проблем (если таковые имеются) при создании нестандартного размера бумаги для устройства.
Например, заявленный размер слишком велик для плоттера или при выводе потребуется разворот листа на 90 градусов.
info: Входной экземпляр сервисного класса HostMgd.PlottingServices.PlotInfo, который предоставляет свойства, определяющие печать.
Returns: Возвращает побитовую комбинацию флагов из перечисления HostMgd.PlottingServices.CustomSizeResults. Тип int.

HostMgd.PlottingServices.PlotInfoValidator.Validate(HostMgd.PlottingServices.PlotInfo)
Метод выполняет проверку листа (layout), переопределений параметров печати и переопределений устройств печати для входного объекта PlotInfo.
Метод выполняет проверку листа (layout), переопределений параметров печати и переопределений устройств печати для входного объекта PlotInfo.  Если валидация прошла успешно, объект PlotInfo помечается как проверенный и в нём сохраняются проверенные параметры PlotSettings и PlotConfig.
Notes
Валидатор выполняет следующие проверки согласованности настроек печати:
* Проверка, что идентификатор слоя не нулевой.
* Проверка, что устройство вывода существует и не является устройством «None».
* Проверяет, что носитель (размер) существует на устройстве. (Если носитель отсутствует на устройстве, валидатор может попытаться найти подходящий носитель или создать пользовательский носитель в зависимости от текущей политики соответствия носителей.)
* Проверяет, что лист чертежа (layout) и переопределения настроек печати имеют одинаковое свойство modelType.
* Если в листе чертежа или переопределениях настроек печати указана таблица стилей печати, проверяет, существует ли таблица стилей печати и совместима ли она с режимом рисования (например, CTB/STB).
* Если областью печати является вид (View), то проверяет, существует ли такой вид на чертеже.
* Если область печати определяется окном (Window), проверяет, указано ли допустимое окно.
* Если область печати определяется листом (Layout), проверяет, относится ли этот лист к пространству листа (Пространству модели соответствует значение false).
Валидатор также регистрирует предупреждения при следующих условиях:
* Если размер носителя не изменился, но изменились единицы измерения, а при этом смещение бумаги и масштаб не изменились на соответствующий коэффициент (в зависимости от отношения новых и старых единиц измерения).
* Если альбомная/книжная ориентация исходного листа (layout) отличается от проверенных настроек.
Алгоритм валидации поддерживает политики сопоставления форматов (размеров) бумаги.
В зависимости от настройки политики валидатор может попытаться найти соответствующий размер бумаги, если каноническое имя носителя, указанное в листе (layout) или переопределениях, отсутствует на устройстве.
На случай сбоя алгоритма сопоставления в валидаторе предусмотрена попытка создания пользовательского размера бумаги (если это возможно).
Если политика допускает такие сценарии, и они успешно выполняются, валидированные параметры обновляются с тем, чтобы содержать корректное каноническое имя носителя, размер носителя и границы печати (поля), которые могут отличаться как от исходного формата листа, так и от любых переопределений параметров печати.
info: Проверяемые настройки печати в объекте типа HostMgd.PlottingServices.PlotInfo.

HostMgd.PlottingServices.PlotInfoValidator.DimensionalWeight
Свойство DimensionalWeight представляет весовой коэффициент для размеров в текущих настройках печати.
Свойство DimensionalWeight представляет весовой коэффициент для размеров в текущей конфигурации печати, связанной с объектом PlotInfo.
Notes
См. описание свойства MediaMatchingThreshold.
Returns: Возвращает весовой коэффициент для размеров в настройках печати.
Тип int.

HostMgd.PlottingServices.PlotInfoValidator.MediaBoundsWeight
Свойство MediaBoundsWeight представляет весовой коэффициент для границ носителя и области печати в текущих настройках печати.
Свойство MediaBoundsWeight представляет весовой коэффициент для границ носителя и области печати в текущей конфигурации печати, связанной с объектом PlotInfo.
Notes
См. описание свойства MediaMatchingThreshold.
Returns: Возвращает весовой коэффициент для границ носителя и области печати.
Тип int.

HostMgd.PlottingServices.PlotInfoValidator.MediaGroupWeight
Свойство MediaGroupWeight представляет весовой коэффициент для текущей группы носителей, установленной в конфигурации печати.
Свойство MediaGroupWeight представляет весовой коэффициент для текущей группы носителей в конфигурации печати, связанной с объектом PlotInfo.
Notes
См. описание свойства MediaMatchingThreshold.
Returns: Возвращает весовой коэффициент для текущей группы носителей.
Тип int.

HostMgd.PlottingServices.PlotInfoValidator.MediaMatchingPolicy
Свойство MediaMatchingPolicy представляет политику сопоставления носителей в текущих настройках печати.
Свойство MediaMatchingPolicy представляет политику сопоставления носителей в текущей конфигурации печати, связанной с объектом PlotInfo.  Доступные варианты приведены в перечислении MatchingPolicy.
Returns: Возвращает текущую политику сопоставления носителей.
Перечисление HostMgd.PlottingServices.MatchingPolicy.

HostMgd.PlottingServices.PlotInfoValidator.MediaMatchingThreshold
Свойство MediaMatchingThreshold представляет текущий порог соответствия носителей, который представляет собой максимум из всех значений ошибок, который допускается при сопоставлении характеристик носителей.
Свойство MediaMatchingThreshold представляет текущий порог соответствия носителей, который представляет собой максимум из всех значений ошибок, который допускается при сопоставлении характеристик носителей.
Политика сопоставления носителей сопоставляет размеры носителей, сравнивая желаемые размер и комплекс свойств носителя (указанные в объекте листа (layout) или переопределениях) с размерами и свойствами носителей, доступными для указанного устройства вывода.
Отклонения в этих свойствах умножаются на весовые коэффициенты, а затем суммируются.
Совпадение фиксируется лишь в случае, если полученная взвешенная сумма отклонений не превышает пороговое значение для данного экземпляра носителя.
Вычисление значения Match_Value для оценки соответствия можно представить следующим образом:
Match_Value = (Разница в границах носителя * вес границ) (Разница в области печати * вес области печати) (Разница в размерах * вес размеров) (Разница в типе группы носителей * вес группы носителей)
Подходящим считается любой носитель, для которого значение Match_Value меньше порогового значения соответствия носителя.
Returns: Возвращает пороговое значение для сопоставления характеристик носителей.
Тип int.

HostMgd.PlottingServices.PlotInfoValidator.PrintableBoundsWeight
Свойство PrintableBoundsWeight представляет весовой коэффициент для границ области печати, установленной в конфигурации печати.
Свойство PrintableBoundsWeight представляет весовой коэффициент для границ области печати в конфигурации печати, связанной с объектом PlotInfo.
Notes
См. описание свойства MediaMatchingThreshold.
Returns: Возвращает весовой коэффициент для границ области печати.
Тип int.

HostMgd.PlottingServices.PlotInfoValidator.SheetDimensionalWeight
Свойство SheetDimensionalWeight представляет весовой коэффициент для размеров листа, определенный в конфигурации печати.
Свойство SheetDimensionalWeight представляет весовой коэффициент для размеров листа в конфигурации печати, связанной с объектом PlotInfo.
Notes
См. описание свойства MediaMatchingThreshold.
Returns: Возвращает весовой коэффициент для размеров листа.
Тип int.

HostMgd.PlottingServices.PlotInfoValidator.SheetMediaGroupWeight
Свойство SheetMediaGroupWeight представляет весовой коэффициент для группы носителей.
Свойство SheetMediaGroupWeight представляет весовой коэффициент для группы носителей в конфигурации печати, связанной с объектом PlotInfo.
Notes
См. описание свойства MediaMatchingThreshold
Returns: Возвращает весовой коэффициент для группы носителей.
Тип int.