Teigha.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity
Метод предоставляет значения параметра всех точек сплайна с нарушенной G1 непрерывностью (неколлинеарность касательных векторов слева и справа от точки).
Метод предоставляет значения параметра всех точек сплайна с нарушенной G1 непрерывностью.
В таких точках касательные векторы слева и справа от точки не коллинеарны.
Используется вызов метода NurbCurve3d.GetParametersOfG1Discontinuity(Tolerance tolerance) с точностью, равной Tolerance.Global.
Returns: Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью.
Тип DoubleCollection.