HostMgd.EditorInput.Editor.PromptingForCorner
Событие возникает при начале операции ввода точки, используемой как угол прямоугольной области.
Событие не реализовано.
Событие инициируется перед началом интерактивного ввода точки,
которая будет использована как угол прямоугольной области — например,
при вызове метода GetCorner().
Оно позволяет разработчикам надстроек nanoCAD динамически изменять
параметры приглашения, такие как сообщение, базовая точка, допустимые ограничения и другие,
до начала взаимодействия с пользователем.
Событие реализуется через делегат PromptPointOptionsEventHandler,
который передаёт объект PromptPointOptionsEventArgs, содержащий параметры ввода точки,
и может быть использован для настройки контекста ввода в зависимости от логики команды.
Example
C#