HostMgd.PlottingServices.RefreshCode
Данное перечисление определяет флаги, которые используются при обновлении списков устройств и стилей печати, поддерживаемых классом PlotConfigManager.
Перечисление RefreshCode определяет флаги, которые используются при обновлении списков устройств и стилей печати, поддерживаемых классом PlotConfigManager.