Teigha.GraphicsSystem.View.InvalidateCachedViewportGeometry
Метод позволяет сообщить графической системе, что вся независимая от вида геометрия viewportDraw перестала быть актуальной и нуждается в перерисовке в данном виде.
Метод позволяет сообщить графической системе, что вся независимая от вида геометрия viewportDraw перестала быть актуальной и нуждается в перерисовке в данном виде.