Teigha.DatabaseServices.Curve
Класс Curve является базовым классом для всех классов сущностей, представляющих различные виды геометрических кривых (дуга, окружность, эллипс, сплайн и др.).  Обеспечивает общую для кривых функциональность.
Класс Curve является базовым классом для всех классов сущностей, представляющих различные виды кривых, таких как дуга, окружность, эллипс, сплайн и др.  Как базовый класс, он предоставляет общую для кривых функциональность, например, вычисление параметров точки на кривой, построение кривых со смещением (offset), определение проекций кривой на плоскость и т.д.

Teigha.DatabaseServices.Curve.CreateFromGeCurve(Teigha.Geometry.Curve3d)
Метод CreateFromGeCurve создает экземпляр класса Curve на основе объекта класса Curve3d.
Метод CreateFromGeCurve создает экземпляр класса Curve на основе объекта класса Curve3d. Для геометричеких построений используется точность по умолчанию.
geCurve: Входная кривая, тип Curve3d.
Returns: Возвращает экземпляр класса Curve.

Teigha.DatabaseServices.Curve.CreateFromGeCurve(Teigha.Geometry.Curve3d,Teigha.Geometry.Tolerance)
Метод CreateFromGeCurve создает экземпляр класса Curve из объекта класса Curve3d с точностью Tolerance.
Метод CreateFromGeCurve создает экземпляр класса Curve на основе объекта класса Curve3d.
Точность геометричеких построений задается аргументом типа Tolerance.
geCurve: Входная кривая, тип Curve3d.
tolerance: Допустимая погрешность геометрических построений, тип Tolerance.
Returns: Возвращает экземпляр класса Curve.

Teigha.DatabaseServices.Curve.CreateFromGeCurve(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Метод CreateFromGeCurve создает экземпляр класса Curve из объекта класса Curve3d.
Метод CreateFromGeCurve создает экземпляр класса Curve на основе объекта класса Curve3d с использованием объекта класса Vector3d.
geCurve: Входная кривая, тип Curve3d.
vec: Аргумент типа Vector3d.
Returns: Возвращает экземпляр класса Curve.

Teigha.DatabaseServices.Curve.CreateFromGeCurve(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод CreateFromGeCurve создает экземпляр класса Curve из объекта класса Curve3d с явно указанной точностью, используя аргумент типа Vector3d.
Метод CreateFromGeCurve создает экземпляр класса Curve из объекта класса Curve3d с явно указанной точностью, используя аргумент типа Vector3d.
geCurve: Входная кривая, тип Curve3d.
vec: Аргумент типа Vector3d.
tolerance: Допустимая погрешность геометрических построений, тип Tolerance.
Returns: Возвращает экземпляр класса Curve.

Teigha.DatabaseServices.Curve.Extend(System.Boolean,Teigha.Geometry.Point3d)
Метод Extend достраивает кривую до заданной точки.
Этот метод достраивает кривую до заданной точки toPoint, которая становится новой начальной или конечной точкой кривой.
extendStart: Если аргумент принимает значение true, то до точки toPoint достраивается начало кривой. В противном случае до точки toPoint дотягивается конец кривой.
toPoint: Аргумент определяет новую начальную или конечную точку кривой.

Teigha.DatabaseServices.Curve.Extend(System.Double)
Метод Extend достраивает кривую до новой точки, заданной параметром newParameter.
Этот метод достраивает кривую до новой точки, заданной параметром newParameter.
newParameter: Аргумент типа double, который параметрически задает новую начальную или конечную точку кривой.

Teigha.DatabaseServices.Curve.GetClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Boolean)
Этот метод находит точку на кривой, ближайшую к заданной точке.
Метод GetClosestPointTo находит точку на кривой, ближайшую к заданной точке givenPoint.
givenPoint: Точка типа Point3d (заданная в мировой системе координат WCS), для которой нужно найти ближайшую точку на кривой.
direction: Вектор нормали (в мировой системе координат WCS) плоскости, на которую будет выполняться проецирование.
extend: Аргумент, определяющий, допускается ли достраивать кривую в процессе поиска ближайшей точки.  Задать true, если допускается, и false в противном случае.
Returns: Возвращает экземпляр класса Point3d.

Teigha.DatabaseServices.Curve.GetClosestPointTo(Teigha.Geometry.Point3d,System.Boolean)
Метод сначала проецирует кривую на плоскость, заданную точкой givenPoint, а затем возвращает точку на кривой (в системе координат WCS), ближайшую к точке givenPoint.
Метод проецирует кривую на плоскость, заданную точкой givenPoint, а затем возвращает точку на кривой (в системе координат WCS), ближайшую к точке givenPoint.
givenPoint: Точка типа Point3d (заданная в мировой системе координат WCS), для которой нужно найти ближайшую точку на кривой.
extend: Аргумент, определяющий, допускается ли достраивать кривую в процессе поиска ближайшей точки.  Задать true, если допускается, и false в противном случае.
Returns: Возвращает экземпляр класса Point3d.

Teigha.DatabaseServices.Curve.GetDistanceAtParameter(System.Double)
Метод возвращает длину вдоль кривой до точки, заданной параметром.
Метод возвращает длину вдоль кривой до точки, заданной параметром.
value: Входной объект, представляющий параметр.
Returns: Метод возвращает значение типа double - длину вдоль кривой до точки, заданной входным параметром.

Teigha.DatabaseServices.Curve.GetDistAtPoint(Teigha.Geometry.Point3d)
Метод возвращает расстояние от кривой до заданной точки.
Метод GetDistAtPoint возвращает расстояние от кривой до заданной точки.
point: Входной аргумент типа Point3d, представляющий точку.
Returns: Метод возвращает значение типа double - расстояние от кривой до заданной точки.

Teigha.DatabaseServices.Curve.GetFirstDerivative(Teigha.Geometry.Point3d)
Метод предназначен для получения вектора первой производной кривой в заданной точке кривой.
Метод предназначен для получения вектора первой производной кривой в заданной точке кривой.
point: Объект типа Point3d, представляющий точку, в которой вычисляется вектор касательной.
Returns: Возвращает вектор Vector3d первой производной кривой в точке point на кривой.

Teigha.DatabaseServices.Curve.GetFirstDerivative(System.Double)
Метод предназначен для получения вектора первой производной кривой в точке, заданной параметром value.
Метод предназначен для получения вектора первой производной кривой в точке, заданной параметром value.
value: Входной параметр типа double для вычисления производной.
Returns: Метод возвращает экземпляр класса Vector3d, который представляет вектор первой производной кривой в точке, заданной параметром value.

Teigha.DatabaseServices.Curve.GetGeCurve(Teigha.Geometry.Tolerance)
Метод GetGeCurve, член класса Curve. Возвращает для данной кривой объект Curve3d, вычисленный с заданной точностью tolerance.
Метод GetGeCurve, член класса Curve. Возвращает объект Curve3d для данной кривой, вычисленный с заданной точностью tolerance.
tolerance: Заданная точность вычисления кривой, тип Tolerance.
Returns: Метод возвращает экземпляр класса Curve3d для данной кривой.

Teigha.DatabaseServices.Curve.GetOffsetCurves(System.Double)
Метод создает коллекцию кривых, полученных со смещением (offset).
Метод создает коллекцию кривых, полученных со смещением (offset).
offsetDist: Величина смещения, тип double.
Returns: Возвращает коллекцию типа DBObjectCollection, в которой содержатся построенные кривые.

Teigha.DatabaseServices.Curve.GetOffsetCurvesGivenPlaneNormal(Teigha.Geometry.Vector3d,System.Double)
Метод создает коллекцию кривых, полученных со смещением (offset) в заданной плоскости.
Метод создает коллекцию кривых, полученных со смещением (offset) в заданной плоскости.
normal: Вектор нормали (тип Vector3d) к плоскости, в которой нужно построить кривые со смещением.
offsetDist: Величина смещения, тип double.
Returns: Возвращает коллекцию типа DBObjectCollection, в которой содержатся построенные кривые.

Teigha.DatabaseServices.Curve.GetOrthoProjectedCurve(Teigha.Geometry.Plane)
Метод создает новую кривую как результат проецирования кривой на заданную плоскость.
Метод GetOrthoProjectedCurve создает новую кривую как результат проецирования кривой на заданную плоскость.
planeToProjectOn: Плоскость, на которую следует спроецировать кривую.
Returns: Возвращает новую кривую, спроецированную на плоскость planeToProjectOn, как экземпляр класса Curve.

Teigha.DatabaseServices.Curve.GetParameterAtDistance(System.Double)
Метод определяет параметр кривой для точки, находящейся на заданном расстоянии вдоль кривой от её начала.
Метод определяет параметр кривой для точки, находящейся на расстоянии dist вдоль кривой от её начала.
dist: Заданное расстояние вдоль кривой от ее начала, тип double.
Returns: Значение типа double, которое определяет параметр для точки на кривой, удаленной от начала кривой на заданное расстояние dist.

Teigha.DatabaseServices.Curve.GetParameterAtPoint(Teigha.Geometry.Point3d)
Метод вычисляет параметр кривой для заданной точки.
Метод GetParameterAtPoint вычисляет параметр кривой для заданной точки Point3d.
point: Точка Point3d на кривой (в мировой системе координат WCS), для которой требуется определить значение параметра.
Returns: Возвращает параметр кривой для заданной точки point в виде значения типа double.

Teigha.DatabaseServices.Curve.GetPointAtDist(System.Double)
Метод вычисляет точку на кривой, которая находится на заданном расстоянии вдоль кривой от её начала.
Метод GetPointAtDist вычисляет точку Point3d на кривой, которая находится на заданном расстоянии value вдоль кривой от начальной точки кривой.
value: Величина типа double, которая задает расстояние вдоль кривой от ее начала до положения искомой точки на кривой.
Returns: Объект типа Point3d, который представляет искомую точку на кривой.

Teigha.DatabaseServices.Curve.GetPointAtParameter(System.Double)
Метод определяет точку на кривой Point3d, соответствующую заданному значению параметра кривой.
Метод GetPointAtParameter определяет точку на кривой Point3d, соответствующую заданному значению параметра кривой.
value: Заданное значение параметра кривой (тип double).
Returns: Возвращает объект типа Point3d, который определяет искомую точку на кривой.

Teigha.DatabaseServices.Curve.GetProjectedCurve(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d)
Метод создает новую кривую Curve как результат проецирования кривой вдоль заданного направления projectionDirection на заданную плоскость planeToProjectOn.
Метод GetProjectedCurve создает новый экземпляр класса Curve как результат проецирования кривой вдоль заданного направления projectionDirection на заданную плоскость planeToProjectOn.
planeToProjectOn: Заданная плоскость (тип Plane) для проецирования кривой.
projectionDirection: Заданное направление (тип Vector3d), вдоль которого кривая проецируется на плоскость planeToProjectOn.
Returns: Экземпляр класса Curve, представляющий спроецированную кривую.

Teigha.DatabaseServices.Curve.GetSecondDerivative(Teigha.Geometry.Point3d)
Метод предназначен для получения вектора второй производной кривой в заданной точке.
Метод предназначен для получения вектора второй производной кривой в заданной точке.
point: Точка Point3d на кривой, в которой определяется вторая производная.
Returns: Возвращает вторую производную кривой в заданной точке, представленную экземпляром класса Vector3d.

Teigha.DatabaseServices.Curve.GetSecondDerivative(System.Double)
Метод предназначен для получения вектора второй производной кривой в точке, заданной параметром value.
Метод предназначен для получения вектора второй производной кривой в точке, заданной параметром value.
value: Заданное значение параметра, которое определчяет точку на кривой.
Returns: Возвращает вторую производную кривой в заданной точке, представленную экземпляром класса Vector3d.

Teigha.DatabaseServices.Curve.GetSplitCurves(Teigha.Geometry.DoubleCollection)
Метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать координаты точек на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
Этот метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать координаты точек на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
value: Коллекция типа DoubleCollection с координатами точек на кривой (в мировой системе координат WCS).
Returns: Метод возвращает экземпляр класса DoubleCollection.

Teigha.DatabaseServices.Curve.GetSplitCurves(Teigha.Geometry.Point3dCollection)
Метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать точки на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
Этот метод создает один или несколько объектов, которые являются подкривыми исходной кривой. Коллекция должна содержать точки на кривой, которые используются в качестве начальных или конечных точек вновь созданных подкривых.
value: Коллекция типа Point3dCollection с точками Point3d на кривой.
Returns: Метод возвращает экземпляр класса Point3dCollection.

Teigha.DatabaseServices.Curve.SetFromGeCurve(Teigha.Geometry.Curve3d)
Метод копирует в текущую кривую Curve параметры заданной кривой Curve3d.
Метод копирует в текущую кривую Curve параметры заданной кривой Curve3d.
geCurve: Исходная кривая типа Curve3d.

Teigha.DatabaseServices.Curve.SetFromGeCurve(Teigha.Geometry.Curve3d,Teigha.Geometry.Tolerance)
Метод копирует в текущую кривую Curve параметры заданной кривой Curve3d с указанной точностью Tolerance.
Метод копирует в текущую кривую Curve параметры заданной кривой Curve3d с указанной точностью Tolerance.
geCurve: Исходная кривая типа Curve3d.
tolerance: Предписанная точность геометрических построений, экземпляр класса Tolerance.

Teigha.DatabaseServices.Curve.SetFromGeCurve(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Метод копирует в текущую кривую Curve в заданной плоскости параметры заданной кривой Curve3d.
Метод копирует в текущую кривую Curve в заданной плоскости параметры заданной кривой Curve3d.
geCurve: Исходная кривая типа Curve3d.
vec: Аргумент типа Vector3d, определяющий плоскость построения.

Teigha.DatabaseServices.Curve.SetFromGeCurve(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод копирует в текущую кривую Curve в заданной плоскости параметры заданной кривой Curve3d с указанной точностью Tolerance.
Метод копирует в текущую кривую Curve в заданной плоскости параметры заданной кривой Curve3d с указанной точностью Tolerance.
geCurve: Исходная кривая типа Curve3d.
vec: Аргумент типа Vector3d, определяющий плоскость построения.
tolerance: Предписанная точность геометрических построений, экземпляр класса Tolerance.

Teigha.DatabaseServices.Curve.Area
Свойство возвращает площадь кривой.
Свойство возвращает площадь кривой.

Teigha.DatabaseServices.Curve.Closed
Свойство возвращает true, если кривая является замкнутой.
Свойство возвращает true, если кривая является замкнутой.

Teigha.DatabaseServices.Curve.EndParam
Возвращает значение параметра для конечной точки кривой.
Возвращает значение параметра для конечной точки кривой.

Teigha.DatabaseServices.Curve.EndPoint
Возвращает или задает конечную точку кривой (в мировой системе координат WCS).
Возвращает или задает конечную точку кривой (в мировой системе координат WCS).
Returns: Возвращает или задает конечную точку кривой в виде экземпляра класса Point3d.

Teigha.DatabaseServices.Curve.IsPeriodic
Возвращает true, если кривая является периодической.
Возвращает true, если кривая является периодической.
Returns: Возвращает true, если кривая является периодической и false в противном случае.

Teigha.DatabaseServices.Curve.Spline
Возвращает указатель на аппроксимацию данной кривой сплайном.
Возвращает указатель на аппроксимацию данной кривой сплайном.
Returns: Указатель на объект Spline.

Teigha.DatabaseServices.Curve.StartParam
Обеспечивает доступ к значению параметра для начальной точки кривой.
Обеспечивает доступ к значению параметра для начальной точки кривой.
Returns: Возвращает значение double параметра для начальной точки кривой.

Teigha.DatabaseServices.Curve.StartPoint
Обеспечивает доступ к начальной точке кривой (в мировой системе координат WCS).
Обеспечивает доступ к начальной точке кривой (в мировой системе координат WCS).
Returns: Возвращает или задает начальную точку кривой в виде экземпляра класса Point3d.