Teigha.Geometry.Vector3d.Negate
Метод создает вектор, обратный данному.
Метод создает вектор, обратный данному.
Компоненты полученного вектора отличаются лишь знаком (-x, -y, -z).
Returns: Возвращает вектор, обратный данному.  Тип Vector3d.