HostMgd.EditorInput.Editor.PromptedForAngle
Событие возникает после завершения операции ввода угла пользователем в редакторе nanoCAD.
Событие не реализовано.
Событие инициируется, когда пользователь завершил ввод значения угла через командную строку
или графический интерфейс. Оно используется для получения результата ввода, например,
при вызове метода GetAngle(). Событие позволяет обработать результат ввода — проверить значение,
выполнить действия на основе введённого угла или отреагировать на отмену операции.
Это событие является частью последовательности, связанной с вводом угла:
1. Вызов метода GetAngle() и начало ввода.
2. Завершение ввода и вызов события PromptedForAngle.
Событие реализуется через делегат PromptDoubleResultEventHandler,
который предоставляет доступ к объекту PromptDoubleResult,
содержащему статус операции и введённое пользователем значение.
Notes
Событие полезно при разработке пользовательских команд, требующих точного ввода угловых значений,
и позволяет реагировать на результат ввода сразу после его завершения.
Example
C#