Teigha.DatabaseServices.LeaderDirectionType
Данное перечисление определяет варианты относительного расположения полки мультивыноски.
Данное перечисление определяет варианты относительного расположения полки мультивыноски.