Teigha.DatabaseServices.BlockTable
Класс предназначен для хранения определений блоков в базе
данных чертежа.
Класс предназначен для хранения определений блоков в базе
данных чертежа.
Каждый блок определен записью BlockTableRecord, которая
является вхождением коллекции BlockTable (таблицы блоков). В
таблицу входят два типа блоков: служебные и пользовательские.
Служебные блоки создаются платформой для собственных нужд
(листы, представления размеров, штриховки и пр.).
Пользовательские блоки создаются пользователями через
интерфейс или с помощью API nanoCAD для повторяющихся
фрагментов чертежа.
Все примитивы чертежа хранятся в таблице блоков: либо в
служебных блоках, либо в пользовательских.
Также у всех блоков есть графическая часть BlockReference,
которая ссылается на неграфическую.
Графическая часть пользовательского блока всегда входит в
какой-либо служебный блок, представляющий собой, например,
лист документа.
Example
В качестве примера работы с таблицей блоков приведена команда
BlockTableReading, которая открывает таблицу блоков и
перебирает её содержимое, выводя в команданую строку название
каждого блока и его тип.
C#

Teigha.DatabaseServices.BlockTable.#ctor(IntPtr,System.Boolean)
Констурктор класса.
Констурктор класса.