Teigha.GraphicsInterface.TransientDrawingMode.DirectShortTerm
Значение: 2.
Режим быстрой отрисовки.
В случае 3D-графической системы рендеринг выполняется непосредственно на устройстве (минуя буфер кадра и z-тест).