HostMgd.Runtime.Converter
Этот .NET класс содержит утилиты преобразования
числовых значений углов и расстояний в строковые,
и наоборот.

HostMgd.Runtime.Converter.AngleToString(System.Double)
Конвертирует угол в строку в соответствии
с текущими угловыми единицами и текущей точностью
(системная переменная AUPREC).

HostMgd.Runtime.Converter.AngleToString(System.Double,HostMgd.Runtime.AngularUnitFormat,System.Int32)
Конвертирует угол в строку в соответствии
с заданными угловыми единицами и точностью.

HostMgd.Runtime.Converter.AreaToString(System.Double)
Конвертирует площадь в строку в соответствии
с текущими квадратичными единицами и текущей точностью
(системная переменная LUPREC).

HostMgd.Runtime.Converter.AreaToString(System.Double,DistanceUnitFormat,System.Int32)
Конвертирует площадь в строку в соответствии
с заданными квадратичными единицами и точностью.

HostMgd.Runtime.Converter.DistanceToString(System.Double)
Конвертирует расстояние в строку в соответствии
с текущими линейными единицами и текущей точностью
(системная переменная LUPREC).

HostMgd.Runtime.Converter.DistanceToString(System.Double,DistanceUnitFormat,System.Int32)
Конвертирует расстояние в строку в соответствии
с заданными линейными единицами и точностью.

HostMgd.Runtime.Converter.StringToAngle(String)
Конвертирует строку в угол в соответствии
с текущими угловыми единицами

HostMgd.Runtime.Converter.StringToAngle(String,HostMgd.Runtime.AngularUnitFormat)
Конвертирует строку в угол в соответствии
с заданными угловыми единицами.

HostMgd.Runtime.Converter.StringToDistance(String)
Конвертирует строку в расстояние в соответствии
с текущими линейными единицами

HostMgd.Runtime.Converter.StringToDistance(String,DistanceUnitFormat)
Конвертирует строку в расстояние в соответствии
с заданными линейными единицами.