Teigha.DatabaseServices.XrefOperation.XrefReloadOperation
Значение: 5.
Операция перезагружает заданный по имени блок внешней ссылки.
При этом предполагается, что в базе данных, указанной в HostDb (или в текущем документе, если HostDb имеет значение null), существует валидный блок внешней ссылки с заданным именем.