HostMgd.EditorInput.PromptFileNameResult
Класс содержит результат, возвращаемый после приглашения,
требующего ввода имени файла в методах
Editor.GetFileNameForSave() и Editor.GetFileNameForOpen().

HostMgd.EditorInput.PromptFileNameResult.ReadOnly
Возвращает признак того, является ли приглашение для
получения имени файла для файла только на чтение.

HostMgd.EditorInput.PromptFileNameResult.ToString(IFormatProvider)
Возвращает строковое значение, представляющее данный объект
(полный путь к файлу), в соответствии с заданным форматом,
зависящим от локализации.
provider: Формат, зависящей от локализации