HostMgd.EditorInput.DraggingEventHandler
Делегат предназначен для обработки событий, происходящих
перед началом операции перетаскивания,
и передаёт дополнительные данные через объект события.
Делегат используется как тип метода-обработчика для событий,
возникающих перед началом операции перетаскивания объектов в чертеже nanoCAD.
Он позволяет подписаться на такие события и выполнять пользовательский код
при их возникновении. В отличие от стандартного EventHandler,
этот делегат предоставляет расширенную информацию о контексте перетаскивания
через параметр e типа DraggingEventArgs.
sender: Источник события — обычно объект редактора или элемент интерфейса,
e: Объект, содержащий данные о событии, включая

HostMgd.EditorInput.DraggingEventHandler
Делегат уведомления в начале метода перетаскивания класса Edit