Teigha.Geometry.Surface.IsClosedInU
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении U.
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении U.
Предполагает реализацию в производных классах.
Notes
Используется вызов метода Surface.IsClosedInU(Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
Returns: Возвращает true, если в пределах точности Tolerance.Global
данную поверхность можно считать замкнутой в направлении U.
В противном случае возвращает false.