Teigha.DatabaseServices.IdMappingEventArgs
Этот класс представляет данные для событий, связанных с сопоставлением (мэппингом) идентификаторов (BeginDeepClone, BeginDeepCloneTranslation, InsertMappingAvailable и WblockMappingAvailable) в базе данных.
Этот класс представляет данные для событий, связанных с сопоставлением (мэппингом) идентификаторов (BeginDeepClone, BeginDeepCloneTranslation, InsertMappingAvailable и WblockMappingAvailable) в базе данных.

Teigha.DatabaseServices.IdMappingEventArgs.IdMapping
Свойство возвращает объект IdMapping, ассоциированный с данным событием.
Свойство возвращает объект IdMapping, ассоциированный с данным событием.
Returns: Возвращает карту сопоставления идентификаторов IdMapping, связанную с данным событием.