Teigha.DatabaseServices.Entity.FaceStyleId
Свойство предназначено для получения или установки идентификатора визуального стиля,
применяемого к поверхностям (граням) трехмерного геометрического объекта.
Свойство обеспечивает доступ к идентификатору визуального стиля только для
поверхности объекта.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на объект стиля поверхности (FaceStyle),
который определяет параметры отображения граней объекта, такие как цвет, текстура, освещение и затенение.