HostMgd.ApplicationServices.DocumentIterator
Итератор перебора документов в коллекции документов,
реализующий интерфейс IEnumerator для коллекции документов. В
момент создания указатель итератора находится на индексе -1.
После создания для получения первого документа из коллекции
необходимо выполнить метод MoveNext() класса.