Teigha.Geometry.Scale2d.ToArray
Метод формирует на основе данного объекта двухэлементный массив масштабных коэффициентов по осям X и Y.
Метод формирует на основе данного объекта двухэлементный массив масштабных коэффициентов по осям X и Y.
Returns: Возвращает двухэлементный массив с масштабными коэффициентами по осям X и Y.
Тип double[]. Индекс 0 соответствует направлению X, индекс 1 - направлению Y.