Teigha.GraphicsInterface.EdgeData.GetTrueColors
Метод предоставляет массив цветов рёбер, используемых этим объектом.
Метод предоставляет массив цветов рёбер, используемых этим объектом.
Returns: Возвращает массив цветов рёбер.
Тип EntityColor[].