HostMgd.ApplicationServices.UserConfigurationManager
Класс управялет глобальными переменными, профилем
пользователя, секциями диалога в реестре Window's для
приложения nanoCAD.
///
/// Класс добавлен для совместимости.

HostMgd.ApplicationServices.UserConfigurationManager.OpenDialogSection(Object )
Осуществляет доступ к секции диалога в реестре Window's