Teigha.BoundaryRepresentation.EnumeratorBase
Класс EnumeratorBase является базовым интерфейсным классом для топологических траверсеров (перечислителей) и определяет общий для них функционал.
Класс EnumeratorBase является базовым интерфейсным классом для всех топологических траверсеров (от 'to traverse a tree' - обходить дерево объектов) и определяет общий для них функционал. Используется исключительно через дочерние классы перечислителей.
Класс является производным от RXObject для обеспечения полнофункциональной проверки типов во время выполнения для всех производных классов траверсеров.

Teigha.BoundaryRepresentation.EnumeratorBase.isNull
Свойство isNull позволяет проверить, является ли данный объект неинициализированным или недействительным (т.е. пустым).
Свойство isNull позволяет проверить, является ли данный объект неинициализированным или недействительным (т.е. пустым).
Returns: Возвращает true, если данный траверсер является неинициализированным или недействительным.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.EnumeratorBase.ValidationLevel
Свойство ValidationLevel представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
Свойство ValidationLevel представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
В общем случае это касается любой функции, которая обращается к топологии BREP.
Returns: Возвращает текущий уровень проверки.
Перечисление BoundaryRepresentation.ValidationLevel.