HostMgd.EditorInput.DrawJig
пользовательских примитивов в виде цельного графического объекта непосредственно на экране
с помощью технологии .
Класс обеспечивает возможность создавать произвольную графику или одновременно несколько
пользовательских примитивов в виде цельного графического объекта непосредственно на экране путем
указания курсором мыши начальной точки на экране и перетаскивания курсора мыши (далее технология Jig).
При этом на экране будет отображаться предпросмотр создаваемого объекта. При необходимости создания
подобным способом одного пользовательского примитива, используется класс .

HostMgd.EditorInput.DrawJig.#ctor
Конструктор класса DrawJig
Конструктор класса DrawJig

HostMgd.EditorInput.DrawJig.ViewportDraw(Teigha.GraphicsInterface.ViewportDraw)
Абстрактный метод, не обязателен к реализации. Метод должен быть реализован, если необходимо,
чтобы отображение графических объектов или части графических объектов зависело от параметров
видового экрана.
Абстрактный метод, не обязателен к реализации.
Метод должен быть реализован, если необходимо,
чтобы отображение графических объектов или части графических объектов зависело от параметров
видового экрана.Для этого используется переменная - параметр метода  типа .
Тип данных  содержит в себе свойства, которые возвращают ссылки на объекты классов
,  и .Класс  позволяет управлять цветами,
слоями, типами линий, типами заливки графических объектов.Класс  отвечает за
кэширование графических объектов для последующего отображения на экране.Класс Viewport содержит
сведения о системе координат видового экрана, положении камеры, определяющей направление взгляда
на графический объект и другие параметры.
Чтобы метод был вызван, необходимо, чтобы метод  вернул значение false.
draw: Параметры для отрисовки графичкских объектов

HostMgd.EditorInput.DrawJig.WorldDraw(Teigha.GraphicsInterface.WorldDraw)
Абстрактный метод, обязателен к реализации. Отвечает за графическое представление объекта на экране.
Абстрактный метод, обязателен к реализации. Отвечает за графическое представление объекта на экране.
В теле метода определяется, как должен выглядеть объект. Для этого используется параметр draw типа .
Тип данных  содержит в себе свойства, которые возвращают ссылки на объекты классов
и .Класс  позволяет управлять цветами, слоями, типами линий, типами заливки
графических объектов.Класс  отвечает за кэширование графических объектов для последующего
отображения на экране.
Метод вызывается после отработки метода .В результате вызова метода
на экране отображается предпросмотр графического объекта.После завершения всех операций метод возвращает
значение типа bool.Если метод возвращает false, то далее вызывается метод , если он
возвращает true, то метод  не будет вызван, даже если он реализован.
draw: Параметры для отрисовки графических объектов.