HostMgd.EditorInput.JigPrompts.DragStatus
Одно из значений перечисления DragStatus
Значение свойства меняется в соответствии с шагом, на котором находится процесс изменения объекта или группы объектов: начало изменения, конец изменения, либо отмена изменений.
Returns: что была выбрана начальная точка (DragStart=0), либо была выбрана конечная точка(DragEnd=1),
либо после выбора начальной точки была отмена действия(DragAbort=2).