Teigha.DatabaseServices.GripOverrule.SetNoFilter
Отключает все методы фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также метод IsApplicable() базового класса Overrule) при определении необходимости применять переопределение.
Отключает все методы фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также метод IsApplicable() базового класса Overrule) при определении необходимости применять переопределение.