Teigha.GraphicsInterface.ImageBackgroundTraits
Класс ImageBackgroundTraits представляет характеристики фонов на основе изображений.
Класс ImageBackgroundTraits представляет характеристики фонов на основе изображений.
Notes
Экземпляр этого класса инициализируют объекты ImageBackground, используя свой метод ImageBackground.SetAttributes().

Teigha.GraphicsInterface.ImageBackgroundTraits.FitToScreen
Свойство FitToScreen определяет, должно ли фоновое изображение быть вписанным в экран.
Свойство FitToScreen определяет, должно ли фоновое изображение быть вписанным в экран.
Returns: Возвращает true, если фоновое изображение должно быть вписанным в экран.
В противном случае возвращает false.

Teigha.GraphicsInterface.ImageBackgroundTraits.ImageFilename
Свойство ImageFilename представляет полный путь к файлу изображения, на базе которого был создан данный объект.
Свойство ImageFilename представляет полный путь к файлу изображения, на базе которого был создан данный объект.
Returns: Возвращает полный путь к файлу изображения.
Тип String.

Teigha.GraphicsInterface.ImageBackgroundTraits.MaintainAspectRatio
Свойство MaintainAspectRatio определяет, следует ли сохранять в данном фоне соотношение сторон исходного изображения.
Свойство MaintainAspectRatio определяет, следует ли сохранять в данном фоне соотношение сторон исходного изображения.
Returns: Возвращает true, если в данном фоне соотношение сторон исходного изображения должно быть сохранено.
В противном случае возвращает false.

Teigha.GraphicsInterface.ImageBackgroundTraits.UseTiling
Свойство UseTiling определяет, является ли данный фон мозаичным.
Свойство UseTiling определяет, является ли данный фон мозаичным.
Returns: Возвращает true, если данный фон является мозаичным.
В противном случае возвращает false.

Teigha.GraphicsInterface.ImageBackgroundTraits.XOffset
Свойство XOffset предоставляет доступ к смещению исходного изображения по оси X.
Свойство XOffset предоставляет доступ к смещению исходного изображения в данном объекте по оси X.
Отрицательная величина XOffset означает, что смещение противоположно положительному направлению оси X.
Returns: Возвращает смещение исходного изображения по оси X.
Тип double.

Teigha.GraphicsInterface.ImageBackgroundTraits.XScale
Свойство XScale представляет масштаб исходного изображения в данном объекте по оси X.
Свойство XScale представляет масштаб исходного изображения в данном объекте по оси X.
Notes
Значения от 0 до 1 означают сжатие изображения по оси X, значения свыше 1 означают, что фон растягивается по оси X.
Отрицательные значения означают дополнительное зеркальное отражение изображения по оси X.
Returns: Возвращает масштаб исходного изображения по оси X.
Тип double.

Teigha.GraphicsInterface.ImageBackgroundTraits.YOffset
Свойство YOffset представляет доступ к смещению исходного изображения в данном объекте по оси Y.
Свойство YOffset представляет доступ к смещению исходного изображения в данном объекте по оси Y.
Отрицательная величина YOffset означает, что смещение противоположно положительному направлению оси Y.
Returns: Возвращает смещение исходного изображения в данном объекте по оси Y.
Тип double.

Teigha.GraphicsInterface.ImageBackgroundTraits.YScale
Свойство YScale представляет масштаб исходного изображения в данном объекте по оси Y.
Свойство YScale представляет масштаб исходного изображения в данном объекте по оси Y.
Notes
Значения от 0 до 1 означают сжатие изображения по оси Y, значения свыше 1 означают, что фон растягивается по оси Y.
Отрицательные значения означают дополнительное зеркальное отражение изображения по оси Y.
Returns: Возвращает масштаб исходного изображения по оси Y.
Тип double.