HostMgd.EditorInput.PromptResult
Класс является базовым классом для всех типов результатов,
возвращаемых после интерактивного ввода пользователя в редакторе nanoCAD.
Класс служит обобщённым контейнером для результатов,
вводимых пользователем через интерактивные команды,
такие как GetInteger(), GetString(), GetPoint() и другие.
Он содержит информацию о статусе завершения операции
и может быть унаследован или использован напрямую для получения:
* статуса операции (Status — например, OK, Cancel, Error),
* введённого значения (StringResult, Value и другие, в зависимости от реализации),
* исходного ввода (InputString), если значение было введено вручную.
Этот класс используется совместно с другими производными классами,
такими как PromptIntegerResult, PromptStringResult, PromptPointResult и т. д.,
и предоставляет единый интерфейс для проверки результата
ввода в надстройках и плагинах nanoCAD.
Example
C#

HostMgd.EditorInput.PromptResult.ToString(IFormatProvider)
Метод ToString(IFormatProvider provider) возвращает строковое представление результата ввода,
отформатированное с учётом локализации, заданной провайдером форматирования.
Метод используется для получения строкового представления результата ввода,
включая числа, точки, строки и другие данные, в формате, соответствующем
региональным настройкам пользователя.
Метод применяется при работе с числовыми значениями (например, PromptDoubleResult, PromptIntegerResult)
и позволяет корректно отображать значения с нужным разделителем (точка или запятая),
что особенно важно при разработке мультиязычных плагинов или надстроек.
provider: Объект, предоставляющий информацию о правилах форматирования, например
Returns: Возвращает значение типа string, представляющее результат операции ввода,
отформатированный с учётом переданного provider.
Возвращаемая строка может содержать:
* числовое значение , если статус OK (например, "3.14" или "3,14" в зависимости от провайдера),
* сообщение об отмене или ошибке , если операция была прервана или завершена некорректно.
Example
C#

HostMgd.EditorInput.PromptResult.Status
Свойство возвращает статус выполнения операции ввода,
завершённой пользователем, например, OK, Cancel или Error.
Свойство используется для получения информации о результате
интерактивной операции ввода, такой как GetInteger(), GetString(), GetPoint()
и другие. Оно предоставляет значение из перечисления PromptStatus,
указывающее, как завершена операция: успешно, отменена пользователем
или прервана по ошибке.
Свойство доступно только для чтения
и автоматически устанавливается после завершения ввода.
Returns: Возвращает значение типа PromptStatus — это перечисление, содержащее следующие возможные статусы:
* PromptStatus.OK — операция завершена успешно, введённое значение допустимо.
* PromptStatus.Cancel — пользователь отменил операцию (например, нажав Esc).
* PromptStatus.Error — произошла ошибка ввода (например, введено некорректное значение).
* PromptStatus.None — операция завершена без ввода значения.
* PromptStatus.Keyword — введено ключевое слово вместо ожидаемого значения.
* PromptStatus.Timeout — операция прервана по таймауту.
Example
C#

HostMgd.EditorInput.PromptResult.StringResult
Свойство возвращает строковое значение, полученное после интерактивного приглашения,
если операция завершена успешно или введено ключевое слово.
Свойство используется для получения строкового результата операции ввода,
выполненной пользователем после приглашения, например,
через методы GetString() или GetKeywords().
Оно возвращает значение, введённое пользователем,
если статус операции равен PromptStatus.OK или PromptStatus.Keyword.
Если ввод был отменён или произошла ошибка,
свойство может возвращать null или пустую строку.
Returns: Возвращает значение типа string:
* Если статус PromptStatus.OK — строка,
введённая пользователем или выбранная из списка.
* Если статус PromptStatus.Keyword —
ключевое слово, введённое пользователем.
* Если операция отменена или произошла ошибка —
null или пустая строка.
Example
C#