Teigha.Editor
Пространство имен Teigha.Editor содержит классы и методы,
предназначенные для работы с интерфейсом пользователя
и взаимодействия с системой команд в рамках платформы Teigha.
Это пространство имен предоставляет инструменты для реализации команд, управления вводом-выводом данных,
обработки событий пользовательского интерфейса и выполнения операций, связанных с редактированием чертежей.