Teigha.GraphicsInterface.FaceColorMode
Перечисление FaceColorMode определяет виды изменений, которые оказывают влияние на цвет грани до выполнения любых расчетов, связанных с освещением и тонированием.
Перечисление FaceColorMode определяет виды изменений, которые оказывают влияние на цвет грани до выполнения любых расчетов, связанных с освещением и тонированием.