Teigha.Geometry.PointEntity3d.GetPoint
Метод предоставляет трехмерную точку данного объекта.
Метод предоставляет трехмерную точку данного объекта.
Returns: Возвращает трехмерную точку данного объекта.
Тип Point3d.