Teigha.DatabaseServices.SubentRef
Класс SubentRef представляет ссылку на подобъект.
Класс SubentRef представляет ссылку на подобъект.

Teigha.DatabaseServices.SubentRef.CopyFrom(Teigha.DatabaseServices.SubentRef)
Метод позволяет скопировать в данный объект содержимое указанного объекта.
Метод позволяет скопировать в данный объект содержимое указанного объекта.
source: Ссылка на подобъект, являющийся источником данных. Тип SubentRef.

Teigha.DatabaseServices.SubentRef.Entity
Свойство Entity представляет идентификатор составного объекта, в который входит подобъект, представленный данной ссылкой SubentRef.
Свойство Entity представляет идентификатор составного объекта, в который входит подобъект, представленный данной ссылкой SubentRef.
Returns: Возвращает идентификатор составного объекта. Тип CompoundObjectId.

Teigha.DatabaseServices.SubentRef.SubentId
Свойство SubentId возвращает идентификатор подобъекта SubentityId, который представлен данной ссылкой SubentRef.
Свойство SubentId возвращает идентификатор подобъекта SubentityId, который представлен данной ссылкой SubentRef.
Returns: Возвращает идентификатор подобъекта. Тип SubentityId.