HostMgd.PlottingServices.EndPlotEventHandler
Делегат EndPlotEventHandler предназначен для обработки события PlotReactorManager.EndPlot, возникающего по окончании вывода на плоттер.
Делегат EndPlotEventHandler предназначен для обработки события PlotReactorManager.EndPlot, возникающего по окончании вывода на плоттер.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события,
а аргумент e типа EndPlotEventArgs передает состояние флага PlotCancelStatus.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип EndPlotEventArgs.