Teigha.GraphicsSystem.SelectionMode.Window
Значение: 0.
Область выделения представляет собой прямоугольное окно, заданное по двум точкам на диагонали.
Выделяются лишь те объекты, которые целиком оказались в пределах области выделения.