Teigha.GraphicsInterface.FaceData.GetNormalVectors
Метод предоставляет массив векторов нормалей граней сети или оболочки в данном объекте FaceData.
Метод предоставляет массив векторов нормалей граней, по одному для каждой грани сети или оболочки, с которой используется этот объект FaceData.
Returns: Возвращает массив векторов нормалей граней.
Тип Vector3d[].
Если массив векторов нормалей не задан, возвращает NULL.