Teigha.DatabaseServices.FileDependencyManager
Класс FileDependencyManager предназначен для управления записями в разделе .dwg списка файловых зависимостей.
Класс FileDependencyManager предназначен для управления записями в разделе .dwg списка файловых зависимостей.
Notes
Каждый экземпляр базы данных имеет постоянную связь с экземпляром класса FileDependencyManager.

Teigha.DatabaseServices.FileDependencyManager.CreateEntry(String,String,System.Boolean,System.Boolean)
Метод создает запись в разделе .dwg списка файловых зависимостей.
Метод создает запись в разделе .dwg списка файловых зависимостей и возвращает для неё уникальный идентификатор списка файловых зависимостей.
feature: Имя приложения или функции, создающих запись. Тип String.
fullFileName: Полное имя файла для записи.  Тип String.
affectsGraphics: Флаг, который определяет, влияет ли запись на отображаемый на экране вид. Тип bool.
noIncrement: Флаг, который определяет, следует ли создавать дублирующие записи вместо увеличения счетчика ссылок в случае, когда запись уже существует. Тип bool.
Returns: Возвращает уникальный идентификатор списка файловых зависимостей или 0, если создать запись не удалось.
Тип int.

Teigha.DatabaseServices.FileDependencyManager.EraseEntry(System.Int32,System.Boolean)
Метод удаляет указанную запись из раздела .dwg списка файловых зависимостей.
Метод удаляет указанную запись из раздела .dwg списка файловых зависимостей.
Notes
Указанная запись удаляется, если счетчик ссылок на запись равен 1, или если аргумент forceRemove имеет значение true. В противном случае этот метод просто уменьшает счетчик ссылок на единицу.
index: Индекс записи в списке файловых зависимостей. Тип int.
forceRemove: Флаг, который определяет, следует ли принудительно удалять запись независимо от значения счетчика ссылок. Тип bool.

Teigha.DatabaseServices.FileDependencyManager.EraseEntry(String,String,System.Boolean)
Метод удаляет запись для указанного элемента из указанного файла из раздела .dwg списка файловых зависимостей.
Метод удаляет из раздела .dwg списка файловых зависимостей запись, которая была создана указанным приложением или функцией.
Notes
Указанная запись удаляется, если счетчик ссылок на запись равен 1, или если аргумент forceRemove имеет значение true. В противном случае этот метод просто уменьшает счетчик ссылок на единицу.
feature: Имя приложения или функции, создавших запись. Тип String.
fullFileName: Полное имя файла. Тип String.
forceRemove: Флаг, который определяет, следует ли принудительно удалять запись независимо от значения счетчика ссылок на запись. Тип bool.

Teigha.DatabaseServices.FileDependencyManager.GetEntry(System.Int32)
Метод предоставляет запись с указанным индексом в разделе .dwg списка файловых зависимостей.
Метод предоставляет запись FileDependencyInfo с указанным индексом в разделе .dwg списка файловых зависимостей.
fdlIndex: Входное значение индекса записи в списке файловых зависимостей. Тип int.
Returns: Возвращает найденную запись. Тип FileDependencyInfo.

Teigha.DatabaseServices.FileDependencyManager.GetEntry(System.Int32,System.Boolean)
Метод предоставляет запись FileDependencyInfo по её индексу в разделе .dwg списка файловых зависимостей. Дополнительно метод позволяет влиять на использование кешированных данных.
Метод предоставляет запись FileDependencyInfo с указанным индексом в разделе .dwg списка файловых зависимостей.
Аргумент useCachedInfo позволяет предписывать использование кеша.
fdlIndex: Индекс записи в разделе .dwg списка файловых зависимостей. Тип int.
useCachedInfo: Флаг, который определяет, следует ли использовать кешированную информацию. Тип bool.  В случае значения false, используется обновленная информация.
Returns: Возвращает найденную запись. Тип FileDependencyInfo.

Teigha.DatabaseServices.FileDependencyManager.GetEntry(String,String)
Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции в заданном файле.
Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции в заданном файле.
feature: Имя приложения или функции, создавших запись. Тип String.
fullFileName: Полное имя файла для искомой записи. Тип String.
Returns: Возвращает найденную запись. Тип FileDependencyInfo.

Teigha.DatabaseServices.FileDependencyManager.GetEntry(String,String,System.Boolean)
Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции.
Дополнительно метод позволяет влиять на использование кешированных данных.
Метод предоставляет запись в разделе .dwg списка файловых зависимостей для указанного приложения или функции.
Дополнительно метод позволяет влиять на использование кешированных данных.
feature: Имя приложения или функции, создавших запись. Тип String.
fullFileName: Полное имя файла для искомой записи. Тип String.
useCachedInfo: Флаг, который определяет, можно ли использовать кешированную информацию. Тип bool.  В случае значения false, используется обновленная информация.
Returns: Возвращает найденную запись.
Тип FileDependencyInfo.

Teigha.DatabaseServices.FileDependencyManager.IteratorInitialize(String,System.Boolean,System.Boolean,System.Boolean)
Метод инициализирует итератор для раздела .dwg списка файловых зависимостей.
Метод инициализирует итератор для раздела .dwg списка файловых зависимостей.
Notes
Если аргументы не указаны, просматриваются все записи в локальном списке.
Первые три предоставленных аргумента ограничивают список просматриваемых записей.
feature: Имя приложения или функции, создавших запись. Тип String.
modifiedOnly: Флаг, который определяет, следует ли возвращать только измененные записи. Тип bool.
affectsGraphicsOnly: Флаг, который определяет, следует ли возвращать только те записи, которые влияют на отображаемый вид. Тип bool.
walkXRefTree: Флаг, который определяет, следует ли просматривать списки файловых зависимостей во внешних ссылках. Тип bool.

Teigha.DatabaseServices.FileDependencyManager.UpdateEntry(System.Int32)
Метод обновляет запись с указанным индексом в разделе .dwg списка файловых зависимостей.
Метод обновляет запись с указанным индексом в разделе .dwg списка файловых зависимостей.
Notes
Этот метод переопределяет заново значения полей mIsModified, mTimestamp и mFileSize записи.
index: Входной индекс записи. Тип int.

Teigha.DatabaseServices.FileDependencyManager.UpdateEntry(String,String)
Метод обновляет в разделе .dwg списка файловых зависимостей ту запись, которая была создана указанным приложением или функцией.
Метод обновляет в разделе .dwg списка файловых зависимостей ту запись, которая была создана указанным приложением или функцией.
Notes
Этот метод переопределяет заново значения полей mIsModified, mTimestamp и mFileSize записи.
feature: Имя приложения или функции, создавших запись. Тип String.
fullFileName: Полное имя файла для записи. Тип String.

Teigha.DatabaseServices.FileDependencyManager.CountEntries
Свойство CountEntries представляет количество уникальных записей в разделе .dwg списка файловых зависимостей.
Свойство CountEntries представляет количество уникальных записей в разделе .dwg списка файловых зависимостей.
Returns: Возвращает количество уникальных записей.
Тип int.

Teigha.DatabaseServices.FileDependencyManager.IteratorNext
Свойство IteratorNext представляет индекс следующей записи в разделе .dwg списка файловых зависимостей.
Свойство IteratorNext представляет индекс следующей записи в разделе .dwg списка файловых зависимостей.
Возвращаемое значение может использоваться в методах GetEntry() и EraseEntry().
Returns: Возвращает индекс следующей записи.
Тип int.