Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter
Структура DoubleRangeParameter используется для представления информации о ближнем и дальнем тумане.
Структура DoubleRangeParameter используется для представления информации о ближнем и дальнем тумане.

Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.#ctor(System.Double,System.Double)
Конструктор структуры DoubleRangeParameter.
Конструктор структуры DoubleRangeParameter. Создает экземпляр класса с указанными дальностями.
n: Близкое расстояние. Тип double.
f: Дальнее расстояние. Тип double.

Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Far
Свойство Far представляет расстояние для дальнего тумана.
Свойство Far представляет расстояние для дальнего тумана.
Returns: Возвращает дистанцию для дальнего тумана. Тип double.

Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Near
Свойство Near представляет расстояние для ближнего тумана.
Свойство Near представляет расстояние для ближнего тумана.
Returns: Возвращает дистанцию для ближнего тумана. Тип double.