HostMgd.ApplicationServices.DocumentDestroyedEventArgs
Класс, обеспечивающий данными событие DocumentDestroyed
класса DocumentCollection.

HostMgd.ApplicationServices.DocumentDestroyedEventArgs.FileName
Возвращает имя уничтоженного документа.