Teigha.DatabaseServices.DataLink
Класс реализует связывание данных таблицы на чертеже с внешним источником данных.
Класс реализует связывание данных таблицы на чертеже с внешним источником данных.

Teigha.DatabaseServices.DataLink.#ctor
Конструктор по умолчанию класса DataLink.
Конструктор по умолчанию класса DataLink.

Teigha.DatabaseServices.DataLink.#ctor(IntPtr,System.Boolean)
Конструктор класса.
Конструктор класса.
unmanagedObjPtr: Неуправляемый указатель на входной объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.DataLink.GetSourceFiles(Teigha.DatabaseServices.DataLinkGetSourceContext)
Метод предоставляет внешние файлы, от которых зависит эта ссылка на данные.
Метод предоставляет внешние файлы, от которых зависит эта ссылка на данные.
nContext: Входной контекст. В настоящее время не используется. Тип DataLinkGetSourceContext.
Returns: Возвращает массив внешних файлов. Тип ArrayList.

Teigha.DatabaseServices.DataLink.GetUpdateStatus(UpdateDirection%,DateTime%,String)
Метод предоставляет статус последнего обновления ссылки на данные.
Метод предоставляет статус последнего обновления ссылки на данные.
pDir: Возвращает направление последнего обновления. Значение из перечисления UpdateDirection.
pTime: Возвращает время последнего обновления. Тип DateTime.
errMessage: Возвращает сообщение об ошибках при последнем обновлении. Тип String.
Returns: Возвращает статус операции как значение из перечисления Teigha.Runtime.ErrorStatus.

Teigha.DatabaseServices.DataLink.RepathSourceFiles(String,Teigha.DatabaseServices.PathOption)
Метод перенаправляет ссылки на пути к внешним исходным файлам.
Метод перенаправляет ссылки на пути к внешним исходным файлам.
sBasePath: Базовый путь к файлам.  Тип String.
nOption: Опции путей. Значение из перечисления PathOption.

Teigha.DatabaseServices.DataLink.Update(Teigha.DatabaseServices.UpdateDirection,DatabaseServices.UpdateOption)
Метод обновляет ссылки на пути к внешним исходным файлам. Не реализован.
Метод обновляет ссылки на пути к внешним исходным файлам. На данный момент не реализован.
dir: Направление обновления. Значение из перечисления UpdateDirection.
option: Опции обновления. Значение из перечисления DatabaseServices.UpdateOption.

Teigha.DatabaseServices.DataLink.ConnectionString
Свойство предоставляет доступ к строке подключения к источнику данных.
Свойство предоставляет доступ к строке подключения к источнику данных.
Returns: Возвращает строку подключения. Тип String.

Teigha.DatabaseServices.DataLink.DataAdapterId
Свойство предоставляет доступ к идентификатору адаптера данных.
Свойство предоставляет доступ к идентификатору адаптера данных.
Returns: Возвращает идентификатор адаптера данных. Тип String.

Teigha.DatabaseServices.DataLink.DataLinkOption
Свойство предоставляет доступ к опциям связи с внешними данными.
Свойство предоставляет доступ к опциям связи с внешними данными.
Returns: Возвращает опции подключения к внешним данным как значение из перечисления DatabaseServices.DataLinkOption.

Teigha.DatabaseServices.DataLink.Description
Свойство предоставляет доступ к описанию связи с данными.
Свойство предоставляет доступ к описанию связи с данными.
Returns: Возвращает описание связи с данными. Тип String.

Teigha.DatabaseServices.DataLink.IsValid
Свойство позволяет проверить, действительна ли связь с внешними данными и может ли она использоваться для обновления данных.
Свойство позволяет проверить, действительна ли связь с внешними данными и может ли она использоваться для обновления данных.
Returns: Возвращает true, если связь с внешними данными действительна.
В противном случае возвращает false.

Teigha.DatabaseServices.DataLink.Name
Свойство предоставляет доступ к наименованию связи с внешними данными.
Свойство предоставляет доступ к наименованию связи с внешними данными.
Returns: Возвращает наименование связи с данными. Тип String.

Teigha.DatabaseServices.DataLink.ToolTip
Свойство предоставляет доступ к строке подсказки связи с данными.
Свойство предоставляет доступ к строке подсказки связи с данными.
Returns: Возвращает строку подсказки. Тип String.

Teigha.DatabaseServices.DataLink.UpdateOption
Свойство предоставляет доступ к опциям обновления связи с данными.
Свойство предоставляет доступ к опциям обновления связи с данными.
Returns: Возвращает опции обновления. Тип int.