Teigha.DatabaseServices.DwgFiler.ReadPoint3d
Метод предназначен для получения точки Point3d из текущего элемента данного объекта Filer.
Метод предназначен для получения точки Point3d из текущего элемента данного объекта Filer.
Returns: Возвращает трехмерную точку. Тип Point3d.