Teigha.GraphicsSystem.Device.Update
Метод позволяет направить всем принадлежащим видам сообщение о необходимости обновиться, что принудительно актуализирует текущее изображение.
Метод позволяет направить всем принадлежащим видам сообщение о необходимости обновиться, что принудительно актуализирует текущее изображение.