HostMgd.EditorInput.PromptEntityOptions
Класс предоставляет параметры для настройки интерактивного выбора
геометрического объекта в nanoCAD.
Класс используется при вызове методов выбора объектов — например,
GetEntity() — для настройки поведения команды.
С его помощью можно задать:
* текст приглашения (Message),
* допустимые типы объектов (линии, окружности, блоки и т.д.) с помощью методов AddAllowedClass...,
* ключевые слова (Keywords),
* режимы ввода (AllowNone, AllowObjectOnLockedLayer и др.).
Этот класс позволяет гибко управлять пользовательским интерфейсом при выборе объектов,
обеспечивая фильтрацию, подсказки и контекстную настройку поведения команды.
Example
C#

HostMgd.EditorInput.PromptEntityOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса
с заданным приглашающим сообщением для выбора геометрического объекта.
Конструктор создаёт объект класса PromptEntityOptions,
используемый при настройке интерактивного выбора объекта
— например, при вызове метода GetEntity() в .NET API nanoCAD.
Он устанавливает текст приглашения, отображаемый пользователю
в командной строке, а все остальные параметры
(такие как допустимые типы объектов, ключевые слова, режимы ввода)
инициализируются значениями по умолчанию.
Этот конструктор является основным способом задания начального сообщения,
которое подсказывает пользователю, что нужно сделать — например,
"Выберите объект:" или "Укажите границу области:".
После создания объекта можно дополнительно настроить его параметры,
такие как фильтрация типов объектов, разрешение на пропуск ввода и другие.
message: Текст приглашения, отображаемый в командной строке
Пример: "Выберите линию для обрезки

HostMgd.EditorInput.PromptEntityOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением,
включающим локальные и глобальные ключевые слова для выбора объекта.
Конструктор создаёт объект класса PromptEntityOptions, используемый при вызове метода GetEntity()
или аналогичных команд выбора объектов в nanoCAD. Он позволяет задать:
* приглашающее сообщение с локальными ключевыми словами , заключёнными в квадратные скобки
— например: "Выберите объект [линия/окружность]:",
* глобальные ключевые слова , доступные на протяжении всей команды —
например: "отмена/выход".
Этот конструктор особенно полезен при реализации интерактивных команд,
где пользователь может выбрать режим выбора или выполнить системные действия,
такие как отмена операции, не прерывая процесс ввода.
messageAndKeywords: Строка, содержащая текст приглашения и, опционально,
globalKeywords: Строка, содержащая глобальные ключевые слова, разделённые пробелом.

HostMgd.EditorInput.PromptEntityOptions.AddAllowedClass(System.Type,System.Boolean)
Метод добавляет тип объекта в список разрешённых для выбора,
с возможностью указать, должен ли выбор быть точным или
включать производные типы.
Метод используется для фильтрации объектов, которые пользователь
может выбирать с помощью команды GetEntity(). Он позволяет
ограничить выбор только объектами определённого типа (или наследниками этого типа),
что полезно при реализации специализированных команд, требующих строгой типовой проверки.
Поведение метода зависит от параметра exactMatch:
* Если exactMatch = true, то для выбора разрешаются
только объекты точно указанного типа .
* Если exactMatch = false, то разрешаются объекты
указанного типа и все объекты, производные от него.
Это позволяет, например, разрешить выбор только Line (отрезков)
или всех объектов, унаследованных от Curve (включая окружности, эллипсы и др.).
type: Тип объекта, который должен быть добавлен в список разрешённых для выбора.
Пример: typeof(Line), typeof(Circle), typeof(BlockReference).
exactMatch: Флаг, определяющий режим проверки типа

HostMgd.EditorInput.PromptEntityOptions.RemoveAllowedClass(System.Type)
Метод удаляет указанный тип из списка классов,
разрешённых для выбора при интерактивной операции.
Метод используется для исключения определённого типа объекта из фильтра выбора,
заданного ранее с помощью метода AddAllowedClass.
Это позволяет уточнить или сузить круг допустимых объектов,
которые пользователь может выбрать с помощью команды GetEntity().
Если тип был добавлен в список разрешённых (через AddAllowedClass),
его можно удалить с помощью этого метода, чтобы предотвратить его выбор в текущей операции.
type: Тип объекта, который необходимо удалить из списка разрешённых для выбора.
Пример: typeof(Line), typeof(Circle), typeof(BlockReference).

HostMgd.EditorInput.PromptEntityOptions.SetRejectMessage(String)
Метод устанавливает пользовательское сообщение,
которое отображается, если выбранный объект
не соответствует критериям фильтрации.
Метод используется для задания текста, который будет показан пользователю
при попытке выбрать объект, запрещённый текущими настройками фильтрации —
например, если объект не входит в список разрешённых типов,
заданных через AddAllowedClass или другие методы фильтрации.
По умолчанию система может выводить стандартное сообщение вроде "Недопустимый объект",
но с помощью SetRejectMessage можно заменить его на более информативное и понятное,
например: "Можно выбирать только линии и полилинии."
message: Текст сообщения, которое будет отображаться при попытке выбрать

HostMgd.EditorInput.PromptEntityOptions.AllowNone
Свойство определяет, разрешено ли завершить операцию выбора объекта
нажатием Enter без указания объекта.
Свойство используется для управления возможностью пропуска выбора объекта.
Если свойство установлено в true, пользователь может завершить команду ввода
(например, GetEntity()) нажатием клавиши Enter , не указывая ни одного объекта.
В этом случае операция завершается со статусом PromptStatus.None,
что позволяет разработчику обработать этот случай как допустимый сценарий
— например, использовать значение по умолчанию или перейти к следующему шагу.
Если AllowNone = false (по умолчанию), пользователь обязан выбрать объект,
и нажатие Enter без выбора будет считаться отменой или ошибкой.
Returns: Возвращает значение типа bool:
* true — завершение ввода нажатием Enter разрешено.
* false — выбор объекта обязателен.
Example
C#

HostMgd.EditorInput.PromptEntityOptions.AllowObjectOnLockedLayer
Свойство определяет, разрешён ли выбор геометрических объектов,
расположенных на заблокированных слоях.
Свойство используется для управления возможностью выбора объектов,
принадлежащих слоям с состоянием "заблокирован".
По умолчанию в nanoCAD объекты на заблокированных слоях нельзя редактировать
или выбирать — это защита от случайных изменений.
Если свойство установлено в true, пользователь может выбрать объект
на заблокированном слое, даже если он не может быть изменён.
Это полезно в командах, где требуется только чтение свойств объекта
— например, анализ, измерение, копирование или получение информации.
Если false (значение по умолчанию), попытка выбрать объект на заблокированном слое
будет отклонена, и система может выдать сообщение об ошибке или проигнорировать выбор.
Returns: Возвращает значение типа bool:
* true — объекты на заблокированных слоях могут быть выбраны.
* false — выбор объектов на заблокированных слоях запрещён.
Example
C#