Teigha.DatabaseServices.MInsertBlock
Класс MInsertBlock представляет в базе данных массивы вхождений блоков (MInserts).
Класс MInsertBlock представляет в базе данных массивы вхождений блоков (MInserts).
По сути, это специальный вид объекта INSERT, который отображает массив повторяющихся изображений объектов в указанной BlockTableRecord. Попытка создать экземпляр MInsertBlock с определением, в котором всего одна строка и один столбец, вместо этого создаст просто вхождение блока BlockReference.

Teigha.DatabaseServices.MInsertBlock.#ctor
Конструктор по умолчанию класса MInsertBlock.
Конструктор по умолчанию класса MInsertBlock.

Teigha.DatabaseServices.MInsertBlock.#ctor(Teigha.Geometry.Point3d,DatabaseServices.ObjectId,short,short,System.Double,System.Double)
Конструктор класса MInsertBlock.
Конструктор класса MInsertBlock.
position: Положение данного объекта MInsertBlock. Тип Point3d.
blockTableRecord: Запись в таблице блоков. Тип DatabaseServices.ObjectId.
columns: Количество столбцов изображения BlockTableRecord, отображаемых данным объектом MInsertBlock. Тип short.
rows: Количество строк изображения BlockTableRecord, отображаемых данным объектом MInsertBlock.  Тип short.
colSpacing: Расстояние между столбцами изображения BlockTableRecord, отображаемых данным объектом MInsertBlock.  Тип double.
rowSpacing: Расстояние между строками изображения BlockTableRecord, отображаемых данным объектом MInsertBlock.  Тип double.

Teigha.DatabaseServices.MInsertBlock.Columns
Свойство представляет количество столбцов изображения BlockTableRecord для отображения данным объектом.
Свойство представляет количество столбцов изображения BlockTableRecord для отображения данным объектом.т
Returns: Возвращает количество столбцов. Тип short.

Teigha.DatabaseServices.MInsertBlock.ColumnSpacing
Свойство представляет расстояние между столбцами изображения BlockTableRecord, отображаемого данным объектом.
Свойство представляет расстояние между столбцами изображения BlockTableRecord, отображаемого данным объектом.
Returns: Возвращает расстояние между столбцами. Тип double.

Teigha.DatabaseServices.MInsertBlock.Rows
Свойство представляет количество строк изображения BlockTableRecord для отображения данным объектом.
Свойство представляет количество строк изображения BlockTableRecord для отображения данным объектом.
Returns: Возвращает количество строк. Тип short.

Teigha.DatabaseServices.MInsertBlock.RowSpacing
Свойство представляет расстояние между строками изображения BlockTableRecord, отображаемого данным объектом.
Свойство представляет расстояние между строками изображения BlockTableRecord, отображаемого данным объектом.
Returns: Возвращает расстояние между строками. Тип double.