HostMgd.EditorInput.UserInputControls.NoZeroResponseAccepted
Значение: 32 (0x20).
Маска определяет режим "Не принимать нулевые значения".
По умолчанию нулевые значения принимаются.
Работает только для методов JigPrompts.AcquireDistance() и JigPrompts.AcquireAngle().