Teigha.GraphicsInterface.DrawableTraits
Класс DrawableTraits реализует интерфейс к графическим атрибутам графических примитивов.
Класс DrawableTraits реализует интерфейс к графическим атрибутам графических примитивов.
Этот класс является наследником SubEntityTraits и предоставляет дополнительные атрибуты, которые являются согласованными для всех отображаемых объектов.
Notes
Экземпляр DrawableTraits доступен во время вызовов метода GraphicsInterface.Drawable.SubSetAttributes().
Настройки графических атрибутов используются для отображения всех графических примитивов до момента изменения атрибутов.

Teigha.GraphicsInterface.DrawableTraits.AddLight(DatabaseServices.ObjectId)
Метод позволяет добавить освещение, привносимое в модель отображаемыми объектами, которые сами являются источниками света.
Метод позволяет добавить освещение, привносимое в модель отображаемыми объектами, которые сами являются источниками света.
По умолчанию этот метод игнорирует такое освещение и требует реализации в производных классах.
lightId: Идентификатор источника освещения. Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.DrawableTraits.SetupForEntity(DatabaseServices.Entity)
Метод инициализирует графические атрибуты, заданные с помощью методов SubEntityTraits и DrawableTraits для указанного объекта чертежа.
Метод инициализирует все графические атрибуты, заданные с помощью методов SubEntityTraits и DrawableTraits для указанного объекта чертежа.
Это эффективнее, чем задавать каждое свойство по отдельности.
Именно так реализован по умолчанию метод Entity.SetAttributes() .
entity: Входной объект чертежа. Тип DatabaseServices.Entity.