HostMgd.EditorInput.JigPrompts.AcquireAngle
Метод запрашивает у пользователя угол в °(градусах).
Метод предназначен для запроса у пользователя угол в °(градусах). В основном применяется для интерактивного поворота
объекта или группы объектов. После вызова создает пустой экземпляр класса JigPromptAngleOptions и
вызывает свою перегрузку JigPrompts.AcquireAngle(JigPromptAngleOptions options).
Returns: Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла определяется либо исходя из текущего положения курсора
мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).