Teigha.Geometry.Vector3d.GetNormal
Метод позволяет получить единичный вектор, сонаправленный данному вектору.
Используется точность Tolerance.Global.
Метод позволяет получить единичный вектор, сонаправленный данному вектору.
Реализация метода использует вызов Vector3d.GetNormal(Tolerance) с точностью, равной Tolerance.Global.
Returns: Возвращает единичный вектор. Тип Vector3d.