Teigha.GraphicsInterface.FaceData.GetColors
Метод предоставляет массив индексов цвета для граней сети или оболочки.
Метод предоставляет массив индексированных цветов, по одному для каждой грани сети или оболочки, с которой используется данный объект FaceData.
Returns: Возвращает массив индексов цвета.
Тип short[].
Если массив индексированных цветов не задан, возвращается NULL.