Teigha.DatabaseServices.AbstractViewTableRecord.SetUcsToWorld
Метод задает пользовательскую систему координат (UCS, ПСК) для записи таблицы видов или видовых экранов с ориентацией мировой системы координат.
Метод задает пользовательскую систему координат (UCS, ПСК) для записи ViewTableRecord или ViewportTableRecord.
Ориентация этой UCS совпадает с ориентацией мировой системы координат.