HostMgd.PlottingServices.DsdEntry.Copy
Метод создает копию данного объекта DsdEntry.
Не реализован.
Метод создает копию данного объекта DsdEntry.
В текущей версии не реализован.
Returns: Возвращает копию данного объекта.
Тип HostMgd.PlottingServices.DsdEntry.