Teigha.DatabaseServices.DxfFiler.ReadPoint3d
Метод возвращает трехмерную точку Point3d из текущего элемента этого объекта Filer.
Метод возвращает трехмерную точку Point3d из текущего элемента этого объекта Filer.
Returns: Возвращает трехмерную точку. Тип Point3d.