Teigha.Geometry.NurbCurve3d.MakeOpen
Метод делает замкнутый сплайн незамкнутым.
Метод делает замкнутый сплайн незамкнутым.
Возможны два варианта.
1. Если сплайн построен методом определяющих точек, он размыкается за счет удаления крайних определяющих точек.
2. Если сплайн построен методом управляющих вершин, он размыкается за счет удаления крайних управляющих вершин.