Teigha.DatabaseServices.CellOption
Перечисление CellOption определяет опциональные параметры ячеек, используемые при выполнении ряда операций.
Перечисление CellOption определяет опциональные параметры ячеек, используемые при выполнении ряда операций.