HostMgd.ApplicationServices.DocumentIterator.Current
Указатель на документ, соответствующий текущему значению
итератора. Возвращается значение Document^ или nullptr.
Последнее - при выходе позиции за пределы коллекции. Позиция
выходит за пределы при создании итератора (перед первым
вызовом MoveNext()) и после возвращения методом MoveNext()
значения false.