Teigha.DatabaseServices.RasterImageDef.LocateActivePath
Возвращает имя пути к реальному файлу, который используется
для определения изображения. Требуется, чтобы объект
RasterImageDef был открыт на чтение.