Teigha.DatabaseServices.HyperLinkCollection.GetEnumerator
Метод позволяет получить перечислитель для данной коллекции.
Метод позволяет получить перечислитель для данной коллекции.
Returns: Возвращает перечислитель коллекции. Тип IEnumerator.