Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut
Класс RevolveOptionsCheckRevolveCurveOut представляет индикаторы возможных проблем, выявляемых при проверке возможности вращения объекта.
Класс RevolveOptionsCheckRevolveCurveOut представляет индикаторы, выводимые методом
RevolveOptions.CheckRevolveCurve()  в результате проверки допустимости конкретного объекта чертежа для операции вращения вокруг определенной оси.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.#ctor
Конструктор по умолчанию класса RevolveOptionsCheckRevolveCurveOut.
Конструктор по умолчанию класса RevolveOptionsCheckRevolveCurveOut.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Closed
Свойство Closed позволяет определить, является ли объект профиля замкнутой областью.
Свойство Closed позволяет определить, является ли объект профиля замкнутой областью.
Returns: Возвращает true, если объект является замкнутым.
В противном случае возвращает false.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.EndPointsOnAxis
Свойство EndPointsOnAxis позволяет определить, является ли вращаемый профиль незамкнутой кривой, концы которой лежат на оси вращения.
Свойство EndPointsOnAxis позволяет определить, является ли вращаемый профиль незамкнутой кривой, концы которой лежат на оси вращения.
Returns: Возвращает true, если концы незамкнутого профиля лежат на оси вращения.
В противном случае возвращает false.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Planar
Свойство Planar позволяет определить, является ли профиль плоской кривой.
Свойство Planar позволяет определить, является ли профиль плоской кривой.
Returns: Возвращает true, если профиль является плоским.
В противном случае возвращает false.