Teigha.DatabaseServices.ScaleEstimationMethod.ScaleEstMethodReferencePoint
Значение: 3.
Этот алгоритм использует масштабный коэффициент сетки референцной системы координат, определенный в реперной точке локальной системы координат.
Важно: использование этого алгоритма подразумевает, что проекционное отображение, на котором основана указанная сетка, является конформным.