Teigha.DatabaseServices.SectionHitTestInfo
Эта структура служит контейнером для результатов проверки попадания в индикатор секущей плоскости, возвращаемых методом DatabaseServices.Section.HitTest().
Эта структура служит контейнером для результатов проверки попадания в индикатор секущей плоскости, возвращаемых методом DatabaseServices.Section.HitTest().

Teigha.DatabaseServices.SectionHitTestInfo.Index
Свойство Index представляет отсчитываемый от нуля индекс сегмента на линии сечения, который проходит рядом или через точку попадания.
Свойство Index представляет отсчитываемый от нуля индекс сегмента на линии сечения, который проходит рядом или через точку попадания.
Returns: Возвращает индекс сегмента. Тип int.

Teigha.DatabaseServices.SectionHitTestInfo.PtOnSegment
Свойство PtOnSegment представляет координаты трехмерной точки на сегменте секущей плоскости, которая соответствует точке попадания.
Свойство PtOnSegment представляет координаты трехмерной точки на сегменте секущей плоскости, которая соответствует точке попадания, или значение NULL, если это не требуется.
Returns: Возвращает координаты трехмерной точки. Тип Point3d.

Teigha.DatabaseServices.SectionHitTestInfo.SubItem
Свойство SubItem обеспечивает доступ к флагам попадания указанной пользователем точки на индикатор секущей плоскости.
Свойство SubItem обеспечивает доступ к флагам попадания указанной пользователем точки на индикатор секущей плоскости.
Returns: Возвращает флагам попадания точки в индикатор секущей плоскости.
Значение из перечисления SectionSubItem.