HostMgd.EditorInput.PointMonitorEventArgs
Класс предоставляет данные для события PointMonitor,
возникающего при перемещении мыши в редакторе nanoCAD.
Класс наследуется от EventArgs и реализует интерфейс IDisposable.
Он используется в связке с событием PointMonitor редактора nanoCAD
и содержит информацию о текущем положении указателя, контексте ввода и активном виде.
Этот класс позволяет разработчикам получать актуальные координаты точки,
над которой находится курсор, а также устанавливать дополнительные параметры отображения
— такие как цвет маркера или тип курсора.
Объект этого класса создаётся системой при каждом событии перемещения мыши
и должен быть корректно освобождён после использования.
Notes
Так как класс реализует IDisposable, рекомендуется использовать его внутри блока using
или вручную вызывать метод Dispose() для освобождения неуправляемых ресурсов.
Example
C#

HostMgd.EditorInput.PointMonitorEventArgs.AppendToolTipText(System.String)
Метод добавляет строку текста подсказки к текущему событию,
например, при отслеживании положения мыши.
Метод используется для динамического добавления текстовой информации в подсказку (tooltip),
которая отображается во время интерактивных операций в редакторе nanoCAD.
Это позволяет выводить пользователю дополнительные сведения о текущем состоянии объекта
или действия, например, координаты, параметры или статус операции.
Метод может быть вызван несколько раз для формирования многострочного сообщения.
value: Строка текста, которую необходимо добавить к подсказке инструмента.

HostMgd.EditorInput.PointMonitorEventArgs.Context
Свойство предоставляет объект, содержащий контекстную информацию о текущей операции ввода точки.
Свойство возвращает экземпляр класса InputPointContext,
который содержит дополнительные данные о контексте интерактивного ввода точки.
Оно используется при обработке событий, связанных с движением мыши
и вводом координат, таких как PointMonitor или PointFilter.
Через объект InputPointContext можно получить информацию о системе координат (UCS),
активных привязках, графическом маркере и других параметрах,
влияющих на поведение точки ввода.
Returns: Возвращает объект типа InputPointContext, предоставляющий доступ к следующим данным о контексте и настройках курсора.
Если контекст не определён или событие завершено, может вернуть null.
Example
C#