Teigha.BoundaryRepresentation.VertexLoopCollection
Класс VertexLoopCollection представляет набор циклов, связанных с вершиной.
Класс VertexLoopCollection представляет набор циклов, связанных с вершиной.