HostMgd.EditorInput.PromptEditorOptions
Это базовый класс для команд настроек приглашения,
используемый в различных типах сбора данных.

HostMgd.EditorInput.PromptEditorOptions.AllowNegative
Возвращает или устанавливает разрешение ввода отрицательного
значения. Значение true означает, что отрицательные значения
разрешены.

HostMgd.EditorInput.PromptEditorOptions.AllowNone
Возвращает или устанавливает признак того, разрешен ли ввод
только Enter.
Значение true означает, что ввод только Enter разрешен, и
false в противном случае.

HostMgd.EditorInput.PromptEditorOptions.AllowZero
Возвращает или устанавливает признак того, разрешен ли ввод
нулевого значения.
Значение true означает, что ввод нулевого значения разрешен,
и false в противном случае.

HostMgd.EditorInput.PromptEditorOptions.LimitsChecked
Устанавилвает или возвращает признак наличия проверки
ограничений при вводе значения.

HostMgd.EditorInput.PromptEditorOptions.Only2d
Возвращает и устанавливает признак, должно ли возвращаемое
значение расстояния рассматриваться как проекция в местной
системе координат (ПСК).
Свойство не используется.

HostMgd.EditorInput.PromptEditorOptions.UseDashedLine
Включает и выключает штриховую "резиновую" линию, которая
рисуется между базовой точкой и текущим положением курсора
при вводе.