Teigha.GraphicsInterface.DisplayStyle
Класс DisplayStyle представляет стиль отображения как набор свойств, используемых графической системой при отображении графических объектов.
Класс DisplayStyle представляет стиль отображения как набор свойств, используемых графической системой при отображении графических объектов.

Teigha.GraphicsInterface.DisplayStyle.#ctor
Конструктор по умолчанию класса DisplayStyle.
Конструктор по умолчанию класса DisplayStyle.

Teigha.GraphicsInterface.DisplayStyle.Set(Teigha.GraphicsInterface.DisplayStyle)
Метод переопределяет данный стиль отображения, используя указанный объект DisplayStyle.
Метод позволяет переопределить данный стиль отображения, используя в качестве источника данных переданный в метод объект DisplayStyle.
style: Стиль отображения, который служит источником данных для переопределения свойств данного объекта. Тип DisplayStyle.

Teigha.GraphicsInterface.DisplayStyle.Brightness
Свойство Brightness определяет яркость в данном стиле отображения.
Свойство Brightness определяет яркость в данном стиле отображения.
Returns: Возвращает текущее значение яркости в стиле отображения.
Тип double.

Teigha.GraphicsInterface.DisplayStyle.DisplaySettings
Свойство DisplaySettings позволяет определить категории настроек для данного стиля отображения.
Свойство DisplaySettings позволяет определить категории настроек
для данного стиля отображения (фоны, источники освещения, материалы, текстуры).
Returns: Возвращает категории настроек для стиля отображения. Значение из перечисления GraphicsInterface.DisplaySettings.

Teigha.GraphicsInterface.DisplayStyle.ShadowType
Свойство ShadowType определяет тип теней, используемых данным стилем отображения.
Свойство ShadowType определяет тип теней, используемых данным стилем отображения.
Returns: Возвращает используемый стилем отображения тип теней.
Значение из перечисления ShadowDisplayType.