Teigha.Runtime.DynamicLinker.ModuleLoaded
Событие ModuleLoaded создается, когда динамический компоновщик успешно завершил загрузку модуля приложения.
Событие ModuleLoaded создается, когда динамический компоновщик успешно завершил загрузку модуля приложения.
Уведомление генерируется после того, как файл приложения был загружен и инициализирован, а все зарегистрированные приложением классы были добавлены в систему выполнения.