HostMgd.PlottingServices.BeginPageEventHandler
Делегат BeginPageEventHandler предназначен для обработки события PlotReactorManager.BeginPage,
возникающего перед началом вывода страницы на печать.
Делегат BeginPageEventHandler предназначен для обработки события PlotReactorManager.BeginPage,
возникающего перед началом вывода страницы на печать.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события,
а аргумент e типа BeginPageEventArgs передает объекты PlotInfo и PlotPageInfo,
а также флаг последней страницы печатаемого документа.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип BeginPageEventArgs.