Teigha.DatabaseServices.DwgFiler.ReadBinaryChunk
Метод позволяет получить значение BinaryData текущего элемента этого объекта Filer.
Метод позволяет получить значение BinaryData текущего элемента этого объекта Filer.
Returns: Возвращает текущий элемент объекта Filer в виде байтового массива. Тип byte[].