Teigha.GraphicsInterface.DiagnosticBSPMode
Перечисление DiagnosticBSPMode определяет поддерживаемые диагностические режимы BSP (Binary Space Partitioning).
Перечисление DiagnosticBSPMode определяет поддерживаемые диагностические режимы BSP (Binary Space Partitioning), используемые для анализа эффективности двоичного разбиения пространства сцены на выпуклые области и для выявления проблем с трассировкой лучей.
BSP имеет древовидную структуру данных.