Teigha.DatabaseServices.AttributeReference.UpdateMTextAttribute
Метод обновляет внутренний объект MText из основных свойств AttributeReference.
Метод обновляет внутренний объект MText многострочного атрибута, исходя из свойств объекта AttributeReference.