Teigha.DatabaseServices.Field
Класс Field представляет объекты Field в базе данных.
Объект Field является контейнером для вычисляемого выражения, вычисленного результата и других данных.
Класс Field представляет объекты Field в базе данных.
Объект Field является контейнером для вычисляемого выражения, вычисленного результата и ряда других данных.
Поддерживаются следующие типы данных для результатов: Long, Double, String, Date, Point, 3dPoint, ObjectId, Buffer и Resbuf.
За вычисление отвечает вычислитель.

Teigha.DatabaseServices.Field.#ctor
Конструктор по умолчанию класса Field.
Конструктор по умолчанию класса Field.

Teigha.DatabaseServices.Field.#ctor(String)
Конструктор класса, создающий объект Field с указанным кодом поля.
Конструктор класса Field. Создает объект Field с указанным кодом поля fieldCode.
fieldCode: Код поля. Тип String.

Teigha.DatabaseServices.Field.#ctor(String,System.Boolean)
Конструктор класса Field. Создает объект Field с указанным кодом поля fieldCode.
Дополнительно позволяет указать, является ли это поле текстовым.
Конструктор класса Field. Создает объект Field с указанным кодом поля fieldCode.
Дополнительно позволяет указать, является ли это поле текстовым.
fieldCode: Код поля. Тип String.
textField: Флаг, определяющий, является ли это поле текстовым. Тип bool. Если принимает значение true, поле является текстовым. В противном случае аргумент должен принимать значение false.

Teigha.DatabaseServices.Field.Evaluate(System.Int32,DatabaseServices.Database)
Метод предназначен для вычисления выражения в данном объекте с учетом указанных опций.
Метод предназначен для вычисления выражения в этом поле с учетом указанных опций, определяющих контекст вычислений.
Если аргумент database имеет значение null, используется та база данных, в которой объект поля является резидентным.
evaluationOptions: Контекст вычисления выражения. Тип int. Флаг контекста может принимать значения из перечисления FieldEvaluationContext или значения, определяемые пользователем.
database: База данных, используемая для вычисления выражения. Тип DatabaseServices.Database.  Может равняться null.

Teigha.DatabaseServices.Field.GetData(String)
Метод предназначен для получения данных из объекта поля по указанному ключу.
Метод предназначен для получения данных из объекта поля по указанному ключу.
key: Ключ для извлечения данных. Тип String.  Не может быть null или пустой строкой.
Returns: Возвращает данные по указанному ключу. Тип Object.

Teigha.DatabaseServices.Field.GetFieldCode(Teigha.DatabaseServices.FieldCodeFlags)
Метод предназначен для получения кода поля в виде строки, сформированной с учетом указанных флагов кодов поля.
Метод предназначен для получения кода поля в виде строки, сформированной с учетом указанных флагов кодов поля из перечисления FieldCodeFlags.
flags: Флаг или набор флагов из перечисления FieldCodeFlags.
Returns: Возвращает строку с кодом поля.  Тип String.

Teigha.DatabaseServices.Field.GetFieldCodeWithChildren(Teigha.DatabaseServices.FieldCodeFlags)
Метод позволяет извлечь код поля с дочерними полями в различных видах, используя аргумент с флагами кодов поля.
Метод позволяет извлечь код поля с дочерними полями в различных видах, используя аргумент с флагами кодов поля.
flags: Флаг или набор флагов из перечисления FieldCodeFlags.
Returns: Возвращает код поля.  Тип FieldCodeWithChildren.

Teigha.DatabaseServices.Field.SetData(String,Object)
Метод предоставляет возможность задать в этом поле данные с указанным ключом.
Метод предоставляет возможность задать в этом поле данные с указанным ключом.
key: Ключ, с которым ассоциированы сохраняемые в поле данные. Тип String. Не может иметь значение null или быть пустой строкой.
data: Данные для поля. Тип Object.

Teigha.DatabaseServices.Field.SetData(String,Object,System.Boolean)
Метод предоставляет возможность установить в этом поле данные с указанным ключом. Дополнительно возможно задать рекурсивную установку этих данных во всех дочерних полях.
Метод предоставляет возможность установить в этом поле данные с указанным ключом. Дополнительно возможно задать рекурсивную установку этих данных во всех дочерних полях.
key: Ключ, с которым ассоциированы сохраняемые в поле данные. Тип String. Не может иметь значение null или быть пустой строкой.
data: Данные для поля. Тип Object.
recursive: Флаг, определяющий, следует ли рекурсивно устанавливать данные во всех дочерних полях. Тип bool. Значение true предписывает рекурсивный проход по всем дочерним полям.

Teigha.DatabaseServices.Field.SetFieldCode(String)
Метод позволяет установить для этого объекта указанный код поля.
Метод позволяет установить для этого объекта указанный код поля fieldCode.
fieldCode: Код поля, который требуется задать. Тип String.

Teigha.DatabaseServices.Field.SetFieldCodeWithChildren(Teigha.DatabaseServices.FieldCodeFlags,Teigha.DatabaseServices.FieldCodeWithChildren)
Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей с учетом указанных флагов кодов полей.
Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей с учетом указанных флагов кодов полей.
flag: Флаги из перечисления FieldCodeFlags.
fieldCode: Входной код поля и вложенные поля, которые следует задать.  Тип FieldCodeWithChildren.

Teigha.DatabaseServices.Field.SetFieldCodeWithChildren(Teigha.DatabaseServices.FieldCodeWithChildren)
Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей.
Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей.
fieldCode: Входной код поля и вложенные поля, которые следует задать.  Тип FieldCodeWithChildren.

Teigha.DatabaseServices.Field.DataType
Свойство DataType возвращает тип результата вычисления поля.
Свойство DataType возвращает тип результата вычисления поля. Возможные типы представлены перечислением Teigha.DatabaseServices.DataType.
Returns: Возвращает тип результата как значение из перечисления Teigha.DatabaseServices.DataType.

Teigha.DatabaseServices.Field.EvaluationOption
Свойство EvaluationOption представляет доступ к опциям вычисления данного поля.
Свойство EvaluationOption представляет доступ к опциям вычисления данного поля.
Returns: Возвращает опции вычисления данного поля как значение из перечисления FieldEvaluationOptions.

Teigha.DatabaseServices.Field.EvaluationStatus
Свойство EvaluationStatus возвращает статус вычисления данного поля.
Свойство EvaluationStatus возвращает статус вычисления данного поля.
Returns: Возвращает статус вычисления поля. Тип FieldEvaluationStatusResult.

Teigha.DatabaseServices.Field.EvaluatorId
Свойство EvaluatorId представляет идентификатор вычислителя, который используется для данного поля.
Свойство EvaluatorId представляет идентификатор вычислителя, который используется для данного поля.
Returns: Возвращает идентификатор вычислителя. Тип String.

Teigha.DatabaseServices.Field.FilingOption
Свойство FilingOption представляет опции сохранения этого поля в файле.
Свойство FilingOption представляет опции сохранения этого поля в файле.
Returns: Возвращает опции сохранения в файл. Тип FieldFilingOptions.

Teigha.DatabaseServices.Field.Format
Свойство Format представляет формат вывода для данного поля.
Свойство Format представляет формат вывода для данного поля.
Returns: Возвращает формат вывода для поля. Тип String.

Teigha.DatabaseServices.Field.HyperLink
Свойство HyperLink представляет гиперссылку, связанную с данным полем.
Свойство HyperLink представляет гиперссылку, связанную с данным полем.
Returns: Возвращает гиперссылку, связанную с данным полем.  Тип HyperLink.

Teigha.DatabaseServices.Field.IsTextField
Свойство IsTextField позволяет определить, является ли данный объект текстовым полем с внедренными полями.
Свойство IsTextField позволяет определить, является ли данный объект текстовым полем с внедренными полями.
Returns: Возвращает true, если данный объект является текстовым полем с внедренными полями.
В противном случае возвращает false.

Teigha.DatabaseServices.Field.State
Свойство State возвращает текущее состояние поля одним из значений перечисления FieldState или их комбинацией.
Свойство State возвращает текущее состояние поля одним из значений перечисления FieldState или их комбинацией.
Returns: Возвращает состояние поля как значение (или комбинация значений) из перечисления FieldState.

Teigha.DatabaseServices.Field.Value
Свойство Value возвращает значение поля в исходном типе данных.
Свойство Value возвращает значение поля в исходном типе данных.
Returns: Возвращает значение поля. Тип Object.