Teigha.DatabaseServices.PlotStyleTable
Класс PlotStyleTable реализует таблицы стилей печати.
Класс PlotStyleTable реализует таблицы стилей печати.

Teigha.DatabaseServices.PlotStyleTable.AddNewPlotStyle(String)
Метод добавляет в данную таблицу новый стиль печати с указанным именем.
Метод добавляет в данную таблицу новый стиль печати с указанным именем.
styleName: Имя нового стиля печати. Тип String.
Returns: Возвращает вновь добавленный стиль печати.
Тип PlotStyle.

Teigha.DatabaseServices.PlotStyleTable.AddPlotStyle(Teigha.DatabaseServices.PlotStyle)
Метод добавляет в данную таблицу указанный стиль печати.
Метод добавляет в данную таблицу указанный стиль печати.
pPs: Добавляемый стиль печати.  Тип PlotStyle.

Teigha.DatabaseServices.PlotStyleTable.DelPlotStyle(Teigha.DatabaseServices.PlotStyle)
Метод удаляет из данной таблицы указанный стиль печати.
Метод удаляет из данной таблицы стиль печати pPsPtr.
pPsPtr: Удаляемый стиль печати. Тип PlotStyle.
Returns: Возвращает ссылку на удаленный стиль печати.
Тип PlotStyle.

Teigha.DatabaseServices.PlotStyleTable.GetLineweightAt(Int32)
Метод предоставляет вес линии, который используется стилем печати с указанным индексом в данной таблице.
Метод предоставляет вес (толщину) линии, который используется стилем печати с указанным индексом в данной таблице стилей печати.
index: Индекс стиля печати (индекс записи) в данной таблице. Тип Int32.
Returns: Возвращает вес (толщину) линии.
Тип double.

Teigha.DatabaseServices.PlotStyleTable.PlotStyleAt(System.Int32)
Метод предоставляет стиль печати с указанным индексом в данной таблице PlotStyleTable.
Метод предоставляет стиль печати с указанным индексом в данной таблице PlotStyleTable.
index: Входной индекс стиля печати. Тип int.
Returns: Возвращает найденный стиль печати.
Тип PlotStyle.

Teigha.DatabaseServices.PlotStyleTable.PlotStyleAt(String)
Метод предоставляет стиль печати, который присутствует в данной таблице PlotStyleTable под указанным именем
Метод предоставляет стиль печати, который присутствует в данной таблице PlotStyleTable под указанным именем.
name: Входное имя стиля печати. Тип String.
Returns: Возвращает найденный стиль печати.
Тип PlotStyle.

Teigha.DatabaseServices.PlotStyleTable.SetLineweightAt(System.Double,Int32)
Метод позволяет задать вес (толщину) линии для стиля печати с указанным индексом в данной таблице PlotStyleTable.
Метод позволяет задать вес (толщину) линии для стиля печати с индексом index в данной таблице PlotStyleTable.
val: Новое значение веса (толщины) линии для стиля печати. Тип double.
index: Индекс стиля печати, в котором изменяется вес линий.  Тип Int32.

Teigha.DatabaseServices.PlotStyleTable.SetOrdering(array)
Метод предназначен для сортировки записей в данной таблице.
Метод сортирует записи в данной таблице в указанном порядке имён стилей печати.
order: Массив имен, определяющий новый порядок следования стилей печати в данной таблице. Тип String[].

Teigha.DatabaseServices.PlotStyleTable.AciTableAvailable
Свойство AciTableAvailable позволяет определить, доступна ли таблица индексированных цветов.
Свойство AciTableAvailable позволяет определить, доступна ли таблица индексированных цветов.
Returns: Возвращает true, если таблица индексированных цветов доступна.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotStyleTable.ApplyScaleFactor
Свойство ApplyScaleFactor позволяет определить, следует ли применять глобальный масштабный коэффициент к не-ISO типам линий.
Свойство ApplyScaleFactor позволяет определить, следует ли применять глобальный масштабный коэффициент к типам линий, не соответствующим стандарту ISO.
Returns: Возвращает true, если глобальный масштабный коэффициент применяется к не-ISO типам линий.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotStyleTable.Description
Свойство Description представляет описание данной таблицы стилей печати.
Свойство Description представляет описание данной таблицы стилей печати PlotStyleTable.
Returns: Возвращает описание данной таблицы стилей печати.
Тип String.

Teigha.DatabaseServices.PlotStyleTable.DisplayCustomLineweightUnits
Свойство DisplayCustomLineweightUnits позволяет определить, следует ли отображать пользовательские единицы измерения толщины линий для данного объекта PlotStyleTable.
Свойство DisplayCustomLineweightUnits позволяет определить, следует ли отображать пользовательские единицы измерения толщины линий для данной таблицы стилей печати PlotStyleTable.
Returns: Возвращает true, если для данной таблицы стилей печати должны отображаться пользовательские единицы измерения толщины линий.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotStyleTable.Lineweights
Свойство Lineweights представляет список толщин линий, использование которых предусмотрено данным объектом PlotStyleTable.
Свойство Lineweights представляет список толщин линий, использование которых предусмотрено данным объектом PlotStyleTable.
Returns: Возвращает коллекцию весов (толщин) линий.
Тип DoubleCollection.

Teigha.DatabaseServices.PlotStyleTable.LineweightSize
Свойство LineweightSize представляет логический размер списка весов линий в данном объекте PlotStyleTable.
Свойство LineweightSize представляет логический размер списка весов (толщин) линий в данной таблице стилей печати PlotStyleTable.
Returns: Возвращает логический размер списка весов (толщин) линий.
Тип unsigned int.

Teigha.DatabaseServices.PlotStyleTable.PlotStyleArr
Свойство PlotStyleArr представляет массив стилей печати в данном объекте PlotStyleTable.
Свойство PlotStyleArr представляет массив стилей печати в данной таблице стилей печати PlotStyleTable.
Returns: Возвращает массив стилей печати.
Тип PlotStyle[].

Teigha.DatabaseServices.PlotStyleTable.PlotStyleSize
Свойство PlotStyleSize представляет логический размер данной таблицы PlotStyleTable.
Свойство PlotStyleSize представляет логический размер данной таблицы стилей печати PlotStyleTable.
Returns: Возвращает логический размер данной таблицы стилей.
Тип unsigned int.

Teigha.DatabaseServices.PlotStyleTable.ScaleFactor
Свойство ScaleFactor представляет глобальный масштабный коэффициент, применяемый к не-ISO типам линий в данном объекте PlotStyleTable.
Свойство ScaleFactor представляет глобальный масштабный коэффициент, применяемый к не-ISO типам линий в данной таблице стилей печати PlotStyleTable.
Returns: Возвращает значение глобального масштабного коэффициента.
Тип double.