Teigha.DatabaseServices.TextAttachmentType.AttachmentLinedCenter
Значение: 10. В качестве точки прикрепления вертикальной полки используется центр многострочного текста.
Сам объект MText сверху и снизу обрамляется горизонтальными линиями.