Teigha.DatabaseServices.TransactionManager
Данный класс представляет системный менеджер транзакций.
При старте nanoCAD система NRX создает единственный объект класса TransactionManager.
Этот менеджер транзакций как объект глобально доступен всем приложениям NRX.
Системный менеджер транзакций - объект TransactionManager - используется для старта, завершения или прерывания транзакций.
Кроме того, он предоставляет функционал для управления транзакциями и объектами в пределах транзакций.

Teigha.DatabaseServices.TransactionManager.#ctor(IntPtr,System.Boolean)
Конструктор.
Конструктор.
TransactionManager: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.TransactionManager.AddNewlyCreatedDBObject(Teigha.DatabaseServices.DBObject,System.Boolean)
Данный метод добавляет в транзакцию вновь созданную запись DBObject в базе данных.
Метод добавляет в транзакцию вновь созданную запись DBObject в базе данных.
Аргумент obj должен указывать на только что созданный объект, т.е. такой объект, который уже находится в базе данных и имееет ObjectId, но еще ни разу не закрывался.
obj: Объект DBObject.
add: Если add == true, объект, на который указывает obj, добавляется к верхней транзакции. Если add == false, то объект удаляется.

Teigha.DatabaseServices.TransactionManager.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode)
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
Поскольку объекты могут быть получены только в верхней транзакции, этот метод избавляет от необходимости как-то сохранять указатель на верхнюю транзакцию или использовать свойство TransactionManager.TopTransaction для его получения.
id: Идентификатор ObjectId получаемого объекта.
mode: Режим доступа к объекту из перечисления OpenMode.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.TransactionManager.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean)
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
С помощью логического аргумента openErased можно получить доступ к удаленному объекту.
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
Объекты могут быть получены только в верхней транзакции, поэтому этот метод избавляет от необходимости как-то сохранять указатель на верхнюю транзакцию или использовать свойство TransactionManager.TopTransaction для его получения.
Если логический аргумент openErased == true, то возможно получить даже удаленный объект.
Если openErased == false, то попытка получить удаленный объект вернет ошибку.
id: Идентификатор ObjectId получаемого объекта.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Если передать значение true, можно получить удаленный объект.  Если задать false, то попытка получить удаленный объект вернет ошибку.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.TransactionManager.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
Аргументы метода позволяют управлять режимом доступа к открываемым объектам, а также включать доступ к удаленным объектам и заблокированным слоям.
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
Объекты могут быть получены только в верхней транзакции, поэтому этот метод избавляет от необходимости как-то сохранять указатель на верхнюю транзакцию или использовать свойство TransactionManager.TopTransaction для его получения.
Если логический аргумент openErased == true, то возможно получить даже удаленный объект.
Если openErased == false, то попытка получить удаленный объект вернет ошибку.
Логический аргумент forceOpenOnLockedLayer управляет доступом к заблокированным слоям.
id: Идентификатор ObjectId получаемого объекта.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Если передать значение true, можно получить удаленный объект.  Если задать false, то попытка получить удаленный объект вернет ошибку.
forceOpenOnLockedLayer: Флаг доступа к заблокированному слою. Если задать true, можно открыть заблокированный слой. Если задать false, то попытка обращения к заблокированному слою вернет ошибку.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.TransactionManager.NumberOfActiveTransactions
Свойство возвращает количество активных транзакций.
Свойство возвращает количество активных транзакций.
Returns: Возвращает количество активных транзакций, тип int.

Teigha.DatabaseServices.TransactionManager.TopTransaction
Предоставляет доступ к объекту Transaction, который является верхним в стеке транзакций (т.е. к последнему созданному объекту Transaction).
Предоставляет доступ к последнему созданному объекту Transaction, который представляет верхнюю в стеке транзакций текущую транзакцию.
Returns: Возвращает объект Transaction.