Teigha.DatabaseServices.XrefFullSubentityPath.XrefObjHandles
Метод предоставляет упорядоченный массив дескрипторов объектов чертежа в базе данных.
Метод предоставляет упорядоченный массив дескрипторов объектов чертежа в базе данных.
Returns: Возвращает упорядоченный массив дескрипторов объектов в базе данных.
Тип Handle[].