Teigha.DatabaseServices.DefaultLightingType
Перечисление DefaultLightingType определяет типы источников света по умолчанию, которые доступны для видовых экранов и полноценной визуализации.
Перечисление DefaultLightingType определяет типы источников света по умолчанию, которые доступны для видовых экранов и полноценной визуализации.
Один из этих типов используется, когда пользовательское освещение не задано или когда восстанавливается освещение по умолчанию.