Teigha.Geometry.Vector3d.ToArray
Метод позволяет создать массив типа double, содержащий значения координат X, Y и Z данного вектора.
Метод позволяет создать массив типа double, содержащий значения координат X, Y и Z данного вектора.
Returns: Возвращает массив с координатами данного вектора. Тип double[].