Teigha.Colors.TransparencyCollectionEnumerator.Reset
Метод реинициализирует перечислитель, возвращая его в исходную позицию перед первым элементом в коллекции.
Метод реинициализирует перечислитель, возвращая его в исходную позицию перед первым элементом в коллекции.