Teigha.GraphicsInterface.WorldGeometry
Класс WorldGeometry отвечает за помещение геометрии в графический кэш для последующего отображения.  Объект этого класса является частью каждого объекта WorldDraw, передаваемого в метод WorldDraw() объекта, которому потребовалась генерация графики.
Класс WorldGeometry отвечает за помещение геометрии в графический кэш для последующего отображения.  Объект этого класса является частью каждого объекта WorldDraw, передаваемого в метод WorldDraw() объекта, которому потребовалась генерация графики.  Геометрия, созданная методами этого класса, используется во всех видовых экранах.  Если требуется графика, специфичная для видового экрана, то вместо WorldDraw() необходимо использовать метод ViewportDraw().
Этот класс также предоставляет текущее геометрическое преобразование из системы координат объекта в пространство модели и позволяет пользователю определить пространственные границы объекта.
В этом классе вся геометрия рассматривается в системе координат модели.  Лишь только метод WorldGeometry.SetExtents() требует указатель на массив из двух точек в мировой системе координат.
Класс WorldGeometry можно наследовать, чтобы создать свой класс с собственными реализациями различных геометрических функций.  Такой объект может быть передан в метод WorldDraw() объекта пользовательского класса, производного от WorldDraw.  Это дает вам возможность получать графическую информацию об  объекте без прямого доступа к его базовому коду.  Например, это оказывается полезным, когда требуется доступ к фасетной геометрии твердых тел.

Teigha.GraphicsInterface.WorldGeometry.SetExtents(DatabaseServices.Extents3d)
Метод позволяет задать экстенты - габаритные границы текущего объекта в мировой системе координат.
Метод позволяет задать новые экстенты текущего объекта - его габаритные границы в мировой системе координат (WCS), заданные аргументом extents.
Экстенты объекта — это прямоугольный параллелепипед минимального размера, который ориентирован по осям WCS и целиком содержит в себе геометрический объект.  Как правило, габаритные границы объекта в пространстве модели автоматически вычисляются в процессе генерации её геометрии.
Данный метод позволяет переопределить эти границы, например, увеличить или сместить.
extents: Массив из двух точек Point3d, которые определяют новый ограничивающий бокс для текущего объекта в мировой системе координат (WCS). Тип DatabaseServices.Extents3d.