Teigha.DatabaseServices.FrameSetting.ImageFrameOff
Значение: 0. Рамка не отображается и не выводится на печать.
Контур рамки временно подсвечивается при предварительном просмотре выбранного изображения.