Teigha.DatabaseServices.PhysicalIntensityMethod
Данное перечисление определяет доступные методы расчета физической интенсивности испускаемого света.
Данное перечисление определяет доступные методы расчета физической интенсивности испускаемого света.
Используемые единицы измерения интенсивности света зависят от выбора метода расчета физической интенсивности (т.е. кандела для PeakIntensity, люмен для Flux и люкс для Illuminance).