Teigha.DatabaseServices.NurbsData
Структура NurbsData заменяет любые имеющиеся данные сплайна данными, предоставленными через параметры этой структуры.
Структура NurbsData заменяет любые имеющиеся данные сплайна данными, предоставленными через параметры этой структуры.

Teigha.DatabaseServices.NurbsData.Equals(Object)
Метод предназначен для проверки идентичности двух объектов.
Метод используется для проверки идентичности данного и входного объектов.
obj: Входной объект, с которым проверяется равенство. Тип Object.
Returns: Возвращает true, если оба объекта не являются нулевыми, имеют одинаковый тип и идентичные параметры.
В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться согласованно с сохранением общей логики.
Если Equals возвращает true, хеш-коды обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать
NurbsData.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.NurbsData.IsEqualTo(Teigha.DatabaseServices.NurbsData)
Метод позволяет проверить, что данный объект идентичен другому объекту NurbsData.
Метод позволяет проверить, что данный объект идентичен другому объекту NurbsData.
Идентичность означает одновременное выполнение следующих условий:
* Совпадают управляющие вершины.
* Совпадают узловые точки.
* Совпадают степени сплайнов.
* Оба сплайна являются рациональными, либо оба являются нерациональными.
* Оба сплайна являются замкнутыми, либо оба являются незамкнутыми.
* Оба сплайна являются периодическими, либо оба являются непериодическими.
other: Другой объект, с которым проверяется равенство. Тип NurbsData.
Returns: Возвращает true, если данный объект идентичен объекту other.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbsData.IsEqualTo(Teigha.DatabaseServices.NurbsData,Teigha.Geometry.Tolerance)
Метод позволяет проверить, что данный объект идентичен другому объекту NurbsData в пределах указанного допуска.
Метод позволяет проверить, что в пределах указанного допуска данный объект идентичен другому объекту NurbsData.
Идентичность означает одновременное выполнение следующих условий (в пределах указанного допуска):
* Совпадают управляющие вершины.
* Совпадают узловые точки.
* Совпадают степени сплайнов.
* Оба сплайна являются рациональными, либо оба являются нерациональными.
* Оба сплайна являются замкнутыми, либо оба являются незамкнутыми.
* Оба сплайна являются периодическими, либо оба являются непериодическими.
other: Другой объект, с которым проверяется равенство. Тип NurbsData.
tolerance: Допуск для сравнения на равенство. Тип Tolerance.
Returns: Возвращает true, если данный объект идентичен объекту other в пределах указанного допуска.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbsData.!=(Teigha.DatabaseServices.NurbsData,Teigha.DatabaseServices.NurbsData)
Оператор неравенства для класса NurbsData.
Оператор неравенства для класса NurbsData.
Для неравенства достаточно невыполнения хотя бы одного из перечисленных ниже условий:
* Совпадают управляющие вершины.
* Совпадают узловые точки.
* Совпадают степени сплайнов.
* Оба сплайна являются рациональными, либо оба являются нерациональными.
* Оба сплайна являются замкнутыми, либо оба являются незамкнутыми.
* Оба сплайна являются периодическими, либо оба являются непериодическими.
a: Левый операнд.  Тип NurbsData.
b: Правый операнд. Тип NurbsData.
Returns: Возвращает true, если нарушено хотя бы одно из условий равенства сравниваемых объектов.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbsData.==(Teigha.DatabaseServices.NurbsData,Teigha.DatabaseServices.NurbsData)
Оператор равенства для класса NurbsData.
Оператор равенства для класса NurbsData.
Равенство означает одновременное выполнение следующих условий:
* Совпадают управляющие вершины.
* Совпадают узловые точки.
* Совпадают степени сплайнов.
* Оба сплайна являются рациональными, либо оба являются нерациональными.
* Оба сплайна являются замкнутыми, либо оба являются незамкнутыми.
* Оба сплайна являются периодическими, либо оба являются непериодическими.
a: Левый операнд.  Тип NurbsData.
b: Правый операнд. Тип NurbsData.
Returns: Возвращает true, если выполнены одновременно все условия равенства сравниваемых объектов.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbsData.Closed
Свойство позволяет убедиться, что сплайн является замкнутым.
Свойство позволяет проверить, что сплайн является замкнутым.
Замкнутый сплайн строится путем замыкания исходного сплайна между первой и последней точками гладким сплайном.
Returns: Возвращает true, если сплайн является замкнутым.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbsData.ControlPointTolerance
Свойство возвращает значение допуска, используемое для операций с управляющими вершинами NURBS.
Свойство возвращает значение допуска, используемое для операций с управляющими вершинами NURBS.
Returns: Возвращает значение допуска для управляющих вершин. Тип double.

Teigha.DatabaseServices.NurbsData.Degree
Свойство возвращает степень кривой NURBS.
Свойство возвращает степень кривой NURBS.
Высокие значения степени делают кривую более гибкой.
Например, степень 1 используется для определения линейного сегмента, а степень 2 используется для определения окружности NURBS и т.д.
Returns: Возвращает степень кривой NURBS. Тип int.

Teigha.DatabaseServices.NurbsData.KnotTolerance
Свойство возвращает значение допуска, используемое для операций с узлами NURBS.
Свойство возвращает значение допуска, используемое для операций с узлами NURBS.
Returns: Возвращает значение допуска для операций с узлами NURBS.
Тип double.

Teigha.DatabaseServices.NurbsData.Periodic
Свойство позволяет проверить, является ли сплайн периодическим.
Свойство позволяет проверить, является ли сплайн периодическим.
У периодического сплайна с периодом T точки, соответствующие значениям параметра t и (t + T), совпадают.
Returns: Возвращает true, если сплайн является периодическим.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbsData.Rational
Свойство позволяет проверить, является ли сплайн рациональным.
Свойство позволяет проверить, является ли сплайн рациональным.
У рационального сплайна каждая управляющая вершина имеет соответствующее значение веса.
Returns: Возвращает true, если сплайн является рациональным.
В противном случае возвращает false.