Teigha.DatabaseServices.XrefOperation.XrefOverlayOperation
Значение: 3.
Выполняется наложение файла внешней ссылки на базу данных, которая указана в HostDb
(или текущем документе, если HostDb имеет значение null).