Teigha.Runtime.CommandFlags.DocExclusiveLock
Значение: 1048576 (0x100000).
Если этот флаг установлен, то при вызове команды выполняется исключительная блокировка документа (exclusive lock).
Если флаг не установлен, осуществляется совместная блокировка документа (shared lock).