Teigha.DatabaseServices.DxfFiler.ResetFilerStatus
Метод сбрасывает текущий статус этого объекта Filer.
Метод сбрасывает текущий статус этого объекта Filer.  Реализация этого метода по умолчанию не делает ничего.