HostMgd.PlottingServices.PlotPageInfo
Класс PlotPageInfo предоставляет информацию об объектах, содержащихся на печатаемой странице.
Класс PlotPageInfo предоставляет статистическую информацию об объектах, содержащихся на печатаемой странице.
Приложения могут использовать эту информацию, чтобы при необходимости предупредить пользователя о том, что печать страницы потребует некоторого времени.
Notes
Объект этого типа возвращает метод HostMgd.PlottingServices.PlotEngine.BeginPage().

HostMgd.PlottingServices.PlotPageInfo.#ctor
Конструктор по умолчанию класса PlotPageInfo.
Конструктор по умолчанию класса PlotPageInfo.

HostMgd.PlottingServices.PlotPageInfo.EntityCount
Свойство EntityCount предоставляет оценку количества объектов чертежа на странице.
Свойство EntityCount позволяет получить оценку количества объектов чертежа на печатаемой странице.
Returns: Возвращает количество объектов чертежа.
Тип int.

HostMgd.PlottingServices.PlotPageInfo.GradientCount
Свойство GradientCount предоставляет оценку количества градиентных объектов на странице.
Свойство GradientCount позволяет получить оценку количества градиентных объектов на печатаемой странице.
Returns: Возвращает количество градиентов.
Тип int.

HostMgd.PlottingServices.PlotPageInfo.OleObjectCount
Свойство OleObjectCount предоставляет оценку количества OLE-объектов на странице.
Свойство OleObjectCount предоставляет оценку количества OLE-объектов на печатаемой странице.
Returns: Возвращает количество OLE-объектов.
Тип int.

HostMgd.PlottingServices.PlotPageInfo.RasterCount
Свойство RasterCount предоставляет оценку количества растровых объектов на странице.
Свойство RasterCount предоставляет оценку количества растровых объектов на печатаемой странице.
Returns: Возвращает количество растровых объектов.
Тип int.

HostMgd.PlottingServices.PlotPageInfo.ShadedViewportType
Свойство ShadedViewportType предоставляет ненулевое значение, если на печатаемой странице имеются тонированные видовые экраны или видовые экраны с рендерами.
Свойство ShadedViewportType предоставляет ненулевое значение, если на печатаемой странице имеются тонированные видовые экраны или видовые экраны с рендерами.  Возвращает ноль, если таких видовых экранов на странице нет.
Returns: Возвращает ноль, если на странице нет тонированных видовых экранов или видовых экранов с рендерами. В противном случае возвращает ненулевое значение.
Тип int.