Teigha.LayerManager.RelationalExpression
Класс RelationalExpression представляет реляционное выражение вида variable  constant, где op — это либо оператор ==, либо !=.
Класс RelationalExpression представляет реляционное выражение вида variable  constant, где op — это либо оператор ==, либо !=.

Teigha.LayerManager.RelationalExpression.Constant
Свойство Constant возвращает имя константы реляционного выражения.
Свойство Constant возвращает имя константы реляционного выражения.
Returns: Возвращает имя константы реляционного выражения.
Тип String.

Teigha.LayerManager.RelationalExpression.Variable
Свойство Variable представляет имя переменной реляционного выражения.
Свойство Variable представляет имя переменной реляционного выражения.
Returns: Возвращает имя переменной реляционного выражения.
Тип String.