Teigha.DatabaseServices.HostApplicationServices
Класс HostApplicationServices предоставляет хост-приложениям различные сервисы времени выполнения.
Класс HostApplicationServices предоставляет хост-приложениям различные сервисы времени выполнения.

Teigha.DatabaseServices.HostApplicationServices.#ctor
Конструктор по умолчанию класса HostApplicationServices.
Конструктор по умолчанию класса HostApplicationServices.

Teigha.DatabaseServices.HostApplicationServices.#ctor(IntPtr,System.Boolean)
Конструктор класса HostApplicationServices.
Конструктор класса HostApplicationServices.
unmanagedObject: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.HostApplicationServices.BitmapDevice(Teigha.Runtime.RXObject,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.BitmapDeviceFlags)
Метод предназначен для получения имени растрового устройства, связанного с данным объектом HostApplicationServices.
В текущей версии не реализован.
Метод предназначен для получения имени растрового устройства, связанного с данным объектом HostApplicationServices.
В текущей версии не реализован.
viewObj: Объект, совместимый с AbstractViewPE (View, Viewport и т.п.). Тип RXObject.
database: Контекст базы данных. Тип Database.
flag: Флаги растрового устройства. Тип BitmapDeviceFlags.
Returns: Возвращает имя растрового устройства, связанного с этим объектом (если оно реализовано). Тип String.

Teigha.DatabaseServices.HostApplicationServices.FindFile(String,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.FindFileHint)
Метод позволяет получить полный путь к указанному файлу.
Метод позволяет получить полный путь к указанному файлу.
Используется в случаях, когда базе данных требуется доступ к файлу, например файлу шрифта, файлу шаблона и т.д.
Типичные этапы поиска:
1. Проверка имени файла.
2. Поиск в текущем каталоге.
3. Поиск в каталоге чертежей (для файлов шрифтов SHX, изображений и внешних ссылок).
4. Поиск в каталогах, перечисленных в переменной среды (environment variable).
5. Поиск в каталоге шрифтов Microsoft(R) Windows(R) (только для шрифтов TTF в Windows).
Для сужения поиска метод позволяет уточнить тип искомого файла константой из перечисления FindFileHint.
fileName: Имя файла, который требуется найти. Тип String.
database: Указатель на контекст базы данных.  Тип Database. Указать значение null, если искомый файл не связан с базой данных.
hint: Уточнение типа искомого файла. Перечисление FindFileHint.
Returns: Возвращает полное имя файла либо пустую строку, если файл найти не удалось. Тип String.

Teigha.DatabaseServices.HostApplicationServices.FindFileEx(String,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.FindFileHint)
Метод позволяет получить полный путь к указанному файлу.
Метод позволяет получить полный путь к указанному файлу.
Используется в случаях, когда базе данных требуется доступ к файлу, например файлу шрифта, файлу шаблона и т.д.
Типичные этапы поиска:
1. Проверка имени файла.
2. Поиск в текущем каталоге.
3. Поиск в каталоге чертежей (для файлов шрифтов SHX, изображений и внешних ссылок).
4. Поиск в каталогах, перечисленных в переменной среды (environment variable).
5. Поиск в каталоге шрифтов Microsoft(R) Windows(R) (только для шрифтов TTF в Windows).
Для сужения поиска метод позволяет уточнить тип искомого файла константой из перечисления FindFileHint.
fileName: Имя файла, который требуется найти. Тип String.
database: Указатель на контекст базы данных.  Тип Database. Указать значение null, если искомый файл не связан с базой данных.
hint: Уточнение типа искомого файла. Перечисление FindFileHint.
Returns: Возвращает полное имя файла либо пустую строку, если файл найти не удалось. Тип String.

Teigha.DatabaseServices.HostApplicationServices.GetPassword(String,Teigha.DatabaseServices.PasswordOptions)
Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля.
Метод устарел. См. метод bool GetPassword().
Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля.
Метод устарел. См. метод bool GetPassword().
fileName: Имя файла чертежа, для доступа к которому требуется пароль. Тип String.
options: Опции пароля. Перечисление PasswordOptions.
Returns: Возвращает пустую строку. Тип String.

Teigha.DatabaseServices.HostApplicationServices.GetPassword(String,Teigha.DatabaseServices.PasswordOptions,[Out] String%)
Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля.
В текущей версии не реализован.
Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля.
В текущей версии не реализован.
fileName: Имя файла чертежа, для доступа к которому требуется пароль. Тип String.
options: Опции пароля. Перечисление PasswordOptions.
pass: Полученный пароль. Тип String.
Returns: Возвращает false.

Teigha.DatabaseServices.HostApplicationServices.GetRemoteFile(Uri,System.Boolean)
Метод предназначен для получения файла, заданного параметром URL. В текущей версии не реализован.
Метод предназначен для получения файла, заданного параметром URL. В текущей версии не реализован.
url: URL, которым идентифицируется файл. Тип Uri.
ignoreCache: Флаг, определяющий, следует ли загружать существующие кэшированные файлы. Тип bool.  В случае значения true кэшированные файлы не загружаются.
Returns: Возвращает найденный файл. Тип String.

Teigha.DatabaseServices.HostApplicationServices.GetUrl(String)
Метод позволяет сопоставить локальный файл с соответствующим адресом URL, с которого файл был загружен.
Метод позволяет сопоставить локальный файл с соответствующим адресом URL, с которого файл был загружен.
localFile: Локальный файл. Тип String.
Returns: Возвращает URI загруженного файла. Тип Uri.

Teigha.DatabaseServices.HostApplicationServices.IsUrl(String)
Метод позволяет проверить, является ли переданная строка допустимым URL-адресом.
В текущей версии не реализован.
Метод позволяет проверить, является ли переданная строка допустимым URL-адресом.
В текущей версии не реализован.
filePath: Проверяемая строка. Тип String.
Returns: Возвращает true, если переданная в метод строка является допустимым URL-адресом.
В противном случае возвращает false.

Teigha.DatabaseServices.HostApplicationServices.LoadApplication(String,Teigha.DatabaseServices.ApplicationLoadReasons,System.Boolean,System.Boolean)
Метод позволяет загрузить приложение. В текущей версии не реализован.
Метод позволяет загрузить приложение. В текущей версии не реализован.
appName: Нуль-терминированная строка, представляющая имя загружаемого приложения. Тип String.
why: Причина загрузки приложения. Перечисление ApplicationLoadReasons.
printIt: Флаг, определяющий, печатать ли сообщение о состоянии загрузки. Тип bool.
asCmd: Флаг, определяющий, следует ли загружать приложение, как это происходит по команде пользователя. Тип bool.

Teigha.DatabaseServices.HostApplicationServices.PutRemoteFile(Uri,String)
Метод позволяет загрузить локальный файл в удаленное расположение с указанным URI.
В текущей версии не реализован.
Метод позволяет загрузить локальный файл в удаленное расположение с указанным URI.
В текущей версии не реализован.
url: Целевой адрес URL. Тип Uri.
localFile: Локальный файл-источник для загрузки.  Тип String.

Teigha.DatabaseServices.HostApplicationServices.recoverFile(Teigha.Runtime.StreamBuf,Teigha.DatabaseServices.AuditInfo,String)
Метод предназначен для восстановления файла в указанном файловом буфере.
Метод предназначен для восстановления файла в указанном файловом буфере.
fileBuff: Файловый буфер с данными для восстановления. Тип StreamBuf.
auditInfo: Объект AuditInfo для данных аудита процесса восстановления файла.
password: Пароль для доступа к файлу. Тип String.
Returns: Возвращает дескриптор базы данных восстановленного файла. Тип Database.

Teigha.DatabaseServices.HostApplicationServices.AlternateFontName
Свойство возвращает имя "альтернативного" шрифта (шрифта по умолчанию), который используется, когда не удается найти никакой другой шрифт.
Свойство возвращает имя "альтернативного" шрифта (шрифта по умолчанию), который используется, когда не удается найти никакой другой шрифт.
Returns: Возвращает имя "альтернативного" шрифта. Тип String.

Teigha.DatabaseServices.HostApplicationServices.CompanyName
Свойство возвращает наименование компании, владеющей приложением.
Свойство возвращает наименование
Returns: Возвращает наименование компании. Тип String.

Teigha.DatabaseServices.HostApplicationServices.Current
Свойство обеспечивает доступ к активному в данный момент объекту HostApplicationServices.
Свойство обеспечивает доступ к активному в данный момент объекту HostApplicationServices.
Returns: Возвращает активный объект HostApplicationServices.

Teigha.DatabaseServices.HostApplicationServices.FontMapFileName
Свойство возвращает имя файла сопоставления (мэппинга) шрифтов.
Реализация по умолчанию возвращает пустую строку.
Свойство возвращает имя файла сопоставления (мэппинга) шрифтов.
Такие файлы содержат список имен шрифтов и шрифтов для их замены.
Реализация по умолчанию возвращает пустую строку.
Returns: Возвращает имя файла сопоставления (мэппинга) шрифтов. Тип String.

Teigha.DatabaseServices.HostApplicationServices.GRIPCOLOR
Свойство обеспечивает доступ к значению цвета невыделенных ручек. Индекс цвета принимает значения в диапазоне [1..255].
Свойство обеспечивает доступ к значению цвета невыделенных ручек. Индекс цвета принимает значения в диапазоне [1..255].
Returns: Возвращает индекс цвета невыделенных ручек. Тип short.

Teigha.DatabaseServices.HostApplicationServices.GRIPHOT
Свойство обеспечивает доступ к значению цвета выделенных ручек.
Индекс цвета принимает значения в диапазоне [1..255].
Свойство обеспечивает доступ к значению цвета выделенных ручек.
Индекс цвета принимает значения в диапазоне [1..255].
Returns: Возвращает индекс цвета выделенных ручек. Тип short.

Teigha.DatabaseServices.HostApplicationServices.GRIPHOVER
Свойство представляет доступ к индексу цвета ACI невыбранных ручек, когда на них наведен курсор (подсвеченное состояние).
Свойство представляет доступ к индексу цвета ACI невыбранных ручек, когда на них наведен курсор (подсвеченное состояние).
Индекс цвета принимает следующие значения в диапазоне [0..257]:
Индекс	Описание
------	---------------------------
0		ByBlock
7 		Foreground color
1		Red
2		Yellow
3		Green
4		Cyan
5		Blue
6		Magenta
7		Foreground color
8-255	Defined by display device
256		ByLayer
257		No color
Returns: Возвращает индекс цвета ручки. Тип short.

Teigha.DatabaseServices.HostApplicationServices.GRIPOBJLIMIT
Свойство представляет количество выделенных объектов, свыше которого ручки у набора выделенных объектов подавляются.
Диапазон допустимых значений [0..32767].
Свойство представляет количество выделенных объектов, свыше которого ручки у набора выделенных объектов подавляются.
Диапазон допустимых значений [0..32767].
Returns: Возвращает верхний предел количества выделенных объектов. Тип int.

Teigha.DatabaseServices.HostApplicationServices.GRIPSIZE
Свойство предоставляет отображаемый размер ручки. Допустимы значения в диапазоне [1..255] пикселей.
Свойство предоставляет отображаемый размер ручки. Допустимы значения в диапазоне [1..255] пикселей.
Returns: Возвращает размер ручки. Тип int.

Teigha.DatabaseServices.HostApplicationServices.LocalRootFolder
Свойство предоставляет путь к корневой папке. Реализация по умолчанию возвращает пустую строку.
Свойство предоставляет путь к корневой папке. Реализация по умолчанию возвращает пустую строку.
Returns: Возвращает путь к корневой папке. Тип String.

Teigha.DatabaseServices.HostApplicationServices.ModelerFlavor
Свойство возвращает возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
Свойство возвращает возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
Returns: Возвращает уровень поддержки средств геометрического моделирования. Перечисление ModelerFlavor.

Teigha.DatabaseServices.HostApplicationServices.Product
Свойство возвращает наименование продукта.
Свойство возвращает наименование продукта.
Returns: Возвращает наименование продукта. Тип String.

Teigha.DatabaseServices.HostApplicationServices.Program
Свойство возвращает наименование программы.
Свойство возвращает наименование программы.
Returns: Возвращает наименование программы. Тип String.

Teigha.DatabaseServices.HostApplicationServices.RegistryProductRootKey
Свойство возвращает корневой ключ продукта в реестре Windows.
Свойство возвращает корневой ключ продукта в реестре Windows.
Returns: Возвращает корневой ключ продукта в реестре. Тип String.

Teigha.DatabaseServices.HostApplicationServices.ReleaseMajorVersion
Свойство возвращает основную версию релиза клиентского приложения.
Свойство возвращает основную версию релиза клиентского приложения.
Returns: Возвращает основную версию релиза клиентского приложения. Тип int.

Teigha.DatabaseServices.HostApplicationServices.ReleaseMinorVersion
Свойство возвращает дополнительную версию клиентского приложения.
Свойство возвращает дополнительную версию клиентского приложения.
Returns: Возвращает дополнительную версию клиентского приложения. Тип int.

Teigha.DatabaseServices.HostApplicationServices.RoamableRootFolder
Свойство возвращает путь к локальному каталогу перемещаемых файлов.
Реализация по умолчанию возвращает пустую строку.
Свойство возвращает путь к локальному каталогу перемещаемых файлов.
Реализация по умолчанию возвращает пустую строку.
Returns: Возвращает путь к локальному каталогу. Тип String.

Teigha.DatabaseServices.HostApplicationServices.TEXTFILL
Свойство позволяет определить, применяется ли заливка к шрифтам TrueType.
Свойство позволяет определить, применяется ли заливка к шрифтам TrueType.
Returns: Возвращает true, если к шрифтам TrueType применяется заливка.
В противном случае возвращает false.

Teigha.DatabaseServices.HostApplicationServices.VersionString
Свойство возвращает строку с основной и дополнительной версиями релиза.
Свойство возвращает строку с основной и дополнительной версиями релиза.
Returns: Возвращает строку с основной и дополнительной версиями релиза. Тип String.

Teigha.DatabaseServices.HostApplicationServices.WorkingDatabase
Свойство предоставляет доступ к текущей активной базе данных.
Свойство предоставляет доступ к текущей активной базе данных.
Returns: Возвращает активную базу данных. Тип Database.