Teigha.DatabaseServices.Filters.SpatialFilterDefinition
Этот класс инкапсулирует данные, необходимые для определения пространственного фильтра SpatialFilter.
Этот класс инкапсулирует данные, необходимые для определения пространственного фильтра SpatialFilter.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Boolean)
Конструктор класса SpatialFilterDefinition.
Конструктор класса SpatialFilterDefinition.
pts: Коллекция вершин выдавливаемого 2D-контура, который определяет форму области фильтра в плане.
normal: Вектор, определяющий положительное направление выдавливания контура с вершинами pts в системе координат WCS. Тип Vector3d.
elevation: Расстояние от начала системы координат WCS до плоскости, в которой располагается выдавливаемый контур области фильтра.  Тип double. Значение elevation и вектор нормали normal определяют плоскость для системы координат объекта (ECS), в которой задаются вершины pts выдавливаемого контура.
frontClip: Расстояние в направлении вектора normal до передней плоскости отсечения. Тип double.
backClip: Расстояние до задней плоскости отсечения в отрицательном направлении выдавливания. Тип double.
enabled: Флаг состояния пространственной области фильтра. Тип bool. Если область отключена (значение false), то зоной действия фильтра становится все 3D-пространство.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.BackClip
Свойство возвращает расстояние задней плоскости отсечения в отрицательном направлении выдавливания.
Свойство возвращает расстояние до задней плоскости отсечения в отрицательном направлении выдавливания.
Returns: Возвращает расстояние до задней плоскости отсечения. Тип double.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Elevation
Свойство Elevation возвращает значение возвышения.  Совместно с вектором normal эта величина определяет плоскость системы координат ECS, в которой определены точки многоугольника основания.
Свойство Elevation возвращает значение возвышения.  Совместно с вектором normal эта величина определяет плоскость системы координат ECS, в которой определены точки многоугольника основания.
Returns: Возвращает значение возвышения. Тип double.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Enabled
Свойство Enabled позволяет определить, используется ли для фильтрации объектов чертежа граничная область фильтра или же всё трехмерное пространство.
Свойство Enabled возвращает статус граничной области фильтра. Если область отключена (значение false), то зоной действия фильтра становится всё 3D-пространство.
Returns: Возвращает true, если для фильтрации объектов чертежа используется граничная область фильтра.
Если область отключена (значение false), то зоной действия фильтра становится все 3D-пространство.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.FrontClip
Свойство FrontClip возвращает расстояние до передней плоскости отсечения в положительном направлении выдавливания.
Свойство FrontClip возвращает расстояние до передней плоскости отсечения в положительном направлении выдавливания.
Returns: Возвращает расстояние до передней плоскости отсечения. Тип double.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Normal
Свойство Normal возвращает положительное направление выдавливания 2D-контура области фильтра.
Свойство Normal возвращает положительное направление выдавливания 2D-контура области фильтра.
Returns: Возвращает вектор направления выдавливания. Тип Vector3d.