Teigha.DatabaseServices.Surface.ConvertToNurbSurface
Метод предназначен для преобразования данного объекта в NURB-поверхности.
Метод предназначен для преобразования данного объекта в NURB-поверхности.
Notes
Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
Returns: Возвращает массив сгенерированных NURB-поверхностей. Тип NurbSurface[].