HostMgd.ApplicationServices.DocumentBeginCloseEventArgs
Класс предоставляет данные для события BeginDocumentClose класса Document.
Класс DocumentBeginCloseEventArgs является наследником класса EventArgs и в .NET API nanoCAD используется совместно с событием BeginDocumentClose и делегатом
DocumentBeginCloseEventHandler для реализации процедур, предшествующих закрытию документа.
В частности, позволяет при необходимости остановить закрытие документа, воспользовавшись методом DocumentBeginCloseEventArgs.Veto().

HostMgd.ApplicationServices.DocumentBeginCloseEventArgs.#ctor
Конструктор по умолчанию класса DocumentBeginCloseEventArgs.
Конструктор по умолчанию класса DocumentBeginCloseEventArgs.