Teigha.DatabaseServices.DBObject.GetField
Метод предназначен для получения идентификатора поля "TEXT" из словаря полей.
Этот метод обеспечивает доступ к полю "TEXT", связанному с
объектом базы данных, путем получения идентификатора поля.
Returns: Возвращает идентификатор поля "TEXT" из словаря полей. Тип ObjectId