HostMgd.Windows
Пространство имен HostMgd.Windows включает классы, делегаты и перечисления, предназначенные для создания  пользовательского оконного интерфейса (окна, диалоги, панели инструментов, меню и т.п.).
Пространство имен HostMgd.Windows включает классы, делегаты и перечисления, предназначенные для создания  пользовательского оконного интерфейса (окна, диалоги, панели инструментов, меню и т.п.).