Teigha.DatabaseServices.UpdateOption.OverwriteFormatModifiedAfterUpdate
Значение: 0x800000.
Выполняется перезапись всех изменений формата, внесенных в связанные данные с момента последнего обновления данных из источника.
Этот параметр действителен только при обновлении данных из источника (т.е. когда направление обновления принимает значение UpdateDirection.SourceToData).