Teigha.Geometry.EllipticalCone.EllipticalCone.#ctor
Конструктор по умолчанию класса EllipticalCone.
Конструктор по умолчанию класса EllipticalCone.
Создает экземпляр эллиптического конуса по умолчанию
с косинусом половинного угла, равным cos(PI/4.0),
синусом половинного угла, равным -sin(PI/4.0),
началом координат конуса в начале мировой системы координат,
единичными большим и малым радиусами и
осью конуса, ориентированной в направлении оси Y МСК.