Teigha.DatabaseServices.DimensionCenterMarkType
Данное перечисление определяет режимы автоматического создания маркера центра и центровых линий для размеров радиуса и диаметра.
Данное перечисление определяет режимы автоматического создания маркера центра и центровых линий для размеров радиуса и диаметра.