Teigha.GraphicsSystem.Device.CreateModel
Метод позволяет создать новый объект модели и связать его с данным устройством.
Метод позволяет создать новый объект модели и связать его с данным устройством.
Returns: Возвращает дескриптор созданной модели.
Тип Model.