Teigha.DatabaseServices.FullDwgVersion
Этот класс представляет основные и второстепенные версии DWG.
Этот класс представляет основные (major) и второстепенные (minor) версии DWG.

Teigha.DatabaseServices.FullDwgVersion.#ctor(Teigha.DatabaseServices.DwgVersion,Teigha.DatabaseServices.MaintenanceReleaseVersion)
Конструктор класса FullDwgVersion. Создает объект с заданными настройками версии (major/minor).
Конструктор класса FullDwgVersion. Создает объект с заданными настройками версии (major/minor).
majorVersion: Основная версия DWG.   Значение из перечисления DwgVersion.
minorVersion: Второстепенная версия. Значение из перечисления MaintenanceReleaseVersion.

Teigha.DatabaseServices.FullDwgVersion.Equals(Object)
Метод предназначен для проверки данного объекта на совпадение с указанным объектом.
Метод предназначен для проверки данного объекта на совпадение с указанным объектом other.
other: Объект, с которым выполняется сравнение. Тип Object.
Returns: Возвращает true, если данный объект идентичен объекту other.
В противном случае возвращает false.

Teigha.DatabaseServices.FullDwgVersion.!=(Teigha.DatabaseServices.FullDwgVersion,Teigha.DatabaseServices.FullDwgVersion)
Оператор неравенства для класса FullDwgVersion.
Оператор неравенства для класса FullDwgVersion.
ver1: Левый операнд.  Тип FullDwgVersion.
ver2: Правый операнд. Тип FullDwgVersion.
Returns: Возвращает true при несовпадении версий ver1 и ver2.
В противном случае возвращает false.

Teigha.DatabaseServices.FullDwgVersion.==(Teigha.DatabaseServices.FullDwgVersion,Teigha.DatabaseServices.FullDwgVersion)
Оператор равенства для класса FullDwgVersion.
Оператор равенства для класса FullDwgVersion.
ver1: Левый операнд.  Тип FullDwgVersion.
ver2: Правый операнд. Тип FullDwgVersion.
Returns: Возвращает true при совпадении версий ver1 и ver2.
В противном случае возвращает false.

Teigha.DatabaseServices.FullDwgVersion.MajorVersion
Свойство возвращает основную (major) версию DWG.
Свойство возвращает основную (major) версию DWG.
Returns: Возвращает основную версию DWG. Значение из перечисления  DwgVersion.

Teigha.DatabaseServices.FullDwgVersion.MinorVersion
Свойство возвращает второстепенную (minor) версию DWG.
Свойство возвращает второстепенную (minor) версию DWG.
Returns: Возвращает версию технического релиза DWG. Значение из перечисления MaintenanceReleaseVersion.