Teigha.DatabaseServices.Extents3d
Класс Extents3d представляет трехмерный ограничивающий прямоугольный параллелепипед (бокс) минимального размера, в который вписан тот или иной геометрический объект.
Класс Extents3d представляет трехмерный ограничивающий прямоугольный параллелепипед (бокс) минимального размера, в который вписан тот или иной геометрический объект. Такой прямоугольный параллелепипед ориентирован по осям системы координат.
Бокс определяется двумя вершинами главной диагонали прямоугольного параллелепипеда - его минимальной (MinPoint) и максимальной (MaxPoint) точками

Teigha.DatabaseServices.Extents3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса Extents3d. Создает ограничивающий бокс по двум точкам Point3d.
Конструктор класса Extents3d.  Создает ограничивающий бокс по двум точкам Point3d.
min: Минимальная точка. Тип Point3d.
max: Максимальная точка. Тип Point3d.

Teigha.DatabaseServices.Extents3d.AddBlockExtents(Teigha.DatabaseServices.BlockTableRecord)
Метод предназначен для вычисления нового ограничивающего бокса, который включает в себя как текущий объект Extents3d, так и все объекты в указанном блоке.
Метод предназначен для вычисления нового ограничивающего бокса, который включает в себя как текущий объект Extents3d, так и все объекты в указанном блоке.
pointerToBlockTableRecord: Указатель на запись таблицы блоков. Тип BlockTableRecord.

Teigha.DatabaseServices.Extents3d.AddExtents(Teigha.DatabaseServices.Extents3d)
Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанный ограничивающий бокс.
Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанный ограничивающий бокс.
source: Ограничивающий бокс, который следует включить в данный объект. Тип Extents3d.

Teigha.DatabaseServices.Extents3d.AddPoint(Teigha.Geometry.Point3d)
Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанную точку Point3d.
Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанную точку Point3d.
pt: Входная 3D-точка. Тип Point3d.

Teigha.DatabaseServices.Extents3d.Equals(Object)
Метод предназначен для проверки данного объекта на равенство другому объекту Extents3d.
Метод предназначен для проверки данного объекта на равенство другому объекту Extents3d.
obj: Объект, проверяемый на равенство. Тип Object.
Returns: Возвращает true, если объект obj не является нулевым, и совпадают соответствующие координаты вершин сравниваемых объектов. В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать Extents3d.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.Extents3d.ExpandBy(Teigha.Geometry.Vector3d)
Метод позволяет расширить данный объект Extents3d в направлении и на величину, которые определяются указанным 3D-вектором.
Метод позволяет расширить данный объект Extents3d в направлении и на величину, которые определяются указанным 3D-вектором.
vector: 3D-вектор, определяющий расположение новых точек.   Тип Vector3d.

Teigha.DatabaseServices.Extents3d.IsEqualTo(Teigha.DatabaseServices.Extents3d)
Метод позволяет сравнить данный объект с указанным объектом Extents3d.
Метод позволяет сравнить данный объект с указанным объектом Extents3d.
a: Проверяемый объект. Тип Extents3d.
Returns: Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают.
В противном случае возвращает false.

Teigha.DatabaseServices.Extents3d.IsEqualTo(Teigha.DatabaseServices.Extents3d,Teigha.Geometry.Tolerance)
Метод позволяет сравнить данный объект с указанным объектом Extents3d в пределах заданного допуска.
Метод позволяет сравнить данный объект с указанным объектом Extents3d в пределах заданного допуска.
a: Проверяемый объект.    Тип Extents3d.
tolerance: Геометрический допуск. Тип Tolerance.
Returns: Возвращает true, если минимальные и максимальные точки сравниваемых объектов совпадают в пределах допуска tolerance. В противном случае возвращает false.

Teigha.DatabaseServices.Extents3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить минимальную и максимальную точки данного ограничивающего бокса Extents3d.
Метод позволяет переопределить минимальную и максимальную точки данного ограничивающего бокса Extents3d.
min: Новая минимальная точка. Тип Point3d.
max: Новая максимальная точка. Тип Point3d.

Teigha.DatabaseServices.Extents3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.DatabaseServices.Extents3d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Предписанный формат строки. Тип String.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде форматированной строки, содержащей координаты его минимальной и максимальной точек.  Тип String.

Teigha.DatabaseServices.Extents3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод применяет к данному объекту Extents3d указанное геометрическое преобразование.
Метод применяет к данному объекту Extents3d геометрическое преобразование, заданное матрицей Matrix3d.
mat: Матрица геометрического преобразования. Тип Matrix3d.

Teigha.DatabaseServices.Extents3d.!=(Teigha.DatabaseServices.Extents3d,Teigha.DatabaseServices.Extents3d)
Оператор неравенства класса Extents3d.
Оператор неравенства класса Extents3d.
a: Левый операнд.  Тип Extents3d.
b: Правый операнд. Тип Extents3d.
Returns: Возвращает true, если у операндов не совпадают минимальные и/или максимальные точки.
В противном случае возвращает false.

Teigha.DatabaseServices.Extents3d.==(Teigha.DatabaseServices.Extents3d,Teigha.DatabaseServices.Extents3d)
Оператор равенства класса Extents3d.
Оператор равенства класса Extents3d.
a: Левый операнд.  Тип Extents3d.
b: Правый операнд. Тип Extents3d.
Returns: Возвращает true, если у операндов совпадают как минимальные, так и максимальные точки.
В противном случае возвращает false.

Teigha.DatabaseServices.Extents3d.MaxPoint
Свойство обеспечивает доступ к максимальной точке данного объекта.
Свойство обеспечивает доступ к максимальной точке данного объекта.
Returns: Возвращает максимальную точку данного объекта. Тип Point3d.

Teigha.DatabaseServices.Extents3d.MinPoint
Свойство обеспечивает доступ к минимальной точке данного объекта.
Свойство обеспечивает доступ к минимальной точке данного объекта.
Returns: Возвращает минимальную точку данного объекта. Тип Point3d.