Teigha.DatabaseServices.Viewport.SetUcsToWorld
Метод позволяет совместить ПСК данного видового экрана с мировой системой координат.
Метод позволяет совместить ПСК данного видового экрана с мировой системой координат (МСК, WCS).