Teigha.DatabaseServices.Table.GetDataLink
Метод позволяет получить коллекцию ссылок на подлинкованные данные, если таблица связана с источником данных по ссылке.
Метод позволяет получить коллекцию ссылок на подлинкованные данные, если таблица связана с источником данных по ссылке.
Returns: Возвращает коллекцию типа ObjectIdCollection.