Teigha.BoundaryRepresentation.LoopType.LoopExterior
Значение: 1.
Цикл является внешним, находится на внешней границе (внешний цикл всегда ровно один, если только цикл не находится на конической поверхности, в этом случае используется тип LoopWinding).