HostMgd.EditorInput.Editor.PromptedForDistance
Событие возникает после завершения интерактивного ввода расстояния пользователем в редакторе nanoCAD.
Событие не реализовано.
Событие инициируется системой .NET API nanoCAD при завершении операции ввода расстояния,
например, после вызова метода GetDistance().
Оно позволяет разработчику получить доступ к результату ввода — значению расстояния типа double,
а также статусу операции (OK, Cancel, Error) через объект PromptDoubleResultEventArgs.
Это событие особенно полезно для обработки или отслеживания ввода расстояния с клавиатуры
или указания мышью двух точек на чертеже.
Example
C#