Teigha.DatabaseServices.DwgFiler.ReadPoint2d
Метод предназначен для получения точки Point2d из текущего элемента данного объекта Filer.
Метод предназначен для получения точки Point2d из текущего элемента данного объекта Filer.
Returns: Возвращает двумерную точку. Тип Point2d.