Teigha.Geometry.NurbSurfaceDefinition
Структура NurbSurfaceDefinition организует данные определения NURBS поверхности, доступ к которым предоставляет метод NurbSurface.GetDefinition.
Структура NurbSurfaceDefinition организует данные определения NURBS поверхности, доступ к которым предоставляет метод NurbSurface.GetDefinition.

Teigha.Geometry.NurbSurfaceDefinition.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если объект obj равен данному объекту.
В противном случае возвращает false.

Teigha.Geometry.NurbSurfaceDefinition.IsEqualTo(Teigha.Geometry.NurbSurfaceDefinition)
Метод проверяет, совпадают ли данные этого определения NURBS поверхности с данными другого определения NurbSurfaceDefinition.
Метод проверяет, совпадают ли данные этого определения NURBS поверхности с данными другого определения NurbSurfaceDefinition.
Notes
Два определения NURBS поверхностей считаются равными, если совместно соблюдаются все перечисленные ниже условия:
* У обоих сплайнов совпадают степени как в направлении U, так и в направлении V.
* У обоих сплайнов совпадают свойства как в направлении U, так и в направлении V.
* У обоих сплайнов совпадает количество управляющих вершин как в направлении U, так и в направлении V.
* У обоих сплайнов совпадают управляющие вершины.
* Значения весов равны.
* У обоих сплайнов совпадают узлы как в направлении U, так и в направлении V.
a: Проверяемые данные определения NURBS поверхности. Тип NurbSurfaceDefinition.
Returns: Возвращает true, если сравниваемые объекты можно считать равными.
В противном случае возвращает false.

Teigha.Geometry.NurbSurfaceDefinition.!=(Teigha.Geometry.NurbSurfaceDefinition,Teigha.Geometry.NurbSurfaceDefinition)
Оператор неравенства структуры NurbSurfaceDefinition.
Оператор неравенства структуры NurbSurfaceDefinition.
Notes
Два определения NURBS поверхностей считаются неравными, если нарушается хотя бы одно из следующих условий:
* У обоих сплайнов совпадают степени как в направлении U, так и в направлении V.
* У обоих сплайнов совпадают свойства как в направлении U, так и в направлении V.
* У обоих сплайнов совпадает количество управляющих вершин как в направлении U, так и в направлении V.
* У обоих сплайнов совпадают управляющие вершины.
* Значения весов равны.
* У обоих сплайнов совпадают узлы как в направлении U, так и в направлении V.
a: Левый  операнд. Тип NurbSurfaceDefinition.
b: Правый операнд. Тип NurbSurfaceDefinition.
Returns: Возвращает true, если операнды не равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.NurbSurfaceDefinition.==(Teigha.Geometry.NurbSurfaceDefinition,Teigha.Geometry.NurbSurfaceDefinition)
Оператор равенства структуры NurbSurfaceDefinition.
Оператор равенства структуры NurbSurfaceDefinition.
Notes
Два определения NURBS поверхностей считаются равными, если совместно соблюдаются все перечисленные ниже условия:
* У обоих сплайнов совпадают степени как в направлении U, так и в направлении V.
* У обоих сплайнов совпадают свойства как в направлении U, так и в направлении V.
* У обоих сплайнов совпадает количество управляющих вершин как в направлении U, так и в направлении V.
* У обоих сплайнов совпадают управляющие вершины.
* Значения весов равны.
* У обоих сплайнов совпадают узлы как в направлении U, так и в направлении V.
a: Левый  операнд. Тип NurbSurfaceDefinition.
b: Правый операнд. Тип NurbSurfaceDefinition.
Returns: Возвращает true, если операнды равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.NurbSurfaceDefinition.ControlPoints
Свойство ControlPoints представляет массив управляющих вершин NURBS поверхности.
Свойство ControlPoints представляет массив управляющих вершин NURBS поверхности.
Returns: Возвращает массив управляющих вершин сплайна.
Тип Point3dCollection.

Teigha.Geometry.NurbSurfaceDefinition.DegreeInU
Свойство DegreeInU представляет степень сплайна в направлении U.
Свойство DegreeInU представляет степень сплайна в направлении U.
Returns: Возвращает степень сплайна в направлении U.
Тип int.

Teigha.Geometry.NurbSurfaceDefinition.DegreeInV
Свойство DegreeInV представляет степень сплайна в направлении V.
Свойство DegreeInV представляет степень сплайна в направлении V.
Returns: Возвращает степень сплайна в направлении V.
Тип int.

Teigha.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInU
Свойство NumberOfControlPointsInU представляет количество управляющих вершин в направлении U.
Свойство NumberOfControlPointsInU представляет количество управляющих вершин в направлении U.
Returns: Возвращает количество управляющих вершин в направлении U.
Тип int.

Teigha.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInV
Свойство NumberOfControlPointsInV представляет количество управляющих вершин в направлении V.
Свойство NumberOfControlPointsInV представляет количество управляющих вершин в направлении V.
Returns: Возвращает количество управляющих вершин в направлении V.
Тип int.

Teigha.Geometry.NurbSurfaceDefinition.PropertiesInU
Свойство PropertiesInU представляет значение NurbSurfaceProperties как свойство поверхности в направлении U.
Свойство PropertiesInU представляет значение NurbSurfaceProperties как свойство поверхности в направлении U.
Returns: Возвращает значение NurbSurfaceProperties как свойство поверхности в направлении U.
Тип int.

Teigha.Geometry.NurbSurfaceDefinition.PropertiesInV
Свойство PropertiesInV представляет значение NurbSurfaceProperties как свойство поверхности в направлении V.
Свойство PropertiesInV представляет значение NurbSurfaceProperties как свойство поверхности в направлении V.
Returns: Возвращает значение NurbSurfaceProperties как свойство поверхности в направлении V.
Тип int.

Teigha.Geometry.NurbSurfaceDefinition.UKnots
Свойство UKnots представляет узловой вектор поверхности в направлении U.
Свойство UKnots представляет узловой вектор поверхности в направлении U.
Returns: Возвращает узловой вектор в направлении U.
Тип KnotCollection.

Teigha.Geometry.NurbSurfaceDefinition.VKnots
Свойство VKnots представляет узловой вектор поверхности в направлении V.
Свойство VKnots представляет узловой вектор поверхности в направлении V.
Returns: Возвращает узловой вектор в направлении V.
Тип KnotCollection.

Teigha.Geometry.NurbSurfaceDefinition.Weights
Свойство Weights представляет массив весов NURBS поверхности.
Свойство Weights представляет массив весов NURBS поверхности.
Returns: Возвращает массив значений весов.
Тип DoubleCollection.