Teigha.Runtime.StreamBuf.Truncate
Метод устанавливает в ноль длину файла, связанного с данным потоковым буфером StreamBuf.
Метод устанавливает в ноль длину файла, связанного с данным потоковым буфером StreamBuf.