Teigha.DatabaseServices.BlockTableRecord.GetEnumerator
Метод предназначен для перебора в цикле содержимого
определения блока.
Метод возвращает счетчик, с помощью которого можно перебрать
содержимое определения блока в цикле.
Returns: Возвращает тип данных BlockTableRecordEnumerator.