HostMgd.EditorInput.Editor.PromptingForPoint
Событие возникает при начале операции ввода точки
и позволяет настроить параметры команды до её запуска.
Событие инициируется перед началом интерактивного ввода точки — например,
при вызове метода GetPoint() или GetCorner(). Оно предоставляет доступ к параметрам ввода
через объект PromptPointOptionsEventArgs, что позволяет разработчику динамически изменять:
* текст приглашения (Message),
* базовую точку (BasePoint),
* режимы привязки (UseBasePoint, UseDashedLine),
* разрешение на пропуск ввода (AllowNone).
Это событие особенно полезно при реализации команд, где требуется гибкая настройка поведения
ввода точки в зависимости от контекста — например, при построении объектов, привязке к предыдущей
точке или отображении визуальных подсказок.
Событие реализуется через делегат PromptPointOptionsEventHandler и вызывается до отображения запроса
пользователю, что позволяет адаптировать параметры ввода в реальном времени.
Example
C#