HostMgd.ApplicationServices.DocumentWindowCollection.GetEnumerator
Метод предоставляет перечислитель данной коллекции.
Метод предоставляет перечислитель коллекции окон открытых документов.
Returns: Возвращает перечислитель коллекции окон документов.
Тип System.Collections.IEnumerator.