Teigha.DatabaseServices.LinkedData.Clear
Метод предназначен для удаления текущих данных. Должен быть реализован в производных классах.
Метод предназначен для удаления текущих данных. Должен быть реализован в производных классах.