Teigha.GraphicsSystem.ImpDevice.GetSize
Метод предоставляет размер данного устройства.
Метод позволяет получить текущий размер данного устройства.
Returns: Возвращает текущий размер устройства.
Тип System.Drawing.Size.