Teigha.BoundaryRepresentation.Mesh2dControl
Интерфейсный класс Mesh2dControl представляет элементы управления 2D-сетью Mesh2d.
Интерфейсный класс Mesh2dControl представляет элементы управления 2D-сетью Mesh2d.
Он определяет конкретный функционал настройки элементов управления для генерации 2D-сетей.
Notes
Этот класс реализован только в среде пространственного моделирования.

Teigha.BoundaryRepresentation.Mesh2dControl.#ctor
Конструктор по умолчанию класса Mesh2dControl.
Конструктор по умолчанию класса Mesh2dControl.

Teigha.BoundaryRepresentation.Mesh2dControl.ElementShape
Свойство ElementShape предоставляет доступ к форме 2D-элемента.
Свойство ElementShape предоставляет доступ к форме 2D-элемента данного объекта.
Returns: Возвращает форму 2D-элемента данного объекта.
Перечисление Element2dShape.

Teigha.BoundaryRepresentation.Mesh2dControl.MaxAspectRatio
Свойство MaxAspectRatio представляет максимальное соотношение ширины и высоты, допустимое для данного элемента управления.
Свойство MaxAspectRatio представляет максимальное соотношение ширины и высоты, допустимое для данного элемента управления.
Returns: Возвращает максимальное соотношение сторон для данного элемента управления.
Тип double.