HostMgd.EditorInput.PromptPointResultEventArgs
Класс предоставляет данные для события,
возникающего после завершения интерактивного
ввода точки пользователем в редакторе nanoCAD.
Класс наследуется от EventArgs и используется для передачи информации
о результате операции ввода точки (Point3d) в событиях,
таких как PromptedForCorner, PromptedForPoint и других.
Он содержит значение точки в мировой системе координат (WCS),
статус выполнения операции, а также дополнительные параметры команды,
такие как приглашение к вводу и строковое представление введённых данных.
Этот класс позволяет разработчикам надстроек nanoCAD обрабатывать
результат выбора или ввода точки пользователем — например,
при построении геометрии, выделении объектов или отрисовке временных элементов.
Notes
Этот класс часто применяется совместно с делегатом PromptPointResultEventHandler
для обработки событий ввода точек в реальном времени.
Example
C#

HostMgd.EditorInput.PromptPointResultEventArgs.Result
Свойство возвращает результат операции интерактивного ввода точки, выполненной пользователем.
Свойство предоставляет доступ к объекту типа PromptPointResult,
который содержит информацию о статусе и результате ввода точки (Point3d)
через такие методы, как GetPoint(), GetCorner() и другие.
Оно используется, например, внутри событий PromptedForCorner,
чтобы получить координаты точки после завершения пользовательского ввода.
Свойство доступно только для чтения и обновляется автоматически при окончании операции.
Returns: Возвращает экземпляр класса PromptPointResult, который содержит:
* Status — статус завершения операции (OK, Cancel, Error и др.).
* Value — значение типа Point3d, представляющее координаты точки в мировой системе координат (WCS), если операция завершена успешно.
* StringResult — строковое представление введённой пользователем информации (если использовался клавиатурный ввод).
Если операция не была завершена или произошла ошибка, возвращается объект со статусом, отличным от OK.
Example
C#