Teigha.DatabaseServices.SubDMesh
Этот класс представляет объекты SubDMesh в базе данных.
Этот класс представляет объекты SubDMesh в базе данных.

Teigha.DatabaseServices.SubDMesh.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.SubDMesh.ConvertToSolid(System.Boolean,System.Boolean)
Метод предназначен для создания на основе данной сети нового объекта Solid3d.
Метод предназначен для создания на основе данной сети нового объекта Solid3d.
Returns: Возвращает объект Solid3d, полученный из данного SubDMesh.

Teigha.DatabaseServices.SubDMesh.ConvertToSurface(System.Boolean,Teigha.DatabaseServices.SubentityId)
Метод предназначен для создания нового объекта Surface из фрагмента этой сети, который задан идентификатором подобъекта.
Метод предназначен для создания нового объекта Surface из фрагмента этой сети, который задан идентификатором подобъекта.
convertAsSmooth: Флаг, определяющий, следует ли выполнять преобразование в гладкую поверхность. Тип bool.  Если задано false, то будет выполнено преобразование в граненую поверхность (faceted surface).
subentId: Идентификатор преобразуемого подобъекта. Тип SubentityId.
Returns: Возвращает объект Surface, преобразованный из заданного подобъекта этого SubDMesh.

Teigha.DatabaseServices.SubDMesh.ConvertToSurface(System.Boolean,System.Boolean)
Метод предназначен для создания нового объекта Surface из фрагмента этой сети.
Метод предназначен для создания нового объекта Surface из фрагмента этой сети.
convertAsSmooth: Флаг, определяющий, следует ли выполнять преобразование в гладкую поверхность. Тип bool.  Если задано false, то будет выполнено преобразование в граненую поверхность (faceted surface).
optimize: Флаг, определяющий, следует ли выполнить преобразование в оптимизированную поверхность. Тип bool.
Returns: Возвращает объект Surface, преобразованный из этого SubDMesh.

Teigha.DatabaseServices.SubDMesh.ExtrudeFaces(array,Teigha.Geometry.Point3dCollection,System.Double)
Метод предназначен для выдавливания граней вдоль заданного направления и с заданным углом сужения.
Метод предназначен для выдавливания граней вдоль заданного направления и с заданным углом сужения.
paths: Массив выдавливаемых подобъектов (поверхностей или сегментов сети). Тип FullSubentityPath[].
alongPath: Массив точек, описывающий траекторию выдавливания граней. Тип Point3dCollection.
taper: Угол сужения при выдавливании. Тип double.

Teigha.DatabaseServices.SubDMesh.ExtrudeFaces(array,System.Double,Teigha.Geometry.Vector3d,System.Double)
Метод предназначен для выдавливания граней вдоль заданного направления и с заданным углом сужения.
Метод предназначен для выдавливания граней вдоль заданного направления и с заданным углом сужения.
paths: Массив выдавливаемых подобъектов (поверхностей или сегментов сети). Тип FullSubentityPath[].
length: Длина выдавливания. Тип double.
dir: Направление выдавливания. Тип Vector3d.
taper: Угол сужения при выдавливании. Тип double.

Teigha.DatabaseServices.SubDMesh.GetAdjacentSubentPath(Teigha.DatabaseServices.FullSubentityPath,Teigha.DatabaseServices.SubentityType)
Метод предназначен для извлечения подобъектов, смежных с данным SubDMesh.
Метод предназначен для извлечения подобъектов, смежных с данным SubDMesh.
path: Исходный подобъект. Тип FullSubentityPath.
type: Тип подобъектов, которые должны быть возвращены. Тип SubentityType.
Returns: Массив путей подобъектов, смежных с указанным путем.

Teigha.DatabaseServices.SubDMesh.GetCrease(Teigha.DatabaseServices.SubentityId)
Метод предназначен для получения величины сгиба для подобъекта сети, заданного идентификатором SubentityId.
Метод предназначен для получения величины сгиба для подобъекта сети, заданного идентификатором SubentityId.
id: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает величину сгиба, тип double.

Teigha.DatabaseServices.SubDMesh.GetCrease(array)
Метод предназначен для получения величин сгибов для массива подобъектов сети.
Метод предназначен для получения величин сгибов для массива подобъектов сети.
subentPaths: Массив подобъектов сети. Тип FullSubentityPath[].
Returns: Возвращает коллекцию величин сгибов. Тип DoubleCollection.

Teigha.DatabaseServices.SubDMesh.GetFacePlane(Teigha.DatabaseServices.SubentityId)
Метод предназначен для получения плоскости Plane грани, заданной идентификатором SubentityId.
Метод предназначен для получения плоскости Plane грани, заданной идентификатором SubentityId.
subentId: ID грани. Тип SubentityId.
Returns: Возвращает плоскость Plane заданной грани.

Teigha.DatabaseServices.SubDMesh.GetNumberOfSubDividedFacesAt(array)
Получает количество гладких граней для заданных граней базовой сети.
Метод предназначен для получения количества гладких граней для заданных граней базовой сети.
paths: Массив граней. Тип FullSubentityPath[].
Returns: Возвращает количество гладких граней.

Teigha.DatabaseServices.SubDMesh.GetObjectMesh(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.MeshFaceterData)
Метод предназначен для тесселяции существующего твердого тела или поверхностного объекта для формирования данных сети с использованием заданных настроек фасетирования.
Метод предназначен для тесселяции существующего твердого тела или поверхностного объекта для формирования данных сети с использованием заданных настроек фасетирования.
Данные сети включают в себя массив вершин, массив списков граней и данные граней.
dbObj: Исходный объект для получения сети. Тип DBObject.
faceterData: Исходная информация о настройках фасетирования. Тип MeshFaceterData.
Returns: Возвращает коллекцию MeshDataCollection, содержащую массив вершин, массив списков граней и данные граней.

Teigha.DatabaseServices.SubDMesh.GetSubDividedVertexAt(Teigha.DatabaseServices.SubentityId)
Метод предназначен для извлечения вершины гладкой сети, используя указанный идентификатор подобъекта.
Метод предназначен для извлечения вершины гладкой сети, используя указанный идентификатор подобъекта.
subentId: Subentity ID of the vertex. Тип SubentityId.
Returns: Возвращает координатную точку Point3d вершины гладкой сети, используя указанный идентификатор подобъекта.

Teigha.DatabaseServices.SubDMesh.GetSubDividedVertexAt(System.Int32)
Метод предназначен для извлечения вершины гладкой сети, используя заданный индекс.
Метод предназначен для извлечения вершины гладкой сети, используя заданный индекс.
index: Индекс вершины. Тип int.
Returns: Возвращает координатную точку вершины с заданным индексом.

Teigha.DatabaseServices.SubDMesh.GetSubentColor(Teigha.DatabaseServices.SubentityId)
Метод предназначен для получения цвета заданного подобъекта.
Метод предназначен для получения цвета заданного подобъекта.
subentId: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает цвет Colors.Color подобъекта.

Teigha.DatabaseServices.SubDMesh.GetSubentMaterial(Teigha.DatabaseServices.SubentityId)
Метод предназначен для получения материала указанного подобъекта сети.
Метод предназначен для получения материала указанного подобъекта сети.
subentId: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает ObjectId для материала подобъекта.

Teigha.DatabaseServices.SubDMesh.GetSubentMaterialMapper(Teigha.DatabaseServices.SubentityId)
Метод предназначен для извлечения сопоставителя (мэппера) заданного подобъекта.
Метод предназначен для извлечения сопоставителя (мэппера) заданного подобъекта.
subentId: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает сопоставитель (мэппер) подобъекта. Тип Mapper.

Teigha.DatabaseServices.SubDMesh.GetSubentPath(System.Int32,Teigha.DatabaseServices.SubentityType)
Метод извлекает все пути к подобъектам, используя заданные индекс и тип подобъекта.
Метод извлекает все пути к подобъектам, используя заданные индекс и тип подобъекта.
index: Индекс подобъекта. Тип int.  Если он равен -1, то все подобъекты указанного типа возвращаются в виде массива.
type: Тип заданного подобъекта. Тип SubentityType.
Returns: Возвращает массив полных путей подобъектов. Тип FullSubentityPath[].

Teigha.DatabaseServices.SubDMesh.GetVertexAt(Teigha.DatabaseServices.SubentityId)
Метод предназначен для определения координатной точки Point3d вершины с заданным идентификатором подобъекта SubentityId.
Метод предназначен для определения координатной точки Point3d вершины с заданным идентификатором подобъекта SubentityId.
subentId: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает точку Point3d для вершины с заданным идентификатором подобъекта.

Teigha.DatabaseServices.SubDMesh.GetVertexAt(System.Int32)
Метод определяет точку Point3d вершины в заданной индексом позиции в сети.
Метод определяет точку Point3d вершины в заданной индексом позиции в сети.
index: Индекс вершины. Тип int.
Returns: Возвращает точку Point3d для вершины с заданным индексом.

Teigha.DatabaseServices.SubDMesh.Setbox(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32)
Метод создает сеть в виде бокса с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
Метод создает сеть в виде бокса (прямоугольного параллелепипеда) с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
xlen: Глубина бокса, double.
ylen: Ширина бокса, double.
zlen: Высота бокса, double.
divx: Определяет, сколько разделений выполняется в направлении глубины, int.
divy: Определяет, сколько разделений выполняется в направлении ширины, int.
divz: Определяет, сколько разделений выполняется в направлении высоты, int.
smoothLevel: Степень сглаживания сети, int.

Teigha.DatabaseServices.SubDMesh.SetCone(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double,System.Int32)
Метод создает сеть в виде конуса с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
Метод создает сеть в виде конуса с заданными размерами, количеством разделений в каждом из направлений и степенью сглаживания сети.
majorRadius: Большая полуось основания, double.
minorRadius: Малая полуось основания, double.
height: Высота конуса, double.
divAxis: Определяет, сколько разделений выполняется в основании конуса, int.
divHeight: Определяет, сколько разделений выполняется в направлении высоты конуса, int.
divCap: Определяет, сколько радиальных разделений выполняется в основании конуса, int.
radiusRatio: Отношение верхнего радиуса к нижнему, double.
smoothLevel: Степень сглаживания сети, int.

Teigha.DatabaseServices.SubDMesh.SetCrease(array,System.Double)
Метод заостряет грани, ребра и вершины сети, заданные массивом подобъектов.
Метод заостряет грани, ребра и вершины сети, заданные массивом подобъектов.
subentPaths: Массив подобъектов, к которым применяется заострение. Тип FullSubentityPath[].
creaseVal: Условие применения заострения, double.
Допустимые значения аргумента creaseVal:

Teigha.DatabaseServices.SubDMesh.SetCrease(System.Double)
Метод предназначен для заострения ребер сети.
Метод предназначен для заострения ребер сети.
creaseVal: Условие применения заострения, double.
Допустимые значения аргумента creaseVal:

Teigha.DatabaseServices.SubDMesh.SetCylinder(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32)
Метод предназначен для создания сети в виде цилиндра.
Метод предназначен для создания сети в виде цилиндра.
majorRadius: Большая полуось основания, double.
minorRadius: Малая полуось основания, double.
height: Высота цилиндра, double.
divAxis: Определяет количество разделений в основании цилиндра, int.
divHeight: Определяет количество разделений в направлении высоты цилиндра, int.
divCap: Определяет количество разделений в основании цилиндра, int.
smoothLevel: Степень сглаживания сети, int.

Teigha.DatabaseServices.SubDMesh.SetDragStatus(Teigha.DatabaseServices.DragStatus)
Метод вызывается, когда начинается, завершается или прерывается операция перетаскивания, в которой задействован данный объект.
Метод вызывается, когда начинается, завершается или прерывается операция перетаскивания, в которой задействован данный объект.
Аргумент status предоставляет информацию о том, что происходит с операцией перетаскивания.
status: Статус операции перетаскивания. Принимает значения из перечисления Dragstart.

Teigha.DatabaseServices.SubDMesh.SetPyramid(System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32,System.Double,System.Int32)
Метод предназначен для создания сети в виде пирамиды.
Метод предназначен для создания сети в виде пирамиды.
radius: Радиус окружности, вписанной в основание пирамиды, double.
height: Высота пирамиды, double.
divLength: Определяет количество разделений в направлении длины, int.
divHeight: Определяет количество разделений в направлении высоты пирамиды, int.
divCap: Определяет количество разделений в базовой грани, int.
nSides: Количество граней у пирамиды, int.
radiusRatio: Отношение большого радиуса к малому, double.
smoothLevel: Степень сглаживания сети, int.

Teigha.DatabaseServices.SubDMesh.SetSphere(System.Double,System.Int32,System.Int32,System.Int32)
Метод создает сеть в виде сферы.
Метод создает сеть в виде сферы.
radius: Радиус сферы, double.
divAxis: Определяет количество разделений в базовой окружности, int.
divHeight: Определяет количество разделений в направлдении высоты сферы, int.
smoothLevel: Степень сглаживания сети, int.

Teigha.DatabaseServices.SubDMesh.SetSubDMesh(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Int32Collection,System.Int32)
Метод создает сеть с заданной гладкостью, используя на входе массивы вершин и граней.
Метод создает сеть с заданной гладкостью, используя на входе массивы вершин и граней.
vertexArray: Массив вершин. Тип Point3dCollection.
indexArray: Массив целых чисел, описывающих грани. Тип Int32Collection.
smoothLevel: Степень сглаживания сети, int.
Массив граней упорядочен следующим образом: первое число определяет количество вершин в грани, следующие числа - индексы вершин, образующих грань.

Teigha.DatabaseServices.SubDMesh.SetSubentColor(Teigha.DatabaseServices.SubentityId,Colors.Color)
Метод задает цвет подобъекта.
Метод задает цвет подобъекта.
subentId: Идентификатор подобъекта. Тип SubentityId.
color: Цвет подобъекта. Тип Colors.Color.

Teigha.DatabaseServices.SubDMesh.SetSubentMaterial(Teigha.DatabaseServices.SubentityId,DatabaseServices.ObjectId)
Метод задает материал для заданного подобъекта.
Метод задает материал для заданного подобъекта.
subentId: Идентификатор подобъекта. Тип SubentityId.
matId: Идентификатор материала. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.SubDMesh.SetSubentMaterialMapper(Teigha.DatabaseServices.SubentityId,Teigha.GraphicsInterface.Mapper)
Метод задает сопоставитель (мэппер) для заданного подобъекта.
Метод задает сопоставитель (мэппер) для заданного подобъекта.
subentId: Идентификатор подобъекта. Тип SubentityId.
mapper: Сопоставитель (мэппер) материалов. Тип Mapper.

Teigha.DatabaseServices.SubDMesh.SetTorus(System.Double,System.Int32,System.Int32,System.Double,System.Double,System.Int32)
Метод создает сеть в виде тора.
Метод создает сеть в виде тора.
majorRadius: Большой радиус тора (расстояние от центра образующей окружности до оси вращения тора), double.
divSection: Количество разделений для образующего сечения тора, int.
divSweepPath: Количество разделений вдоль окружности вращения сечения тора, int.
sectionRadiusRatio: Отношение большого радиуса к малому, double.
sectionRotate: Угол поворота образующего сечения тора, double.
smoothLevel: Степень сглаживания сети, int.

Teigha.DatabaseServices.SubDMesh.SetVertexAt(Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Point3d)
Метод задает вершину сети, используя заданный идентификатор подобъекта.
Метод задает вершину сети, используя заданный идентификатор подобъекта.
subentId: Идентификатор подобъекта. Тип SubentityId.
position: Положение вершины в пространстве, тип Point3d.

Teigha.DatabaseServices.SubDMesh.SetVertexAt(System.Int32,Teigha.Geometry.Point3d)
Метод задает вершину сети, используя заданный индекс.
Метод задает вершину сети, используя заданный индекс.
index: Индекс вершины, тип int.
position: Положение вершины в пространстве, тип Point3d.

Teigha.DatabaseServices.SubDMesh.SetWedge(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Метод создает сеть-клин.
Метод создает сеть-клин.

Teigha.DatabaseServices.SubDMesh.SplitFace(Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Point3d,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Point3d)
Метод разрезает грань на две грани, используя две точки на разных ребрах исходной грани.
Метод разрезает грань на две грани, используя две точки на разных ребрах исходной грани.

Teigha.DatabaseServices.SubDMesh.SubdRefine(array)
Данный метод предназначен для применения текущей степени сглаженности сети к заданному массиву вершин и граней.
Степень сглаженности устанавливается равной 0.
Данный метод предназначен для применения текущей степени сглаженности сети к заданному массиву вершин и граней.
Степень сглаженности устанавливается равной 0.
paths: Массив подобъектов. Тип FullSubentityPath[].

Teigha.DatabaseServices.SubDMesh.EdgeArray
Свойство предоставляет доступ к массиву индексов ребер базового уровня сети.
Свойство предоставляет доступ к массиву индексов ребер базового уровня сети.
Returns: Возвращает массив индексов ребер, тип Int32Collection.

Teigha.DatabaseServices.SubDMesh.FaceArray
Свойство предоставляет доступ к массиву индексов граней базового уровня сети.
Свойство предоставляет доступ к массиву индексов граней базового уровня сети.
Returns: Возвращает массив индексов граней, тип Int32Collection.

Teigha.DatabaseServices.SubDMesh.NormalArray
Свойство представляет доступ к нормалям во всех вершинах данного объекта SubDMash.
Свойство представляет доступ к нормалям во всех вершинах данного объекта SubDMash.
Returns: Возвращает массив нормалей в вершинах объекта SubDMash. Тип Vector3dCollection.

Teigha.DatabaseServices.SubDMesh.NumberOfEdges
Свойство представляеn доступ к количеству ребер на базовом уровне сети.
Свойство представляеn доступ к количеству ребер на базовом уровне сети.
Returns: Возвращает количество ребер на базовом уровне сети, int.

Teigha.DatabaseServices.SubDMesh.NumberOfFaces
Свойство представляеn доступ к количеству граней на базовом уровне сети.
Свойство представляеn доступ к количеству граней на базовом уровне сети.
Returns: Возвращает количество граней на базовом уровне сети, int.

Teigha.DatabaseServices.SubDMesh.NumberOfSubDividedFaces
Свойство предоставляет доступ к количеству граней с текущей степенью сглаженности.
Свойство предоставляет доступ к количеству граней с текущей степенью сглаженности.
Returns: Возвращает количество граней, int.

Teigha.DatabaseServices.SubDMesh.NumberOfSubDividedVertices
Свойство предоставляет доступ к количеству вершин с текущей степенью сглаженности.
Свойство предоставляет доступ к количеству вершин с текущей степенью сглаженности.
Returns: Возвращает количество вершин, int.

Teigha.DatabaseServices.SubDMesh.NumberOfVertices
Свойство предоставляет доступ к количеству вершин на базовом уровне сети.
Свойство предоставляет доступ к количеству вершин на базовом уровне сети.
Returns: Свойство возвращает количество вершин, int.

Teigha.DatabaseServices.SubDMesh.SmoothLevel
Свойство предоставляет доступ к текущей степени сглаженности сети.
Свойство предоставляет доступ к текущей степени сглаженности сети.
Returns: Свойство возвращает степень сглаженности сети, int.

Teigha.DatabaseServices.SubDMesh.SubDividedFaceArray
Свойство предоставляет доступ к массиву индексов граней сглаженной сети.
Свойство предоставляет доступ к массиву индексов граней сглаженной сети.
Returns: Возвращает массив индексов граней, тип Int32Collection.

Teigha.DatabaseServices.SubDMesh.SubDividedNormalArray
Свойство представляет нормали во всех вершинах данного объекта SubDMash с учетом степени сглаженности.
Свойство представляет нормали во всех вершинах данного объекта SubDMash с учетом степени сглаженности.
Returns: Возвращает массив нормалей, тип Vector3dCollection.

Teigha.DatabaseServices.SubDMesh.SubDividedVertices
Свойство предоставляет доступ к массиву вершин сглаженной сети.
Свойство предоставляет доступ к массиву вершин сглаженной сети.
Returns: Возвращает массив вершин Point3dCollection.

Teigha.DatabaseServices.SubDMesh.VertexColorArray
Свойство предоставляет доступ к массиву цветов вершин сети.
Свойство предоставляет доступ к массиву цветов вершин сети.
Returns: Возвращает цвета вершин сети в виде массива Colors.EntityColor[].

Teigha.DatabaseServices.SubDMesh.VertexNormalArray
Свойство представляет доступ к массиву нормалей в вершинах сети.
Свойство представляет доступ к массиву нормалей в вершинах сети.
Returns: Возвращает массив нормалей в вершинах сети, тип Vector3dCollection.

Teigha.DatabaseServices.SubDMesh.VertexTextureArray
Свойство представляет доступ к массиву координат текстур.
Свойство представляет доступ к массиву координат текстур.
Returns: Возвращает коллекцию Point3dCollection.

Teigha.DatabaseServices.SubDMesh.Vertices
Свойство представляет доступ к коллекции вершин на базовом уровне сети.
Свойство представляет доступ к коллекции вершин на базовом уровне сети.
Returns: Возвращает коллекцию вершин. Тип Point3dCollection.

Teigha.DatabaseServices.SubDMesh.Watertight
Свойство позволяет определить, является ли сеть непроницаемой.
Данное свойство позволяет определить, является ли сеть непроницаемой.
Returns: Возвращает true, если сеть непроницаемая, и false в противном случае.