HostMgd.EditorInput.Editor.UpdateTiledViewportsInDatabase
Метод обновляет информацию о видовых экранах в базе данных чертежа.
Метод используется для сохранения текущих параметров и конфигурации видовых экранов (viewport'ов),
расположенных в пространстве листа (paper space), обратно в базу данных чертежа.
Это позволяет зафиксировать изменения, внесённые программно или пользователем,
и обеспечить их корректное отображение при последующих операциях,
таких как переключение между листами или регенерация чертежа.
Метод применяется, например, при динамическом изменении размеров,
положения или содержимого видовых экранов.
Example
C#