Teigha.DatabaseServices.RotatedDimType
Перечисление RotatedDimType определяет поддерживаемые типы выравнивания повернутого размера.
Перечисление RotatedDimType определяет поддерживаемые типы выравнивания повернутого размера.