HostMgd.PlottingServices.EndPageEventHandler
Делегат предназначен для обработки события PlotReactorManager.EndPage, возникающего сразу после завершения вывода страницы на плоттер.
Делегат EndPageEventHandler предназначен для обработки события PlotReactorManager.EndPage,
возникающего сразу после завершения вывода страницы на плоттер.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события,
а аргумент e типа EndPageEventArgs передает состояние флага SheetCancelStatus.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип EndPageEventArgs.