Teigha.Geometry.Cone
Класс Cone представляет ограниченный прямой круговой конус.
Класс Cone представляет ограниченный прямой круговой конус.

Teigha.Geometry.Cone.#ctor
Конструктор по умолчанию для класса Cone.
Создает прямой круговой конус с параметрами по умолчанию.
Конструктор по умолчанию для класса Cone.
Создает прямой круговой конус со следующими параметрами:
* центр основания (0, 0, 0);
* ось конуса (0, 1, 0);
* радиус основания 2.0;
* угол раствора конуса (угол при вершине) 90°;
* направление отсчета углов (1, 0, 0).

Teigha.Geometry.Cone.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d)
Конструктор класса Cone.
Создает полный конус с заданными центром и радиусом основания, осью конуса и углом при вершине.
Конструктор класса Cone.
Создает полный конус с заданными центром и радиусом основания, осью конуса и углом при вершине.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип double.
sineAngle: Синус угла между осью конуса и его образующей.   Тип double.
baseOrigin: Центр окружности в основании конуса. Тип Point3d.
baseRadius: Радиус основания конуса. Тип double.
axisOfSymmetry: Направление оси конуса. Тип Vector3d.

Teigha.Geometry.Cone.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Конструктор класса Cone.
Создает конус с заданными центром и радиусом основания, осью конуса, косинусом и синусом угла между осью конуса и образующей, высотой конуса, а также начальным и конечным углами поворота образующей конуса.
Конструктор класса Cone.
Создает конус с заданными центром и радиусом основания, осью конуса, косинусом и синусом угла между осью конуса и образующей, высотой конуса, а также начальным и конечным углами поворота образующей конуса.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип double.
sineAngle: Синус угла между осью конуса и его образующей.   Тип double.
baseOrigin: Центр окружности в основании конуса. Тип Point3d.
baseRadius: Радиус основания конуса. Тип double.
axisOfSymmetry: Направление оси конуса. Тип Vector3d.
referenceAxis: Опорный вектор в основании конуса, задающий направление отсчета углов в основании. Тип Vector3d.
height: Высота конуса. Тип Interval.
startAngle: Начальный угол поворота образующей в радианах.  Тип double.
endAngle: Конечный  угол поворота образующей в радианах.  Тип double.

Teigha.Geometry.Cone.Create(IntPtr,System.Boolean)
Метод создает объект Cone на основе переданного указателя.
Метод создает объект Cone на основе переданного указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Cone.

Teigha.Geometry.Cone.GetHeightAt(System.Double)
Метод позволяет вычислить высоту данного конуса, соответствующую указанному параметру на оси U.
Метод позволяет вычислить высоту данного конуса, соответствующую указанному параметру на оси U.
parameter: Параметр, определяющий положение точки на оси U данного конуса.
Returns: Возвращает высоту этого конуса, соответствующую входному значению аргумента parameter.
Тип double.

Teigha.Geometry.Cone.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом.
Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом.
Используется вызов метода Cone.IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance) c точностью, равной Tolerance.Global.
Notes
Точка касания считается точкой пересечения.
linearEntity: Линейный объект, который пересекается с конусом. Тип LinearEntity3d.
Returns: Возвращает массив точек пересечения.
Тип Point3d[].

Teigha.Geometry.Cone.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом, вычисленные с заданной точностью.
Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом, вычисленные с заданной точностью.
Notes
Точка касания считается точкой пересечения.
linearEntity: Линейный объект, который пересекается с конусом. Тип LinearEntity3d.
tolerance: Заданная точность вычислений. Тип Tolerance.
Returns: Возвращает массив точек пересечения.
Тип Point3d[].

Teigha.Geometry.Cone.IsClosed(Teigha.Geometry.Tolerance)
Метод позволяет проверить с указанной точностью, является ли основание данного конуса полным кругом.
Метод позволяет проверить с указанной точностью, является ли основание данного конуса полным кругом.
tolerance: Заданная точность вычислений.
Returns: Возвращает true тогда и только тогда, когда основание этого конуса является полным кругом.
В противном случае возвращает false.

Teigha.Geometry.Cone.Set(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d)
Метод позволяет переопределить основные параметры конуса - центр и радиус основания, направление оси и угол раствора конуса.
Метод позволяет переопределить основные параметры конуса - центр и радиус основания, направление оси и угол раствора конуса.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип double.
sineAngle: Синус угла между осью конуса и его образующей.   Тип double.
baseCenter: Центр окружности в основании конуса. Тип Point3d.
baseRadius: Радиус основания конуса. Тип double.
axisOfSymmetry: Направление оси конуса. Тип Vector3d.

Teigha.Geometry.Cone.Set(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Метод позволяет переопределить все параметры конуса - центр и радиус основания, направление оси конуса, косинус и синус угла между осью конуса и образующей, высоту конуса, а также начальный и конечный углы поворота образующей конуса.
Метод позволяет переопределить все параметры конуса - центр и радиус основания, направление оси конуса, косинус и синус угла между осью конуса и образующей, высоту конуса, а также начальный и конечный углы поворота образующей конуса.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип double.
sineAngle: Синус угла между осью конуса и его образующей.   Тип double.
baseCenter: Центр окружности в основании конуса. Тип Point3d.
baseRadius: Радиус основания конуса. Тип double.
axisOfSymmetry: Направление оси конуса. Тип Vector3d.
refAxis: Опорный вектор в основании конуса, задающий направление отсчета углов в основании. Тип Vector3d.
height: Высота конуса. Тип Interval.
startAngle: Начальный угол поворота образующей в радианах.  Тип double.
endAngle: Конечный  угол поворота образующей в радианах.  Тип double.

Teigha.Geometry.Cone.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы поворота образующей этого конуса.
Метод позволяет переопределить начальный и конечный углы поворота образующей этого конуса.
startAngle: Начальный угол поворота образующей в радианах.  Тип double.
endAngle: Конечный  угол поворота образующей в радианах.  Тип double.

Teigha.Geometry.Cone.Apex
Свойство Apex представляет вершину данного конуса.
Свойство Apex представляет вершину данного конуса.
Returns: Возвращает вершину данного конуса.
Тип Point3d.

Teigha.Geometry.Cone.AxisOfSymmetry
Свойство AxisOfSymmetry представляет ось данного конуса.
Свойство AxisOfSymmetry представляет ось данного конуса.
Returns: Возвращает направляющий вектор оси конуса.
Тип Vector3d.

Teigha.Geometry.Cone.BaseCenter
Свойство BaseCenter представляет центр основания данного конуса.
Свойство BaseCenter представляет центр основания данного конуса.
Returns: Возвращает центр основания данного конуса.
Тип Point3d.

Teigha.Geometry.Cone.BaseRadius
Свойство BaseRadius представляет доступ к радиусу основания данного конуса.
Свойство BaseRadius представляет доступ к радиусу основания данного конуса.
Returns: Возвращает радиус основания данного конуса.
Тип double.

Teigha.Geometry.Cone.HalfAngle
Свойство HalfAngle представляет угол между осью и образующей конуса.
Свойство HalfAngle представляет угол между осью и образующей конуса.
Returns: Возвращает угол между осью и образующей конуса (в радианах).
Тип double.

Teigha.Geometry.Cone.Height
Свойство Height обеспечивает доступ к параметрическому интервалу, который определяет высоту данного конуса.
Свойство Height обеспечивает доступ к параметрическому интервалу, который определяет высоту данного конуса.
Returns: Возвращает параметрический интервал, определяющий высоту данного конуса.
Тип Interval.

Teigha.Geometry.Cone.IsOuterNormal
Свойство IsOuterNormal представляет флаг, определяющий, направлена ли нормаль конуса в сторону замкнутого конуса.
Свойство IsOuterNormal представляет флаг, определяющий, направлена ли нормаль конуса в сторону замкнутого конуса.
Returns: Возвращает true, если нормаль конуса ориентирована в сторону замкнутого конуса.
В противном случае возвращает false.

Teigha.Geometry.Cone.ReferenceAxis
Свойство ReferenceAxis представляет опорный вектор в основании конуса.
Свойство ReferenceAxis представляет опорный вектор в основании конуса.
Он определяет направления отсчета углов в основании конуса.
Returns: Возвращает опорный вектор в основании конуса.
Тип Vector3d.