Teigha.DatabaseServices.XrefOperation.XrefAttachOperation
Значение: 0.
Прикрепляет файл внешней ссылки к базе данных, указанной в базе данных HostDb, или к текущему документу в редакторе, если HostDb имеет значение null.