HostMgd.EditorInput.RolloverEventArgs
Класс предоставляет данные для события Rollover,
возникающего при наведении курсора на графический объект в чертеже.
Класс используется для передачи информации о событии подсветки объекта
при наведении курсора. Он применяется в обработчике события Rollover
и содержит сведения о геометрическом объекте, над которым в данный момент
находится курсор.
Основные данные, предоставляемые классом:
* идентификатор объекта (ObjectId),
* точка пересечения курсора с объектом в мировых координатах.
Example
C#

HostMgd.EditorInput.RolloverEventArgs.Highlighted
Свойство устанавливает или возвращает путь к подобъекту
(например, сегменту, ребру, вершине), который выделяется
при наведении курсора.
Свойство предназначено для управления визуальным выделением
подобъектов — отдельных элементов составных объектов, таких
как сегменты полилинии, рёбра 3D-тела или грани многогранников.
Оно позволяет указать, какой именно фрагмент объекта должен быть
подсвечен при наведении курсора, обеспечивая точную визуальную
обратную связь.
Returns: Возвращает или устанавливает объект типа FullSubentityPath:
* Если значение не null — указывает на конкретный подобъект, который будет подсвечен.
* Если null — подсветка подобъекта не применяется (может выделяться весь объект).
Example
C#

HostMgd.EditorInput.RolloverEventArgs.Picked
Свойство устанавливает или возвращает путь к геометрическому подобъекту,
выбранному или подсвеченному при взаимодействии с курсором.
Свойство используется в контексте событий, связанных с наведением и выбором объектов —
например, при обработке выбора вложенных элементов. Оно указывает на конкретный подобъект
(например, сегмент полилинии, ребро 3D-тела, грань или вершину), с которым в данный момент
взаимодействует пользователь.
В отличие от Highlighted, которое отвечает за визуальную подсветку,
свойство Picked может использоваться для определения логически выбранного подобъекта
в процессе наведения или выбора. Оно позволяет точно идентифицировать элемент
составного объекта, даже если сам объект не был окончательно выбран.
Returns: Возвращает или устанавливает объект типа FullSubentityPath, представляющий путь к подобъекту:
* Если значение не null — содержит ObjectId контейнера и массив селекторов, идентифицирующих конкретный подобъект.
* Если null — ни один подобъект не выбран или не определён.
Example
C#