Teigha.DatabaseServices.Dimension.GetDimstyleData
Метод предназначен для копирования настроек размерного стиля данного объекта Dimension, включая переопределения, в указанную запись таблицы размерных стилей.
Метод предназначен для копирования настроек размерного стиля данного объекта Dimension в указанную запись таблицы размерных стилей. Скопированные данные включают данные размерного стиля со всеми применимыми переопределениями.
Returns: Возвращает объект DimStyleTableRecord с копией настроек размерного стиля.