HostMgd.EditorInput.PointMonitorEventHandler
Делегат предназначен для обработки событий, возникающих
при перемещении мыши в окне редактора nanoCAD,
без возможности изменения точки ввода.
Делегат используется как сигнатура метода-обработчика для события PointMonitor,
которое вызывается при каждом перемещении указателя в графической области чертежа.
В отличие от PointFilterEventHandler, этот делегат не позволяет изменять точку
— он предназначен только для наблюдения за движением мыши и отображения информации.
Это может быть использовано для реализации подсказок, логгирования позиции курсора
или контекстной помощи во время интерактивных операций.
sender: Источник события, обычно представляющий экземпляр редактора (Editor),
e: Объект события, содержащий данные о контексте и настройках курсора.