HostMgd.EditorInput.Editor.SwitchToModelSpace
Метод выполняет переключение текущего пространства чертежа в пространство модели.
Метод используется для программного переключения активного контекста редактора
из пространства листа (paper space) в пространство модели (model space).
Это может быть полезно при автоматизации операций, требующих работы именно в пространстве модели,
например, при создании или редактировании геометрических объектов.
Метод не вызывает запросов к пользователю и выполняет переключение немедленно.
Example
C#