HostMgd.EditorInput.UserInputControls
Данное перечисление определяет битовые маски всех настроек управления пользовательским вводом,
которые действуют в данный момент для используемого варианта технологии Jig.
Перечисление UserInputControls определяет битовые маски всех настроек управления пользовательским вводом,
которые действуют в данный момент для используемого варианта технологии Jig.