HostMgd.PlottingServices.PlotConfig.RefreshMediaNameList
Метод обновляет информацию об устройстве вывода.
Не реализован.
Метод обновляет информацию о носителях (листах), которые доступны для текущего устройства вывода или PC3-файла.
В текущей версии не реализован.