Teigha.DatabaseServices.Database.RestoreOriginalXrefSymbols
Этот метод должен использоваться вместе с
RestoreForwardingXrefSymbols(), и должен окружать код, в
котором планируется редактировать и/или сохранить внешние
ссылки базы данных.
Метод RestoreOriginalXrefSymbols() отменяет все изменения,
сделанные в процессе разрешения внешних ссылок, так что база
данных имеет то же самое состояние, которое она имела после
первого чтения с диска.
Символы, на которые оказывается воздействие — это таблицы и
записи для блоков, слоев, типов линий, стилей текстов, стилей
размеров, зарегистрированных приложений, стилей печати, также
как изменения любых пользовательских объектов, сделанные во
время и между событиями XrefBeginAttached и
XrefBeginOtherAttached.