Teigha.GraphicsInterface.EdgeModifiers.HaloGap
Значение: 16.
Этот модификатор обеспечивает применение коэффициента недовода рёбер (HaloGap) к рёбрам объекта, скрытого другим объектом.
Недотягивание скрытых рёбер до ребер объекта, который их скрывает, определяется в процентах.