HostMgd.PlottingServices.SheetCancelStatus.CanceledByCancelAllButton
Значение: 2.
Пользователь отменил выполнение всего задания на печать, используя элементы управления в пользовательском интерфейсе.
Это означает, что отменяется вывод на печать всех листов, которые ожидают печати в текущем процессе печати.