Teigha.Geometry.ClipBoundary2d
Класс ClipBoundary2d представляет ограничивающий многоугольник, определяющий плоскую границу обрезки произвольных 2D-полигонов или полилиний.
Класс ClipBoundary2d представляет ограничивающий многоугольник, который определяет плоскую границу обрезки произвольных 2D-полигонов или полилиний. Результатом обрезки являются двумерные выпуклые открытые или замкнутые полилинии или прямоугольники.
Реализация аналогична алгоритму обрезки Сазерленда - Ходжмана.
Для отслеживания источника каждого сегмента отсеченного многоугольника опционально может генерироваться подробная информация о ребрах.  Она может пригодиться для управления отображением ребер или для эффективного объединения отсеченных многоугольников, полученных по нескольким границам обрезки (возможно, путем декомпозиции невыпуклой границы обрезки до нескольких выпуклых границ).
Кроме того, генерируется информация о пространственной взаимосвязи между отсеченным многоугольником или полилинией и областью обрезки.

Teigha.Geometry.ClipBoundary2d.#ctor
Конструктор по умолчанию класса ClipBoundary2d.
Конструктор по умолчанию класса ClipBoundary2d.
Создает пустой объект ClipBoundary2d без заданной границы обрезки.

Teigha.Geometry.ClipBoundary2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса ClipBoundary2d.
Создает прямоугольную границу обрезки по двум противолежащим угловым точкам прямоугольника.
Конструктор класса ClipBoundary2d.
Создает прямоугольную границу обрезки по двум угловым точкам на диагонали прямоугольника.
firstCorner: Первая угловая точка прямоугольника. Тип Point2d.
secondCorner: Вторая угловая точка прямоугольника. Тип Point2d.

Teigha.Geometry.ClipBoundary2d.#ctor(Teigha.Geometry.Point2dCollection)
Конструктор класса ClipBoundary2d.
Создает экземпляр класса с указанными параметрами.
Конструктор класса ClipBoundary2d.
Создает границу обрезки с вершинами в заданных точках.
clipBoundary: Массив вершин границы обрезки. Тип Point2dCollection.

Teigha.Geometry.ClipBoundary2d.ClipPolygon(Teigha.Geometry.Point2dCollection)
Метод обрезает указанный многоугольник, используя данный объект границы обрезки.
Метод обрезает указанный многоугольник, используя данный объект границы обрезки.
rawVertices: Входная коллекция вершин обрезаемого многоугольника. Тип Point2dCollection.
Returns: Возвращает многоугольник, полученный в результате операции обрезки.
Тип ClipBoundary2dData.

Teigha.Geometry.ClipBoundary2d.ClipPolyline(Teigha.Geometry.Point2dCollection)
Метод обрезает полилинию, образованную переданными в метод вершинами.
Метод обрезает полилинию, образованную переданными в метод вершинами.
rawVertices: Входная коллекция вершин обрезаемой полилинии. Тип Point2dCollection.
Returns: Возвращает полилинию, полученную в результате операции обрезки.
Тип ClipBoundary2dData.

Teigha.Geometry.ClipBoundary2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип ClipBoundary2d.

Teigha.Geometry.ClipBoundary2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод переопределяет данный объект так, чтобы его граница обрезки приняла вид прямоугольника с указанными вершинами.
Метод позволяет переопределить данный объект так, чтобы его граница обрезки приняла вид прямоугольника с указанными вершинами.
firstCorner: Первая вершина прямоугольника. Тип Point2d.
secondCorner: Вторая вершина прямоугольника. Тип Point2d.
Returns: Возвращает результат выполнения метода из перечисления ClipError.

Teigha.Geometry.ClipBoundary2d.Set(Teigha.Geometry.Point2dCollection)
Метод позволяет переопределить данный объект так, чтобы его граница обрезки приняла вид полилинии с указанными вершинами.
Метод позволяет переопределить данный объект так, чтобы его граница обрезки приняла вид полилинии с указанными вершинами.
clipBoundary: Входная коллекция вершин новой границы обрезки. Тип Point2dCollection.
Returns: Возвращает результат выполнения метода из перечисления ClipError.