HostMgd.Windows.ToolPalette.CustomToolBase.ValidateEditChanges
Метод выполняет проверку изменений, внесённых пользователем в процессе редактирования свойств инструмента.
Вызывается после нажатия кнопки "ОК" в редакторе свойств инструмента.
Не реализован.
Метод вызывается после завершения редактирования свойств инструмента нажатием кнопки "ОК" и выполняет проверку изменений, внесённых пользователем.
В текущей версии не реализован.