Teigha.GraphicsInterface.PixelBGRA32
Структура PixelBGRA32 определяет цвет пикселя в формате RGBA, который представляет цвета, используя целочисленные значения красной, зеленой и синей компонент, а также альфа-канала, управляющего непрозрачностью.
Структура PixelBGRA32 определяет цвет пикселя в формате RGBA, который представляет цвета, используя целочисленные значения красной, зеленой и синей компонент, а также альфа-канала, управляющего непрозрачностью.

Teigha.GraphicsInterface.PixelBGRA32.#ctor(IntPtr)
Конструктор структуры PixelBGRA32.
Создает экземпляр структуры, используя переданный указатель.
Конструктор структуры PixelBGRA32.
Создает экземпляр структуры, используя переданный неуправляемый указатель.
unmanagedObjPtr: Входной неуправляемый указатель. Тип IntPtr.

Teigha.GraphicsInterface.PixelBGRA32.#ctor(unsigned char,unsigned char,unsigned char,unsigned char)
Конструктор структуры PixelBGRA32.
Создает экземпляр структуры с указанными значениями цветовых компонент и альфа-канала.
Конструктор структуры PixelBGRA32.
Создает экземпляр структуры с указанными значениями цветовых компонент и альфа-канала.
blue: Синий цвет.   Тип unsigned char.
green: Зеленый цвет. Тип unsigned char.
red: Красный цвет. Тип unsigned char.
alpha: Альфа-канал.  Тип unsigned char.

Teigha.GraphicsInterface.PixelBGRA32.#ctor(unsigned int)
Конструктор структуры PixelBGRA32.
Создает экземпляр структуры, используя входное значение цвета в формате BGRA.
Конструктор структуры PixelBGRA32.
Создает экземпляр структуры, используя входное значение цвета в формате BGRA.
Рекомендуется использовать шестнадцатеричное представление входных значений.
bgra: Входной цвет в формате BGRA. Тип unsigned int.

Teigha.GraphicsInterface.PixelBGRA32.Alpha
Свойство Alpha предоставляет доступ к текущему значению альфа-канала.
Свойство Alpha предоставляет доступ к текущему значению альфа-канала.
Returns: Возвращает значение альфа-канала.
Тип char.

Teigha.GraphicsInterface.PixelBGRA32.Blue
Свойство Blue предоставляет доступ к текущему значению синей компоненты.
Свойство Blue предоставляет доступ к текущему значению синей компоненты.
Returns: Возвращает значение синей компоненты.
Тип char.

Teigha.GraphicsInterface.PixelBGRA32.Green
Свойство Green предоставляет доступ к текущему значению зеленой компоненты.
Свойство Green предоставляет доступ к текущему значению зеленой компоненты.
Returns: Возвращает значение зеленой компоненты.
Тип char.

Teigha.GraphicsInterface.PixelBGRA32.Red
Свойство Red предоставляет доступ к текущему значению красной компоненты.
Свойство Red предоставляет доступ к текущему значению красной компоненты.
Returns: Возвращает значение красной компоненты.
Тип char.