HostMgd.EditorInput.PromptForSelectionEndingEventHandler
Делегат предназначен для обработки события, возникающего
при завершении операции выбора объектов в редакторе nanoCAD.
Делегат используется как сигнатура метода, который обрабатывает событие
PromptForSelectionEnding, происходящее после завершения интерактивного выбора
множества объектов, но до фиксации результата. Это позволяет разработчику
получить доступ к текущему набору выбранных объектов и выполнить
дополнительные действия — например, проверить корректность выборки,
изменить состав выделенных элементов или отменить операцию на уровне обработчика.
sender: Источник события, обычно представляющий экземпляр редактора (Editor),
e: Объект, содержащий данные о завершающейся операции выбора.