Teigha.DatabaseServices.PlotSettingsValidator
Этот класс определяет методы, которые позволяют проверить данные для настроек печати в объекте PlotSettings до фактического переопределения этих настроек в объектах.
Этот класс определяет методы, которые позволяют проверить данные для настроек печати в объекте PlotSettings до фактического переопределения этих настроек в объектах.

Teigha.DatabaseServices.PlotSettingsValidator.GetCanonicalMediaNameList(Teigha.DatabaseServices.PlotSettings)
Метод предоставляет коллекцию независимых от локализации (канонических) имен бумажных носителей для указанного объекта PlotSettings.
Метод предоставляет коллекцию независимых от локализации (канонических) имен бумажных носителей для указанного объекта PlotSettings.
plotSet: Входной объект PlotSettings.
Returns: Возвращает коллекцию независимых от локализации (канонических) имен бумажных носителей.
Тип StringCollection.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.

Teigha.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Teigha.DatabaseServices.PlotSettings,System.Int32)
Метод предоставляет локализованную версию наименования бумажного носителя по его индексу в коллекции
канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
Метод предоставляет локализованную версию наименования бумажного носителя по его индексу в коллекции
канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
plotSet: Входной объект PlotSettings.
index: Входной индекс носителя в коллекции, возвращаемой методом GetCanonicalMediaNameList().
Returns: Возвращает локализованную версию наименования бумажного носителя.
Тип String.

Teigha.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Teigha.DatabaseServices.PlotSettings,String)
Метод предоставляет локализованную версию наименования бумажного носителя по его наименованию в коллекции
канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
Метод предоставляет локализованную версию наименования бумажного носителя по его наименованию в коллекции
канонических имен носителей, возвращаемой методом GetCanonicalMediaNameList().
plotSet: Входной объект PlotSettings.
canonicalName: Независимое от локализации каноническое имя носителя.  Тип String.
Returns: Возвращает локализованную версию наименования бумажного носителя.
Тип String.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.

Teigha.DatabaseServices.PlotSettingsValidator.RefreshLists(Teigha.DatabaseServices.PlotSettings)
Метод обновляет в указанном объекте PlotSettings списки устройств печати, коллекцию доступных бумажных носителей и таблицы стилей печати.
Метод обновляет в указанном объекте PlotSettings списки устройств печати, коллекцию доступных бумажных носителей и таблицы стилей печати.
Такое обновление необходимо выполнять, если в течение сеанса nanoCAD изменились какие-либо устройства печати, файлы PC3 или таблицы стилей печати.
plotSet: Входной объект PlotSettings с настройками печати.

Teigha.DatabaseServices.PlotSettingsValidator.SetCanonicalMediaName(Teigha.DatabaseServices.PlotSettings,String)
Метод позволяет задать каноническое (независимое от локализации) имя физического носителя для указанного объекта PlotSettings.
Метод позволяет задать каноническое (независимое от локализации) имя физического носителя для указанного объекта PlotSettings.
Следует помнить, что канонические имена носителей являются чувствительными к регистру символов.
Чтобы получить локализованные версии имен носителей, используйте метод GetLocaleMediaName().
plotSet: Входной объект PlotSettings с настройками печати.
mediaName: Каноническое имя бумажного носителя.  Тип String.

Teigha.DatabaseServices.PlotSettingsValidator.SetClosestMediaName(Teigha.DatabaseServices.PlotSettings,System.Double,System.Double,Teigha.DatabaseServices.PlotPaperUnit,System.Boolean)
Метод позволяет задать в указанном объекте PlotSettings имя носителя, который лучше других соответствует переданным параметрам.
Метод позволяет задать в указанном объекте PlotSettings имя носителя, который лучше других соответствует переданным параметрам.
Единицы измерения бумажного носителя используются для определения полей области печати, смещений, формата бумаги и вычисления масштабов отображения объектов чертежа.
plotSet: Входной объект PlotSettings с настройками печати.
paperWidth: Ширина бумаги. Тип double.
paperHeight: Высота бумаги. Тип double.
units: Единицы измерения для бумажного носителя (миллиметры, дюймы, пиксели).
matchPrintableArea: Флаг, определяющий, идет ли речь о поиске соответствия по границам области печати (значение true) или по физическим размерам бумажного носителя (значение false). Тип bool.

Teigha.DatabaseServices.PlotSettingsValidator.SetCurrentStyleSheet(Teigha.DatabaseServices.PlotSettings,String)
Метод позволяет задать текущую таблицу стилей печати для указанного объекта PlotSettings.
Метод позволяет задать текущую таблицу стилей печати для указанного объекта PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.
styleSheetName: Имя текущего стиля листа. Тип String.

Teigha.DatabaseServices.PlotSettingsValidator.SetCustomPrintScale(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.CustomScale)
Метод позволяет задать для указанного объекта PlotSettings пользовательский масштаб печати.
Метод позволяет задать для указанного объекта PlotSettings пользовательский масштаб печати.
Пользовательский масштаб определяет отношение единиц листа к единицам носителя и всегда отражает масштаб, который будет использоваться при выводе на печать.
plotSet: Входной объект PlotSettings с настройками печати.
scale: Пользовательский масштаб. Тип CustomScale.

Teigha.DatabaseServices.PlotSettingsValidator.SetDefaultPlotConfig(Teigha.DatabaseServices.PlotSettings)
Метод применяет параметры настроек печати по умолчанию к указанному объекту PlotSettings.
Метод применяет параметры настроек печати по умолчанию к указанному объекту PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotCentered(Teigha.DatabaseServices.PlotSettings,System.Boolean)
Метод предназначен для управления центрированием чертежа на листе бумаги с учетом настроек печати PlotSettings.
Метод предназначен для управления центрированием чертежа на листе бумаги с учетом настроек печати PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.
isCentered: Входной флаг, управляющий центрированием при печати на листе. Тип bool. В случае значения true поля печати на бумаге вычисляются автоматически так, чтобы расположить чертеж по центру листа.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotConfigurationName(Teigha.DatabaseServices.PlotSettings,String,String)
Метод задает имена устройства печати и носителя для указанного объекта PlotSettings.
Метод задает имена устройства печати и носителя для указанного объекта PlotSettings.
Параметр plotDeviceName может иметь значение none_device, только если параметр mediaName имеет значение none_user_media.
plotSet: Входной объект PlotSettings с настройками печати.
plotDeviceName: Имя системного принтера или файла PC3 с настройками устройств печати.  Тип String.
mediaName: Наименование бумажного носителя. Тип String.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotOrigin(Teigha.DatabaseServices.PlotSettings,Teigha.Geometry.Point2d)
Метод задает в настройках печати PlotSettings смещение начала координат области печати на печатаемом листе.
Метод задает смещение начала координат области печати для указанного объекта PlotSettings.
Это смещение измеряется от границ печатаемой страницы и всегда в миллиметрах независимо от единиц чертежа.
plotSet: Входной объект PlotSettings с настройками печати.
origin: Смещение начала координат. Тип Point2d.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotPaperUnits(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.PlotPaperUnit)
Метод задает единицы измерения на бумаге, используемые указанным объектом PlotSettings для полей, смещений, размера бумаги и единиц чертежа.
Метод задает единицы измерения на бумаге, используемые указанным объектом PlotSettings для полей, смещений, размера бумаги и единиц чертежа.
plotSet: Входной объект PlotSettings с настройками печати.
units: Единицы измерения из перечисления PlotPaperUnit (миллиметры, дюймы, пиксели).

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotRotation(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.PlotRotation)
Метод задает поворот при печати в настройках этого объекта PlotSettings.
Метод задает поворот при печати в настройках этого объекта PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.
rotationType: Тип поворота чертежа при печати. Значение из перечисления PlotRotation.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotType(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.PlotType)
Метод задает тип печати чертежа, определенный для данного объекта PlotSettings.
Метод задает тип печати чертежа, определенный для данного объекта PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.
plotAreaType: Тип печати чертежа. Значение из перечисления PlotType.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotViewName(Teigha.DatabaseServices.PlotSettings,String)
Метод задает именованный вид, определяющий печатаемый контент для указанного объекта PlotSettings.
Метод задает именованный вид, который определяет, какая часть листа должна выводиться на печать.
plotSet: Входной объект PlotSettings с настройками печати.
viewName: Имя вида. Тип String.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotWindowArea(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.Extents2d)
Метод задает углы рамки, определяющей печатаемую область чертежа для указанного объекта PlotSettings.
Метод задает углы рамки, определяющей печатаемую область чертежа для указанного объекта PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.
windowArea: Границы рамки. Тип Extents2d.

Teigha.DatabaseServices.PlotSettingsValidator.SetStdScale(Teigha.DatabaseServices.PlotSettings,System.Double)
Метод задает для указанного объекта PlotSettings стандартный масштаб как действительное число с плавающей точкой.
Метод задает для указанного объекта PlotSettings стандартный масштаб как действительное число с плавающей точкой.
plotSet: Входной объект PlotSettings с настройками печати.
standardScale: Стандартный масштаб. Тип double.

Teigha.DatabaseServices.PlotSettingsValidator.SetStdScaleType(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.StdScaleType)
Метод позволяет задать для указанного объекта PlotSettings стандартный масштаб из перечисления StdScaleType.
Метод позволяет задать для указанного объекта PlotSettings стандартный масштаб из перечисления StdScaleType.
Это перечисление отражает желаемый масштаб при печати, который платформа использует вместе с другой информацией, такой как размеры области печати, для вычисления значения CustomPrintScale, когда свойство UseStandardScale имеет значение true.
plotSet: Входной объект PlotSettings с настройками печати.
scaleType: Стандартный тип масштаба.  Значение из перечисления StdScaleType.

Teigha.DatabaseServices.PlotSettingsValidator.SetUseStandardScale(Teigha.DatabaseServices.PlotSettings,System.Boolean)
Метод позволяет контролировать использование стандартного масштаба для указанного объекта PlotSettings.
Метод позволяет назначать и отменять использование стандартного масштаба для указанного объекта PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.
useStandard: Входной флаг, определяющий, должен ли использоваться стандартный масштаб.

Teigha.DatabaseServices.PlotSettingsValidator.SetZoomToPaperOnUpdate(Teigha.DatabaseServices.PlotSettings,System.Boolean)
Метод управляет настройкой «Масштабировать в размер листа бумаги при обновлении» для указанного объекта PlotSettings.
Метод управляет настройкой «Масштабировать в размер листа бумаги при обновлении» для указанного объекта PlotSettings.
plotSet: Входной объект PlotSettings с настройками печати.
doZoom: Флаг масштабирования. Тип bool. Если данный флаг принимает значение true, должно применяться масштабирование.

Teigha.DatabaseServices.PlotSettingsValidator.Current
Свойство представляет текущий элемент.
Свойство представляет текущий элемент.
Returns: Возвращает текущий элемент. Тип PlotSettingsValidator.