Teigha.DatabaseServices.BlockReference.ConvertToStaticBlock
Преобразует экземпляр динамического блока в наследуемый (не
динамический) анонимный блок.
Note
При успехе, ссылка на блок фиксирует свойства динамического
блока их текущими значениями и он прекращает быть
динамическим блоком. Он становится для всех целей анонимным
блоком.