Teigha.GraphicsInterface.FontDescriptor
Структура FontDescriptor представляет ряд характеристик шрифта, такие как гарнитура, набор символов, пропорции и семейство, жирный или курсивный шрифт.
Структура FontDescriptor инкапсулирует свойства, описывающие следующие характеристики шрифта:
* Гарнитура шрифта,
* Набор символов,
* Пропорции и семейство,
* Флаг полужирного шрифта,
* Флаг курсивного шрифта.

Teigha.GraphicsInterface.FontDescriptor.#ctor(String,System.Boolean,System.Boolean,System.Int32,System.Int32)
Конструктор структуры FontDescriptor.
Создает новый дескриптор шрифта с указанными параметрами.
Конструктор структуры FontDescriptor.
Создает новый дескриптор шрифта с указанными параметрами.
typeFace: Наименование гарнитуры шрифта. Тип String.
bold: Флаг жирного шрифта. Тип bool.
italic: Флаг курсивного шрифта. Тип bool.
characters: Набор символов. Тип int.
pitchAndFamily: Пропорции и семейство шрифта как комбинация предопределенных констант. Тип int.

Teigha.GraphicsInterface.FontDescriptor.Equals(Object)
Метод предназначен для проверки равенства данного объекта и указанного объекта.
Метод предназначен для проверки равенства данного объекта и указанного объекта.
Равенство объектов FontDescriptor означает одновременное равенство значений их соответствующих свойств.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true в случае равенства сравниваемых объектов.
В противном случае возвращает false.

Teigha.GraphicsInterface.FontDescriptor.ToString(IFormatProvider)
Метод формирует эквивалентное строковое представление данного объекта, которое учитывает предписанные языковые и региональные настройки.
Метод формирует эквивалентное строковое представление данного объекта, которое учитывает предписанные языковые и региональные настройки.
Результирующая строка содержит описание дескриптора шрифта в следующем порядке:
1. Флаг полужирного шрифта,
2. Набор символов,
3. Флаг курсивного шрифта,
4. Пропорции и семейство,
5. Наименование гарнитуры шрифта.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта, которое учитывает языковые и региональные настройки, предписанные аргументом provider. Тип String.

Teigha.GraphicsInterface.FontDescriptor.!=(Teigha.GraphicsInterface.FontDescriptor,Teigha.GraphicsInterface.FontDescriptor)
Оператор неравенства структуры FontDescriptor.
Оператор неравенства структуры FontDescriptor.
a: Левый  операнд. Тип FontDescriptor.
b: Правый операнд. Тип FontDescriptor.
Returns: Возвращает true, если операнд a не равен операнду b.
В противном случае возвращает false.

Teigha.GraphicsInterface.FontDescriptor.==(Teigha.GraphicsInterface.FontDescriptor,Teigha.GraphicsInterface.FontDescriptor)
Оператор равенства структуры FontDescriptor.
Оператор равенства структуры FontDescriptor.
a: Левый  операнд. Тип FontDescriptor.
b: Правый операнд. Тип FontDescriptor.
Returns: Возвращает true, если операнд a равен операнду b.
В противном случае возвращает false.

Teigha.GraphicsInterface.FontDescriptor.Bold
Свойство Bold представляет состояние флага полужирного шрифта.
Свойство Bold представляет текущее состояние флага полужирного шрифта в данном объекте.
Returns: Возвращает true, если флаг полужирного шрифта установлен.
В противном случае возвращает false.

Teigha.GraphicsInterface.FontDescriptor.CharacterSet
Свойство CharacterSet представляет код текущего набора символов.
Свойство CharacterSet представляет код текущего набора символов.
Returns: Возвращает код текущего набора символов.
Тип int.

Teigha.GraphicsInterface.FontDescriptor.Italic
Свойство Italic представляет флаг курсивного шрифта.
Свойство Italic представляет флаг курсивного шрифта.
Returns: Возвращает true, если флаг курсивного шрифта установлен.
В противном случае возвращает false.

Teigha.GraphicsInterface.FontDescriptor.PitchAndFamily
Свойство PitchAndFamily представляет пропорции и семейство шрифта как комбинацию предопределенных констант.
Свойство PitchAndFamily представляет пропорции и семейство шрифта как логическую комбинацию предопределенных констант.
Notes
Пропорции шрифта:
* 0 - Значение по умолчанию;
* 1 - Моноширинный шрифт;
* 2 - Пропорциональный шрифт.
Семейство шрифта:
* 0 - Неизвестно или не имеет значения;
* 16 - семейство Serif;
* 32 - семейство Sans-serif;
* 48 - семейство Serif или Sans-serif;
* 64 - курсивный;
и т.д.
Returns: Возвращает пропорции и семейство шрифта.
Тип int.

Teigha.GraphicsInterface.FontDescriptor.TypeFace
Свойство TypeFace представляет наименование гарнитуры шрифта.
Свойство TypeFace представляет наименование гарнитуры шрифта.
Returns: Возвращает наименование гарнитуры шрифта.
Тип String.