Teigha.Runtime.Dictionary
Класс Dictionary представляет коллекцию указателей на объект, которая поддерживает поиск сохраненных в коллекции значений либо по текстовому ключу, либо по 32-битному идентификатору.
Класс Dictionary представляет коллекцию указателей на объект, которая поддерживает поиск сохраненных в коллекции значений либо по текстовому ключу, либо по 32-битному идентификатору.  Ни ключ, ни сохраненное значение указателя не могут принимать значение NULL.
Создание экземпляров этого класса реализовано только с использованием одного из перегруженных методов newDictionary() класса Kernel.
Словарь может быть создан с поддержкой сортировки значений по ключу, либо без сортировки.
В любом из этих случаев доступна настройка на удаление содержащихся в словаре указателей на Object при их удалении или замене записи, а также при удалении словаря.  Если словарь не настроен на удаление объектов (примером является словарь реестра служб), то заботы по их удалению возлагаются на пользователя.  Если настройка не предполагает удаление словарем объектов, то он возвращает их указатели при вызовах методов AtPut() и Remove(), оставляя свободу принятия дальнейших решений клиентскому приложению.  В противном случае методы словаря возвращают значение NULL, а для указателей автоматически вызывается метод delete.

Teigha.Runtime.Dictionary.At(System.Int32)
Метод позволяет получить объект в словаре по идентификатору объекта.
Метод позволяет получить объект в словаре по идентификатору объекта.
id: Идентификатор искомого объекта.  Тип int.
Returns: Возвращает найденный объект или значение NULL, если идентификатор в словаре не найден.
Тип RXObject.

Teigha.Runtime.Dictionary.At(String)
Метод позволяет получить объект по его ключу в словаре.
Метод позволяет получить объект по его ключу в словаре.
key: Ключ для объекта в словаре.  Тип String.
Returns: Возвращает найденный объект или NULL, если указанный ключ в словаре не найден.
Тип RXObject.

Teigha.Runtime.Dictionary.AtKeyAndIdPut(String,System.Int32,Teigha.Runtime.RXObject)
Метод позволяет добавить в словарь объект с существующим идентификатором.
Метод позволяет добавить в словарь объект с существующим идентификатором.
Ключ newKey не используется для индексации в словаре.
Ключ newKey и объект не должны быть равны NULL.
Идентификатор должен быть больше 0 и не должен уже использоваться другим объектом.
newKey: Входной ключ для добавляемого в словарь значения. Тип String.
id: Входной идентификатор записи словаря, в которой будет размещено добавляемое значение. Тип int.
value: Добавляемое в словарь значение. Тип RXObject.

Teigha.Runtime.Dictionary.AtPut(System.Int32,Teigha.Runtime.RXObject)
Метод предназначен для замены объекта в словаре с указанным идентификатором.
Метод предназначен для замены объекта в словаре с идентификатором id.
id: Идентификатор, под которым в словаре размещается значение.  Тип int.  Идентификатор должен быть положительным.
value: Входное значение для добавления в словарь.  Тип RXObject.  Не может быть NULL.
Returns: Метод возвращает указатель на объект, который был под указанным идентификатором до этого вызова.  Тип RXObject.
Если словарь был настроен на удаление своих записей, метод возвращает NULL.
Notes
Этот метод можно использовать ТОЛЬКО для замены объектов с существующими идентификаторами.

Teigha.Runtime.Dictionary.AtPut(String,Teigha.Runtime.RXObject)
Метод предназначен для размещения значения в словаре с указанным ключом в качестве ключа поиска.
Метод предназначен для размещения значения в словаре с указанным ключом в качестве ключа поиска.
key: Входной ключ для размещаемого в словаре значения.  Тип String.  Значение NULL недопустимо.
value: Входное значение для добавления в словарь.  Тип RXObject.  Значение NULL недопустимо.
Returns: Возвращает указатель на объект, который хранился в словаре этим с ключом до вызова данного метода.
Тип RXObject.  Если словарь был настроен на удаление своих записей, метод возвращает NULL.

Teigha.Runtime.Dictionary.AtPut(String,Teigha.Runtime.RXObject,[Out]int%)
Метод предназначен для размещения в словаре нового значения с указанным ключом и возвращает идентификатор новой записи в словаре, который может использоваться для поиска записи наравне с ключом.
Метод размещает в словаре новое значение value с указанным ключом key и возвращает идентификатор retId новой записи в словаре, который может использоваться для поиска созданной записи наравне с ключом.
key: Входной ключ для размещаемого в словаре значения.  Тип String.  Значение NULL недопустимо.
value: Входное значение для добавления в словарь.  Тип RXObject.  Значение NULL недопустимо.
retId: Выходное значение идентификатора записи с только что добавленным значением. Тип int.
Returns: Возвращает указатель на объект, который хранился в словаре с ключом key до вызова данного метода.
Тип RXObject.  Метод возвращает NULL, если в словаре не было значений с данным ключом, или если словарь был настроен на удаление своих записей.

Teigha.Runtime.Dictionary.Contains(System.Int32)
Метод позволяет проверить, содержится ли в данном словаре объект, соответствующий указанному идентификатору.
Метод позволяет проверить, содержится ли в данном словаре объект, соответствующий указанному идентификатору.
id: Идентификатор искомого значения.  Тип int.
Returns: Возвращает true, если в словаре существует значение с указанным идентификатором.
В противном случае возвращает false.

Teigha.Runtime.Dictionary.Contains(String)
Метод позволяет проверить, содержится ли в данном словаре объект, соответствующий указанному ключу.
Метод позволяет проверить, содержится ли в данном словаре объект, соответствующий указанному ключу.
key: Ключ для искомого значения.  Тип String.
Returns: Возвращает true, если в словаре существует значение с указанным ключом.
В противном случае возвращает false.

Teigha.Runtime.Dictionary.CopyTo(array,System.Int32)
Метод копирует объекты из массива в данный словарь.
Метод копирует в данный словарь объекты из массива, начиная с элемента массива с указанным индексом.
array: Входной массив копируемых записей.  Тип DictionaryEntry[].
index: Индекс элемента массива, начиная с которого начинается копирование элементов массива в данный словарь.  Тип int.

Teigha.Runtime.Dictionary.IdAt(String)
Метод позволяет выяснить идентификатор записи, хранящейся в данном словаре с указанным ключом.
Метод позволяет выяснить идентификатор записи, хранящейся в данном словаре с указанным ключом key.
Если такой ключ в словаре отсутствует, метод вернет значение 0.
key: Ключ для поиска значения. Тип String.
Returns: Возвращает идентификатор записи в данном словаре с ключом key.  Тип int.  Если ключ не найден, возвращает 0.
Notes
См. также метод KeyAt().

Teigha.Runtime.Dictionary.KeyAt(System.Int32)
Метод позволяет выяснить ключ для записи, хранящейся в данном словаре с указанным идентификатором.
Метод позволяет выяснить ключ для записи, хранящейся в данном словаре с указанным идентификатором.
id: Идентификатор искомой записи словаря.  Тип int.  Передаваемое значение должно быть положительным.
Returns: Возвращает ключ для записи с идентификатором id.  Тип String.
Notes
Не следует предпринимать никаких попыток освободить память, выделенную для возвращаемой строки.
См. также метод IdAt().

Teigha.Runtime.Dictionary.Remove(System.Int32)
Метод удаляет из словаря запись с указанным идентификатором.
Метод удаляет из словаря запись с идентификатором id.
id: Идентификатор удаляемой из словаря записи.  Тип int.  Передаваемое значение должно быть положительным.
Returns: Возвращает значение, хранящееся в словаре с идентификатором id.
Тип RXObject.

Teigha.Runtime.Dictionary.Remove(String)
Метод предназначен для удаления из словаря записи с указанным ключом.
Метод предназначен для удаления из словаря записи с указанным ключом key.
В случае успеха метод возвращает удаленный объект.
Если в словаре отсутствует запись с ключом key, или если словарь был настроен на удаление записей, то метод возвращает NULL.
key: Ключ удаляемой из словаря записи.  Тип String.
Returns: Возвращает удаленный из словаря объект.  Тип RXObject.  В случае отсутствия записи с указанным ключом возвращает null.

Teigha.Runtime.Dictionary.ResetKey(System.Int32,String)
Метод задает копию указанной строки в качестве ключа для записи словаря с указанным идентификатором.
Метод задает копию указанной строки newKey в качестве ключа для записи словаря с указанным идентификатором id.
id: Идентификатор записи словаря.  Тип int.  Значение должно быть положительным.
newKey: Новое значение ключа для записи словаря.  Тип String.  Значение не может равняться NULL.

Teigha.Runtime.Dictionary.ResetKey(String,String)
Метод позволяет изменить значение ключа у существующей записи словаря.
Метод позволяет изменить значение ключа у существующей записи словаря.
oldKey: Текущее значение ключа записи.  Тип String.  Не должно равняться NULL.
newKey: Новое значение ключа записи.    Тип String.  Не должно равняться NULL.

Teigha.Runtime.Dictionary.Count
Свойство Count представляет количество записей в данном словаре.
Свойство Count представляет количество записей в данном словаре.
Returns: Возвращает текущее количество записей в словаре.
Тип int.

Teigha.Runtime.Dictionary.DeletesObjects
Свойство DeletesObjects позволяет проверить, настроен ли словарь на удаление объектов при удалении из словаря связанных с этими объектами записей.
Свойство DeletesObjects позволяет проверить, настроен ли словарь на удаление объектов при удалении из словаря связанных с этими объектами записей.
Returns: Возвращает true, если словарь настроен на удаление объектов.
В противном случае возвращает false.

Teigha.Runtime.Dictionary.IsCaseSensitive
Свойство IsCaseSensitive позволяет проверить, чувствительны ли к регистру ключи данного словаря.
Свойство IsCaseSensitive позволяет проверить, чувствительны ли к регистру ключи данного словаря.
Notes
Свойство предполагается использовать в сочетании со свойствами DeletesObjects и IsSorted для проверки свойств словаря.
Returns: Возвращает true, если ключи данного словаря чувствительны к регистру символов.
В противном случае возвращает false.

Teigha.Runtime.Dictionary.IsSorted
Свойство IsSorted позволяет проверить, является ли данный словарь отсортированным.
Свойство IsSorted позволяет проверить, является ли данный словарь отсортированным.
Returns: Возвращает true, если словарь отсортирован.
В противном случае возвращает false.

Teigha.Runtime.Dictionary.Item
Свойство Item возвращает запись словаря по ее ключу.
Свойство Item возвращает запись словаря по ее ключу.
s: Ключ записи.  Тип String.
Returns: Возвращает значение, сохраненное в словаре с ключом s.  Тип RXObject.