HostMgd.EditorInput.PromptSelectionResultEventArgs
Класс предоставляет данные для события PromptedForSelection,
включая набор выбранных объектов и статус операции.
Класс наследуется от EventArgs и используется в .NET API nanoCAD
для передачи информации о завершённой операции выбора объектов
в обработчик событий. Он применяется совместно с событием PromptedForSelection
и делегатом PromptSelectionResultEventHandler, предоставляя разработчикам
доступ к результату выборки, статусу операции и дополнительным параметрам команды.
Класс содержит:
* набор объектов (SelectionSet), выбранных пользователем,
* статус операции (PromptStatus — OK, Cancel, Error и др.),
* параметры приглашения (PromptSelectionOptions),
* строковое значение , если выбор был прерван с клавиатуры.
Example
C#

HostMgd.EditorInput.PromptSelectionResultEventArgs.Result
Свойство предоставляет доступ к результату операции выбора объектов,
включая статус и набор выделенных элементов.
Свойство возвращает объект типа PromptSelectionResult,
который содержит данные о завершённой операции выбора объектов
— например, после вызова метода GetSelection()
или при обработке события PromptedForSelection.
Оно позволяет получить:
* статус операции (PromptStatus.OK, PromptStatus.Cancel, PromptStatus.Error и др.),
* набор выбранных объектов (SelectionSet),
* строковое представление ввода , если выбор был прерван пользователем.
Свойство доступно только для чтения и автоматически обновляется
после завершения интерактивной операции выбора.
Returns: Возвращает экземпляр класса PromptSelectionResult, содержащий следующие данные:
* Status — статус выполнения команды (PromptStatus.OK, если выборка успешна).
* Value — набор выделенных объектов (SelectionSet), если операция завершена успешно.
* StringResult — строковое значение, если операция была прервана клавиатурой.
Если операция не завершена успешно, значение может быть недопустимым или null.
Example
C#