Teigha.Runtime.CommandFlags.NoUndoMarker
Значение: 16777216 (0x1000000).
Команда и ее маркеры отмены не будут добавлены в файл отмены.
Этот флаг предусмотрен для команд, которые не изменяют базу данных и, следовательно, не нуждаются в отображении в файле отмены.