HostMgd.EditorInput.Editor.PromptingForInteger
Событие возникает при начале операции ввода целого числа,
позволяя настроить параметры команды до её запуска.
Событие не реализовано.
Событие инициируется в момент начала интерактивного ввода целого числа —
например, перед вызовом метода GetInteger() в .NET API nanoCAD.
Оно предоставляет доступ к параметрам ввода через объект PromptIntegerOptionsEventArgs,
что позволяет динамически изменять:
* текст приглашения (Message),
* значение по умолчанию (DefaultValue),
* допустимый диапазон (LowerLimit, UpperLimit),
* режимы ввода (AllowNone, AllowZero и др.).
Это событие особенно полезно при разработке интерактивных команд,
где требуется гибкая настройка параметров ввода целого числа в зависимости от контекста —
например, при задании количества копий, номера слоя, параметра массива и других целочисленных значений.
Событие вызывается до отображения запроса пользователю, что позволяет модифицировать
параметры ввода в реальном времени.
Example
C#