Teigha.DatabaseServices.CollisionType
Перечисление CollisionType определяет интерпретацию объекта в процессе обнаружения коллизий.
Перечисление CollisionType определяет интерпретацию объекта в процессе обнаружения коллизий.
Он может игнорироваться в этом процессе, либо рассматриваться как твердое тела в конкретных границах.