Teigha.DatabaseServices.PlotStyleDescriptor.GetHashCode
Метод вычисляет хэш-код для данного объекта.
Метод вычисляет хэш-код для данного объекта. Дополнительные сведения см. в документации по API Microsoft .NET.
Returns: Возвращает хэш-код для данного объекта. Тип int.