Teigha.Geometry.Tolerance
Структура Tolerance представляет значения точности (допуски), используемые для проверки равенства точек и векторов.
Структура Tolerance представляет значения точности (допуски), используемые для проверки равенства точек и векторов.
Notes
Для оценки совпадения точек и векторов предусмотрены значения equalPoint и equalVector, соответственно.
Используются следующие критерии равенства точек и векторов:
1. Две точки p1 и p2 считаются равными, если расстояние между ними не превышает значения equalPoint, т.е. (p1 - p2).length() .
2. Два вектора v1 и v2 считаются равными, если длина вектора их разности не превышает значения equalVector,
т.е. (v1 - v2).length() .
3. Два вектора v1 и v2 считаются параллельными, если длина вектора суммы или разности этих векторов после их нормирования на единицу меньше значения equalVector, т.е.
(v1/v1.length() - v2/v2.length()).length()  или (v1/v1.length() + v2/v2.length()).length() .
4. Два вектора v1 и v2 считаются перпендикулярными, если модуль скалярного произведения приведенных к единичной длине векторов v1 и v2 не превышает значения equalVector, т.е.
abs((v1.dotProduct(v2))/(v1.length()*v2.length())) .
5. Две прямые линии или два луча параллельны (или перпендикулярны), если их направляющие векторы параллельны (или, соответственно, перпендикулярны).

Teigha.Geometry.Tolerance.#ctor(System.Double,System.Double)
Конструктор структуры Tolerance.
Создает экземпляр класса с указанными значениями equalPoint и equalVector для проверки равенства точек и векторов.
Конструктор структуры Tolerance.
Создает экземпляр класса с указанными значениями equalPoint и equalVector для проверки равенства точек и векторов.
equalVector: Точность (допуск) для критерия равенства векторов. Тип double.
equalPoint: Точность (допуск) для критерия равенства точек.    Тип double.

Teigha.Geometry.Tolerance.EqualPoint
Свойство EqualPoint представляет точность (допуск) для оценки равенства двух точек.
Свойство EqualPoint представляет точность (допуск) для оценки равенства двух точек.
Returns: Возвращает точность (допуск) для оценки равенства двух точек.
Тип double.

Teigha.Geometry.Tolerance.EqualVector
Свойство EqualVector представляет точность (допуск) для оценки равенства двух векторов.
Свойство EqualVector представляет точность (допуск) для оценки равенства двух векторов.
Returns: Возвращает точность (допуск) для оценки равенства двух векторов.
Тип double.

Teigha.Geometry.Tolerance.Global
Свойство Global представляет точность (допуск) по умолчанию.
Свойство Global представляет точность (допуск) по умолчанию.
Returns: Возвращает точность (допуск) по умолчанию.
Тип Tolerance.