HostMgd.EditorInput.Editor.PromptingForKeyword
Событие возникает при начале операции ввода ключевого слова,
позволяя настроить доступные варианты и сообщение приглашения.
Событие не реализовано.
Событие инициируется перед началом интерактивного ввода ключевого слова —
например, при вызове метода GetString() с заданным набором ключевых слов.
Оно предоставляет доступ к параметрам ввода через объект
PromptKeywordOptionsEventArgs, что позволяет динамически изменять:
* текст приглашения (Message),
* список доступных ключевых слов (Keywords),
* глобальные ключевые слова ,
* режимы ввода (например, обязательный выбор).
Это событие особенно полезно при разработке команд, где требуется гибкая
настройка диалога с пользователем — например, выбор действия из списка:
"Да/Нет", "Включить/Отключить", "Сохранить/Отмена".
Событие реализуется через делегат PromptKeywordOptionsEventHandler
и вызывается до отображения запроса, что позволяет адаптировать параметры ввода
в зависимости от контекста чертежа или состояния приложения.
Example
C#