Teigha.GraphicsInterface.VertexData.GetTrueColors
Метод предоставляет массив цветов для вершин сети или оболочки, которые используются в данный момент объектом VertexData.
Метод предоставляет массив цветов для вершин сети или оболочки, которые используются в данный момент объектом VertexData.
Returns: Возвращает массив цветов для вершин сети или оболочки.
Тип EntityColor[].