Teigha.DatabaseServices.Vertex2dType.CurveFitVertex
Значение: 3.  Определяющая точка, автоматически созданная в процессе аппроксимации кривой.
Этот тип вершин может исчезнуть или измениться автоматически при последующих операциях редактирования полилинии.