Teigha.GraphicsInterface.ExtendedLightShape
Перечисление ExtendedLightShape определяет геометрические формы протяженных источников света.
Перечисление ExtendedLightShape определяет поддерживаемые геометрические формы протяженных источников света.