Teigha.GraphicsInterface.WorldGeometry.StartAttributesSegment
Метод начинает сегмент атрибутов блока.
Метод начинает сегмент атрибутов блока.
Если объект отрисовки является блоком и имеет атрибуты, он должен вызвать этот метод ровно один раз, прежде чем отправлять атрибуты в Draw().
Атрибуты должны быть последними визуализированными объектами.
По этой причине после вызова этого метода объект сможет отрисовывать только атрибуты, но уже не графические примитивы.
Этот метод связан с флагом DrawableHasAttributes, который может быть получен из метода SetAttributes().
Если этот флаг установлен, следует вызвать метод StartAttributesSegment() и уже затем отображать имеющиеся атрибуты.