Teigha.Runtime.DynamicLinker.ModuleLoading
Событие ModuleLoading создается динамическим компоновщиком непосредственно перед началом загрузки модуля приложения.
Событие ModuleLoading создается, когда динамический компоновщик приступает к загрузке модуля приложения.
Уведомление генерируется до начала загрузки файла программы.