Teigha.DatabaseServices.DwgFiler.ReadSoftPointerId
Метод предназначен для получения идентификатора мягкой ссылки на указатель (SoftPointerId) из текущего элемента данного объекта Filer.
Метод предназначен для получения идентификатора мягкой ссылки на указатель (SoftPointerId) из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатора мягкой ссылки на указатель (SoftPointerId). Тип ObjectId.