Teigha.DatabaseServices.MeshPointMaps
Структура MeshPointMaps хранит данные, возвращаемые методом
Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps().
Структура MeshPointMaps хранит данные, возвращаемые методом
Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps().

Teigha.DatabaseServices.MeshPointMaps.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Point2dCollection)
Конструктор структуры MeshPointMaps.
Конструктор структуры MeshPointMaps.
sourcePts: Исходные точки.   Тип Point2dCollection.
destPts: Точки назначения. Тип Point2dCollection.

Teigha.DatabaseServices.MeshPointMaps.DestPonints
Свойство DestPonints представляет коллекцию точек назначения.
Свойство DestPonints представляет коллекцию точек назначения.
Returns: Возвращает коллекцию точек назначения. Тип Point2dCollection.

Teigha.DatabaseServices.MeshPointMaps.SourcePonints
Свойство SourcePonints представляет коллекцию исходных точек.
Свойство SourcePonints представляет коллекцию исходных точек.
Returns: Возвращает коллекцию исходных точек. Тип Point2dCollection.