Teigha.Geometry.CurveCurveIntersector2d.ChangeCurveOrder
Метод предназначен для изменения порядка кривых в данном объекте, делая первую кривую второй и наоборот.
Метод предназначен для изменения порядка кривых в данном объекте, делая первую кривую второй и наоборот.