Teigha.Geometry.CurveCurveIntersector3d
Класс CurveCurveIntersector3d представляет геометрию пересечений 3D-кривых общего вида.
Класс CurveCurveIntersector3d представляет геометрию пересечений 3D-кривых общего вида.
В классах LinearEntity3d, CircularArc3d и AcGeEllipticArc3d предусмотрены специальные методы IntersectWith() для поиска точек пересечения двух линий, линии и дуги, двух дуг или линии и эллипса.
Однако нет обобщенного метода для поиска точек пересечения двух 3D-кривых общего вида.
Эту задачу решают объекты класса CurveCurveIntersector3d.
Создание объектов этого класса сопровождается указанием двух кривых, пересечения которых требуется вычислить.
Указатели на входные кривые сохраняются в элементах данных класса.
Для поиска пересечений возможно дополнительно конкретизировать параметрические интервалы для каждой из кривых.
Класс содержит методы запросов, которые возвращают точки пересечения и/или интервалы перекрытия двух кривых. Предусмотрены также методы, которые предоставляют информацию о каждой точке пересечения, например, является ли конкретное пересечение тангенциальным или трансверсальным. Чтобы найти точки самопересечения кривой, достаточно в качестве входных кривых передать в конструктор одну и ту же кривую.
Notes
Если одна из связанных кривых удалена, объект этого класса должен быть перевычислен.

Teigha.Geometry.CurveCurveIntersector3d.#ctor
Конструктор по умолчанию класса CurveCurveIntersector3d.
Конструктор по умолчанию класса CurveCurveIntersector3d.
Создает объект с нулевыми указателями на кривые и точностью по умолчанию.
Предполагается, что реальные данные будут заданы позднее с использованием одного из методов Set().

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления пересечений указанных кривых с использованием точности по умолчанию.
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления пересечений указанных кривых с использованием точности по умолчанию.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления пересечений указанных кривых с заданной точностью.
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления пересечений указанных кривых с заданной точностью.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.
tolerance: Заданная точность геометрических вычислений. Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d)
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления пересечений двух кривых на участках, которые определены заданными параметрическими интервалами.
Используется точность по умолчанию.
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
Используется точность по умолчанию.
Notes
Точки пересечения и наложения возвращаются только в том случае, если они находятся в пределах двух указанных параметрических интервалов.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления с заданной точностью пересечений двух кривых на их участках, которые определены заданными параметрическими интервалами.
Конструктор класса CurveCurveIntersector3d.
Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
Используется точность, заданная входным аргументом tolerance.
Notes
Точки пересечения и наложения возвращаются только в том случае, если они находятся в пределах двух указанных параметрических интервалов.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.
tolerance: Заданная точность геометрических вычислений. Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector3d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта на основе переданного указателя.
Метод создает объект на основе переданного указателя и возвращает полученный объект.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип CurveCurveIntersector3d.

Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionParameters(System.Int32)
Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
intersection: Индекс точки пересечения, в которой требуется вычислить параметры для пересекающихся кривых. Тип int.
Returns: Возвращает массив из двух элементов. Тип double[].
Первое значение представляет параметр для первой кривой в точке пересечения, а второе значение — параметр для второй кривой в точке пересечения.

Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionPoint(System.Int32)
Метод предоставляет 3D-точку пересечения с указанным индексом.
Метод предоставляет 3D-точку пересечения с указанным индексом.
intersection: Порядковый индекс искомой точки пересечения. Тип int.
Returns: Возвращает 3D-точку пересечения с индексом intersection. Тип Point3d.

Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionPointTolerance(System.Int32)
Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
intersection: Индекс интересующей точки пересечения. Тип int.
Returns: Возвращает геометрическую точность вычисления указанной точки пересечения. Тип double.

Teigha.Geometry.CurveCurveIntersector3d.GetOverlapRanges(System.Int32)
Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
overlap: Индекс участка перекрытия (совпадения) кривых. Тип int. Значение индекса должно быть неотрицательным и быть меньше количества перекрытий, возвращаемого свойством OverlapCount.
Returns: Возвращает массив из двух элементов, которые представляют параметрические интервалы для первой и второй кривой, соответственно.  Тип Interval[].

Teigha.Geometry.CurveCurveIntersector3d.GetPointOnCurve1(System.Int32)
Метод позволяет получить точку пересечения с указанным индексом как точку PointOnCurve3d на первой кривой.
Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve3d на первой кривой.
Класс PointOnCurve3d предоставляет доступ к 3D-координатам и значению параметра возвращаемой точки.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает объект PointOnCurve3d для точки пересечения на первой кривой.

Teigha.Geometry.CurveCurveIntersector3d.GetPointOnCurve2(System.Int32)
Метод позволяет получить точку пересечения с указанным индексом как точку PointOnCurve3d на второй кривой.
Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve3d на второй кривой.
Класс PointOnCurve3d предоставляет доступ к 3D-координатам и значению параметра возвращаемой точки.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает объект PointOnCurve3d для точки пересечения на второй кривой.

Teigha.Geometry.CurveCurveIntersector3d.IsTangential(System.Int32)
Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает true, если в указанной точке пересечения кривые являются касательными.
В противном случае возвращает false.

Teigha.Geometry.CurveCurveIntersector3d.IsTransversal(System.Int32)
Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения.
Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения.
В такой точке пересечения вектора касательных к кривым 1 и 2 не параллельны друг другу.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает true, если пересечение кривых в указанной точке является трансверсальным.
В противном случае возвращает false.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах точности по умолчанию.
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах указанной точности.
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.
tolerance: Заданная точность геометрических вычислений. Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах точности по умолчанию.
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах указанной точности.
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип Curve3d.
curve2: Вторая входная кривая. Тип Curve3d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.
planeNormal: Опциональный вектор нормали плоскости. Тип Vector3d.
tolerance: Заданная геометрическая точность. Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector3d.Curve1
Свойство Curve1 представляет указатель на первую кривую в данном объекте.
Свойство Curve1 представляет указатель на первую кривую в данном объекте.
Returns: Возвращает первую кривую. Тип Geometry.Curve3d.

Teigha.Geometry.CurveCurveIntersector3d.Curve2
Свойство Curve2 представляет указатель на вторую кривую в данном объекте.
Свойство Curve2 представляет указатель на вторую кривую в данном объекте.
Returns: Возвращает вторую кривую. Тип Geometry.Curve3d.

Teigha.Geometry.CurveCurveIntersector3d.NumberOfIntersectionPoints
Свойство NumberOfIntersectionPoints представляет количество найденных точек пересечения двух кривых.
Свойство NumberOfIntersectionPoints представляет количество найденных точек пересечения двух кривых.
Returns: Возвращает количество точек пересечения. Тип int.

Teigha.Geometry.CurveCurveIntersector3d.PlaneNormal
Свойство PlaneNormal представляет нормаль плоскости, которая используется для вычисления конфигураций в точке пересечения.
Свойство PlaneNormal представляет нормаль плоскости, которая используется для вычисления конфигураций в точке пересечения.
Returns: Возвращает нормаль плоскости. Тип Vector3d.

Teigha.Geometry.CurveCurveIntersector3d.Tolerance
Свойство Tolerance представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
Свойство Tolerance представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
Returns: Возвращает текущее значение геометрической точности. Тип Geometry.Tolerance.