Teigha.DatabaseServices.TypedValue
Класс TypedValue реализует тип значения для хранения объектов различных типов.
Конкретный тип хранимого значения определяется свойством TypeCode.
Класс TypedValue реализует тип значения для хранения объектов различных типов.
Конкретный тип хранимого значения определяется свойством TypeCode.
Экземпляры этого класса используются в результирующих буферах для представления данных в виде пар "код – значение".

Teigha.DatabaseServices.TypedValue.#ctor(System.Int32)
Данный конструктор создает объект с заданным кодом типа значения.
Данный конструктор создает объект с заданным кодом типа значения.
typeCode: Код типа, int.

Teigha.DatabaseServices.TypedValue.#ctor(System.Int32,Object)
Данный конструктор создает объект с заданным кодом типа и конкретным значением.
Данный конструктор создает объект с заданным кодом типа и конкретным значением.
typeCode: Код типа, int.
value: Значение. Тип Object.

Teigha.DatabaseServices.TypedValue.Equals(Object)
Метод определяет равенство данного объекта с указанным объектом.
Метод определяет равенство данного объекта с указанным объектом.
obj: Объект, с которым выполняется проверка на равенство.  Тип Object
Returns: Возвращает значение true в случае равенства объектов, в противном случае - false.

Teigha.DatabaseServices.TypedValue.ToString(IFormatProvider)
Метод предназначен для получения строкового представления данного объекта с учетом заданных региональных и языковых настроек.
Метод предназначен для получения строкового представления данного объекта в формате, котрый учитывает языковые и региональные настройки.
provider: Поставщик языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки, формат которой определяется указанным провайдером. Тип String.

Teigha.DatabaseServices.TypedValue.!=(Teigha.DatabaseServices.TypedValue,Teigha.DatabaseServices.TypedValue)
Оператор предназначен для определения неравенства двух заданных типизированных значений.
Оператор предназначен для определения неравенства двух заданных типизированных значений.
a: Левый операнд, тип TypedValue.
b: Правый операнд, тип TypedValue.
Returns: Возвращает true, если операнды a и b не совпадают, иначе - false.

Teigha.DatabaseServices.TypedValue.==(Teigha.DatabaseServices.TypedValue,Teigha.DatabaseServices.TypedValue)
Оператор предназначен для определения равенства двух заданных типизированных значений.
Оператор предназначен для определения равенства двух заданных типизированных значений.
a: Левый операнд, тип TypedValue.
b: Правый операнд, тип TypedValue.
Returns: Возвращает true, если операнды a и b равны, иначе - false.

Teigha.DatabaseServices.TypedValue.TypeCode
Свойство предназначено для хранения кода типа объекта.
Свойство предназначено для хранения кода типа объекта.
Returns: Возвращает код типа объекта.  Тип short.

Teigha.DatabaseServices.TypedValue.Value
Свойство предназначено для хранения типизированного значения, котрое представляет данный объект TypedValue.
Свойство предназначено для хранения типизированного значения, котрое представляет данный объект TypedValue.
Returns: Возвращает типизированное значение как объект Object.