Teigha.DatabaseServices.LoftOptionsNormalOption.UseDraftAngles
Значение: 5.
Направление поверхности в первом и последнем сечениях будет определяться заданными углами сопряжения лофт-поверхности с плоскостями соответствующих сечений (start draft angle и end draft angle).