Teigha.DatabaseServices.StdScaleType
Данное перечисление определяет список стандартных значений масштаба печати.
Данное перечисление определяет список стандартных значений масштаба печати.
Используется ли листом стандартный масштаб, зависит от значения свойства Teigha.PlotSettings.UseStandardScale.