Teigha.GraphicsSystem.ImpDevice.OnRealizeBackgroundPalette
Метод сообщает данному устройству, что его палитру следует переключить в фоновый режим.
Обычно вызывается, когда окно графического интерфейса теряет фокус.
Метод сообщает данному устройству, что его палитру следует переключить в фоновый режим.
Этот метод обычно вызывается, когда окно графического интерфейса теряет фокус.