Teigha.DatabaseServices.Group.GetAllEntityIds
Метод позволяет получить массив идентификаторов объектов чертежа, принадлежащих данной группе.
Метод позволяет получить массив идентификаторов объектов чертежа, принадлежащих данной группе.
Returns: Возвращает массив идентификаторов объектов-членов данной группы. Тип ObjectId[].