Teigha.DatabaseServices.PaperOrientationStates
Перечисление PaperOrientationStates определяет текущее значение свойства ориентации бумаги для аннотативного объекта.
Перечисление PaperOrientationStates определяет текущее значение свойства ориентации бумаги для аннотативного объекта.