HostMgd.ApplicationServices.InplaceTextEditor.ParagraphDialog
Метод вызывает диалоговое окно редактирования текстового абзаца.
В текущей версии не реализован.
Метод вызывает диалоговое окно редактирования текстового абзаца в данном редакторе.
В текущей версии не реализован.