Teigha.DatabaseServices.LoftedSurface
Этот класс реализует трехмерный объект, поверхность которого получена при помощи лофта - вытягивания поверхности по сечениям.
Этот класс реализует трехмерный объект, поверхность которого получена при помощи лофта - вытягивания поверхности по сечениям.

Teigha.DatabaseServices.LoftedSurface.#ctor
Конструктор по умолчанию класса LoftedSurface.
Конструктор по умолчанию класса LoftedSurface.

Teigha.DatabaseServices.LoftedSurface.CreateLoftedSurface(array,array,Teigha.DatabaseServices.Entity,DatabaseServices.LoftOptions)
Метод позволяет создать лофтом поверхность на основе заданных кривых в соответствии с переданными параметрами операции лофта.
Метод позволяет создать лофтом поверхность на основе заданных кривых в соответствии с переданными параметрами операции лофта.
Профили поперечных сечений могут быть как замкнутыми, так и разомкнутыми.
Когда все кривые замкнутые, этот метод принимает объект-точку в качестве первого и/или последнего элемента массива сечений crossSections.
Всякая кривая из массива направляющих guideCurves должна начинаться на первом поперечном сечении, завершаться на последнем поперечном сечении и пересекать каждую из кривых поперечных сечений. Таким образом, кривые направляющих и кривые поперечных сечений образуют структуру, подобную сетчатой. При этом кривые направляющих и поперечных сечений располагаются на вытянутой по сечениям поверхности.
В случае лофта по траектории используется траектория из аргумента pathCurve, а массив направляющих guideCurves должен иметь значение NULL, и наоборот, при лофте по направляющим нулевой должна быть траектория pathCurve, а массив guideCurves должен содержать какие-либо кривые направляющих.
Кривая траектории не обязана ни пересекать кривые сечений, ни даже проходить вблизи них. Но, как правило, рекомендуется начинать траекторию
на плоскости первого поперечного сечения и заканчивать на плоскости последнего поперечного сечения.
crossSections: Массив поперечных сечений. Тип Entity[].
guideCurves: Массив направляющих. Тип Entity[].
pathCurve: Траектория вытягивания поверхности. Тип Entity.
loftOptions: Опции операции лофта. Тип DatabaseServices.LoftOptions. Эти опции оказывают влияние на геометрию получаемой поверхности.

Teigha.DatabaseServices.LoftedSurface.Closed
Свойство предоставляет возможность проверить замкнутость полученной вытянутой поверхности.
Свойство предоставляет возможность проверить замкнутость полученной вытянутой поверхности.
Returns: Возвращает true, если поверхность является замкнутой.
В противном случае возвращает false.

Teigha.DatabaseServices.LoftedSurface.CrossSections
Свойство возвращает массив объектов, используемых в качестве профилей поперечных сечений.
Свойство возвращает массив объектов, используемых в качестве профилей поперечных сечений.
Returns: Возвращает массив кривых поперечных сечений. Тип Entity[].

Teigha.DatabaseServices.LoftedSurface.GuideCurves
Свойство возвращает массив объектов (кривых), используемых в качестве направляющих для вытягивания поверхности по сечениям.
Свойство возвращает массив объектов (кривых), используемых в качестве направляющих для вытягивания поверхности по сечениям.
Returns: Возвращает массив направляющих. Тип Entity[].

Teigha.DatabaseServices.LoftedSurface.LoftOptions
Свойство представляет параметры лофта, используемые для управления геометрией результирующей поверхности.
Свойство представляет параметры лофта, используемые для управления геометрией результирующей поверхности.
Returns: Возвращает параметры лофта. Тип DatabaseServices.LoftOptions.

Teigha.DatabaseServices.LoftedSurface.NumberOfCrossSections
Свойство возвращает количество используемых поперечных сечений.
Свойство возвращает количество используемых поперечных сечений.
Returns: Возвращает количество поперечных сечений. Тип int.

Teigha.DatabaseServices.LoftedSurface.PathEntity
Свойство возвращает объект траектории, вдоль которой выполняется лофт.
Свойство возвращает объект траектории, вдоль которой выполняется лофт.
Returns: Возвращает траекторию лофта.  Тип Entity.