Teigha.Geometry.PointOnSurface.GetNormal
Метод вычисляет нормаль к поверхности в текущей точке.
В текущей версии не реализован.
Метод вычисляет нормаль к поверхности в текущей точке.
В текущей версии не реализован.
Returns: Возвращает вектор нормали в точке, определяемой данным объектом.
Тип Vector3d.