Teigha.DatabaseServices.TableStyleFlags
Перечисление TableStyleFlags определяет флаги, которые используются для работы со стилями таблиц. Для внутреннего использования.
Перечисление TableStyleFlags определяет флаги, которые используются для работы со стилями таблиц. Для внутреннего использования.