Teigha.DatabaseServices.ItemLocator
Класс ItemLocator представляет индекс {i, j, k} элемента в прямоугольном массиве.
Класс ItemLocator представляет индекс {i, j, k} элемента в прямоугольном массиве.

Teigha.DatabaseServices.ItemLocator.#ctor(System.Int32,System.Int32,System.Int32)
Конструктор класса ItemLocator. Инициализирует индексы этой структуры указанными значениями.
Конструктор класса ItemLocator. Инициализирует индексы этой структуры указанными значениями.
itemIndex: Индекс элемента. Тип int.
rowIndex: Индекс строки.   Тип int.
levelIndex: Индекс уровня.   Тип int.

Teigha.DatabaseServices.ItemLocator.ItemIndex
Свойство обеспечивает доступ к индексу, который определяет позицию элемента в массиве относительно первого элемента массива.
Свойство обеспечивает доступ к индексу, который определяет позицию элемента в массиве относительно первого элемента массива.
Returns: Возвращает индекс данного элемента. Тип int.

Teigha.DatabaseServices.ItemLocator.LevelIndex
Свойство представляет индекс, определяющий текущий уровень элемента в массиве относительно первого уровня.
Свойство представляет индекс, определяющий текущий уровень элемента в массиве относительно первого уровня.
Returns: Возвращает уровень данного элемента. Тип int.

Teigha.DatabaseServices.ItemLocator.RowIndex
Свойство представляет индекс, определяющий строку элемента в массиве относительно первой строки.
Свойство представляет индекс, определяющий строку элемента в массиве относительно первой строки.
Returns: Возвращает текущую строку данного элемента. Тип int.