Teigha.DatabaseServices.MTextFragment.GetUnderLinePoints
Метод возвращает массив из двух точек, определяющих линию подчёркивания текста, если таковая используется.
Метод возвращает массив из двух точек, определяющих линию подчёркивания текста, если таковая используется.
Returns: Возвращает массив из двух точек, которые определяют линию подчёркивания.
Тип Point3d[].