Teigha.GraphicsInterface.EdgeModifiers.Overhang
Значение: 1.
Этот модификатор позволяет ребру выступать за начальную и конечную точки на некоторую заданную величину.
Отображение рёбер с удлинением линий используется при создании эффекта карандашного наброска от руки.