HostMgd.PlottingServices.PreviewEndPlotStatus.Plot
Значение: 1.
Предварительный просмотр завершен стандартно, и пользователь запросил вывод на печать непосредственно из пользовательского интерфейса предварительного просмотра.
Клиентские приложения должны продолжить печать с тем же объектом PlotInfo, который использовался для создания предварительного просмотра.