HostMgd.EditorInput.EntityJig
непосредственно на экране путем указания начальной точки и перетаскивания курсора мыши(технология Jig).
Класс обеспечивает возможность создавать пользовательский примитив непосредственно на экране путем
указания начальной точки и перетаскивания курсора мыши (далее технология Jig). При этом во время
перетаскивания курсора мыши на экране будет отображаться предпросмотр создаваемого примитива. При
необходимости создания подобным способом произвольной графики, в том числе одновременно нескольких
пользовательских примитивов в виде цельного графического объекта, используется класс .

HostMgd.EditorInput.EntityJig.#ctor(DatabaseServices.Entity )
Конструктор класса EntityJig
Конструктор класса EntityJig
entity: Пользовательский примитив