Teigha.DatabaseServices.DBText.CorrectSpelling
Метод выполняет проверку правописания текста для исправления
орфографических ошибок. Проверка правописания встроена в
nanoCAD, поэтому метод может не разрабатываться в
пользовательских библиотеках.
Метод возвращает 0 в случае успеха (если ошибок нет или они
исправлены) и 1 в противном случае.