Teigha.Colors.EntityColor
Класс определяет цвета для объектов типа Entity.
Этот .NET класс соответствует классу OdCmEntityColor nanoCAD
API.
Объект EntityColor определяет цвета для объекта OdDbEntity.

Teigha.Colors.EntityColor.Blue
Возвращает значение компонента цвета Blue от 0 до 255.

Teigha.Colors.EntityColor.ColorIndex
Возвращает индекс цвета.

Teigha.Colors.EntityColor.ColorMethod
Возвращает цветовую модель.

Teigha.Colors.EntityColor.Green
Возвращает значение компонента цвета Green от 0 до 255.

Teigha.Colors.EntityColor.IsByAci
Возвращает true, если цвет определен с помощью индекса
(номера).

Teigha.Colors.EntityColor.IsByBlock
Возвращает true, если цвет определен с помощью блока.

Teigha.Colors.EntityColor.IsByColor
Возвращает true, если цвет определен с помощью другого цвета.

Teigha.Colors.EntityColor.IsByLayer
Возвращает true, если цвет задается как EntityColor.ByLayer
или цвет задается с помощью индекса (номера) и индекс задан
как EntityColor.ACIbyLayer.

Teigha.Colors.EntityColor.IsByPen
Возвращает true, если цвет является цветом ручки.

Teigha.Colors.EntityColor.IsForeground
Возвращает true, если цвет — цвет переднего плана.

Teigha.Colors.EntityColor.Red
Возвращает значение компонента цвета Red от 0 до 255.

Teigha.Colors.EntityColor.IsNone
Возвращает true, если цвет не задан.

Teigha.Colors.EntityColor.PenIndex
Возвращает номер ручки.