Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.Reset
Метод реинициализирует перечислитель, устанавливая его индекс в значение -1.
Метод реинициализирует перечислитель, устанавливая его индекс в значение -1.