Teigha.DatabaseServices.DBObject.Modified
Cобытие происходит каждый раз, когда объект открывается для изменений, в режиме OpenMode.ForWrite,
изменяется и закрывается с изменениями.
Cобытие происходит каждый раз, когда объект открывается для изменений, в режиме OpenMode.ForWrite,
вызывается функция, которая может изменить содержимое этого объекта,
и этот объект в настоящее время закрывается.
Returns: Тип данных EventHandler, представляющий обработчик события.