Teigha.DatabaseServices.FieldEvaluator
Класс FieldEvaluator является абстрактным базовым классом, определяющим интерфейс вычислителя поля.
Класс FieldEvaluator является абстрактным базовым классом, определяющим интерфейс вычислителя поля.
Notes
Приложения реализуют вычислители для своих полей, производные от этого класса.
Объект вычислителя предоставляется загрузчиком вычислителя поля.
Идентификатор требуемого для загрузки вычислителя хранится в поле.
Класс вычислителя может быть реализован как для каждого типа поля, так и для нескольких типов полей.

Teigha.DatabaseServices.FieldEvaluator.#ctor
Конструктор по умолчанию класса FieldEvaluator.
Конструктор по умолчанию класса FieldEvaluator.

Teigha.DatabaseServices.FieldEvaluator.Compile(Teigha.DatabaseServices.Field,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.FieldResult)
Метод компилирует поле при изменении кода поля.
Метод предназначен для компиляции поля при изменении кода поля.
Notes
Вычислитель может выполнять произвольный парсинг кода поля и сохранять в поле полученные результаты.
Фреймворк полей вызывает этот метод для компиляции поля при всяком изменении кода поля.
Но в отличие от метода Evaluate(), который вызывается при каждом вычислении поля, метод Compile вызывается только при изменении кода поля.
pField: Вычисляемое поле. Тип Field.
pDb: Указатель на базу данных. Тип Database.
result: Объект результата поля, в котором сохраняется статус компиляции поля. Тип FieldResult.

Teigha.DatabaseServices.FieldEvaluator.Evaluate(Teigha.DatabaseServices.Field,System.Int32,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.FieldResult)
Метод предназначен для вычисления значения поля.
Метод предназначен для вычисления значения поля.
pField: Поле, которое должно быть вычислено. Тип Field.
nContext: Контекст вычисления поля. Этот флаг контекста передается вычислителю и может быть одним из предопределенных флагов из перечисления FieldEvaluationOptions или пользовательским флагом контекста. Тип int.
pDb: Указатель базы данных, который может равняться null, если в текущем контексте база данных недоступна. Тип Database.
pResult: Объект результата вычисления поля, в котором задается сам результат вычисления и статус ошибки. Тип FieldResult.

Teigha.DatabaseServices.FieldEvaluator.EvaluatorId(Teigha.DatabaseServices.Field)
Метод предоставляет идентификатор вычислителя для указанного кода поля.
Метод предоставляет идентификатор вычислителя для указанного кода поля.
Вызывается для поиска вычислителя по коду поля, для которого не задан идентификатор вычислителя.
Notes
Реализации этого метода должны проверять код поля.
Если код поля распознается вычислителем и может быть им обработан, тогда этот метод должен возвращать идентификатор вычислителя.
pField: Входной объект поля, для которого требуется получить идентификатор вычислителя. Тип Field.
Returns: Возвращает идентификатор вычислителя. Если их несколько, идентификаторы разделяются запятыми. Тип String.

Teigha.DatabaseServices.FieldEvaluator.Format(Teigha.DatabaseServices.Field)
Метод предоставляет вычисленное значение поля в виде строки.
Фреймворк поля вызывает этот метод, когда у поля запрашивается вычисленное значение поля в строковом представлении.
Notes
Вычислитель может реализовать этот метод для поддержки пользовательского форматирования значений полей.
В отсутствие такой реализации стандартные типы данных форматируются с использованием форматов по умолчанию.
pField: Поле, значение которого должно быть отформатировано. Тип Field.
Returns: Возвращает строковое представление вычисленного значения поля.
Тип String.

Teigha.DatabaseServices.FieldEvaluator.Initialize(Teigha.DatabaseServices.Field)
Метод инициализирует новое поле.
Метод предназначен для инициализации нового поля.
Вызывается фреймворком поля после задания в поле кода поля и перед вызовом метода Compile().
Notes
Вычислитель может изменить параметры по умолчанию, которые устанавливаются в поле при его создании.
Для каждого поля этот метод вызывается только один раз.
pField: Инициализируемое поле. Тип Field.