HostMgd.EditorInput.PromptSelectionOptions.UnknownInput
Событие возникает, когда пользователь вводит произвольный текст,
не совпадающий с ключевыми словами, в ответ на приглашение выбора объектов.
Событие инициируется при операции выбора объектов — например,
при вызове GetSelection() — если пользователь вводит строку,
которая не распознана как ключевое слово, команда или допустимое значение.
Вместо отклонения ввода, система вызывает это событие, позволяя разработчику
обработать текст программно.
Оно реализуется через делегат SelectionTextInputEventHandler
и предоставляет доступ к:
* введённой строке (Input),
* возможности пометить ввод как обработанный (Handled = true),
* управлению дальнейшим поведением команды.
Example
C#