HostMgd.ApplicationServices.InplaceTextEditor.RemoveHightlight
Метод удаляет подсветку текста в текстовом редакторе.
В текущей версии не реализован.
Метод удаляет подсветку текста в текстовом редакторе.
В текущей версии не реализован.