Teigha.DatabaseServices.DynamicBlockReferencePropertyUnitsType
Данное перечисление определяет единицы измерения свойств динамического блока.
Данное перечисление определяет единицы измерения свойств динамического блока (если имеются).
Клиентское приложение может воспользоваться этой информацией для форматирования свойства в своем пользовательском интерфейсе.