HostMgd.ApplicationServices.XrefFileLock.ConsistencyCheck
По выбранному ID записи таблицы блоков для внешней ссылки
этот метод определяет, является ли файл внешней ссылки все
еще синхронизованым с тем файлом, который использовался во
время загрузки чертежа. Он также определяет, являются ли
любые другие записи таблицы блоков, относящиеся к тому же
самому файлу внешней ссылки, также синхронизированными. Эта
проверка выполняется путем проверки даты/времени файла
внешней ссылки и его размера во время загрузки по сравнению с
этими же его характеристиками, актуальными во время
выполнения метода.