HostMgd.ApplicationServices.PreTranslateMessageEventArgs
Класс PreTranslateMessageEventArgs представляет данные события PreTranslateMessage класса Application.
В текущей версии не реализован.
Класс PreTranslateMessageEventArgs наследует класс System.EventArgs и предоставляет данные события
PreTranslateMessage класса Application, в частности, объект сообщения в формате структуры MSG и флаг состояния события (обработано или нет).
В текущей версии не реализован.

HostMgd.ApplicationServices.PreTranslateMessageEventArgs.Handled
Свойство Handled позволяет указать или проверить, обработано ли событие.
В текущей версии не реализовано.
Свойство Handled позволяет указать или проверить, обработано ли событие.
В текущей версии не реализовано.
Returns: Возвращает true, если событие было обработано.
В противном случае возвращает false.

HostMgd.ApplicationServices.PreTranslateMessageEventArgs.Message
Свойство Message позволяет получить или задать объект сообщения в формате структуры MSG.
В текущей версии не реализовано.
Свойство Message позволяет получить или задать объект сообщения в формате структуры MSG.
В текущей версии не реализовано.
Returns: Возвращает объект сообщения. Тип System.Windows.Interop.MSG.