Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations
Структура SurfaceSurfaceIntersectorConfigurations предназначена для хранения данных о конфигурации каждой из двух пересекающихся поверхностей в окрестности кривой пересечения.
Структура SurfaceSurfaceIntersectorConfigurations предназначена для хранения данных о конфигурации каждой из двух пересекающихся поверхностей в окрестности кривой пересечения.
Notes
Экземпляры этой структуры используются методом Teigha.Geometry.SurfaceSurfaceIntersector.GetIntersectionConfigurations для представления результатов.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true в случае равенства сравниваемых объектов.
В противном случае возвращает false.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.IsEqualTo(Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations)
Метод проверяет равенство данного объекта другой конфигурации пересечения.
Метод проверяет равенство данного объекта другой конфигурации пересечения.
Notes
Условием равенства двух конфигураций пересечения является одновременное выполнение следующих условий:
* Конфигурации для первых поверхностей слева от пересечений равны;
* Конфигурации для первых поверхностей справа от пересечений равны;
* Конфигурации для вторых поверхностей слева от пересечений равны;
* Конфигурации для вторых поверхностей справа от пересечений равны;
* Типы пересечений совпадают;
* Размерности объектов пересечений совпадают.
a: Входная конфигурация пересечения двух поверхностей, с которой сравнивается данный объект. Тип SurfaceSurfaceIntersectorConfigurations.
Returns: Возвращает true, если выполняется условие равенства двух конфигураций пересечения поверхностей.
В противном случае возвращает false.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.!=(Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations,Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations)
Оператор неравенства структуры SurfaceSurfaceIntersectorConfigurations.
Оператор неравенства структуры SurfaceSurfaceIntersectorConfigurations.
Notes
Условием неравенства двух экземпляров данной структуры является невыполнение по крайней мере одного из перечисленных ниже условий:
* Конфигурации для первых поверхностей слева от пересечений равны;
* Конфигурации для первых поверхностей справа от пересечений равны;
* Конфигурации для вторых поверхностей слева от пересечений равны;
* Конфигурации для вторых поверхностей справа от пересечений равны;
* Типы пересечений совпадают;
* Размерности объектов пересечений совпадают.
a: Левый операнд.  Тип SurfaceSurfaceIntersectorConfigurations.
b: Правый операнд. Тип SurfaceSurfaceIntersectorConfigurations.
Returns: Возвращает true, если условие равенства левого и правого операндов не выполняется.
В противном случае возвращает false.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.==(Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations,Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations)
Оператор равенства структуры SurfaceSurfaceIntersectorConfigurations.
Оператор равенства структуры SurfaceSurfaceIntersectorConfigurations.
Notes
Условием равенства двух экземпляров данной структуры является одновременное выполнение всех перечисленных ниже условий:
* Конфигурации для первых поверхностей слева от пересечений равны;
* Конфигурации для первых поверхностей справа от пересечений равны;
* Конфигурации для вторых поверхностей слева от пересечений равны;
* Конфигурации для вторых поверхностей справа от пересечений равны;
* Типы пересечений совпадают;
* Размерности объектов пересечений совпадают.
a: Левый операнд.  Тип SurfaceSurfaceIntersectorConfigurations.
b: Правый операнд. Тип SurfaceSurfaceIntersectorConfigurations.
Returns: Возвращает true, если выполняется условие равенства левого и правого операндов.
В противном случае возвращает false.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Dimension
Свойство Dimension представляет размерность объекта пересечения двух поверхностей.
Свойство Dimension представляет размерность объекта пересечения двух поверхностей (кривая или точка).
Returns: Возвращает размерность объекта пересечения двух поверхностей.
Тип int. В случае точки возвращает 0, в случае кривой 1.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.IntersectionType
Свойство IntersectionType представляет тип пересечения двух поверхностей.
Свойство IntersectionType представляет тип пересечения двух поверхностей (некасательное пересечение, касательное пересечение с сонаправленными нормалями двух поверхностей или касательное пересечение с противонаправленными нормалями двух поверхностей).
Returns: Возвращает тип пересечения двух поверхностей.
Значение из перечисления SurfaceSurfaceIntersectorType.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface1Left
Свойство Surface1Left представляет конфигурацию первой поверхности слева от кривой пересечения.
Свойство Surface1Left представляет конфигурацию первой поверхности слева от кривой пересечения.
Returns: Возвращает конфигурацию первой поверхности слева от кривой пересечения.
Тип SurfaceSurfaceIntersectorConfiguration.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface1Right
Свойство Surface1Right представляет конфигурацию первой поверхности справа от кривой пересечения.
Свойство Surface1Right представляет конфигурацию первой поверхности справа от кривой пересечения.
Returns: Возвращает конфигурацию первой поверхности справа от кривой пересечения.
Тип SurfaceSurfaceIntersectorConfiguration.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface2Left
Свойство Surface2Left представляет конфигурацию второй поверхности слева от кривой пересечения.
Свойство Surface2Left представляет конфигурацию второй поверхности слева от кривой пересечения.
Returns: Возвращает конфигурацию второй поверхности слева от кривой пересечения.
Тип SurfaceSurfaceIntersectorConfiguration.

Teigha.Geometry.SurfaceSurfaceIntersectorConfigurations.Surface2Right
Свойство Surface2Right представляет конфигурацию второй поверхности справа от кривой пересечения.
Свойство Surface2Right представляет конфигурацию второй поверхности справа от кривой пересечения.
Returns: Возвращает конфигурацию второй поверхности справа от кривой пересечения.
Тип SurfaceSurfaceIntersectorConfiguration.