Teigha.DatabaseServices.DxfCode.ViewportSnapPair
Значение: 78. Плоскость изометрии для текущего видового экрана.
Тип: 16-битное целое число.  Допустимые значения:
Описание                         Значение
----------------------           --------
Левая плоскость (по умолчанию)   0
Верхняя плоскость                1
Правая плоскость                 2