HostMgd.EditorInput.PromptKeywordOptionsEventHandler
Делегат предназначен для обработки события, возникающего перед началом ввода ключевого слова,
и позволяет настроить параметры выбора.
Делегат используется как сигнатура метода-обработчика для события PromptingForKeyword,
которое генерируется перед началом интерактивного ввода ключевого слова в редакторе nanoCAD.
Он позволяет разработчику изменять параметры команды ввода — такие как сообщение приглашения,
список доступных ключевых слов и режимы ввода — до того, как пользователь увидит запрос.
Этот делегат применяется при реализации команд, где требуется выбор из ограниченного
набора вариантов — например, "Да/Нет", "Вкл/Выкл", "Сохранить/Отмена".
Он обеспечивает гибкость при настройке интерфейса взаимодействия с пользователем
в зависимости от контекста.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий параметры ввода ключевого слова