Teigha.Geometry.Curve3dCollection.GetEnumerator
Метод предоставляет перечислитель этой коллекции.
Метод предоставляет перечислитель этой коллекции.
Returns: Возвращает перечислитель этой коллекции.
Тип System.Collections.IEnumerator.