Teigha.LayerManager.LayerCollection
Класс LayerCollection представляет в базе данных коллекцию слоев.
Класс LayerCollection представляет в базе данных коллекцию слоев.

Teigha.LayerManager.LayerCollection.Add(Teigha.DatabaseServices.ObjectId)
Метод позволяет добавить в данную коллекцию указанный объект.
Метод позволяет добавить в данную коллекцию объект value, представленный идентификатором ObjectId.
value: Идентификатор добавляемого в коллекцию объекта. Тип ObjectId.

Teigha.LayerManager.LayerCollection.Contains(Teigha.DatabaseServices.ObjectId)
Метод позволяет проверить, содержится ли в коллекции объект с указанным идентификатором объекта.
Метод позволяет проверить, содержится ли в коллекции объект с указанным идентификатором объекта ObjectId.
value: Идентификатор искомого объекта.  Тип ObjectId.
Returns: Возвращает true, если искомый объект содержится в коллекции.
В противном случае возвращает false.

Teigha.LayerManager.LayerCollection.CopyTo(array,System.Int32)
Метод копирует в данную коллекцию объекты из указанного массива.
Метод копирует в данную коллекцию объекты из указанного массива.
array: Входной массив идентификаторов копируемых объектов.  Тип ObjectId[].
index: Индекс в массиве, начиная с которого объекты массива будут копироваться в данную коллекцию.  Тип int.  Индексация элементов в массиве начинается с нуля.

Teigha.LayerManager.LayerCollection.Remove(Teigha.DatabaseServices.ObjectId)
Метод удаляет из данной коллекции указанный объект.
Метод удаляет из данной коллекции объект, представленный идентификатором ObjectId.
value: Идентификатор удаляемого объекта.  Тип ObjectId.

Teigha.LayerManager.LayerCollection.Count
Свойство Count представляет текущее количество объектов в данной коллекции.
Свойство Count представляет текущее количество объектов в данной коллекции.
Returns: Возвращает количество объектов в коллекции.  Тип int.

Teigha.LayerManager.LayerCollection.Item
Свойство Item возвращает элемент коллекции с указанным индексом.
Свойство Item возвращает элемент коллекции с указанным индексом.
index: Индекс искомого элемента коллекции.  Тип int.
Returns: Возвращает идентификатор объекта, хранящегося в коллекции под индексом index.
Тип ObjectId.