Teigha.DatabaseServices.PlotSettingsValidator.GetPlotStyleSheetList
Метод предоставляет коллекцию всех доступных таблиц стилей печати.
Метод предоставляет коллекцию всех доступных таблиц стилей печати.
Эта коллекция в пределах сеанса nanoCAD создается лишь один раз, поэтому в случае каких-либо изменений в таблицах стилей печати вам следует предусмотреть принудительное обновление коллекции.
Returns: Возвращает коллекцию всех доступных таблиц стилей печати.
Тип StringCollection.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод RefreshLists(), чтобы обновить списки стилей и устройств вывода.