Teigha.Geometry.BoundBlock2d.GetMaximumPoint
Метод предоставляет максимальную точку данной граничной рамки.
Метод предоставляет максимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса Point2d, который представляет максимальную точку граничной рамки.