Teigha.DatabaseServices.DataCell
Класс DataCell реализует единообразный подход к представлению следующих типов данных: Boolean, integer, double, char*, Point3d, ObjectId, HardOwnershipId, SoftOwnershipId, HardPointerId и SoftPointerId.
Класс DataCell реализует единообразный подход к представлению следующих типов данных: Boolean, integer, double, char*, Point3d, ObjectId, HardOwnershipId, SoftOwnershipId, HardPointerId и SoftPointerId.
Класс предоставляет полный набор конструкторов, операторов присваивания и приведения, которые упрощают и делают безопасным  использование ячеек DataCell в качестве базового типа.

Teigha.DatabaseServices.DataCell.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DataCell.SetBool(System.Boolean)
Метод устанавливает для этой ячейки логическое значение.
Метод устанавливает для этой ячейки логическое значение, заданное входным аргументом value.
value: Входное значение для ячейки. Тип bool.

Teigha.DatabaseServices.DataCell.SetHardOwnershipId(DatabaseServices.ObjectId)
Метод делает эту ячейку владельцем указанного объекта по жесткой ссылке на идентификатор зависимого объекта.
Метод наделяет данную ячейку правом жесткого владения указанным объектом value.
В ячейке сохраняется идентификатор жесткой ссылки на зависимый объект.
value: Идентификатор зависимого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetHardPointerId(DatabaseServices.ObjectId)
Метод устанавливает для этой ячейки идентификатор жесткой ссылки на указатель.
Метод устанавливает для этой ячейки идентификатор жесткой ссылки на указатель, заданный входным аргументом value.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetInteger(System.Int32)
Метод устанавливает для этой ячейки значение типа int.
Метод устанавливает для этой ячейки значение типа int, заданное входным аргументом value.
value: Входное значение для ячейки. Тип int.

Teigha.DatabaseServices.DataCell.SetObjectId(DatabaseServices.ObjectId)
Метод устанавливает для этой ячейки значение типа ObjectId.
Метод устанавливает для этой ячейки значение типа ObjectId, заданное входным аргументом value.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetPoint(Teigha.Geometry.Point3d)
Метод устанавливает для этой ячейки значение типа Point3d.
Метод устанавливает для этой ячейки значение типа Point3d, заданное входным аргументом value.
value: Входное значение для ячейки. Тип Point3d.

Teigha.DatabaseServices.DataCell.SetSoftOwnershipId(DatabaseServices.ObjectId)
Метод делает ячейку владельцем указанного объекта по мягкой ссылке на идентификатор зависимого объекта.
Метод делает ячейку владельцем указанного объекта по мягкой ссылке на идентификатор зависимого объекта value.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetSoftPointerId(DatabaseServices.ObjectId)
Метод устанавливает для этой ячейки идентификатор мягкой ссылки на указатель на зависимый объект.
Метод устанавливает для этой ячейки идентификатор мягкой ссылки на указатель на зависимый объект, заданный входным аргументом value.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetString(String)
Метод устанавливает для этой ячейки значение типа String.
Метод устанавливает для этой ячейки значение типа String, заданное входным аргументом value.
value: Входное значение для ячейки. Тип String.

Teigha.DatabaseServices.DataCell.SetVector(Teigha.Geometry.Vector3d)
Метод устанавливает для этой ячейки значение типа Vector3d.
Метод устанавливает для этой ячейки значение типа Vector3d, заданное входным аргументом value.
value: Входное значение для ячейки. Тип Vector3d.

Teigha.DatabaseServices.DataCell.CellType
Свойство возвращает тип данных, установленный для этой ячейки.
Свойство возвращает тип данных, установленный для этой ячейки.
Returns: Возвращает значение из перечисления DatabaseServices.CellType.

Teigha.DatabaseServices.DataCell.Value
Свойство возвращает значение, установленное для этой ячейки.
Свойство возвращает значение, установленное для этой ячейки.
Returns: Возвращает значение в ячейке. Тип Object.