Teigha.GraphicsInterface.EdgeData.GetLineTypes
Метод предоставляет массив типов линий, используемых этим объектом.
Метод предоставляет массив идентификаторов объектов LinetypeTableRecord, по одному для каждого ребра в сети или оболочке, с которыми используется данный объект.
Returns: Возвращает массив идентификаторов объектов LinetypeTableRecord.
Тип ObjectId[].
Возвращает пустой массив, если массив идентификаторов типов линий не был задан.