HostMgd.EditorInput.PointInputEventHandler
Делегат PointInputEventHandler предназначен для обработки событий, связанных с интерактивным указанием точки в редакторе nanoCAD.
Делегат PointInputEventHandler определяет тип обработчика для пользовательских событий, связанных с интерактивным указанием точки в редакторе nanoCAD. Параметры события передаются через аргументы sender и e, где
sender представляет объект-инициатор события, а аргумент e определяет контекст события в виде экземпляра класса
HostMgd.EditorInput.PointInputEventArgs. Этот контекст обеспечивает доступ к таким объектам как документ, из которого было выдано событие, режим объектной привязки, указатель на ручку, подсказки и т.п.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип PointInputEventArgs.