Teigha.DatabaseServices.SecurityActions
Данное перечисление определяет связанные с шифрованием операции, которые могут запрашиваться в процессе файлового ввода-вывода.
Данное перечисление определяет связанные с шифрованием операции, которые могут запрашиваться в процессе файлового ввода-вывода.