HostMgd.EditorInput.PromptIntegerResultEventArgs
Класс предоставляет данные для события,
возникающего после завершения интерактивного ввода
целого числа пользователем в редакторе nanoCAD.
Класс наследуется от EventArgs и используется для передачи информации
о результате ввода целого числа в обработчик событий.
Он применяется совместно с событием PromptedForInteger,
которое генерируется после вызова метода GetInteger()
или других команд, где требуется ввод числового значения типа int.
Этот класс содержит:
* Value — целочисленное значение, введённое пользователем.
* Status — статус выполнения операции (OK, Cancel, Error и др.).
* StringResult — строковое представление введённого значения или команды.
Он позволяет разработчикам надстроек nanoCAD реагировать на результат ввода,
проверять допустимость значения и выполнять дальнейшие действия
в зависимости от введённых данных.
Example
C#

HostMgd.EditorInput.PromptIntegerResultEventArgs.Result
Свойство предоставляет доступ к результату операции ввода целого числа,
включая статус и значение, введённое пользователем.
Свойство возвращает объект типа PromptIntegerResult,
который содержит данные о завершении интерактивного ввода
целого числа — например, после вызова метода GetInteger()
или при обработке события PromptedForInteger.
Оно позволяет получить:
* Value — введённое пользователем целое число.
* Status — статус выполнения (OK, Cancel, Error и др.).
* InputString — строковое представление введённого значения или команды.
Это свойство используется для анализа результата ввода,
проверки допустимости числа и выполнения дальнейших действий
на основе введённых данных. Доступно только для чтения и
обновляется автоматически при завершении операции ввода.
Returns: Возвращает экземпляр класса PromptIntegerResult, содержащий:
* Value — значение типа int, если ввод был успешным.
* Status — статус завершения операции (например, PromptStatus.OK, если пользователь ввёл корректное число, или PromptStatus.Cancel, если операция была прервана).
* StringResult — строковое значение, если пользователь ввёл текст вместо числа или использовал клавишу Esc.
Если операция не завершена успешно, результат может содержать null или нулевое значение.
Example
C#