Teigha.DatabaseServices.MlineJustification
Данное перечисление определяет типы расположения мультилинии относительно курсора, которые может иметь объект Mline.
Данное перечисление определяет типы расположения мультилинии относительно курсора, которые может иметь объект Mline.