Teigha.GraphicsInterface.Context
Класс Context определяет общие операции и свойства, используемые платформой в процессе векторизации.
Класс Context определяет общие операции и свойства, используемые платформой в процессе векторизации.
Большинство виртуальных методов и свойств в этом классе являются пустыми и служат исключительно для определения интерфейса.
Notes
Контекст можно рассматривать как корневой объект регенерации.
Единственный экземпляр класса, производного от Context, служит опорным объектом в процессе конкретной регенерации.
Он доступен как через WorldDraw, так и через ViewportDraw и, следовательно, доступен клиенту всегда.
Гарантируется, что экземпляр ViewportDraw, переданный в ViewportDraw(), вернет тот же экземпляр Context, что и экземпляр WorldDraw, переданный в предыдущем вызове WorldDraw().

Teigha.GraphicsInterface.Context.ByBlockLineWeight
Свойство ByBlockLineWeight представляет толщину линии, если предписано использовать настройку по блоку (ByBlock).
Свойство ByBlockLineWeight представляет толщину линии, если предписано использовать настройку по блоку (ByBlock).
Это не включает никакие изменения, вызываемые в конвейере печати любым активным стилем печати.
Notes
В текущей реализации не используется, но сохранено для совместимости.
Returns: Возвращает толщину линии.  Тип DatabaseServices.LineWeight.
По умолчанию это значение DatabaseServices.LineWeight.LineWeight000.

Teigha.GraphicsInterface.Context.ByBlockPlotStyleNameId
Свойство ByBlockPlotStyleNameId представляет стиль печати, который будет использоваться, если указан параметр ByBlock.
Свойство ByBlockPlotStyleNameId представляет стиль печати, который будет использоваться, если указан параметр ByBlock.
Notes
В текущей реализации не используется, но сохранено для совместимости.
Returns: Возвращает идентификатор объекта стиля печати. Тип DatabaseServices.ObjectId.
По умолчанию возвращает Null.

Teigha.GraphicsInterface.Context.Database
Свойство Database представляет базу данных, которая векторизуется в данный момент.
Свойство Database представляет базу данных, которая векторизуется в данный момент.
Notes
Всякая регенерация связана определенной базой данных, и если вашему объекту с какой-либо целью требуется обращение к ней, следует использовать базу данных, возвращаемую этим свойством. Полученный указатель гарантированно не равен NULL.
Returns: Возвращает текущую базу данных, которая в данный момент векторизуется.
Тип DatabaseServices.Database.

Teigha.GraphicsInterface.Context.EffectiveColor
Свойство EffectiveColor представляет цвет, который будет использоваться для отрисовки примитива.
Свойство EffectiveColor представляет цвет, который будет использоваться для отрисовки примитива. Учтены настройки по слоям и по блоку.  Не исключает изменения, которые в конвейере печати может привнести любой активный стиль печати.
Notes
В текущей реализации не используется, но сохранено для совместимости.
Returns: Возвращает цвет отрисовки примитива.
Тип Colors.EntityColor.

Teigha.GraphicsInterface.Context.IsBoundaryClipping
Свойство IsBoundaryClipping позволяет проверить, активна ли в данный момент обрезка по границам.
Свойство IsBoundaryClipping позволяет проверить, активна ли в данный момент обрезка отображаемых примитивов по границам.
Returns: Возвращает true, если обрезка примитивов по границам активна.
В противном случае возвращает false.

Teigha.GraphicsInterface.Context.IsNesting
Свойство IsNesting позволяет проверить, является ли отображаемый объект вложенным (т.е. частью составного объекта).
Свойство IsNesting позволяет проверить, является ли отображаемый объект вложенным (т.е. частью составного объекта).
Returns: Возвращает true, если регенерируемый объект является частью составного объекта, например, входит в блок.
Если объект вставлен в пространство модели непосредственно, возвращаемое значение будет равно false.

Teigha.GraphicsInterface.Context.IsPlotGeneration
Свойство IsPlotGeneration позволяет проверить, используется ли текущая регенерация для вывода на печать (на бумагу).
Свойство IsPlotGeneration позволяет проверить, используется ли текущая регенерация для вывода на печать (на бумагу).
Returns: Возвращает true, если текущая регенерация предназначена для получения твердой копии.
В противном случае возвращает false.

Teigha.GraphicsInterface.Context.IsPostScriptOut
Свойство IsPostScriptOut позволяет проверить, используется ли регенерация для вывода PostScript.
Свойство IsPostScriptOut позволяет проверить, используется ли регенерация для вывода PostScript.
Returns: Возвращает true, если регенерация используется для вывода PostScript.
В противном случае возвращает false.

Teigha.GraphicsInterface.Context.SupportsTrueTypeText
Свойство SupportsTrueTypeText позволяет определить, поддерживает ли текущая реализация отрисовку шрифтов TrueType.
Свойство SupportsTrueTypeText позволяет определить, поддерживает ли текущая реализация отрисовку шрифтов TrueType.
Returns: Возвращает true, если текущая реализация поддерживает шрифты TrueType.
В противном случае возвращает false.
Notes
Возвращаемое значение false означает, что устройство будет использовать штриховой шрифт (stroke based font) для любого текста, указанного шрифтом TrueType.