Teigha.BoundaryRepresentation.EdgeLoopCollection
Класс EdgeLoopCollection представляет коллекцию циклов, соответствующих ребру BREP.
Класс EdgeLoopCollection представляет коллекцию циклов, соответствующих ребру BREP.