Teigha.Runtime.Services
Класс Services предназначен для представления доступа к службам во время выполнения.
Класс Services предназначен для представления доступа к службам во время выполнения.

Teigha.Runtime.Services.#ctor
Конструктор класса Services.
Обеспечивает инициализацию вновь созданного объекта.
Конструктор класса Services.
Обеспечивает инициализацию вновь созданного объекта.

Teigha.Runtime.Services.AccessFileRead(String)
Метод позволяет проверить, доступен ли указанный файл на чтение.
Метод позволяет проверить, доступен ли указанный файл для операций чтения.
fileName: Имя проверяемого файла. Тип String.
Returns: Возвращает true, если файл fileName доступен на чтение.
В противном случае возвращает false.

Teigha.Runtime.Services.odActivate(String,String)
Метод переопределяет данные активации указанного пользователя.
Метод переопределяет данные активации указанного пользователя.
Notes
Данные активации берутся из соответствующего файла активации: OdActivationInfo без расширения для проектов C++ или соответствующих расширений для других проектов, например OdActivationInfo.cs.
В случае пробных версий программного обеспечения данные активации не требуются.
userInfo: Первая строка в соответствующем файле активации. Тип String.
userSignature: Первая строка в соответствующем файле активации. Тип String.