Teigha.DatabaseServices.EraseFlags
Перечисление EraseFlags представляет флаги, используемые при удалении пустых объектов.
Перечисление EraseFlags представляет флаги, используемые при удалении пустых объектов.