Teigha.DatabaseServices.FormattedTableData
Класс реализует форматирование ячеек, строк и столбцов, чтобы обеспечить желаемое отображение таблицы.
Класс является производным от класса LinkedTableData и реализует форматирование ячеек, строк и столбцов, чтобы обеспечить желаемое отображение таблицы.

Teigha.DatabaseServices.FormattedTableData.#ctor
Конструктор по умолчанию класса FormattedTableData.
Конструктор по умолчанию класса FormattedTableData.

Teigha.DatabaseServices.FormattedTableData.GetAlignment(System.Int32,System.Int32)
Метод позволяет получить выравнивание содержимого ячейки.
Метод позволяет получить выравнивание содержимого ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и быть меньше, чем количество строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и быть меньше, чем количество столбцов в таблице.
Returns: Возвращает выравнивание содержимого ячейки как значение из перечисления CellAlignment.

Teigha.DatabaseServices.FormattedTableData.GetBackgroundColor(System.Int32,System.Int32)
Метод возвращает цвет фона ячейки, строки или столбца.
Метод возвращает цвет фона ячейки, строки или столбца.
Чтобы указать ячейку, следует передать действительные индексы строки и столбца.
Чтобы указать строку, следует передать действительный индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и  -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
Returns: Возвращает цвет фона ячейки, строки или столбца. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.FormattedTableData.GetContentColor(System.Int32,System.Int32)
Метод позволяет получить цвет содержимого указанной ячейки.
Метод позволяет получить цвет содержимого указанной ячейки.
row: Индекс строки. Тип int.
column: Индекс столбца. Тип int.
Returns: Возвращает цвет содержимого ячейки. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.FormattedTableData.GetGridColor(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить цвет сетки в ячейке, строке или столбце.
Метод позволяет получить цвет сетки в ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления GridLineType. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора OR.
Returns: Возвращает цвет линий сетки ячейки. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.FormattedTableData.GetGridLinetype(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить тип линий сетки в ячейке, строке или столбце.
Метод позволяет получить тип линий сетки в ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления GridLineType. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора OR.
Returns: Возвращает идентификатор типа линий. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.FormattedTableData.GetGridLineWeight(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для получения толщины линий сетки в ячейке, строке или столбце.
Метод предназначен для получения толщины линий сетки в ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления GridLineType. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора OR.
Returns: Возвращает толщину (вес) линий из перечисления LineWeight.

Teigha.DatabaseServices.FormattedTableData.GetGridVisibility(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет определить видимость линий сетки в ячейке, строке или столбце.
Метод позволяет определить видимость линий сетки в ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления GridLineType.  Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
Returns: Возвращает видимость линий сетки как значение из перечисления Visibility.

Teigha.DatabaseServices.FormattedTableData.GetMargin(System.Int32,System.Int32,Teigha.DatabaseServices.CellMargins)
Метод предназначен для получения размера полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
Метод предназначен для получения размера полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
margin: Тип поля из перечисления CellMargins.
Returns: Возвращает размер полей. Тип double.

Teigha.DatabaseServices.FormattedTableData.GetMergeRange(System.Int32,System.Int32)
Метод позволяет определить диапазон слияния, которому принадлежит указанная ячейка.
Метод позволяет определить диапазон слияния, которому принадлежит указанная ячейка.
Возвращаемый диапазон будет недействительным, если ячейка не входит в диапазон слияния.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает диапазон ячеек. Тип CellRange.

Teigha.DatabaseServices.FormattedTableData.GetOverride(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить переопределения для сетки в заданной строке, столбце или ячейке.
Метод позволяет получить переопределения для сетки в заданной строке, столбце или ячейке.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления GridLineType.  Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
Returns: Возвращает выявленные переопределения у линий сетки как комбинацию битовых полей из перечисления GridProperties.

Teigha.DatabaseServices.FormattedTableData.GetOverride(System.Int32,System.Int32,System.Int32)
Метод позволяет получить переопределения ячейки, строки, столбца или содержимого ячейки.
Метод позволяет получить переопределения ячейки, строки, столбца или содержимого ячейки.
Чтобы указать элемент содержимого ячейки, следует задать допустимые индексы строки, столбца и элемента содержимого ячейки.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца, а также -1 в качестве индекса элемента содержимого ячейки.
Чтобы указать строку, следует задать допустимый индекс строки и -1 для индексов столбца и элемента содержимого ячейки.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 для индексов строки и элемента содержимого ячейки.
row: Индекс строки. Тип int. Индекс может равняться -1.
column: Индекс столбца. Тип int. Индекс может равняться -1.
content: Индекс элемента содержимого ячейки. Тип int. Индекс может равняться -1.
Returns: Возвращает выявленные переопределения у линий сетки как комбинацию битовых полей из перечисления GridProperties.

Teigha.DatabaseServices.FormattedTableData.GetRotation(System.Int32,System.Int32)
Метод позволяет определить угол поворота содержимого указанной ячейки.
Метод позволяет определить угол поворота содержимого указанной ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает угол поворота в радианах. Тип double.

Teigha.DatabaseServices.FormattedTableData.GetScale(System.Int32,System.Int32)
Метод позволяет определить масштаб элементов содержимого указанной ячейки.
Метод позволяет определить масштаб элементов содержимого указанной ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает масштаб содержимого ячейки. Тип double.

Teigha.DatabaseServices.FormattedTableData.GetTextHeight(System.Int32,System.Int32)
Метод предназначен для получения высоты текста в указанной ячейке.
Метод предназначен для получения высоты текста в указанной ячейке.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает высоту текста. Тип double.

Teigha.DatabaseServices.FormattedTableData.GetTextStyle(System.Int32,System.Int32)
Метод предназначен для получения текстового стиля указанной ячейки.
Метод предназначен для получения текстового стиля указанной ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.FormattedTableData.IsFormatEditable(System.Int32,System.Int32)
Метод позволяет определить, допускается ли изменение формата ячейки.
Метод позволяет определить, допускается ли изменение формата ячейки.
Учитывая, что семантика редактируемой ячейки может изменяться по мере добавления новых состояний, для проверки редактируемости ячеек рекомендуется использовать данный метод вместо прямого обращения к cellState.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает true, если изменение формата ячейки возможно. В противном случае возвращает false.

Teigha.DatabaseServices.FormattedTableData.IsMerged(System.Int32,System.Int32)
Метод позволяет определить, принадлежит ли данная ячейка диапазону слияния ячеек.
Метод позволяет определить, принадлежит ли данная ячейка диапазону слияния ячеек.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает true, если ячейка входит в диапазон слияния.
В противном случае возвращает false.

Teigha.DatabaseServices.FormattedTableData.Merge(Teigha.DatabaseServices.CellRange)
Метод выполняет слияние ячеек в указанном диапазоне.
Метод выполняет слияние ячеек в указанном диапазоне.
range: Диапазон, ячейки которого объединяются. Тип CellRange.

Teigha.DatabaseServices.FormattedTableData.RemoveAllOverrides(System.Int32,System.Int32)
Метод предназначен для удаления всех переопределений в ячейке, строке или столбце.
Метод удаляет все переопределения в ячейке, строке или столбце.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Индекс может равняться -1.
column: Индекс столбца. Тип int. Индекс может равняться -1.

Teigha.DatabaseServices.FormattedTableData.SetAlignment(System.Int32,System.Int32,Teigha.DatabaseServices.CellAlignment)
Метод позволяет задать выравнивание содержимому заданной ячейки.
Метод позволяет задать выравнивание содержимому заданной ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Тип выравнивания как значение из перечисления CellAlignment.

Teigha.DatabaseServices.FormattedTableData.SetBackgroundColor(System.Int32,System.Int32,Colors.Color)
Метод позволяет задать цвет фона в ячейке, строке или столбце.
Метод позволяет задать цвет фона в ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.   Тип int. Индекс может равняться -1.
column: Индекс столбца.  Тип int. Индекс может равняться -1.
value: Новый цвет фона. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.FormattedTableData.SetContentColor(System.Int32,System.Int32,Colors.Color)
Метод позволяет задать цвет содержимого ячейки.
Метод позволяет задать цвет содержимого ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Новый цвет содержимого ячейки. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.FormattedTableData.SetGridColor(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Colors.Color)
Метод позволяет задать цвет сетки в строке, столбце или ячейке.
Метод позволяет задать цвет сетки в строке, столбце или ячейке.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Индекс может равняться -1.
column: Индекс столбца. Тип int. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления GridLineType.  Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
value: Новый цвет сетки. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.FormattedTableData.SetGridLinetype(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,DatabaseServices.ObjectId)
Метод позволяет задать тип линий сетки в строке, столбце или ячейке.
Метод позволяет задать тип линий сетки в строке, столбце или ячейке.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Индекс может равняться -1.
column: Индекс столбца. Тип int. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления GridLineType.  Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
value: Идентификатор нового типа линий сетки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.FormattedTableData.SetGridLineWeight(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.LineWeight)
Метод позволяет задать толщину линий сетки в указанной ячейке, строке или столбце.
Метод позволяет задать толщину линий сетки в указанной ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Индекс может равняться -1.
column: Индекс столбца. Тип int. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления GridLineType.  Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
value: Новая толщина линий сетки. Значение из перечисления LineWeight.

Teigha.DatabaseServices.FormattedTableData.SetGridVisibility(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.Visibility)
Метод позволяет задать видимость линий сетки в указанной ячейке, строке или столбце.
Метод позволяет задать видимость линий сетки в указанной ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Индекс может равняться -1.
column: Индекс столбца. Тип int. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления GridLineType.  Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
value: Видимость линий сетки. Значение из перечисления Visibility.

Teigha.DatabaseServices.FormattedTableData.SetMargin(System.Int32,System.Int32,Teigha.DatabaseServices.CellMargins,System.Double)
Метод позволяет задать размер полей в указанной ячейке, строке или столбце.
Метод позволяет задать размер полей (расстояний между границами и содержимым) в указанной ячейке, строке или столбце.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
margin: Тип поля из перечисления CellMargins.
value: Новый размер полей. Тип double.

Teigha.DatabaseServices.FormattedTableData.SetOverride(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.GridProperties)
Метод позволяет задать переопределения для сетки в указанной строке, столбце или ячейке.
Метод позволяет задать переопределения для сетки в указанной строке, столбце или ячейке.
Чтобы указать ячейку,  следует передать действительные индексы строки и столбца.
Чтобы указать строку,  следует передать действительный индекс строки  и -1 в качестве индекса столбца.
Чтобы указать столбец, следует передать действительный индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int. Может принимать значение -1.
column: Индекс столбца. Тип int. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления GridLineType.  Комбинацию типов линий сетки можно задать с помощью логического оператора OR.
gridProperty: Задаваемое переопределение из перечисления GridProperties.

Teigha.DatabaseServices.FormattedTableData.SetOverride(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.CellProperties)
Метод позволяет задать переопределение для ячейки, строки, столбца или элемента содержимого ячейки.
Метод позволяет задать переопределение для ячейки, строки, столбца или элемента содержимого ячейки.
Чтобы указать элемент содержимого ячейки, следует задать допустимые индексы строки, столбца и элемента содержимого ячейки.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца, а также -1 в качестве индекса элемента содержимого ячейки.
Чтобы указать строку, следует задать допустимый индекс строки и -1 для индексов столбца и элемента содержимого ячейки.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 для индексов строки и элемента содержимого ячейки.
row: Индекс строки. Тип int. Индекс может равняться -1.
column: Индекс столбца. Тип int. Индекс может равняться -1.
content: Индекс элемента содержимого ячейки. Тип int. Индекс может равняться -1.
cellProperty: Задаваемое переопределение из перечисления GridProperties.

Teigha.DatabaseServices.FormattedTableData.SetRotation(System.Int32,System.Int32,System.Double)
Метод позволяет задать поворот содержимого ячейки.
Метод позволяет задать поворот содержимого ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Угол поворота элементов содержимого ячейки (в радианах).  Тип double.

Teigha.DatabaseServices.FormattedTableData.SetScale(System.Int32,System.Int32,System.Double)
Метод позволяет задать масштаб содержимого ячейки.
Метод позволяет задать масштаб содержимого ячейки.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Новый масштаб. Тип double.

Teigha.DatabaseServices.FormattedTableData.SetTextHeight(System.Int32,System.Int32,System.Double)
Метод позволяет задать высоту текста в ячейке.
Метод позволяет задать высоту текста в ячейке.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Новая высота текста. Тип double.

Teigha.DatabaseServices.FormattedTableData.SetTextStyle(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать текстовый стиль в ячейке.
Метод позволяет задать текстовый стиль в ячейке.
row: Индекс строки.  Тип int. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Идентификатор назначаемого текстового стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.FormattedTableData.Unmerge(Teigha.DatabaseServices.CellRange)
Метод предназначен для отмены слияния ячеек в указанном диапазоне.
Метод предназначен для отмены слияния ячеек в указанном диапазоне.
range: Разбиваемый диапазон ячеек.  Тип CellRange.