Teigha.DatabaseServices.AssocArrayPathParameters
Класс предоставляет интерфейс для управления параметрами ассоциативного массива по траекториии.
Класс предоставляет интерфейс для управления параметрами ассоциативного массива по траекториии.

Teigha.DatabaseServices.AssocArrayPathParameters.#ctor
Конструктор класса по умолчанию.
Конструктор класса по умолчанию.

Teigha.DatabaseServices.AssocArrayPathParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double)
Конструктор создает новый объект класса AssocArrayPathParameters с указанными параметрами ассоциативного массива.
Конструктор создает новый объект класса AssocArrayPathParameters с указанными параметрами ассоциативного массива.
itemSpacing: Расстояние между элементами массива. Тип double.
rowSpacing: Расстояние между рядами в массиве. Тип double.
levelSpacing: Расстояние между уровнями в массиве. Тип double.
itemCount: Количество элементов в массиве. Тип int.
rowCount: Количество рядов в массиве. Тип int.
levelCount: Количество уровней в массиве. Тип int.
rowElevation: Приращение отметок между соседними рядами массива. Тип double.

Teigha.DatabaseServices.AssocArrayPathParameters.GetEndOffset([Out] String,[Out] String)
Метод предоставляет смещение для конца массива по траектории.
Метод предоставляет смещение для конца массива по траектории.
Это смещение доступно, только если для распределения элементов массива по траектории используется метод MethodType.Divide.
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
Returns: Возвращает смещение для конца массива по траектории. Тип double.

Teigha.DatabaseServices.AssocArrayPathParameters.GetItemCount([Out] String,[Out] String)
Метод предоставляет количество элементов в массиве по траектории.
Метод предоставляет количество элементов в массиве по траектории.
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
Returns: Возвращает количество элементов в массиве по траектории. Тип int.

Teigha.DatabaseServices.AssocArrayPathParameters.GetItemSpacing([Out] String,[Out] String)
Метод получает расстояние между элементами в массиве по траектории.
Метод получает расстояние между элементами в массиве по траектории.
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
Returns: Возвращает расстояние между элементами в массиве по траектории. Тип double.

Teigha.DatabaseServices.AssocArrayPathParameters.GetStartOffset([Out] String,[Out] String)
Метод получает начальный интервал между элементами в массиве по траектории.
Метод получает начальный интервал между элементами в массиве по траектории.
Если для параметра выражение отсутствует, то после выполнения метода строки expression и evaluatorId остаются пустыми.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
Returns: Возвращает начальный интервал между элементами в массиве по траектории. Тип double.

Teigha.DatabaseServices.AssocArrayPathParameters.SetEndOffset(System.Double,String,String)
Метод задаёт смещение для последнего элемента массива по траектории.
Метод задаёт смещение для последнего элемента массива по траектории.
Это смещение доступно, только если для распределения элементов по траектории используется метод MethodType.Divide.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
offset: Смещение элемента. Тип double. Задаваемое значение должно быть неотрицательным.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayPathParameters.SetItemCount(System.Int32,String,String)
Метод задает количество элементов в массиве по траектории.
Метод задает количество элементов в массиве по траектории.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
count: Количество элементов в массиве. Тип int.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayPathParameters.SetItemSpacing(System.Double,String,String)
Метод задает расстояние между элементами массива по траектории.
Метод задает расстояние между элементами массива по траектории.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
spacing: Расстояние между элементами массива по траектории. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayPathParameters.SetStartOffset(System.Double,String,String)
Метод задаёт смещение первого элемента массива по траектории.
Метод задаёт смещение первого элемента массива по траектории.
Если для параметра выражение отсутствует, строки expression и evaluatorId должны быть пустыми.
offset: Смещение первого элемента массива. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayPathParameters.AlignItems
Свойство обеспечивает доступ к флагу равномерной расстановки элементов массива по траектории.
Свойство обеспечивает доступ к флагу равномерной расстановки элементов массива по траектории.
Returns: Возвращает true, если элементы распределяются по траектории равномерно.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocArrayPathParameters.EndOffset
Свойство обеспечивает доступ к смещению для последнего элемента массива по траектории.
Свойство обеспечивает доступ к смещению для последнего элемента массива по траектории.
Returns: Возвращает смещение элемента. Тип double.

Teigha.DatabaseServices.AssocArrayPathParameters.ItemCount
Свойство обеспечивает доступ к количеству элементов в массиве.
Свойство обеспечивает доступ к количеству элементов в массиве.
Returns: Возвращает количество элементов в массиве. Тип int.

Teigha.DatabaseServices.AssocArrayPathParameters.ItemSpacing
Свойство обеспечивает доступ к расстоянию между элементами массива.
Свойство обеспечивает доступ к расстоянию между элементами массива.
Returns: Возвращает расстояние между элементами массива. Тип double.

Teigha.DatabaseServices.AssocArrayPathParameters.Method
Свойство обеспечивает доступ к текущему методу распределения объектов вдоль траектории.
Свойство обеспечивает доступ к текущему методу распределения объектов вдоль траектории.
Returns: Возвращает метод распределения объектов вдоль траектории как значение из перечисления MethodType.

Teigha.DatabaseServices.AssocArrayPathParameters.Path
Свойство обеспечивает доступ к траектории массива.
Свойство обеспечивает доступ к траектории массива.
Returns: Возвращает траекторию массива. Тип EdgeRef.

Teigha.DatabaseServices.AssocArrayPathParameters.PathDirection
Свойство обеспечивает доступ к флагу направления расстановки элементов массива по траектории.
Свойство обеспечивает доступ к флагу направления расстановки элементов массива по траектории.
Изменение флага меняет направление расстановки на противоположное.
Returns: Возвращает true в случае расстановки элементов от начала к концу траектории.
При обратном направлении возвращает false.

Teigha.DatabaseServices.AssocArrayPathParameters.StartOffset
Свойство обеспечивает доступ к смещению первого элемента массива.
Свойство обеспечивает доступ к смещению первого элемента массива.
Returns: Возвращает смещение первого элемента массива. Тип double.