Teigha.DatabaseServices.FileOpenMode.OpenForReadAndAllShare
Значение: 3.
Файл открывается на чтение, и разрешён совместный доступ к файлу на чтение и запись.
Вызов метода Database.ReadDwgFile() в этом режиме допускает полный доступ к файлу других приложений.
Это позволяет открыть на чтение файл, который уже открыт на запись другим приложением.
Кроме того, вызов метода Database.ReadDwgFile() в этом режиме не блокирует другим приложениям возможность записи в этот файл.