Teigha.Geometry.NurbCurve3d.GetParametersOfC1Discontinuity
Метод предоставляет значения параметра всех точек сплайна с нарушенной C1 непрерывностью (неравные касательные векторы слева и справа от точки).
Метод предоставляет значения параметра всех точек сплайна с нарушенной C1 непрерывностью.
В таких точках касательные векторы слева и справа от точки хотя и коллинеарны, но отличаются по модулю.
Этот метод вызывает NurbCurve3d.GetParametersOfC1Discontinuity(Tolerance tolerance) с точностью, равной  на Tolerance.Global.
Returns: Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью.
Тип DoubleCollection.