Teigha.DatabaseServices.LayerStateMasks
Перечисление LayerStateMasks определяет биты, используемые для указания атрибутов слоя.
Перечисление LayerStateMasks определяет биты, используемые для указания атрибутов слоя.