Teigha.Geometry.Matrix3dBuilder
Класс Matrix3dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix3d, который является неизменяемым типом.
Класс Matrix3dBuilder используется для создания экземпляров класса Teigha.Geometry.Matrix3d, который является неизменяемым типом.

Teigha.Geometry.Matrix3dBuilder.#ctor
Конструктор по умолчанию класса Matrix3dBuilder.
Конструктор по умолчанию класса Matrix3dBuilder.

Teigha.Geometry.Matrix3dBuilder.#ctor(Teigha.Geometry.Matrix3d)
Конструктор класса Matrix3dBuilder.
Создает новый экземпляр класса на основе указанной матрицы.
Конструктор класса Matrix3dBuilder.
Создает новый экземпляр класса на основе указанной матрицы.
value: Входная матрица, на основе которой создается новый экземпляр класса. Тип Matrix3d.

Teigha.Geometry.Matrix3dBuilder.ElementAt
Свойство ElementAt представляет элемент матрицы с указанными индексами строки и столбца.
Свойство ElementAt представляет элемент матрицы с указанными индексами строки и столбца.
i: Индекс строки.  Тип int.
j: Индекс столбца. Тип int.
Returns: Возвращает элемент матрицы с указанными индексами строки и столбца.
Тип double.