Teigha.DatabaseServices.ModelerFlavor
Данное перечисление определяет возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
Данное перечисление определяет возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.