Teigha.Geometry.Point3dCollection.GetEnumerator
Метод предоставляет перечислитель для этой коллекции точек.
Метод предоставляет перечислитель для этой коллекции точек.
Returns: Возвращает перечислитель. Тип System.Collections.IEnumerator.