Teigha.DatabaseServices.AnnotationScale
Данный класс представляет один единственный масштаб аннотаций, определенный в чертеже как контекст объекта.
Данный класс представляет один единственный масштаб аннотаций, определенный в чертеже как контекст объекта.
Объекты класса можно получить из коллекции контекстов AnnotationScale.

Teigha.DatabaseServices.AnnotationScale.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.AnnotationScale.CollectionName
Свойство возвращает имя коллекции масштабов аннотаций.
Свойство возвращает имя коллекции масштабов аннотаций.
Returns: Возвращает имя коллекции, тип String.

Teigha.DatabaseServices.AnnotationScale.DrawingUnits
Свойство предоставляет доступ к единицам измерения в пространстве модели, которые используются в масштабе аннотаций.
Свойство предоставляет доступ к единицам измерения в пространстве модели, которые используются в масштабе аннотаций.
Returns: Возвращает величину типа double.

Teigha.DatabaseServices.AnnotationScale.IsTemporaryScale
Данное свойство позволяет установить, является ли масштаб аннотаций временно сохраненным в чертеже.
Данное свойство позволяет установить, является ли масштаб аннотаций временно сохраненным в чертеже.
Returns: Возвращает true, если масштаб в чертеже является временным, и false в противном случае.

Teigha.DatabaseServices.AnnotationScale.Name
Доступ к имени масштаба аннотаций. Уникальность таких имен не гарантируется.
Доступ к имени масштаба аннотаций. Уникальность имен масштабов аннотаций не гарантируется.
Returns: Возвращает имя масштаба аннотаций. Тип String.

Teigha.DatabaseServices.AnnotationScale.PaperUnits
Свойство предоставляет доступ к единицам измерения в пространстве листа, которые используются в масштабе аннотаций.
Свойство предоставляет доступ к единицам измерения в пространстве листа, которые используются в масштабе аннотаций.
Returns: Возвращает величину единицы, тип double.

Teigha.DatabaseServices.AnnotationScale.Scale
Свойство предоставляет значение масштаба аннотаций.
Свойство предоставляет значение масштаба аннотаций.
Returns: Возвращает значение масштаба аннотаций. Тип double.

Teigha.DatabaseServices.AnnotationScale.UniqueIdentifier
Свойство предоставляет доступ к уникальному идентификатору масштаба аннотаций.
Свойство предоставляет доступ к уникальному идентификатору масштаба аннотаций.
Returns: Возвращает указатель на масштаб аннотаций. Тип IntPtr.