Teigha.Runtime.CommandFlags.UsePickSet
Значение: 2.
При извлечении набора объектов, выбранных перед запуском команды (набор pickfirst), этот набор в nanoCAD очищается.
Команда может извлечь набор pickfirst с помощью функций NRX ncedSSSetFirst() или ncedSSGet("I.").
Команда может задать набор pickfirst с помощью ncedSSSetFirst(), но он остается заданным только до завершения команды.
Команда не может извлекать или задавать ручки.