Teigha.DatabaseServices.LinetypeTable
Класс представляет таблицу символов для записей
LinetypeTableRecord.
Класс представляет таблицу символов для записей
LinetypeTableRecord, которая соответствует типам линий внутри
чертежа.