Teigha.GraphicsInterface.ImageBGRA32
Класс ImageBGRA32 представляет изображение с параметрами цвета в формате RGBA (красный, зелёный, синий, альфа-канал).
Класс ImageBGRA32 определяет изображение в формате RGBA, который представляет цвета, используя целочисленные значения красной, зеленой и синей компонент, а также альфа-канала, задающего непрозрачность.

Teigha.GraphicsInterface.ImageBGRA32.#ctor
Конструктор по умолчанию класса ImageBGRA32.
Конструктор по умолчанию класса ImageBGRA32.
Создает экземпляр класса, который представляет изображение с нулевой шириной и высотой, без базового изображения.

Teigha.GraphicsInterface.ImageBGRA32.#ctor(unsigned int,unsigned int,IntPtr)
Конструктор класса ImageBGRA32.
Создает экземпляр класса с указанным базовым изображением и переданными целочисленными размерами.
Конструктор класса ImageBGRA32.
Создает экземпляр класса с указанным базовым изображением и переданными целочисленными размерами.
width: Ширина изображения. Тип unsigned int.
height: Высота изображения. Тип unsigned int.
imageData: Указатель на буфер изображения. Тип IntPtr.

Teigha.GraphicsInterface.ImageBGRA32.Height
Свойство Height предоставляет доступ к высоте изображения.
Свойство Height предоставляет доступ к высоте изображения.
Returns: Возвращает высоту изображения.
Тип int.

Teigha.GraphicsInterface.ImageBGRA32.Image
Свойство Image предоставляет доступ к буферу изображения.
Свойство Image предоставляет доступ к буферу изображения.
Returns: Возвращает указатель на буфер изображения.
Тип IntPtr.

Teigha.GraphicsInterface.ImageBGRA32.Width
Свойство Width предоставляет доступ к ширине изображения.
Свойство Width предоставляет доступ к ширине изображения.
Returns: Возвращает ширину изображения.
Тип int.