Teigha.BoundaryRepresentation.EnumeratorBase.MoveNext
Этот метод осуществляет переход траверсера вперед к следующему элементу.
Этот метод осуществляет переход траверсера вперед к следующему элементу.
Returns: Возвращает true, если переход выполнен успешно.
В противном случае возвращает false.