Teigha.DatabaseServices.DBDictionaryEntry.ToString
Возвращает строковое представление данного объекта в виде экземпляра String.
Подробности см. в документации Microsoft .NET API.
Возвращает строковое представление данного объекта в виде экземпляра String.
Подробности см. в документации Microsoft .NET API.