HostMgd.PlottingServices.EndDocumentEventArgs
Класс EndDocumentEventArgs инкапсулирует информацию, относящуюся к выводу документа на печать, которая необходима для события PlotReactorManager.EndDocument.
Класс EndDocumentEventArgs инкапсулирует информацию, относящуюся к выводу документа на печать,
которая необходима для события PlotReactorManager.EndDocument.
Эта информация включает состояние флага PlotCancelStatus и
используется делегатом HostMgd.PlottingServices.EndDocumentEventHandler.

HostMgd.PlottingServices.EndDocumentEventArgs.#ctor(HostMgd.PlottingServices.PlotCancelStatus)
Конструктор класса EndDocumentEventArgs.
Создает экземпляр класса с указанным статусом PlotCancelStatus.
Конструктор класса EndDocumentEventArgs.
Создает экземпляр класса с заданным состоянием статуса отмены печати PlotCancelStatus.
status: Входное значение статуса отмены печати.

HostMgd.PlottingServices.EndDocumentEventArgs.PlotCancelStatus
Свойство PlotCancelStatus возвращает код из перечисления PlotCancelStatus, определяющий состояние отмены печати документа.
Свойство PlotCancelStatus возвращает код из перечисления PlotCancelStatus, определяющий состояние отмены печати документа.
Returns: Возвращает состояние отмены печати документа как значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.

HostMgd.PlottingServices.EndDocumentEventArgs.Status
Свойство Status возвращает текущий статус отмены печати документа.
Свойство Status возвращает текущий статус отмены печати документа
как значение из перечисления HostMgd.PlottingServices.PlotCancelStatus.
Returns: Возвращает текущий статус. Перечисление HostMgd.PlottingServices.PlotCancelStatus.