Teigha.DatabaseServices.DynamicBlockReferenceProperty.GetAllowedValues
Метод позволяет получить массив допустимых значений для данного свойства динамического блока.
Метод позволяет получить массив допустимых значений для данного свойства динамического блока.
Returns: Возвращает массив допустимых значений.  Тип Object[].