Teigha.DatabaseServices.Entity.ExplodeGeometryToOwnerSpace
Метод разбивает этот объект на набор более простых объектов и добавляет их в блок-владелец исходного объекта.
Метод разбивает объект на более простые подобъекты и добавляет их в тот же блок (BlockTableRecord), которому принадлежит исходный объект.
Созданные объекты могут являться или не являться резидентами базы данных в зависимости от владельца блока исходного объекта.
Если запись таблицы блоков/блок является резидентом базы данных, то созданные объекты также будут резидентами базы данных.
Если запись таблицы блоков не является резидентом базы данных, то созданные объекты также не будут резидентами базы данных.