Teigha.Runtime.CommandFlags
Данное перечисление определяет значения, которые могут быть переданы как аргумент commandFlags функции NRX NcEdCommandStack.addCommand().  В .NET API nanoCAD эти значения могут быть переданы как аргумент flags в метод Teigha.Runtime.CommandMethodAttribute().