HostMgd.PlottingServices.PreviewEndPlotInfo
Класс PreviewEndPlotInfo представляет результаты предварительного просмотра операции вывода на печать.
Не реализован.
Класс PreviewEndPlotInfo представляет результаты предварительного просмотра операции вывода на печать.
Эти результаты обновляются после успешного завершения метода PlotEngine.EndPlot().
Состояние предварительного просмотра отражается в свойстве Status значениями из перечисления PreviewEndPlotStatus.
В текущей версии не реализован.

HostMgd.PlottingServices.PreviewEndPlotInfo.#ctor
Конструктор по умолчанию класса PreviewEndPlotInfo.
Не реализован.
Конструктор по умолчанию класса PreviewEndPlotInfo.
Не реализован.

HostMgd.PlottingServices.PreviewEndPlotInfo.Status
Свойство Status возвращает текущее состояние операции предварительного просмотра.
Не реализовано.
Свойство Status возвращает текущее состояние операции предварительного просмотра.
В текущей версии не реализовано.
Returns: Возвращает состояние операции предварительного просмотра.
Перечисление HostMgd.PlottingServices.PreviewEndPlotStatus.