HostMgd.EditorInput.PromptStringResultEventHandler
Делегат предназначен для обработки событий, возникающих после завершения
интерактивного ввода строки или ключевого слова пользователем в редакторе nanoCAD.
Делегат используется как тип обработчика событий для операций ввода строковых данных
— таких как методы GetString() или события PromptedForKeyword.
Он передаёт контекст события через параметры sender и e, где e содержит:
* Value — строку, введённую пользователем или выбранную из списка ключевых слов.
* Status — статус завершения (OK, Cancel, Error и др.).
* StringResult — исходная строка, введённая пользователем (если отличается от значения выбора).
Этот делегат применяется при разработке плагинов, где требуется обрабатывать ввод текста
или выбор ключевых слов, например: "Да", "Нет", "Отмена" и другие.
sender: Источник события, обычно представляющий текущий экземпляр редактора (Editor),
e: Объект, содержащий данные о результате ввода