Teigha.DbConstraints.Exception
Класс Exception представляет контейнер для значений ошибок ErrorStatus.
Класс Exception представляет контейнер для значений ошибок ErrorStatus.

Teigha.DbConstraints.Exception.#ctor
Конструктор по умолчанию класса Exception.
Конструктор по умолчанию класса Exception.

Teigha.DbConstraints.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus)
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки.
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки.
es: Входной статус ошибки.

Teigha.DbConstraints.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String)
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки и с указанным сообщением.
Конструктор класса Exception. Создает экземпляр класса для указанного статуса ошибки и с указанным сообщением.
es: Входной статус ошибки.       Тип ErrorStatus.
message: Входное сообщение об ошибке. Тип String.

Teigha.DbConstraints.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String,Teigha.BoundaryRepresentation.Exception)
Конструктор класса Exception.
Создает экземпляр класса с указанными статусом ошибки, сообщением об ошибке и с внутренним исключением.
Конструктор класса Exception.
Создает экземпляр класса с указанными статусом ошибки, сообщением об ошибке и с внутренним исключением.
es: Входной статус ошибки.         Тип ErrorStatus.
message: Входное сообщение об ошибке.   Тип String.
innerException: Входное внутреннее исключение. Тип Exception.

Teigha.DbConstraints.Exception.#ctor(SerializationInfo,StreamingContext)
Конструктор класса Exception.
Создает исключение, используя указанную информацию о сериализации и потоковом контексте.
Конструктор класса Exception.
Создает исключение, используя указанную информацию о сериализации и потоковом контексте.
info: Входная информация о сериализации, которая используется для инициализации статуса ошибки.  Тип SerializationInfo.
context: Входной контекст сериализованного потока, содержит контекстную информацию об источнике или получателе. Тип StreamingContext.

Teigha.DbConstraints.Exception.GetObjectData(SerializationInfo,StreamingContext)
Метод предназначен для извлечения данных об исключениях.
Метод предназначен для извлечения данных об исключениях.
info: Выходная информация о сериализации, которая используется для инициализации статуса ошибки.  Тип SerializationInfo.
context: Выходной контекст сериализованного потока, содержит контекстную информацию об источнике или получателе. Тип StreamingContext.

Teigha.DbConstraints.Exception.ErrorStatus
Свойство ErrorStatus предоставляет доступ к текущему статусу ошибки.
Свойство ErrorStatus предоставляет доступ к текущему статусу ошибки.
Returns: Возвращает статус ошибки.  Тип ErrorStatus.