Teigha.DatabaseServices.Row
Класс Row представляет строку ячеек таблицы.
Класс Row представляет строку ячеек таблицы.

Teigha.DatabaseServices.Row.Height
Свойство Height представляет высоту строки.
Свойство Height представляет высоту данной строки.
Returns: Возвращает высоту строки.
Тип double.

Teigha.DatabaseServices.Row.MinimumHeight
Свойство MinimumHeight представляет минимальную высоту строки.
Свойство MinimumHeight представляет минимально допустимую высоту данной строки.
Returns: Возвращает минимальную высоту строки.
Тип double.