Teigha.BoundaryRepresentation.BrepEntity
Класс BrepEntity является базовым интерфейсным классом для топологических объектов и определяет их общий функционал.
Класс BrepEntity является базовым интерфейсным классом для топологических объектов.
Этот класс определяет общий для объектов топологии функционал, но его объекты непосредственно не создаются, поскольку сами по себе не имеют смысла.
Он является производным от RXObject для предоставления полнофункциональной проверки типов во время выполнения для всех производных топологических классов.
Класс BrepEntity формирует агрегированные коллекции объектов производных классов для целей хранения и извлечения из массива и объявляет указатели на топологические объекты, тип подобъектов которых не может быть известен до вызова метода.

Teigha.BoundaryRepresentation.BrepEntity.Equals(Object)
Метод предназначен для проверки равенства двух объектов.
Метод предназначен для проверки равенства двух объектов.
Два объекта BrepEntity эквивалентны тогда и только тогда, когда они оба не равны NULL и имеют одинаковый путь подобъекта.
obj: Объект, который сравнивается с данным объектом.
Returns: Возвращает true, если оба объекта можно считать равными.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.BrepEntity.GetLineContainment(Geometry.LinearEntity3d,System.Int32)
Метод позволяет проверить, проходит ли указанная линия в пределах или вне пределов топологической границы данного объекта.
В текущей версии не реализован.
Метод позволяет проверить, проходит ли указанная линия в пределах или вне пределов топологической границы данного объекта.
Линия может быть либо линейным сегментом, либо лучом, либо бесконечной линией, приведенной к типу LinearEntity3d.
Массив попаданий отражает сегментацию (разбиение) линии на участки, которые оказались в пределах топологической границы данного объекта.
В массиве сохраняются начальные или конечные точки линейных сегментов и конечные точки лучей.
Если линия оказывается полностью снаружи, возвращается нулевой массив попаданий.
Notes
Метод в текущей версии платформы не реализован.
line: Линия, проверяемая на пересечения с топологической границей данного объекта.  Тип Geometry.LinearEntity3d.
iNumHitsWanted: Максимальное значение пересечений границы при проверке.  Тип int.
Returns: Возвращает массив попаданий линии в границу объекта.  Тип Hit[].

Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double)
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с учетом заданной плотности материала. Точность вычислений определяется глобальными настройками.
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с полной цепочкой преобразований из пути подобъекта, применяемых там, где это уместно. Используется указанная плотность density.
Требуемая и достигаемая точности определяются глобальными настройками.
Notes
Массо-центровочные характеристики определены лишь для тех объектов, для которых определено свойство объема.
density: Входная расчетная плотность для данного объекта.  Тип double.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип MassProperties.

Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double,System.Double)
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с учетом заданной плотности материала и требуемой точности вычислений.
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с полной цепочкой преобразований из пути подобъекта, применяемых там, где это уместно. Используются заданные плотность density и точность вычислений tolRequired.
Notes
Массо-центровочные характеристики определены лишь для тех объектов, для которых определено свойство объема.
density: Входная расчетная плотность для данного объекта.  Тип double.
tolRequired: Входная требуемая точность вычислений.            Тип double.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип MassProperties.

Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double,System.Double,[Out] double%)
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с учетом указанных параметров. Метод возвращает также фактически достигнутую точность вычислений массовых свойств.
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с полной цепочкой преобразований из пути подобъекта, применяемых там, где это уместно. Используются плотность density и требуемая точность вычислений tolRequired.
Метод возвращает также фактически достигнутую точность вычислений tolAchieved массовых свойств.
Notes
Массо-центровочные характеристики определены лишь для тех объектов, для которых определено свойство объема.
density: Входная расчетная плотность для данного объекта.      Тип double.
tolRequired: Входная требуемая точность вычислений.                Тип double.
tolAchieved: Выходная фактически достигнутая точность вычислений.  Тип double.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип MassProperties.

Teigha.BoundaryRepresentation.BrepEntity.GetPerimeterLength(System.Double)
Метод предназначен для вычисления периметра данного топологического объекта с указанной точностью.
Метод предназначен для вычисления периметра данного топологического объекта с применением максимального масштабного коэффициента из вложенных преобразований.
Требуемая точность вычислений определяется входным параметром tolRequired.
Свойство длины периметра применимо к большинству объектов, представляющих собой плоские фигуры и некоторые 3D-фигуры.
tolRequired: Входная требуемая точность вычислений.
Returns: Возвращает периметр данного объекта.
Тип double.

Teigha.BoundaryRepresentation.BrepEntity.GetPerimeterLength(System.Double,[Out] double%)
Метод предназначен для вычисления периметра данного топологического объекта с указанной точностью.
Метод предназначен для вычисления периметра данного топологического объекта с применением максимального масштабного коэффициента из вложенных преобразований.
Требуемая точность вычислений определяется входным параметром tolRequired.
Метод возвращает также фактически достигнутую точность tolAchieved вычисления периметра.
Свойство длины периметра применимо к большинству объектов, представляющих собой плоские фигуры и некоторые 3D-фигуры.
tolRequired: Входная требуемая точность вычислений.  Тип double.
tolAchieved: Фактически достигнутая точность вычисления периметра.  Тип double.
Returns: Возвращает периметр данного объекта.
Тип double.

Teigha.BoundaryRepresentation.BrepEntity.GetPointContainment(Teigha.Geometry.Point3d,[Out]PointContainment%)
Метод позволяет определить, располагается ли указанная точка внутри или снаружи топологической границы данного объекта.
В текущей версии не реализован.
Метод позволяет определить, располагается ли указанная точка внутри или снаружи топологической границы данного объекта.
Если точка располагается вне данного объекта, то параметр containment возвращает значение PointContainment.Outside.
Если же точка располагается внутри объекта, то containment принимает значение PointContainment.Inside, а метод возвращает копию данного объекта.
Если точка лежит на топологической границе данного объекта, параметр containment принимает значение PointContainment.OnBoundary, а метод возвращает объект BrepEntity, являющийся объектом топологии самого низкого уровня, который соответствует принадлежности точки.  Например, если точка оказалась на ребре грани, возвращается это ребро.
Чтобы точка находилась с текущим объектом в едином пространстве оценки, перед проверкой к точке применяется вся инвертированная цепочка преобразований из массива идентификаторов объектов.
Ответственность за удаление возвращенного объекта BrepEntity возлагается на вызывающее приложение.
Notes
Метод в текущей версии платформы не реализован.
point: Проверяемая 3D-точка.  Тип Point3d.
containment: Результат определения принадлежности точки.  Значение из перечисления PointContainment.
Returns: Возвращает топологический объект, которому принадлежит входная точка point.
Тип BrepEntity.

Teigha.BoundaryRepresentation.BrepEntity.GetSurfaceArea(System.Double)
Метод позволяет получить площадь поверхности данного топологического объекта с указанной точностью.
Метод позволяет получить площадь поверхности данного топологического объекта как значение типа double с применением максимального масштабного коэффициента из вложенных преобразований.
Требуемая точность вычислений определяется аргументом tolRequired, а достигаемая точность - глобальными настройками.
Площадь поверхности можно определять для большинства топологических объектов, которые представляют объемные фигуры.
tolRequired: Требуемая точность вычислений.
Returns: Возвращает площадь поверхности данного объекта.
Тип double.

Teigha.BoundaryRepresentation.BrepEntity.GetSurfaceArea(System.Double,[Out] double%)
Метод позволяет получить площадь поверхности данного топологического объекта с указанной точностью.  Дополнительно метод возвращает фактически достигнутую точность вычисления площади.
Метод позволяет получить площадь поверхности данного топологического объекта как значение типа double с применением максимального масштабного коэффициента из вложенных преобразований.
Требуемая точность вычислений определяется аргументом tolRequired, а фактически достигнутую точность возвращает параметр tolAchieved.
tolRequired: Требуемая точность вычислений.            Тип double.
tolAchieved: Достигнутая точность вычисления площади.  Тип double.
Returns: Возвращает площадь поверхности данного объекта.
Тип double.

Teigha.BoundaryRepresentation.BrepEntity.GetVolume(System.Double)
Метод позволяет получить объем данного топологического объекта с требуемой точностью.
Метод позволяет получить объем данного топологического объекта с применением максимального масштабного коэффициента из вложенных преобразований.
Требуемая точность вычислений определяется аргументом tolRequired, а достигаемая точность - глобальными настройками.
tolRequired: Требуемая точность вычислений.  Тип double.
Returns: Возвращает объем данного объекта.
Тип double.

Teigha.BoundaryRepresentation.BrepEntity.GetVolume(System.Double,[Out] double%)
Метод позволяет получить объем данного топологического объекта с требуемой точностью.  Дополнительно метод возвращает фактически достигнутую точность вычисления объема.
Метод позволяет получить объем данного топологического объекта как значение типа double с применением максимального масштабного коэффициента из вложенных преобразований.
Требуемая точность вычислений определяется аргументом tolRequired, а фактически достигнутую точность возвращает параметр tolAchieved.
tolRequired: Требуемая точность вычислений объема.   Тип double.
tolAchieved: Достигнутая точность вычисления объема. Тип double.
Returns: Возвращает объем данного объекта.
Тип double.

Teigha.BoundaryRepresentation.BrepEntity.BoundBlock
Свойство BoundBlock представляет граничный бокс в пространстве модели для данного топологического объекта.
Свойство BoundBlock представляет граничный бокс в пространстве модели для данного топологического объекта.
Returns: Возвращает граничный бокс данного объекта.
Тип BoundBlock3d.

Teigha.BoundaryRepresentation.BrepEntity.Brep
Свойство Brep предоставляет доступ к объекту BoundaryRepresentation.Brep на вершине текущей топологической иерархии.
Свойство Brep предоставляет доступ к объекту BoundaryRepresentation.Brep на вершине текущей топологической иерархии.
Returns: Возвращает объект на вершине текущей топологической иерархии.
Тип BoundaryRepresentation.Brep.

Teigha.BoundaryRepresentation.BrepEntity.IsNull
Свойство IsNull позволяет проверить, инициализирован ли данный объект, т.е. связана ли с ним модель ACIS.
Свойство IsNull позволяет проверить, инициализирован ли данный объект, т.е. связана ли с ним модель ACIS.
В отсутствие модели ACIS объект является неинициализированным или недействительным (т.е. пустым).
Returns: Возвращает true, только если с данным объектом не связана никакая модель ACIS.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.BrepEntity.SubentityPath
Свойство SubentityPath представляет полный путь подобъекта nanoCAD для данного топологического объекта.
Свойство SubentityPath представляет полный путь подобъекта nanoCAD для данного топологического объекта.
Returns: Возвращает полный путь подобъекта.
Тип FullSubentityPath.

Teigha.BoundaryRepresentation.BrepEntity.ValidationLevel
Свойство ValidationLevel предоставляет доступ к уровню проверки, который в данный момент используется данным топологическим объектом.
Свойство ValidationLevel представляет уровень проверки, который в данный момент используется данным топологическим объектом.
Returns: Возвращает уровень проверки данного объекта. Перечисление BoundaryRepresentation.ValidationLevel.