Teigha.DatabaseServices.Filters.IndexUpdateData
Этот класс предназначен для сопоставления идентификаторов объектов ObjectId с любыми данными или флагами, специфичными для индекса.
Этот класс предназначен для сопоставления идентификаторов объектов ObjectId с любыми данными или флагами, специфичными для индекса.  Например, в ходе обновления пространственного индекса можно в этом экземпляре индекса связать идентификаторы ObjectId с ограничивающими боксами этих объектов.
Основная задача методов get и set этого класса — предоставить приложениям не слишком затратный, но при этом достаточно эффективный метод (с временной сложностью, которая асимптотически оценивается как O(1)) связывания флагов и данных с соответствующими идентификаторами объектов в ходе обновления индекса.
Экземпляр IndexUpdateData напрямую никогда не создается. Он всегда предоставляется в качестве аргумента.

Teigha.DatabaseServices.Filters.IndexUpdateData.AddId(Teigha.DatabaseServices.ObjectId)
Метод добавляет к данному объекту IndexUpdateData указанный идентификатор объекта ObjectId.
Метод добавляет к данному объекту IndexUpdateData указанный идентификатор объекта ObjectId.
id: Добавляемый идентификатор объекта. Тип ObjectId.

Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdData(Teigha.DatabaseServices.ObjectId)
Устарел - Используйте вместо него метод GetIdDataPtr.
Метод позволяет получить 32-битные данные, связанные с указанным идентификатором объекта.
Устарел - Используйте вместо него метод GetIdDataPtr.
Метод позволяет получить 32-битные данные, связанные с указанным идентификатором объекта ObjectId.
id: Входной идентификатор объекта.  Тип ObjectId.
Returns: Возвращает целое число. Тип int.

Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdDataPtr(Teigha.DatabaseServices.ObjectId)
Метод позволяет получить указатель IntPtr на данные, связанные с переданным идентификатором объекта.
Метод позволяет получить указатель IntPtr на данные, связанные с переданным идентификатором объекта ObjectId.
id: Входной идентификатор объекта.  Тип ObjectId.
Returns: Возвращает указатель на связанные данные. Тип IntPtr.

Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdFlags(Teigha.DatabaseServices.ObjectId)
Метод предназначен для получения 8-битного флага, связанного с идентификатором объекта ObjectId.
Метод предназначен для получения 8-битного флага, связанного с идентификатором объекта ObjectId.
id: Входной идентификатор объекта, с которым связан флаг. Тип ObjectId.
Returns: Возвращает флаг, связанный с указанным ObjectId. Тип byte.

Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdData(Teigha.DatabaseServices.ObjectId,System.Int32)
Метод устарел - используйте метод SetIdData(ObjectId, IntPtr).
Метод позволяет задать в этом объекте IndexUpdateData указанные данные, связанные с переданным идентификатором объекта.
Метод устарел - используйте метод SetIdData(ObjectId, IntPtr).
Метод позволяет задать в этом объекте IndexUpdateData указанные данные, связанные с переданным идентификатором объекта.
id: Входной идентификатор объекта. Тип ObjectId.
data: Связанные с идентификатором id данные. Тип int.

Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdData(Teigha.DatabaseServices.ObjectId,IntPtr)
Метод задаёт в этом объекте IndexUpdateData указатель IntPtr на данные, связанные с переданным идентификатором объекта ObjectId.
Метод задаёт в этом объекте IndexUpdateData указатель IntPtr на данные, связанные с переданным идентификатором объекта ObjectId.
id: Входной идентификатор объекта. Тип ObjectId.
data: Указатель на данные, связанные с id. Тип IntPtr.

Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdFlags(Teigha.DatabaseServices.ObjectId,unsigned char)
Этот метод позволяет задать флаги, связанные указанным идентификатором объекта ObjectId.
Этот метод позволяет задать флаги, связанные указанным идентификатором объекта ObjectId.
id: Входной идентификатор объекта, с которым связаны флаги flags. Тип ObjectId.
flags: Флаги, связанные с идентификатором id. Тип unsigned char.