Teigha.DatabaseServices.MText.CorrectSpelling
Метод предназначен для проверки орфографии с целью исправления орфографических ошибок.
В текущей версии не реализован.
Метод предназначен для проверки орфографии с целью исправления орфографических ошибок.
В случае успешного завершения должен возвращать 0 и 1 в противном случае.
В текущей версии не реализован и всегда возвращает 0.
Returns: Возвращает 0 в случае успешного завершения. В противном случае возвращает 1.
Тип int.