Teigha.DatabaseServices.FieldUpdateResult.NumFound
Свойство NumFound представляет количество найденных полей.
Свойство NumFound представляет количество найденных полей.
Returns: Возвращает количество найденных полей.
Тип int.