HostMgd.PlottingServices.DsdEntryCollection.Clear
Метод удаляет из коллекции все элементы.
Метод удаляет из коллекции все элементы.
После завершения метода свойство Count коллекции возвращает значение 0.