Teigha.DatabaseServices.BlockTableRecord.Copy
Метод предназначен для быстрого создания копии определения
блока.
Метод предназначен для быстрого создания копии определения
блока.
Returns: Тип данных BlockTableRecord.