Teigha.DatabaseServices.FieldEvaluationStatusResult
Этот класс предназначен для хранения кодов, представляющих результаты вычисления поля.
Этот класс предназначен для хранения кодов, представляющих результаты вычисления поля.

Teigha.DatabaseServices.FieldEvaluationStatusResult.#ctor(Teigha.DatabaseServices.FieldEvaluationStatus,System.Int32,String)
Конструктор класса FieldEvaluationStatusResult.  Только для внутреннего использования.
Конструктор класса FieldEvaluationStatusResult.  Только для внутреннего использования.
s: Статус вычисления поля. Значение из перечисления FieldEvaluationStatus.
e: Код ошибки. Тип int.
m: Сообщение об ошибке. Тип String.

Teigha.DatabaseServices.FieldEvaluationStatusResult.ErrorCode
Свойство ErrorCode возвращает код ошибки этого объекта.
Свойство ErrorCode возвращает код ошибки этого объекта.
Returns: Возвращает код ошибки. Тип int.

Teigha.DatabaseServices.FieldEvaluationStatusResult.ErrorMessage
Свойство ErrorMessage возвращает сообщение об ошибке этого объекта.
Свойство ErrorMessage возвращает сообщение об ошибке этого объекта.
Returns: Возвращает сообщение об ошибке. Тип String.

Teigha.DatabaseServices.FieldEvaluationStatusResult.Status
Свойство Status возвращает статус вычисления поля этого объекта.
Свойство Status возвращает статус вычисления поля этого объекта.
Returns: Возвращает статус вычисления поля. Значение из перечисления FieldEvaluationStatus.