HostMgd.ApplicationServices.DocumentWindowCollection.ArrangeIcons
Метод предназначен для размещения иконок дочерних окон MDI.
В текущей версии  не реализован.
Метод предназначен для размещения иконок дочерних окон MDI (Multiple Document Interface).
В текущей версии  не реализован.