HostMgd.EditorInput.JigPromptPointOptions.DefaultValue
Значение по умолчанию для запроса точки во время операции Jig.
Свойство предназначено для чтения и определения точки по умолчанию для запроса точки во время операции Jig с геометрическим объектом.
Значение по умолчанию будет использовано, если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
Returns: Возвращает тип данных  - точка, заданная по умолчанию.