HostMgd.ApplicationServices.ExecuteInApplicationContextCallback
Делегат ExecuteInApplicationContextCallback предназначен для обратного вызова void функции из контекста приложения.
Делегат ExecuteInApplicationContextCallback предназначен для обратного вызова void функции из контекста приложения.
userData: Пользовательская функция callback. Тип System.Object.