HostMgd.PlottingServices.ProcessPlotState
Данное перечисление определяет значения, описывающие текущий процесс вывода чертежа на печать.
Перечисление ProcessPlotState определяет значения, описывающие текущий процесс вывода чертежа на печать.