Teigha.DatabaseServices.SubDMesh.SubdRefine
Данный метод применяет текущую степень сглаженности сети к подобъектам SubDMesh.
Степень сглаженности устанавливается равной 0.
Данный метод применяет текущую степень сглаженности сети к подобъектам SubDMesh.
Степень сглаженности устанавливается равной 0.