Teigha.DatabaseServices.TransformOverrule
Этот класс переопределяет подмножество операций, связанных с 3D-преобразованиями объекта.
Используется в качестве базового для настройки поведения наследников класса Entity.
Этот класс переопределяет подмножество операций, связанных с 3D-преобразованиями объекта.
Класс используется в качестве базового для настройки поведения наследников класса Entity.
Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.

Teigha.DatabaseServices.TransformOverrule.CloneMeForDragging(Teigha.DatabaseServices.Entity)
Метод проверяет необходимость создавать для операций перетаскивания клон указанного объекта.
Метод проверяет, следует ли создавать клон указанного объекта для операций перетаскивания.
entity: Проверяемый объект чертежа. Тип Entity.

Teigha.DatabaseServices.TransformOverrule.Explode(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.DBObjectCollection)
Метод взрывает указанный в аргументе объект с получением множества более простых объектов.
Метод взрывает указанный в аргументе entity объект с получением множества более простых объектов.
Полученные объекты добавляются в коллекцию entitySet.  Вновь созданные в результате взрыва объекты не являются резидентными в базе данных.
Реализация этого метода по умолчанию порождает исключение eNotApplicable.
Этот метод может переопределяться в пользовательских классах.
entity: Взрываемый объект. Тип Entity.
entitySet: Коллекция, в которую добавляются объекты, порождаемые взрывом объекта entity. Коллекция может содержать элементы перед выполнением метода; новые элементы добавляются в конец коллекции.

Teigha.DatabaseServices.TransformOverrule.GetTransformedCopy(Teigha.DatabaseServices.Entity,Teigha.Geometry.Matrix3d)
Метод создает копию указанного объекта и применяет к этой копии заданное геометрическое 3D-преобразование.
Метод создает копию указанного объекта entity и применяет к этой копии заданное аргументом transform геометрическое 3D-преобразование.
entity: Копируемый объект, тип Entity.
transform: Матрица 3D-преобразования, которое применяется к объекту-копии.

Teigha.DatabaseServices.TransformOverrule.HideMeForDragging(Teigha.DatabaseServices.Entity)
Метод проверяет, должен ли указанный объект быть скрытым для операций перетаскивания.
Метод проверяет, должен ли указанный объект быть скрытым для операций перетаскивания.
entity: Проверяемый объект чертежа, тип Entity.
Returns: Возвращает true, если объект entity должен быть скрыт для операции перетаскивания, в противном случае возвращает false.

Teigha.DatabaseServices.TransformOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD искал в словаре расширений запись с именем entryName.  Переопределения не будут вызываться, если запись с entryName не будет найдена в словаре расширений.
entryName: Имя записи в словаре расширений, тип String.

Teigha.DatabaseServices.TransformOverrule.SetIdFilter(array)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов ids.
ids: Массив идентификаторов объектов. Тип ObjectId[].

Teigha.DatabaseServices.TransformOverrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
registeredApplicationName: String

Teigha.DatabaseServices.TransformOverrule.TransformBy(Teigha.DatabaseServices.Entity,Teigha.Geometry.Matrix3d)
Метод предназначен для выполнения 3D-преобразования заданного объекта с использованием указанной матрицы преобразования.
Метод предназначен для выполнения 3D-преобразования объекта entity с использованием матрицы преобразования transform.
entity: Объект чертежа, у которому применяется 3D-преобразование. Тип Entity.
transform: Матрица 3D-преобразования. Тип Matrix3d.