Teigha.DatabaseServices.SubentityId
Структура SubentityId представляет в базе данных идентификаторы подобъектов для графических объектов чертежа.
Структура SubentityId представляет в базе данных идентификаторы подобъектов для графических объектов чертежа.
Объект чертежа может включать произвольное количество графических подобъектов.
Типы подобъектов SubentType определяются перечислением SubentityType и могут принимать следующие значения:
Имя             Значение
------------    --------
Null            0
Face            1
Edge            2
Vertex          3
MlineCache      4
Class           5
Каждый объект SubentityId создается на основе типа подобъекта и индекса.
Notes
Рекомендуется использовать индексы в виде указателей.

Teigha.DatabaseServices.SubentityId.#ctor(Teigha.DatabaseServices.SubentityType,IntPtr)
Конструктор структуры SubentityId.
Создает экземпляр структуры, используя переданный тип подобъекта и указатель в качестве индекса.
Конструктор структуры SubentityId.
Создает экземпляр структуры, используя переданный тип подобъекта и указатель в качестве индекса.
type: Тип подобъекта.    Тип SubentityType.
i: Индекс подобъекта. Тип IntPtr.

Teigha.DatabaseServices.SubentityId.#ctor(Teigha.DatabaseServices.SubentityType,long long)
Конструктор структуры SubentityId.
Создает экземпляр структуры с указанными типом подобъекта и целочисленным значением индекса.
Конструктор структуры SubentityId.
Создает экземпляр структуры с указанными типом подобъекта и целочисленным значением индекса.
Notes
Устарел.
Рекомендуется использовать перегрузку Teigha.DatabaseServices.SubentityId.SubentityId(SubentityType, IntPtr).
type: Тип подобъекта.    Тип SubentityType.
i: Индекс подобъекта. Тип long long.

Teigha.DatabaseServices.SubentityId.#ctor(Teigha.Runtime.RXClass,IntPtr)
Конструктор структуры SubentityId.
Создает экземпляр структуры для указанного класса подобъекта и указателя в качестве индекса.
Конструктор структуры SubentityId.
Создает экземпляр структуры для указанного класса подобъекта и указателя в качестве индекса.
classType: Класс подобъекта.  Тип RXClass.
i: Индекс подобъекта. Тип IntPtr.

Teigha.DatabaseServices.SubentityId.#ctor(Teigha.Runtime.RXClass,long long)
Конструктор структуры SubentityId.
Создает экземпляр структуры с указанным классом подобъекта и целочисленным индексом подобъекта.
Конструктор структуры SubentityId.
Создает экземпляр структуры с указанным классом подобъекта и целочисленным индексом подобъекта.
Notes
Устарел.
Рекомендуется использовать перегрузку Teigha.DatabaseServices.SubentityId.SubentityId(RXClass, IntPtr).
classType: Класс подобъекта.  Тип RXClass.
i: Индекс подобъекта. Тип long long.

Teigha.DatabaseServices.SubentityId.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.DatabaseServices.SubentityId.!=(Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.SubentityId)
Оператор неравенства для структуры SubentityId.
Оператор неравенства для структуры SubentityId.
Notes
Условием неравенства двух объектов SubentityId является невыполнение хотя бы одного из следующих условий:
* Объекты имеют одинаковый тип подобъекта.
* Объекты имеют одинаковый индекс подобъекта.
* Объекты имеют одинаковый тип класса.
a: Левый операнд.  Тип SubentityId.
b: Правый операнд. Тип SubentityId.
Returns: Возвращает true только в случае неравенства операндов.
Тип bool.

Teigha.DatabaseServices.SubentityId.==(Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.SubentityId)
Оператор равенства для структуры SubentityId.
Оператор равенства для структуры SubentityId.
Notes
Условием равенства двух объектов SubentityId является совместное выполнение следующих условий:
* Объекты имеют одинаковый тип подобъекта.
* Объекты имеют одинаковый индекс подобъекта.
* Объекты имеют одинаковый тип класса.
a: Левый операнд.  Тип SubentityId.
b: Правый операнд. Тип SubentityId.
Returns: Возвращает true только в случае равенства операндов.
Тип bool.

Teigha.DatabaseServices.SubentityId.Index
Свойство Index предоставляет индекс подобъекта в виде целочисленного значения.
Свойство Index предоставляет индекс подобъекта в виде целочисленного значения.
Notes
Устарело.
Рекомендуется использовать свойство Teigha.DatabaseServices.SubentityId.IndexPtr.
Returns: Возвращает целочисленный индекс подобъекта.
Тип int.

Teigha.DatabaseServices.SubentityId.IndexPtr
Свойство IndexPtr представляет индекс подобъекта в виде указателя IntPtr.
Свойство IndexPtr представляет индекс подобъекта в виде указателя IntPtr.
Returns: Возвращает индекс подобъекта. Тип IntPtr.

Teigha.DatabaseServices.SubentityId.Null
Свойство Null представляет нулевой ID подобъекта.
Свойство Null представляет нулевой идентификатор подобъекта.
Returns: Возвращает нулевой идентификатор подобъекта. Тип SubentityId.

Teigha.DatabaseServices.SubentityId.Type
Свойство Type представляет тип подобъекта.
Свойство Type представляет тип подобъекта.
Returns: Возвращает тип подобъекта. Тип SubentityType.

Teigha.DatabaseServices.SubentityId.TypeClass
Свойство TypeClass представляет тип класса подобъекта, если тип подобъекта равен SubentityType.Class.
Свойство TypeClass представляет тип класса подобъекта, если тип подобъекта равен SubentityType.Class.
Returns: Возвращает тип класса подобъекта, если тип подобъекта равен SubentityType.Class.
В противном случае возвращает Null. Тип RXClass.