Teigha.Geometry.Vector2dCollectionEnumerator
Класс Vector2dCollectionEnumerator представляет перечислитель для коллекции Vector2dCollection.
Класс Vector2dCollectionEnumerator представляет перечислитель для коллекции двумерных векторов Vector2dCollection.

Teigha.Geometry.Vector2dCollectionEnumerator.Current
Свойство Current представляет текущий элемент перечислителя.
Свойство Current представляет текущий элемент перечислителя.
Returns: Возвращает текущий элемент перечислителя.
Тип Vector2d.