HostMgd.EditorInput.PromptAngleOptions.GetDefaultValueString
Метод возвращает строковое представление угла по умолчанию,
заданного в параметрах ввода угла.
Метод предназначен для получения значения угла по умолчанию,
хранящегося в свойстве DefaultValue, в виде строки,
отформатированной в градусах или радианах в зависимости
от настроек локализации и контекста.
Это удобно при отображении подсказок, сообщений или формировании
строки ввода с предустановленным значением для пользователя.
Returns: Возвращает значение типа string, представляющее собой
отформатированное значение угла по умолчанию
(в градусах или радианах), например:
"90" — если угол задан как Math.PI / 2.
"0" — если DefaultValue равен 0.
Если значение угла по умолчанию не задано (например, равно null или 0.0),
метод может вернуть пустую строку или строковое представление угла 0.
Example
C#