Teigha.DatabaseServices.Field.GetFieldCodeWithChildren
Метод позволяет извлечь код поля с дочерними полями в различных видах.
Метод позволяет извлечь код поля с дочерними полями в различных видах.
Returns: Возвращает код поля.  Тип FieldCodeWithChildren.