HostMgd.ApplicationServices.DocumentWindowCollection.TileHorizontally
Метод позволяет разместить дочерние окна MDI горизонтально.
В текущей версии  не реализован.
Метод позволяет разместить дочерние окна MDI данной коллекции горизонтально.
В текущей версии  не реализован.