Teigha.GraphicsSystem.Device.GetSize
Метод позволяет получить размер данного устройства.
Метод позволяет получить размер данного устройства.
Returns: Возвращает текущий размер устройства.
Тип System.Drawing.Size.