HostMgd.EditorInput.Editor
Класс представляет системный объект, управляющий цепочкой реакторов редактора nanoCAD,
что позволяет приложениям добавлять и удалять реакторы для обработки событий и взаимодействия
с редактором.
Системный объект класса, наследованный от этого абстрактного
базового класса, позволяет приложению управлять реакторами
редактора nanoCAD. Приложения могут добавлять и удалять
реакторы из цепочки реакторов редактора nanoCAD.

HostMgd.EditorInput.Editor.Command(... array)
Метод выполняет встроенную команду nanoCAD с указанными
параметрами.
Метод позволяет вызывать внутренние команды nanoCAD,
передавая им набор параметров в виде массива объектов. Он
предназначен для программного взаимодействия с командной
строкой редактора, что может использоваться для автоматизации
действий или интеграции пользовательских функций в рабочий
процесс nanoCAD. Метод принимает переменное число аргументов
(params object[]), что упрощает передачу параметров
различного типа.
parameter: Массив объектов, представляющих параметры,
одного из следующих типов\:

HostMgd.EditorInput.Editor.DoPrompt(HostMgd.EditorInput.PromptOptions)
Метод выводит приглашение пользователю с заданными параметрами и возвращает результат ввода.
Метод используется для отображения текстового приглашения в командной строке nanoCAD,
сопровождаемого возможными вариантами ввода, и ожидает ответа пользователя.
Он предоставляет гибкие настройки отображения и поведения приглашения через объект PromptOptions.
После завершения ввода метод возвращает объект PromptResult, содержащий информацию о том,
что ввёл пользователь или какая операция была прервана.
opt: Параметры приглашения, такие как
Returns: Возвращается значение типа PromptResult, представляющее результат выполнения приглашения.
Содержит информацию о статусе операции (успешно, отменено, введено неизвестное значение).
Если ввод был успешным — может содержать введённое пользователем значение (Value, StringResult и др.).
Используется для дальнейшей обработки ввода в зависимости от выбора пользователя.
Example
C#

HostMgd.EditorInput.Editor.Drag(HostMgd.EditorInput.Jig)
Метод запускает операцию перетаскивания с использованием
объекта Jig и возвращает результат этой операции.
Метод используется для реализации интерактивного перемещения
или изменения геометрического объекта в реальном времени в
окне nanoCAD. Он инициирует операцию "привязки" (jig),
позволяя пользователю манипулировать объектом через мышь или
другие устройства ввода. Метод ожидает завершения операции и
возвращает значение типа PromptResult, которое указывает на
успешность выполнения или причину прерывания.
jig: Объект, реализующий логику интерактивного перемещения
Returns: Возвращает значение типа PromptResult, содержащее результат
выполнения операции перетаскивания. Статус может быть: OK
(операция завершена успешно), Cancel (отменена
пользователем), Error (ошибка во время операции) и другие.
При необходимости содержит дополнительные данные, например,
конечную позицию или введённое значение. Используется для
дальнейшей обработки результата после завершения операции.
Example
Примеры работы с методом приведены в описаниях классов
DrawJig и EntityJig и в статьях
и .

HostMgd.EditorInput.Editor.Drag(HostMgd.EditorInput.PromptDragOptions)
Метод предлагает пользователю переместить выделенный набор графических объектов
пространства модели или листа с помощью перетаскивания и возвращает результат операции.
Метод используется для инициации интерактивного перемещения одного или нескольких выделенных
графических объектов в текущем чертеже nanoCAD. Пользователь может перетаскивать объекты мышью,
а система отображает их новое положение.
Метод поддерживает только графические объекты из пространства модели или пространства листа
текущего документа — неграфические объекты и примитивы из других блоков не поддерживаются.
После завершения операции метод возвращает результат, содержащий статус и конечную точку перемещения.
options: Объект, задающий параметры операции перетаскивания
Returns: Возвращается значение типа PromptPointResult, представляющее результат выполнения операции перетаскивания.
Содержит статус операции: OK (успешно завершена), Cancel (отменена пользователем), Error (ошибка) и другие.
Если операция успешна, содержит конечную точку (Value типа Point3d), на которую были перемещены объекты.
Используется для последующей обработки результата, например, фиксации нового положения объектов.
Example
C#

HostMgd.EditorInput.Editor.Drag(HostMgd.EditorInput.SelectionSet,System.String,HostMgd.EditorInput.DragCallback)
Метод предлагает пользователю переместить выделенный набор объектов с помощью перетаскивания,
используя заданное сообщение и функцию обратного вызова.
Метод инициирует интерактивную операцию перетаскивания выделенного множества графических объектов
в пространстве модели или листа текущего чертежа. Пользователь может перемещать объекты мышью, а система
отслеживает изменение положения в реальном времени. Метод поддерживает только графические объекты —
неграфические элементы и примитивы из других блоков не обрабатываются. При каждом изменении позиции
вызывается функция обратного вызова (callback), позволяя динамически обновлять состояние объектов.
После завершения возвращается результат с конечной точкой перемещения.
selection: Набор выделенных объектов, которые будут перемещаться в процессе перетаскивания.
message: Сообщение, выводимое в командной строке для информирования пользователя о выполняемом
callback: Функция обратного вызова, которая вызывается при каждом изменении положения во время перетаскивания.
Returns: Возвращается значение типа PromptPointResult, представляющее результат выполнения операции перетаскивания.
Содержит статус операции: OK (успешно завершена), Cancel (отменена пользователем), Error (ошибка) и другие.
Если операция успешна, содержит конечную точку (Value типа Point3d), на которую были перемещены объекты.
Используется для последующей обработки результата, например, фиксации нового положения объектов в чертеже.
Example
C#

HostMgd.EditorInput.Editor.DrawVector(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Int32,System.Boolean)
Метод отрисовывает вектор между двумя точками с заданным цветом и возможностью подсветки.
Метод используется для отображения вектора в трёхмерном пространстве nanoCAD,
соединяя начальную и конечную точки прямой линией. Позволяет задать цвет линии и указать,
требуется ли её подсветка. Применяется, например, для визуализации направлений,
нормалей или динамических построений во время интерактивных операций.
from: Начальная точка вектора (координаты в мировой системе WCS).
to: Конечная точка вектора (координаты в мировой системе WCS).
color: Цвет вектора, заданный номером из текущей палитры цветов
drawHighlight: Флаг, определяющий, будет ли вектор отрисован с подсветкой

HostMgd.EditorInput.Editor.DrawVectors(Teigha.DatabaseServices.ResultBuffer,Teigha.Geometry.Matrix3d)
Метод отрисовывает набор векторов, предварительно преобразованных заданной матрицей.
Метод используется для визуализации векторов, хранящихся в буфере результатов (ResultBuffer),
с применением указанного геометрического преобразования. Это позволяет отображать векторы
в нужной ориентации и положении в трёхмерном пространстве, используя матрицу преобразования
(смещение, поворот, масштабирование). Метод применяется, например, при отладке или динамическом
отображении направлений, нормалей, силовых векторов и других графических элементов.
rb: Буфер, содержащий данные векторов, которые необходимо отрисовать.
transform: Матрица преобразования, которая применяется к каждому вектору перед

HostMgd.EditorInput.Editor.GetAngle(HostMgd.EditorInput.PromptAngleOptions)
Метод предлагает пользователю ввести угол с учётом текущего значения
системной переменной ANGBASE, возвращая результат в виде числового значения угла.
Метод используется для интерактивного ввода угла пользователем через командную строку
или указатель мыши в графической области nanoCAD. Угол вводится с учетом текущей настройки
системной переменной ANGBASE, которая определяет начальное направление угла
(обычно угол отсчитывается от оси X). Метод предоставляет гибкие настройки ввода через
объект PromptAngleOptions. После завершения операции возвращается результат, содержащий
статус и значение введённого угла в радианах.
options: Объект, задающий параметры ввода угла
Returns: Возвращает значение типа PromptDoubleResult, представляющее результат ввода угла.
Содержит статус операции: OK (успешно), Cancel (отменено пользователем), Error (ошибка) и другие.
Если операция успешна, содержит значение угла в радианах (Value типа double).
Может использоваться для последующего применения угла в построениях, поворотах и других вычислениях.
Example
C#

HostMgd.EditorInput.Editor.GetAngle(String)
Метод предлагает пользователю ввести угол с учётом текущего значения
системной переменной ANGBASE и возвращает результат в виде значения угла в радианах.
Метод используется для интерактивного ввода угла пользователем через командную строку
или графическое указание на чертеже. Угол отсчитывается относительно направления,
заданного системной переменной ANGBASE. Пользователь может ввести значение с клавиатуры
или указать угол мышью. Метод выводит указанное сообщение перед началом ввода
и возвращает результат в виде объекта PromptDoubleResult.
message: Сообщение, отображаемое в командной строке для приглашения пользователя
к вводу угла (например, "Укажите угол поворота: ").
Returns: Возвращается объект типа PromptDoubleResult, содержащий:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — значение введённого угла в радианах (если операция завершена успешно).
* StringResult — строковое представление введённого угла или имя ключевого слова (если использовалось).
Example
C#

HostMgd.EditorInput.Editor.GetCorner(HostMgd.EditorInput.PromptCornerOptions)
Метод позволяет пользователю указать точку — второй угол прямоугольника,
используя графический ввод или клавиатуру, с возможностью настройки
через параметры приглашения.
Метод используется для интерактивного ввода пользователем второй угловой точки
прямоугольника относительно заданной начальной точки. Позволяет ограничивать координаты
по осям X и Y (как в команде RECTANG), обеспечивая прямоугольное выравнивание.
Метод поддерживает как мышиный ввод, так и ввод координат вручную.
Настройка поведения осуществляется через объект PromptCornerOptions.
options: Объект, содержащий параметры ввода угла прямоугольника
Returns: Возвращает объект типа PromptPointResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — значение точки (Point3d), если ввод был успешным.
* InputString — строковое представление введённых данных (если использовался ручной ввод).
Example
C#

HostMgd.EditorInput.Editor.GetCorner(String,Teigha.Geometry.Point3d)
Метод позволяет пользователю указать вторую угловую точку прямоугольника
относительно заданной начальной точки, с отображением указанного сообщения.
Метод используется для интерактивного ввода второй угловой точки прямоугольника.
Пользователь может указать точку мышью на чертеже или ввести координаты вручную.
При этом обеспечивается прямоугольное выравнивание по осям X и Y относительно
начальной точки (аналогично поведению команды RECTANG). Метод выводит заданное
текстовое приглашение и возвращает результат в виде объекта PromptPointResult.
message: Сообщение, отображаемое в командной строке для приглашения пользователя
к выбору угла прямоугольника (например, "Укажите противоположный угол: ").
basePoint: Начальная точка прямоугольника, относительно которой будет определяться
Returns: Возвращает объект типа PromptPointResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — значение точки (Point3d), если ввод был успешным.
* StringResult — строковое представление введённых данных (если использовался ручной ввод).
Example
C#

HostMgd.EditorInput.Editor.GetDistance(HostMgd.EditorInput.PromptDistanceOptions)
Метод позволяет пользователю ввести линейное расстояние графически или вручную,
с возможностью настройки параметров ввода.
Метод используется для интерактивного ввода значения расстояния пользователем.
Пользователь может указать две точки на чертеже мышью, либо ввести числовое
значение в командной строке. Метод предоставляет гибкие настройки приглашения
через объект PromptDistanceOptions, такие как начальное значение, ограничения
на ввод и сообщение для пользователя.
options: Объект, содержащий параметры ввода расстояния
* Message — текст приглашения (например, "Укажите расстояние: ").
Returns: Возвращает объект типа PromptDoubleResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — значение расстояния в единицах чертежа (если ввод успешен).
* StringResult — строковое представление введённого значения или команды.
Example
C#

HostMgd.EditorInput.Editor.GetDistance(String)
Метод позволяет пользователю ввести значение линейного расстояния с клавиатуры или
графически указать две точки на чертеже, возвращая результат в виде числового значения.
Метод используется для интерактивного получения значения расстояния от пользователя.
Пользователь может либо ввести значение вручную в командной строке, либо указать
две точки на чертеже мышью — в этом случае расстояние вычисляется автоматически.
Метод выводит заданное приглашение и возвращает результат в виде объекта PromptDoubleResult,
содержащего статус операции и значение расстояния в единицах чертежа.
message: Сообщение, отображаемое в командной строке для приглашения пользователя
к вводу расстояния (например, "Укажите длину: ").
Returns: Возвращает объект типа PromptDoubleResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — значение расстояния в единицах чертежа (если ввод был успешным).
* StringResult — строковое представление введённого значения или команды.
Example
C#

HostMgd.EditorInput.Editor.GetDouble(HostMgd.EditorInput.PromptDoubleOptions)
Метод позволяет пользователю ввести числовое значение с возможностью настройки параметров
ввода и возвращает результат в виде объекта PromptDoubleResult.
Метод используется для интерактивного ввода пользователем вещественного числа через командную строку.
Позволяет задать ограничения на ввод (например, минимальное и максимальное значение), установить
начальное значение по умолчанию и настроить сообщения приглашения. Метод предоставляет гибкий способ
получения числовых данных от пользователя с поддержкой проверки корректности ввода.
options: Объект, содержащий параметры ввода числа
* Message — текст приглашения (например, "Введите коэффициент масштабирования: ").
Returns: Возвращает объект типа PromptDoubleResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — числовое значение (double), если ввод был успешным.
* StringResult — строковое представление введённого значения или ключевого слова.
Example
C#

HostMgd.EditorInput.Editor.GetDouble(String)
Метод позволяет пользователю ввести вещественное число через командную строку,
возвращая результат в виде объекта PromptDoubleResult.
Метод используется для интерактивного получения от пользователя числового значения типа double.
Пользователь может ввести число с клавиатуры, при этом система автоматически проверяет
корректность формата. Метод выводит заданное текстовое приглашение и ожидает ввода до тех пор,
пока не будет получено допустимое значение или операция не будет прервана.
message: Сообщение, отображаемое в командной строке для приглашения пользователя к вводу числа
(например, "Введите радиус окружности: ").
Returns: Возвращает объект типа PromptDoubleResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — введённое пользователем числовое значение типа double (если ввод успешен).
* StringResult — строковое представление введённого значения.
Example
C#

HostMgd.EditorInput.Editor.GetEntity(HostMgd.EditorInput.PromptEntityOptions)
Метод приглашает пользователя выбрать геометрический объект указанием точки на нём
и возвращает информацию о выбранном объекте и точке выбора.
Метод используется для интерактивного выбора пользователем одного геометрического объекта
на чертеже с помощью указания мышью. Метод ожидает ввод от пользователя до тех пор,
пока не будет выбран допустимый объект или операция не будет прервана.
Поддерживаются только графические объекты — неграфические элементы игнорируются.
Настройка поведения выбора осуществляется через параметр PromptEntityOptions.
options: Объект, содержащий параметры приглашения
* Message — текст приглашения (например, "Выберите объект: ").
Returns: Возвращает объект типа PromptEntityResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* ObjectId — идентификатор выбранного объекта (если операция успешна).
* PickedPoint — координата точки, указанной пользователем на объекте (Point3d).
Если пользователь отменил операцию или был выбран недопустимый объект, статус будет отличаться от OK.
Example
C#

HostMgd.EditorInput.Editor.GetEntity(String)
Метод приглашает пользователя выбрать графический объект указанием точки
на нём и возвращает результат с идентификатором объекта и координатой точки выбора.
Метод используется для интерактивного выбора пользователем одного геометрического объекта на чертеже.
Пользователь указывает мышью точку на объекте, после чего метод возвращает информацию о выбранном объекте.
Выбор возможен только для графических объектов — неграфические элементы игнорируются.
Метод выводит заданное сообщение-приглашение и ожидает ввода от пользователя до завершения операции.
message: Сообщение, отображаемое в командной строке для приглашения пользователя к выбору объекта
(например, "Выберите линию: ").
Returns: Возвращает объект типа PromptEntityResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* ObjectId — идентификатор выбранного графического объекта (если операция успешна).
* PickedPoint — координата точки, указанной пользователем на объекте (Point3d).
Если пользователь прервал операцию или был выбран недопустимый объект, статус будет отличаться от OK.
Example
C#

HostMgd.EditorInput.Editor.GetFileNameForOpen(HostMgd.EditorInput.PromptOpenFileOptions)
Метод эмулирует ввод имени файла для открытия, выводя приглашение
в командной строке, если диалоговые окна отключены или выполняется скрипт.
Метод используется для получения пути и имени файла, который пользователь
намерен открыть. Если значение системной переменной FILEDIA равно 0
(диалоговые окна отключены) или команда вызвана из LISP-скрипта,
метод выводит приглашение в командной строке и ожидает ввода пользователем имени файла.
В противном случае может быть показан стандартный диалог открытия файла.
Метод предоставляет гибкие настройки через параметр PromptOpenFileOptions.
options: Объект, содержащий параметры запроса имени файла
* Message — текст приглашения (например, "Укажите файл для открытия: ").
Returns: Возвращает объект типа PromptFileNameResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — строку с путём к выбранному файлу, если операция успешна.
Example
C#

HostMgd.EditorInput.Editor.GetFileNameForOpen(String)
Метод эмулирует ввод имени файла для открытия,
выводя заданное приглашение в командной строке,
если диалоговые окна отключены или выполняется скрипт.
Метод используется для получения пути к файлу, который пользователь намерен открыть.
Если значение системной переменной FILEDIA равно 0 (диалоговые окна отключены)
или команда вызвана из LISP-скрипта, метод выводит указанное сообщение в командной строке
и ожидает ввода имени файла с клавиатуры. В противном случае может быть показан
стандартный диалог открытия файла. Метод позволяет интегрировать выбор файла
в интерактивные и автоматизированные сценарии работы с nanoCAD.
message: Сообщение, отображаемое в командной строке для приглашения пользователя
к вводу имени файла (например, "Введите путь к файлу DWG: ").
Returns: Возвращает объект типа PromptFileNameResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — строковое значение с путём к выбранному файлу (если ввод успешен).
Если пользователь отменил операцию или не указал допустимый файл, статус будет отличаться от OK.
Example
C#

HostMgd.EditorInput.Editor.GetFileNameForSave(HostMgd.EditorInput.PromptSaveFileOptions)
Метод эмулирует ввод имени файла для сохранения,
выводя приглашение в командной строке,
если диалоговые окна отключены или выполняется скрипт.
Метод используется для получения пути и имени файла, под которым пользователь намерен сохранить документ.
Если значение системной переменной FILEDIA равно 0 (диалоговые окна отключены)
или команда вызвана из LISP-скрипта, метод выводит приглашение в командной строке
и ожидает ввода пользователем имени файла. В противном случае может быть показан
стандартный диалог сохранения файла. Метод предоставляет гибкие настройки через
параметр PromptSaveFileOptions.
options: Объект, содержащий параметры запроса имени файла
* Message — текст приглашения (например, "Введите имя файла для сохранения: ").
Returns: Возвращает объект типа PromptFileNameResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — строку с путём, под которым будет сохранён файл (если операция успешна).
Example
C#

HostMgd.EditorInput.Editor.GetFileNameForSave(String)
Метод эмулирует ввод имени файла для сохранения,
выводя заданное приглашение в командной строке,
если диалоговые окна отключены или выполняется скрипт.
Метод используется для получения пути и имени файла, под которым пользователь хочет сохранить документ.
Если значение системной переменной FILEDIA равно 0 (диалоговые окна отключены) или команда вызвана из LISP-скрипта,
метод выводит указанное сообщение в командной строке и ожидает ввода от пользователя.
В противном случае может быть показан стандартный диалог сохранения файла.
Метод позволяет интегрировать операцию сохранения в интерактивные и автоматизированные сценарии.
message: Сообщение, отображаемое в командной строке для приглашения пользователя к вводу имени файла
(например, "Введите путь для сохранения файла DWG: ").
Returns: Возвращает объект типа PromptFileNameResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — строковое значение с путём, под которым будет сохранён файл (если ввод успешен).
Если пользователь отменил операцию или не указал допустимое имя файла, статус будет отличаться от OK.
Example
C#

HostMgd.EditorInput.Editor.GetInteger(HostMgd.EditorInput.PromptIntegerOptions)
Метод позволяет пользователю ввести целое число в диапазоне
от -32768 до +32767 с возможностью настройки параметров ввода.
Метод используется для интерактивного получения целочисленного значения
от пользователя через командную строку. Пользователь может ввести число
вручную или указать значение графически (если поддерживается).
Метод предоставляет гибкие настройки приглашения, такие как сообщение,
начальное значение, ограничения и дополнительные подсказки.
Диапазон допустимых значений соответствует 16-битному целому числу со знаком.
options: Объект, содержащий параметры ввода
* Message — текст приглашения (например, "Введите количество копий: ").
Returns: Возвращает объект типа PromptIntegerResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — введённое пользователем целое число (int), если ввод был успешным.
* StringResult — строковое представление введённого значения.
Example
C#

HostMgd.EditorInput.Editor.GetInteger(String)
Метод позволяет пользователю ввести целое число
в диапазоне от -32768 до +32767, возвращая результат
в виде объекта PromptIntegerResult.
Метод используется для интерактивного получения целочисленного значения
от пользователя через командную строку. Пользователь может ввести число с клавиатуры,
при этом система автоматически проверяет его на соответствие допустимому диапазону и формату.
Метод выводит заданное текстовое сообщение-приглашение и ожидает ввода до тех пор,
пока не будет получено корректное значение или операция не будет прервана.
message: Сообщение, отображаемое в командной строке для приглашения пользователя
к вводу целого числа (например, "Введите количество: ").
Returns: Возвращает объект типа PromptIntegerResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — введённое пользователем целое число (int), если ввод был успешным.
* StringResult — строковое представление введённого значения.
Example
C#

HostMgd.EditorInput.Editor.GetKeywords(HostMgd.EditorInput.PromptKeywordOptions)
Метод позволяет пользователю ввести ключевое слово из заданного списка,
возвращая результат с указанием статуса и выбранного значения.
Метод используется для получения от пользователя одного из допустимых ключевых слов,
вводимого с клавиатуры. Если пользователь вводит значение, не входящее в список разрешённых,
nanoCAD выводит сообщение об ошибке и предлагает повторный ввод.
Нажатие Enter без ввода значения возвращает пустую строку, если это не запрещено настройками.
Метод поддерживает настраиваемое приглашение и флаги поведения, такие как обязательность выбора
или отмена операции.
options: Объект, содержащий параметры ввода ключевых слов
Returns: Возвращает объект типа PromptResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — введённое пользователем ключевое слово (или пустая строка, если AllowNone = true).
Статус OK возвращается, если введено допустимое ключевое слово или значение по умолчанию.
При отмене или некорректном вводе статус будет другим.
Example
C#

HostMgd.EditorInput.Editor.GetKeywords(String,...array)
Метод позволяет пользователю ввести одно из заданных ключевых слов с клавиатуры,
выводя сообщение-приглашение и проверяя ввод на соответствие списку допустимых вариантов.
Метод используется для получения от пользователя одного из заранее определённых ключевых слов.
Пользователь вводит значение в командной строке. Если введённое значение не совпадает ни с одним из списка globalKeywords,
nanoCAD выводит сообщение об ошибке и предлагает повторный ввод.
Нажатие Enter без текста возвращает пустую строку, если это не запрещено системой или настройками ввода.
Метод поддерживает интерактивный выбор из ограниченного набора допустимых команд или параметров.
message: Сообщение, отображаемое в командной строке для приглашения пользователя к вводу
(например, "Выберите действие: ").
globalKeywords: Массив строк, представляющий список допустимых ключевых слов
Returns: Возвращает объект типа PromptResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — введённое пользователем ключевое слово (если ввод успешен).
Если пользователь ввёл допустимое ключевое слово, статус будет OK.
Если операция была прервана или введено недопустимое значение, статус будет другим.
Example
C#

HostMgd.EditorInput.Editor.GetNestedEntity(HostMgd.EditorInput.PromptNestedEntityOptions)
Метод позволяет пользователю выбрать геометрический объект,
вложенный во внешнюю ссылку или блок, возвращая его идентификатор и точку выбора.
Метод используется для интерактивного выбора пользователем геометрического объекта,
который находится внутри вложенной структуры — например, внутри блока или внешней ссылки.
Метод ожидает указания мышью на объект и возвращает информацию о выбранном элементе и его расположении.
Поведение и сообщения приглашения можно настроить через параметры PromptNestedEntityOptions.
options: Объект, содержащий параметры приглашения
* Message — текст приглашения (например, "Выберите объект внутри блока: ").
Returns: Возвращает объект типа PromptNestedEntityResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* ObjectId — идентификатор выбранного вложенного объекта.
* PickedPoint — координата точки, в которой объект был выбран пользователем.
* Transform — матрица преобразования, применённая к объекту внутри блока.
Если пользователь отменил операцию или объект не был найден, статус будет отличаться от OK.

HostMgd.EditorInput.Editor.GetNestedEntity(String)
Метод позволяет пользователю выбрать геометрический объект,
вложенный во внешнюю ссылку или блок, и возвращает его идентификатор вместе с точкой выбора.
Метод используется для интерактивного выбора пользователем геометрического объекта,
который находится внутри вложенной структуры — например, внутри блока или внешней ссылки.
Пользователь указывает объект мышью, после чего метод возвращает информацию о выбранном элементе
и координате точки, в которой он был выбран. Метод выводит заданное текстовое приглашение
в командной строке перед началом операции.
message: Сообщение, отображаемое в командной строке для приглашения пользователя
к выбору вложенного объекта (например, "Выберите объект внутри блока: ").
Returns: Возвращает объект типа PromptNestedEntityResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* ObjectId — идентификатор выбранного вложенного геометрического объекта.
* PickedPoint — координата точки, в которой пользователь выбрал объект (Point3d`).
* Transform — матрица преобразования, применённая к объекту внутри блока.
Если пользователь отменил операцию или объект не был найден, статус будет отличаться от OK.

HostMgd.EditorInput.Editor.GetPoint(HostMgd.EditorInput.PromptPointOptions)
Метод позволяет пользователю указать точку в чертеже с помощью мыши
или ввести координаты вручную, возвращая результат с координатами точки.
Метод используется для интерактивного получения координат точки от пользователя.
Пользователь может выбрать точку графически — щелчком мыши на экране,
либо ввести её координаты в командной строке.
Метод предоставляет гибкие настройки приглашения через объект PromptPointOptions,
включая сообщение, начальную точку, ограничения и дополнительные подсказки.
Поддерживает привязки и фильтры, что делает его удобным для точного позиционирования.
options: Объект, содержащий параметры ввода точки
* Message — текст приглашения (например, "Укажите точку вставки: ").
Returns: Возвращает объект типа PromptPointResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — значение точки (Point3d`) в мировой системе координат (WCS), если ввод был успешным.
* StringResult — строковое представление введённых данных.
Если пользователь успешно указал точку, статус будет OK.
Если операция была прервана или введены некорректные данные, статус будет другим.
Example
C#

HostMgd.EditorInput.Editor.GetPoint(String)
Метод позволяет пользователю указать точку в чертеже с помощью мыши
или ввести её координаты вручную, возвращая результат с координатами точки.
Метод используется для интерактивного получения координат точки от пользователя.
Пользователь может выбрать точку графически — щелчком мыши на экране,
либо ввести координаты в командной строке. Метод выводит заданное сообщение-приглашение
и ожидает ввода до тех пор, пока не будет получена допустимая точка или операция не будет прервана.
Поддерживает стандартные привязки и фильтры, что делает его удобным для точного позиционирования.
message: Сообщение, отображаемое в командной строке для приглашения пользователя
к выбору точки (например, "Укажите центр окружности: ").
Returns: Возвращает объект типа PromptPointResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — значение точки (Point3d`) в мировой системе координат (WCS), если ввод был успешным.
* StringResult — строковое представление введённых данных.
Если пользователь успешно указал точку, статус будет OK.
Если операция была прервана или введены некорректные данные, статус будет другим.
Example
C#

HostMgd.EditorInput.Editor.GetSelection(HostMgd.EditorInput.PromptSelectionOptions)
Метод позволяет пользователю выбрать множество графических объектов в интерактивном режиме,
используя заданные параметры приглашения.
Метод используется для получения набора объектов, выбранных пользователем в графической области nanoCAD.
Пользователь может указывать объекты мышью, выделять рамкой и т. д. Метод предоставляет возможность настроить
процесс выбора через объект PromptSelectionOptions, например, задать сообщение-приглашение,
использовать перекрестье или ограничить количество выбора.
Фильтрация объектов не применяется — пользователь может выбрать любые допустимые графические элементы.
options: Объект, содержащий параметры выбора
* MessagePrompt — текст приглашения (например, "Выберите объекты: ").
Returns: Возвращает объект типа PromptSelectionResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId`) выбранных объектов (если операция успешна).
* StringResult — строковое представление введённой команды или ключевого слова.
Если пользователь успешно выбрал объекты, статус будет OK, и в Value будет содержаться их список.
Example
C#

HostMgd.EditorInput.Editor.GetSelection(HostMgd.EditorInput.PromptSelectionOptions,HostMgd.EditorInput.SelectionFilter)
Метод позволяет пользователю выбрать множество объектов на чертеже
с использованием заданных параметров и фильтра, ограничивающего типы
допустимых для выбора объектов.
Метод используется для интерактивного выбора пользователем одного или нескольких графических объектов в nanoCAD.
В отличие от базовой версии GetSelection(), этот метод позволяет применить фильтр, который ограничивает список
допустимых для выбора объектов — например, только линии, окружности или объекты определённого слоя.
Пользователь может выбирать объекты мышью, рамкой или другими способами, поддерживаемыми системой.
Параметры приглашения (PromptSelectionOptions) позволяют настроить поведение и сообщения во время выбора.
options: Объект, содержащий параметры приглашения
* MessagePrompt — текст приглашения (например, "Выберите объекты: ").
filter: Фильтр, определяющий, какие объекты могут быть выбраны.
Тип: SelectionFilter
Returns: Возвращает объект типа PromptSelectionResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* Value— объект типа SelectionSet, содержащий список идентификаторов (ObjectId`) выбранных объектов (если операция успешна).
* StringResult — строковое представление введённой команды или ключевого слова (если использовался ручной ввод).
Если пользователь успешно выбрал объекты, соответствующие фильтру,
статус будет равен PromptStatus.OK, и в Value будет содержаться набор выбранных объектов.
Example
C#

HostMgd.EditorInput.Editor.GetSelection(HostMgd.EditorInput.SelectionFilter)
Метод предназначени для получения набора объектов, выбранных пользователем и соответствующих заданному фильтру.
Метод используется для получения множества графических объектов, выделенных пользователем в интерактивном режиме,
с последующей фильтрацией по заданным критериям. Пользователь может выбрать объекты на чертеже стандартными средствами
(щелчок, рамка и т. д.), а затем к результату выбора применяется фильтр, который оставляет только те объекты,
которые удовлетворяют условиям фильтрации — например, тип объекта, слой или другие свойства.
Если ни один из выбранных объектов не проходит фильтр, операция завершается с ошибкой или отменяется.
filter: Фильтр, определяющий допустимые для выбора объекты. Строится на основе массива TypedValue,
Returns: Возвращает объект типа PromptSelectionResult, который содержит:
* Status — статус выполнения операции (OK, Cancel, Error и др.).
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных и прошедших фильтрацию объектов (если операция успешна).
* StringResult — строковое значение, если выбор был прерван с помощью клавиатуры или ключевого слова.
Если операция завершена успешно, статус будет равен PromptStatus.OK, и в Value будет содержаться отфильтрованный набор выбранных объектов.
Example
C#

HostMgd.EditorInput.Editor.GetString(HostMgd.EditorInput.PromptStringOptions)
Метод позволяет пользователю ввести текстовую строку, возвращая результат с информацией о статусе и введённом значении.
Метод используется для интерактивного получения текстового ввода от пользователя через командную строку nanoCAD.
Пользователь может ввести произвольную строку или выбрать значение из списка ключевых слов (если они заданы).
Метод предоставляет гибкие настройки приглашения через объект PromptStringOptions, такие как сообщение, начальное значение,
ограничения на ввод и возможность игнорировать пробелы. Результат операции возвращается в виде объекта PromptResult.
options: Объект, содержащий параметры ввода строки
* Message — текст приглашения (например, "Введите имя: ").
Returns: Возвращает объект типа PromptResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — введённая пользователем строка (если ввод успешен).
Если пользователь ввёл допустимое значение, статус будет равен PromptStatus.OK.
Example
C#

HostMgd.EditorInput.Editor.GetString(String)
Метод позволяет пользователю ввести текстовую строку через командную строку,
возвращая результат с информацией о статусе и введённом значении.
Метод используется для получения текстового ввода от пользователя в интерактивном режиме.
Пользователь вводит строку с клавиатуры, при этом nanoCAD выводит заданное сообщение-приглашение.
Метод ожидает ввод до тех пор, пока не будет получено допустимое значение или операция не будет прервана.
Результат возвращается в виде объекта PromptResult, который содержит статус операции и введённую строку.
message: Сообщение, отображаемое в командной строке для приглашения пользователя к вводу строки (например, "Введите комментарий
Returns: Возвращает объект типа PromptResult, который содержит:
* Status — статус операции (OK, Cancel, Error и др.).
* StringResult — введённая пользователем строка (если ввод был успешным).
Если пользователь успешно ввёл строку, статус будет равен PromptStatus.OK.
Example
C#

HostMgd.EditorInput.Editor.GetViewportNumber(System.Drawing.Point)
Метод предназначен для получения номера видового экрана, в котором находится указанная точка на экране.
Метод используется для определения, в каком видовом экране nanoCAD находится заданная точка,
указанная в координатах клиентской области окна редактора.
Это может быть полезно при обработке пользовательского ввода,
связанного с несколькими видовыми экранами, например,
при работе с мультимониторными интерфейсами или разделённым представлением чертежа.
point: Точка в клиентных координатах окна (в пикселях), относительно которой определяется номер видового экрана.
Returns: Возвращает значение типа int, представляющее номер видового экрана,
в котором находится указанная точка.
Если точка не принадлежит ни одному из видовых экранов, метод может вернуть -1.
Example
C#

HostMgd.EditorInput.Editor.InitCommandVersion(System.Int32)
Метод инициализирует версию команды и возвращает предыдущее значение версии.
Метод не реализован.
Метод используется для установки номера версии текущей команды,
что может быть необходимо для обеспечения совместимости с различными реализациями команд
или для отслеживания изменений в их поведении. Метод принимает новое значение версии команды,
сохраняет его во внутреннем состоянии и возвращает предыдущее значение,
позволяя при необходимости восстановить прежнюю версию.
Метод не реализован.
nVersion: Новое значение версии команды, которое должно быть установлено.
Returns: Возвращает значение типа int, представляющее предыдущий номер версии команды до её изменения.
Example
C#

HostMgd.EditorInput.Editor.PointToScreen(Teigha.Geometry.Point3d,System.Int32)
Метод преобразует трёхмерную точку из пространства чертежа в координаты экрана указанного видового экрана.
Метод используется для перевода точки из мировой системы координат (WCS)
или системной координатной системы чертежа в экранные координаты относительно
конкретного видового экрана. Это может быть полезно при отрисовке графических
элементов поверх чертежа или при обработке пользовательского ввода, привязанного
к определённому видовому экрану.
pt: Трёхмерная точка в координатах чертежа, которую необходимо преобразовать.
viewportNumber: Номер видового экрана, относительно которого выполняется преобразование.
Returns: Возвращает значение типа System.Drawing.Point, представляющее координаты точки на экране (в пикселях)
относительно указанного видового экрана. Эта точка может быть использована, например, для вывода
информации поверх чертежа или взаимодействия с интерфейсными элементами.
Example
C#

HostMgd.EditorInput.Editor.PointToWorld(System.Drawing.Point)
Метод преобразует точку из экранных координат в трёхмерную точку в
мировой системе координат (WCS) текущего видового экрана.
Метод используется для перевода координат точки, заданной в клиентских пикселях окна редактора,
в соответствующую трёхмерную точку в мировой системе координат (WCS), с учётом текущего представления чертежа.
Это позволяет определить, какая точка в пространстве чертежа соответствует указанному месту на экране — например,
при обработке кликов мыши или других событий пользовательского интерфейса.
pt: Точка в экранных координатах (в пикселях), относительно клиентской области окна редактора.
Returns: Возвращает объект типа Point3d, представляющий координаты точки в мировой системе координат (WCS),
соответствующей положению курсора или указанной области на экране текущего видового экрана.
Example
C#

HostMgd.EditorInput.Editor.PointToWorld(System.Drawing.Point,System.Int32)
Метод преобразует точку из экранных координат в трёхмерную мировую координату
с учётом указанного видового экрана.
Метод используется для перевода координат точки из клиентской области окна (в пикселях)
в соответствующую точку в мировой системе координат (WCS), связанную с конкретным видовым экраном.
Это позволяет определить, какая точка чертежа находится под указанным местом на экране — например,
при обработке пользовательского ввода или построении графических элементов интерфейса.
pt: Точка в экранных координатах (в пикселях),
viewportNumber: Номер видового экрана, используемого для преобразования
Returns: Возвращает объект типа Point3d, представляющий собой координаты точки в мировой системе координат (WCS),
соответствующие указанному положению на экране и проекции текущего видового экрана.
Example
C#

HostMgd.EditorInput.Editor.SelectAll(HostMgd.EditorInput.SelectionFilter)
Метод выбирает все объекты в текущем пространстве чертежа,
соответствующие заданному фильтру, и возвращает их
в виде набора выделенных объектов.
Метод предназначен для программного выбора всех доступных объектов
в пространстве модели или листа с применением фильтра, который ограничивает
выборку только теми объектами, которые удовлетворяют заданным критериям.
Это позволяет выполнять массовые операции над определённым типом объектов —
например, только линиями, окружностями или объектами конкретного слоя.
Результат возвращается в виде объекта PromptSelectionResult.
filter: Фильтр выборки, определяющий, какие объекты будут включены в результат.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). Если выборка успешна, статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, прошедших фильтрацию.
* InputString — строковое значение, если операция была прервана пользователем с помощью клавиатуры.
Если ни один объект не соответствует фильтру, Value может быть null, а статус — отличным от OK.
Example
C#

HostMgd.EditorInput.Editor.SelectCrossingPolygon(Teigha.Geometry.Point3dCollection)
Метод возвращает набор объектов, которые пересекают или полностью находятся внутри заданного многоугольника.
Метод используется для выбора геометрических объектов чертежа,
которые либо пересекаются с границей, либо полностью находятся
внутри замкнутого многоугольника, заданного набором вершин.
Этот метод особенно полезен при точном выделении объектов
на сложных чертежах, где стандартные методы выбора рамкой
могут быть недостаточно гибкими.
polygon: Коллекция трёхмерных точек (Point3d), представляющих вершины
Returns: Возвращает объект типа PromptSelectionResult, содержащий результат выборки:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
* InputString — строковое значение, если операция была прервана пользователем.
Если ни один объект не удовлетворяет условию попадания в/на многоугольник, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectCrossingPolygon(Teigha.Geometry.Point3dCollection,HostMgd.EditorInput.SelectionFilter)
Метод возвращает набор объектов, пересекающих или находящихся внутри
заданного многоугольника и соответствующих указанному фильтру.
Метод используется для выбора геометрических объектов чертежа,
которые находятся внутри или пересекают замкнутый многоугольник,
с дополнительной фильтрацией по типу объекта, слою, цвету и другим параметрам.
Многоугольник задается коллекцией точек в мировых координатах (WCS).
Метод позволяет точно выделять объекты на чертеже с учётом как пространственного положения,
так и внутренних свойств, что делает его удобным для массовых операций
с определёнными категориями объектов.
polygon: Коллекция трёхмерных точек (Point3d), представляющих вершины многоугольника
filter: Фильтр, определяющий, какие объекты будут включены в выборку.
Returns: Возвращает объект типа PromptSelectionResult, содержащий результат выборки:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям многоугольника и фильтра.
* StringResult — строковое значение.
Если ни один объект не удовлетворяет условиям, Value может быть null, а статус — отличным от OK.
Example
C#

HostMgd.EditorInput.Editor.SelectCrossingWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,HostMgd.EditorInput.SelectionFilter,System.Boolean)
Метод предоставляет набор объектов, пересекающих или находящихся внутри
прямоугольной области, с возможностью фильтрации и выбора подобъектов.
Метод используется для выбора геометрических объектов, которые полностью
находятся внутри или пересекаются с прямоугольной областью, заданной двумя угловыми точками.
Выборка может быть дополнена фильтром по типу объекта, слою, цвету и другим свойствам.
Если параметр forceSubEntitySelection установлен в true, разрешено выделять отдельные подобъекты
(например, сегменты полилинии).
pt1: Первая угловая точка прямоугольного окна выборки в мировых координатах.
pt2: Вторая угловая точка прямоугольного окна выборки. Тип Point3d.
filter: Фильтр, определяющий, какие объекты будут включены в выборку.
forceSubEntitySelection: Флаг, определяющий возможность выбора подобъктов.
Returns: Возвращает объект типа PromptSelectionResult, содержащий результат выборки:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
* StringResult — строковое значение.
Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectCrossingWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод возвращает набор объектов, которые пересекают или находятся
внутри прямоугольного окна, заданного двумя противоположными угловыми точками.
Метод используется для интерактивной выборки геометрических объектов чертежа,
находящихся внутри или пересекающих прямоугольную область.
Прямоугольник определяется двумя точками — противоположными углами окна в мировой системе координат (WCS).
Объекты, полностью или частично попадающие в эту область, включаются в результат выборки.
pt1: Первая точка, задающая один из углов прямоугольного окна.
pt2: Вторая точка, задающая противоположный угол прямоугольного окна.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). Если выборка успешна, статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
* StringResult — строковое значение.
Если ни один объект не попал в окно выбора, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectCrossingWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,HostMgd.EditorInput.SelectionFilter)
Метод возвращает набор объектов, находящихся внутри или пересекающих прямоугольное окно,
заданное двумя точками, и соответствующих указанному фильтру.
Метод используется для выборки геометрических объектов чертежа,
которые попадают в прямоугольную область, заданную двумя противоположными угловыми точками.
Объекты выбираются как по пересечению с границей окна, так и по нахождению внутри него.
При этом дополнительно применяется фильтр, который позволяет ограничить выборку только объектами,
удовлетворяющими определённым критериям (тип, слой, цвет и т. д.).
pt1: Первая угловая точка прямоугольного окна в мировых координатах (WCS). Тип Point3d.
pt2: Вторая угловая точка, противоположная первой, которая вместе с pt1 определяет область окна. Тип Point3d.
filter: Фильтр, задающий условия для выбираемых объектов.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям окна и фильтра.
* StringResult — строковое значение.
Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectFence(Teigha.Geometry.Point3dCollection)
Метод возвращает набор объектов, пересекаемых ломаной линией выбора, заданной множеством вершин.
Метод используется для выбора геометрических объектов чертежа, которые пересекаются с линией,
построенной по заданным точкам. Линия выбора (fence) представляет собой последовательность
соединённых отрезков, и все объекты, пересекающие эту линию, включаются в результат.
Метод удобен при выделении объектов вдоль сложной траектории.
fence: Коллекция трёхмерных точек (Point3d), представляющих вершины линии выбора.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
* StringResult — строковое значение.
Если ни один объект не пересекает линию выбора, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectFence(Teigha.Geometry.Point3dCollection,HostMgd.EditorInput.SelectionFilter)
Метод возвращает набор объектов, пересекаемых ломаной линией выбора,
заданной точками, и соответствующих указанному фильтру.
Метод используется для выборки геометрических объектов чертежа, которые пересекаются с линией выбора
— последовательностью отрезков, построенных по заданным вершинам.
При этом дополнительно применяется фильтр, позволяющий ограничить выборку только теми объектами,
которые удовлетворяют определённым критериям (например, типу объекта, слою или цвету).
Метод удобен при выделении объектов вдоль произвольной траектории с учетом их свойств.
fence: Коллекция трёхмерных точек (Point3d), представляющих вершины линии выбора.
filter: Фильтр, задающий условия для выбираемых объектов.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям линии выбора и фильтра.
* StringResult — строковое значение.
Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод возвращает набор объектов, полностью находящихся внутри прямоугольного окна,
заданного двумя противоположными угловыми точками.
Метод используется для выборки геометрических объектов чертежа,
которые полностью расположены внутри прямоугольной области.
Прямоугольник определяется двумя точками — противоположными углами окна
в мировой системе координат (WCS). В отличие от метода SelectCrossingWindow,
данный метод не включает объекты, пересекающие границу окна — только те,
что полностью в нём помещаются.
pt1: Первая угловая точка прямоугольного окна в мировых координатах (WCS).
pt2: Вторая угловая точка, противоположная первой, которая вместе
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). Если выборка успешна, статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
* StringResult — строковое значение, если операция была прервана пользователем с помощью клавиатуры.
Если ни один объект не находится полностью внутри окна, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,HostMgd.EditorInput.SelectionFilter)
Метод возвращает набор объектов, полностью находящихся внутри прямоугольного окна,
заданного двумя точками, и соответствующих указанному фильтру.
Метод используется для выборки геометрических объектов чертежа, которые
полностью расположены внутри прямоугольной области, определённой
двумя противоположными угловыми точками.
В отличие от перекрёстного выделения, данный метод исключает объекты,
частично пересекающие границы окна. Кроме того, к выборке применяется фильтр,
позволяющий ограничить результат только объектами, удовлетворяющими
заданным критериям (тип, слой, цвет и т. д.).
pt1: Первая угловая точка прямоугольного окна в мировых координатах (WCS). Тип Point3d.
pt2: Вторая угловая точка, противоположная первой,
filter: Фильтр, задающий условия для выбираемых объектов.
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям окна и фильтра.
* StringResult — строковое значение, если операция была прервана пользователем.
Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectWindowPolygon(Teigha.Geometry.Point3dCollection)
Метод возвращает набор объектов, полностью находящихся внутри заданного многоугольника,
построенного по вершинам.
Метод используется для выборки геометрических объектов чертежа, которые
полностью расположены внутри замкнутого многоугольника, заданного коллекцией точек.
В отличие от перекрёстного выделения (SelectCrossingPolygon), данный метод
включает только те объекты, которые полностью находятся внутри области многоугольника.
polygon: Коллекция трёхмерных точек (Point3d), представляющих вершины многоугольника
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов.
* StringResult — строковое значение.
Если ни один объект не находится полностью внутри многоугольника, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SelectWindowPolygon(Teigha.Geometry.Point3dCollection,HostMgd.EditorInput.SelectionFilter)
Метод возвращает набор объектов, полностью находящихся
внутри заданного многоугольника и соответствующих указанному фильтру.
Метод используется для выборки геометрических объектов чертежа,
которые полностью расположены внутри замкнутого многоугольника,
заданного коллекцией вершин. В отличие от перекрёстного выделения,
данный метод исключает объекты, частично пересекающие границу многоугольника.
К выборке применяется фильтр, который позволяет ограничить результат
только теми объектами, которые удовлетворяют заданным критериям
(например, типу объекта, слою или цвету).
polygon: Коллекция трёхмерных точек (Point3d), представляющих вершины многоугольника
filter: Фильтр, задающий условия для выбираемых объектов. Может включать проверки
Returns: Возвращает объект типа PromptSelectionResult, содержащий:
* Status — статус выполнения (OK, Cancel, Error и др.). При успешной выборке статус равен PromptStatus.OK.
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId) выбранных объектов, удовлетворяющих условиям многоугольника и фильтра.
* StringResult — строковое значение.
Если ни один объект не удовлетворяет условиям выборки, Value может быть null.
Example
C#

HostMgd.EditorInput.Editor.SetCurrentView(Teigha.DatabaseServices.ViewTableRecord)
Метод устанавливает текущий вид чертежа, используя заданную запись таблицы видов.
Метод используется для программного изменения текущего вида в чертеже nanoCAD.
Он принимает объект ViewTableRecord, представляющий собой запись из таблицы видов,
и применяет его параметры (положение камеры, направление взгляда, окно просмотра и др.)
к активному пространству модели или листа. Это позволяет быстро переключать отображение
чертежа между различными предопределенными или динамически созданными видами.
value: Объект, представляющий новую конфигурацию вида.

HostMgd.EditorInput.Editor.SetImpliedSelection(HostMgd.EditorInput.SelectionSet)
Метод устанавливает набор объектов как текущее неявное выделение, доступное для следующей команды.
Метод используется для программной установки набора объектов в качестве неявного выделения
(implied selection), которое становится доступным для следующей выполняемой команды.
Это позволяет имитировать ситуацию, когда пользователь уже выделил объекты до запуска команды —
аналогично функции "previous selection" в некоторых командах nanoCAD.
Метод полезен при автоматизации и последовательном выполнении команд без повторного выбора объектов.
selectionSet: Набор объектов (ObjectId), который будет установлен как текущее неявное выделение.

HostMgd.EditorInput.Editor.SetImpliedSelection(array )
Метод устанавливает массив объектов как текущее неявное выделение для последующих команд.
Метод используется для программного задания набора объектов,
который будет считаться неявно выделенным перед выполнением следующей команды.
Это позволяет автоматически предоставлять выделение другим командам
без необходимости повторного выбора объектов пользователем.
Метод может быть полезен при создании скриптов или плагинов,
где требуется сохранить и передать контекст выборки между операциями.
selectedObjects: Массив идентификаторов объектов (ObjectId),

HostMgd.EditorInput.Editor.Snap(System.String,Teigha.Geometry.Point3d)
Метод привязывает указанную точку к ближайшей точке привязки чертежа
в соответствии с заданным режимом привязки. Метод не реализован.
Метод используется для выполнения операции привязки точки в чертеже nanoCAD
по заданному режиму. Он позволяет корректировать координаты входной точки (input) так,
чтобы она совпадала с одной из опорных точек чертежа — например, узлом сетки, концом линии,
центром окружности и т. д. Режим привязки задаётся строковым параметром snapMode,
который определяет тип используемой привязки (например, "END", "MID", "CEN" и т. п.).
Метод не реализован
snapMode: Режим привязки, указывающий, к какому типу опорной точки
Поддерживаются стандартные режимы привязки, такие как:
input: Входная точка в мировых координатах (WCS), которую необходимо
Returns: Возвращает значение типа Point3d, представляющее собой скорректированную точку
после применения привязки. Если привязка не может быть выполнена (например, подходящая точка не найдена),
возвращается исходная точка input.
Example
C#

HostMgd.EditorInput.Editor.StartUserInteraction(System.Windows.Forms.Control)
Метод скрывает указанную модальную форму и позволяет пользователю продолжить
взаимодействие с чертежом, выполняя другие команды.
Метод используется для временного освобождения интерфейса nanoCAD от блокировки,
вызванной отображением модальной формы. Это позволяет продолжить выполнение
других команд в редакторе, не закрывая форму полностью. Метод возвращает объект
EditorUserInteraction, который управляет контекстом взаимодействия пользователя
с чертежом до тех пор, пока форма остаётся открытой.
modalForm: Модальная форма (или элемент управления), которая была открыта
Returns: Возвращает объект типа EditorUserInteraction, представляющий текущий контекст
взаимодействия пользователя с редактором. Этот объект реализует IDisposable
и должен быть использован внутри блока using, чтобы корректно завершить сессию
взаимодействия после завершения операции.
Example
C#

HostMgd.EditorInput.Editor.TraceBoundary(Teigha.Geometry.Point3d,System.Boolean)
Метод возвращает коллекцию полилиний, образующих замкнутый контур вокруг указанной точки,
с возможностью поиска внутренних областей (островков).
Метод используется для автоматического определения замкнутого контура в чертеже,
образованного геометрическими объектами (обычно полилиниями), окружающими заданную точку.
Точка seedPoint служит начальным ориентиром для поиска.
Если параметр detectIslands установлен в true, метод также учитывает внутренние замкнутые
области (островки) внутри основного контура. Метод может применяться, например,
при создании штриховки или анализе замкнутых зон чертежа.
seedPoint: Точка в мировой системе координат (WCS), вокруг которой производится поиск замкнутого контура.
Тип: Point3d
detectIslands: Флаг, указывающий, следует ли обнаруживать внутренние замкнутые области (островки)
внутри найденного контура:
Returns: Возвращает объект типа DBObjectCollection, содержащий все найденные полилинии,
которые формируют замкнутый контур вокруг указанной точки.
Если контур не найден, возвращается пустая коллекция.
Example
C#

HostMgd.EditorInput.Editor.ViewportIdFromNumber(System.Int32)
Метод возвращает идентификатор видового экрана по его номеру в текущем чертеже.
Метод используется для получения идентификатора (ObjectId) видового экрана,
который соответствует указанному номеру. Номер видового экрана определяется
в порядке их создания в пространстве листа (paper space).
Этот метод позволяет программно обращаться к конкретным видовым экранам
для изменения их параметров или управления отображением.
viewportNumber: Номер видового экрана (начиная с 1), для которого необходимо получить идентификатор.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на объект видового экрана в базе данных чертежа.
Если видовой экран с указанным номером не найден, возвращается ObjectId.Null.
Example
C#

HostMgd.EditorInput.Editor.WriteMessage(IFormatProvider,String,...array)
Метод выводит форматированный текст в командной строке nanoCAD.
Метод используется для отображения текстового сообщения в командной строке редактора nanoCAD.
Позволяет выводить строки с подстановкой значений по заданному формату,
аналогично стандартным функциям форматирования .NET (String.Format).
Предоставляет возможность локализованного форматирования чисел и дат через указание IFormatProvider.
provider: Объект, предоставляющий информацию о форматировании (например, культуре или языковом стандарте),
sFormat: Строка формата, содержащая текст и спецификаторы замены в стиле
String.Format, например: "Точка X={0}, Y={1}".
aAgs: Массив объектов, значения которых подставляются в строку формата sFormat.

HostMgd.EditorInput.Editor.WriteMessage(String)
Метод выводит заданный текст в командной строке nanoCAD.
Метод используется для отображения текстовой информации в командной строке приложения nanoCAD.
Он предназначен для информирования пользователя о выполняемых действиях,
результатах операций или возникших ошибках.
Метод просто выводит переданную строку без форматирования.
message: Текстовое сообщение, которое будет выведено в командной строке.

HostMgd.EditorInput.Editor.WriteMessage(String,...array)
Метод выводит форматированное текстовое сообщение в командной строке nanoCAD,
подставляя значения в указанную строку формата.
Метод используется для отображения динамически формируемого текста в командной строке редактора.
Он работает аналогично методу String.Format, позволяя включать в выводимую строку
подстановочные элементы (например, {0}, {1}), которые заменяются на значения из массива aAgs.
Это удобно для вывода информации с переменными значениями — координатами, числами, именами объектов и т. д.
sFormat: Строка формата, содержащая текст и спецификаторы подстановки, например
"Объект ID: {0}, Тип
Тип: String
aAgs: Массив объектов, значения которых будут подставлены в строку формата sFormat при выводе.

HostMgd.EditorInput.Editor.ActiveViewportId
Свойство предназначено для получения идентификатора активного видового экрана в текущем чертеже.
Свойство предоставляет доступ к идентификатору (ObjectId) активного видового экрана,
который может быть либо объектом типа ViewportTableRecord, либо Viewport,
в зависимости от того — активна ли вкладка "Модель" или "Лист".
Это позволяет программно определить, какой именно видовой экран используется в данный момент
для отображения чертежа. Свойство доступно только для чтения и обновляется автоматически
при переключении между видовыми экранами.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на запись таблицы видовых экранов
(или сам видовой экран), которая является активной в текущем контексте документа.
Если активный видовой экран не определён, возвращается ObjectId.Null.
Example
C#

HostMgd.EditorInput.Editor.CurrentUserCoordinateSystem
Свойство предоставляет доступ к матрице преобразования,
описывающей текущую пользовательскую систему координат (ПСК) в чертеже.
Свойство позволяет получать или устанавливать матрицу преобразования (Matrix3d),
которая определяет ориентацию и положение пользовательской системы координат (ПСК)
относительно мировой системы координат (МСК).
Это свойство используется при работе с интерактивным вводом,
построением объектов в заданной ориентации и других операциях,
зависящих от текущей системы координат.
Свойство доступно как для чтения, так и для записи.
Returns: Возвращает объект типа Matrix3d, представляющий собой матрицу преобразования
текущей пользовательской системы координат.
Эта матрица включает информацию о положении начала координат
и направлении осей X, Y и Z ПСК относительно МСК.
Example
C#

HostMgd.EditorInput.Editor.CurrentViewportObjectId
Свойство предназначено для получения идентификатора текущего видового экрана, активного на вкладке "Лист".
Свойство предоставляет доступ к идентификатору (ObjectId) объекта Viewport,
который является активным в пространстве листа (paper space) в данный момент.
Оно позволяет программно определить, какой именно видовой экран используется
для отображения модели в текущем контексте.
Свойство доступно только для чтения и актуально
при работе с несколькими видовыми экранами на листе.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на объект Viewport
в базе данных чертежа. Если активный видовой экран не определён или находится
в пространстве модели, возвращается ObjectId.Null.
Example
C#

HostMgd.EditorInput.Editor.Document
Свойство предоставляет доступ к документу, с которым связан текущий редактор.
Свойство используется для получения ссылки на объект Document, представляющий активный чертёж,
открытый в nanoCAD, и связанный с текущим экземпляром редактора.
Оно позволяет получать информацию о чертеже, управлять его состоянием, открывать и закрывать документы,
а также взаимодействовать с базой данных чертежа.
Returns: Возвращает объект типа Document, который представляет текущий чертёж,
связанный с редактором. Если документ не определён (например, редактор
не привязан к какому-либо документу), может вернуть null.
Example
C#

HostMgd.EditorInput.Editor.IsDragging
Свойство предназначено для проверки, находится ли редактор в состоянии обработки события перетаскивания мыши.
Свойство используется для определения, было ли вызвано новое событие мыши (например, движение или клик)
во время выполнения текущего действия — например, при отрисовке или длительных вычислениях.
Оно позволяет приложениям nanoCAD быстро реагировать на пользовательский ввод и прерывать выполнение ненужных операций,
если событие перетаскивания уже устарело.
Это особенно полезно при интерактивном перемещении объектов, чтобы избежать лишних вычислений для устаревших координат.
Returns: Возвращает значение типа bool:
* true — если в очередь событий добавлено новое событие мыши, и текущее действие перетаскивания должно быть завершено как устаревшее.
* false — если событие перетаскивания всё ещё актуально и его можно продолжить обрабатывать.
Example
C#

HostMgd.EditorInput.Editor.IsQuiescent
Свойство предназначено для определения, находится ли редактор в состоянии
ожидания пользовательского ввода без активных фоновых операций.
Свойство используется для проверки текущего состояния редактора nanoCAD —
является ли он "спокойным", то есть не выполняет каких-либо команд или операций перерисовки,
и готов к восприятию нового пользовательского ввода.
Это может быть полезно при разработке плагинов или реакции на события,
когда важно убедиться, что редактор находится в стабильном состоянии
перед началом выполнения определённого действия.
Returns: Возвращает значение типа bool:
* true — если редактор находится в спокойном состоянии (ожидает ввода пользователя и не занят выполнением команд).
* false — если редактор в данный момент выполняет какую-либо операцию или обрабатывает событие.
Example
C#

HostMgd.EditorInput.Editor.IsQuiescentForTransparentCommand
Свойство предназначено для проверки, готов ли редактор к выполнению прозрачной команды.
Свойство используется для определения, находится ли редактор nanoCAD в состоянии,
допускающем выполнение прозрачных команд — то есть, когда редактор не занят выполнением
основной команды и может принять команду, вызванную во время другой операции
(например, настройки или запросы).
Это состояние важно при реализации команд, которые могут быть вызваны из контекста
других команд без их прерывания.
Returns: Возвращает значение типа bool:
* true — если редактор находится в состоянии, подходящем для выполнения прозрачной команды.
* false — если редактор занят выполнением другой команды или находится в недопустимом состоянии.
Example
C#

HostMgd.EditorInput.Editor.MouseHasMoved
Свойство предназначено для проверки, перемещался ли курсор мыши
в текущем контексте редактора с момента последней обработки события.
Свойство используется при интерактивных операциях (например, при перетаскивании или динамической отрисовке)
для определения, было ли зафиксировано новое движение мыши.
Если событие движения произошло, это позволяет прервать текущую длительную операцию
и немедленно обновить состояние на основе актуальных координат курсора,
избегая устаревших вычислений.
Свойство особенно полезно в методах, где важна отзывчивость к пользовательскому вводу.
Returns: Возвращает значение типа bool:
* true — если курсор мыши был перемещён с момента последнего обновления.
* false — если перемещения мыши не было и текущее положение остаётся актуальным.
Example
C#

HostMgd.EditorInput.Editor.UseCommandLineInterface
Свойство предоставляет возможность проверить или задать,
используется ли командная строка nanoCAD для взаимодействия с пользователем.
Свойство не реализовано.
Свойство определяет, включен ли интерфейс командной строки в текущем контексте редактора.
Оно может применяться для управления режимом ввода — например, при необходимости
временно отключить вывод сообщений и запросов в командную строку
или принудительно перевести взаимодействие в графический режим
(например, при работе с формами или диалогами).
Returns: Возвращает значение типа bool:
* true — если командная строка активна и используется для взаимодействия с пользователем.
* false — если взаимодействие осуществляется другим способом (например, через модальные окна или графические элементы).
Свойство не реализовано, всегда возвращает false.