Teigha.Geometry.Line2dCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для этой коллекции.
Тип IEnumerator.