Teigha.Runtime.ExtensionApplicationAttribute
Класс ExtensionApplicationAttribute определяет пользовательский атрибут, который помечает сборку как расширение nanoCAD.
Класс ExtensionApplicationAttribute определяет пользовательский атрибут, который помечает сборку как расширение nanoCAD.
Тип, который представляет этот атрибут, обязан реализовать интерфейс IExtensionApplication.
При загрузке сборки этот атрибут используется для создания экземпляра типа точки входа приложения.

Teigha.Runtime.ExtensionApplicationAttribute.#ctor(System.Type)
Конструктор класса ExtensionApplicationAttribute.
Создает новый экземпляр, используя переданный в конструктор тип точки входа.
Конструктор класса ExtensionApplicationAttribute.
Создает новый экземпляр, используя переданный в конструктор тип точки входа.
entryPointType: Входной тип точки входа.

Teigha.Runtime.ExtensionApplicationAttribute.Type
Свойство Type возвращает тип, который представлен данным объектом.
Свойство Type возвращает тип, который представлен данным объектом.
Returns: Возвращает тип пользовательского атрибута.
Тип System.Type.