Teigha.DatabaseServices.DataCellCollection
Класс представляет коллекцию объектов типа DataCell.
Класс представляет коллекцию объектов типа DataCell.

Teigha.DatabaseServices.DataCellCollection.#ctor
Конструктор по умолчанию класса DataCellCollection.
Конструктор по умолчанию класса DataCellCollection.

Teigha.DatabaseServices.DataCellCollection.Add(Teigha.DatabaseServices.DataCell)
Метод добавляет в коллекцию новый объект DataCell.
Метод добавляет в коллекцию новый объект DataCell и возвращает его индекс.
value: Добавляемый объект. Тип DataCell.
Returns: Возвращает отсчитываемый от нуля индекс нового элемента коллекции. Тип int.

Teigha.DatabaseServices.DataCellCollection.Contains(Teigha.DatabaseServices.DataCell)
Метод проверяет, содержит ли данная коллекция элемент, соответствующий указанному объекту DataCell.
Метод проверяет, содержит ли данная коллекция элемент, соответствующий указанному объекту DataCell.
value: Искомый объект типа DataCell.
Returns: Возвращает true, если коллекция содержит объект value.
В противном случае возвращает false.

Teigha.DatabaseServices.DataCellCollection.CopyTo(array,System.Int32)
Копирует объекты из коллекции в указанный массив, начиная с заданного индекса.
Копирует объекты из коллекции в указанный массив, начиная с заданного индекса.
arr: Массив, в который копируется коллекция. Тип DataCell[].
index: Индекс в массиве, начиная с которого выполняется копирование элементов коллекции. Тип int.

Teigha.DatabaseServices.DataCellCollection.IndexOf(Teigha.DatabaseServices.DataCell)
Метод возвращает индекс элемента коллекции, соответствующего входному объекту DataCell.
Метод возвращает индекс элемента коллекции, соответствующего входному объекту DataCell.
Индексы элементов в коллекции отсчитываются от нуля.
value: Объект типа DataCell, для которого предполагается найти индекс.
Returns: Возвращает индекс элемента коллекции, если объект value найден. В противном случае возвращает -1.

Teigha.DatabaseServices.DataCellCollection.Insert(System.Int32,Teigha.DatabaseServices.DataCell)
Метод позволяет вставить указанный объект DataCell в эту коллекцию по заданному индексу.
Метод позволяет вставить указанный объект DataCell в эту коллекцию по заданному индексу.
Если предоставленный индекс недействителен, метод выбрасывает исключение ArgumentOutOfRangeException.
index: Индекс, по которому вставляется объект value. Тип int.
value: Вставляемый в коллекцию объект.  Тип DataCell.

Teigha.DatabaseServices.DataCellCollection.Remove(Teigha.DatabaseServices.DataCell)
Метод удаляет из коллекции элемент, соответствующий входному объекту DataCell.
Метод удаляет из коллекции элемент, соответствующий входному объекту DataCell.
value: Удаляемый из коллекции элемент.  Тип DataCell.

Teigha.DatabaseServices.DataCellCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент по указанному индексу.
Метод удаляет из коллекции элемент по указанному индексу.
Если предоставленный индекс недействителен, метод выбрасывает исключение ArgumentOutOfRangeException.
index: Индекс удаляемого элемента коллекции. Тип int.

Teigha.DatabaseServices.DataCellCollection.Count
Свойство возвращает текущее количество элементов в коллекции.
Свойство возвращает текущее количество элементов в коллекции.
Returns: Возвращает количество элементов в коллекции. Тип int.

Teigha.DatabaseServices.DataCellCollection.Item
Свойство позволяет получить или задать элемент коллекции по указанному индексу.
Свойство позволяет получить или задать элемент коллекции по указанному индексу.
В случае недействительного индекса выбрасывается исключение ArgumentOutOfRangeException.
index: Индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции. Тип DataCell.