Teigha.DatabaseServices.TextVerticalMode
Перечисление TextVerticalMode определяет типы вертикального выравнивания текста.
Перечисление TextVerticalMode определяет поддерживаемые типы вертикального выравнивания текста.