HostMgd.EditorInput.PromptEntityOptionsEventArgs
Класс предоставляет данные для события PromptingForEntity
и позволяет настроить параметры выбора геометрического объекта
перед началом операции.
Класс используется в .NET API nanoCAD для передачи параметров
при начале операции выбора объекта — например, перед вызовом метода GetEntity().
Объект этого класса передаётся в обработчик события PromptingForEntity,
предоставляя доступ к настройкам выбора через свойство Options.
Через этот класс можно:
* изменить текст приглашения (Message),
* ограничить типы допустимых объектов (линии, окружности, блоки и т.д.),
* задать ключевые слова,
* управлять режимами ввода (AllowNone, AllowArbitraryInput и др.).
Это позволяет гибко настраивать поведение команды выбора в зависимости от
контекста — например, при реализации фильтров, специализированных редакторов
или параметрических операций.
Example
C#

HostMgd.EditorInput.PromptEntityOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при интерактивном выборе геометрического объекта.
Свойство предоставляет доступ к объекту PromptEntityOptions,
содержащему настройки команды выбора объекта в nanoCAD.
Оно используется в обработчике события PromptingForEntity
для динамической модификации параметров ввода перед началом
операции — например, при вызове метода GetEntity().
Через это свойство можно:
* задать текст приглашения (Message),
* указать допустимые типы объектов с помощью методов SetAllow... (например, SetAllowLines, SetAllowCircles),
* добавить ключевые слова,
* разрешить или запретить пропуск ввода (AllowNone),
* включить произвольный ввод (AllowArbitraryInput).
Свойство доступно только для чтения, но сам объект PromptEntityOptions может быть изменён,
что позволяет гибко настраивать поведение команды в реальном времени.
Returns: Возвращает объект типа PromptEntityOptions, содержащий параметры выбора объекта.
Если объект не был инициализирован, может вернуть null.
Example
C#