Teigha.GraphicsInterface.StandardLightTraits
Класс StandardLightTraits представляет характеристики стандартного источника света.
Класс StandardLightTraits представляет характеристики стандартного источника света.
Notes
Стандартный источник света является нефотометрическим.
Он определяет свойства, общие для всех таких источников света.
Свет, передающий свои свойства этому классу, не должен полагаться ни на какие значения по умолчанию.

Teigha.GraphicsInterface.StandardLightTraits.#ctor
Конструктор по умолчанию класса StandardLightTraits.
Конструктор по умолчанию класса StandardLightTraits.

Teigha.GraphicsInterface.StandardLightTraits.Intensity
Свойство Intensity представляет физическую интенсивность источника света.
Свойство Intensity представляет физическую интенсивность источника света, выраженную в канделах.
Returns: Возвращает физическую интенсивность источника света.
Тип double.

Teigha.GraphicsInterface.StandardLightTraits.LightColor
Свойство LightColor представляет цвет излучаемого источником света.
Свойство LightColor представляет цвет излучаемого источником света.
Returns: Возвращает цвет излучаемого источником света.
Тип Colors.Color.

Teigha.GraphicsInterface.StandardLightTraits.Shadow
Свойство Shadow представляет параметры теней источника света.
Свойство Shadow представляет параметры теней, характерные для данного источника света.
Returns: Возвращает параметры теней источника света.
Тип ShadowParameters.