Teigha.Runtime.FileStreamBuf
Класс FileStreamBuf представляет файловый потоковый буфер для операций ввода-вывода.
Класс FileStreamBuf представляет файловый потоковый буфер для операций ввода-вывода.

Teigha.Runtime.FileStreamBuf.#ctor(String)
Конструктор класса FileStreamBuf.
Создает потоковый буфер для указанного файла.
Конструктор класса FileStreamBuf.
Создает потоковый буфер для доступа к указанному файлу.
pcFilename: Входное имя файла. Тип String.

Teigha.Runtime.FileStreamBuf.#ctor(String,System.Boolean)
Конструктор класса FileStreamBuf.
Создает потоковый буфер для доступа к указанному файлу либо на чтение, либо на запись.
Конструктор класса FileStreamBuf.
Создает потоковый буфер для доступа к указанному файлу либо на чтение, либо на запись.
pcFilename: Входное имя файла. Тип String.
openForRead: Флаг, определяющий, создается ли буфер для операций чтения. Тип bool.  В случае значения false буфер создается для операций записи.

Teigha.Runtime.FileStreamBuf.#ctor(String,System.Boolean,Teigha.Runtime.FileShareMode)
Конструктор класса FileStreamBuf.
Создает потоковый буфер для доступа к указанному файлу либо на чтение, либо на запись в предписанном режиме общего доступа.
Конструктор класса FileStreamBuf.
Создает потоковый буфер для доступа к указанному файлу либо на чтение, либо на запись в предписанном режиме общего доступа.
pcFilename: Входное имя файла. Тип String.
openForRead: Флаг, определяющий, создается ли буфер для операций чтения. Тип bool.  В случае значения false буфер создается для операций записи.
nShareMode: Режим общего доступа к файлам. Значение из перечисления FileShareMode.

Teigha.Runtime.FileStreamBuf.#ctor(String,System.Boolean,Teigha.Runtime.FileShareMode,Teigha.Runtime.FileCreationDisposition)
Конструктор класса FileStreamBuf.
Создает потоковый буфер для доступа к указанному файлу на чтение или на запись в предписанном режиме общего доступа и в заданных условиях создания / открытия файла.
Конструктор класса FileStreamBuf.
Создает потоковый буфер для доступа к указанному файлу либо на чтение, либо на запись в предписанном режиме общего доступа.
Дополнительный аргумент позволяет управлять условиями создания / открытия файла.
pcFilename: Входное имя файла. Тип String.
openForRead: Флаг, определяющий, создается ли буфер для операций чтения. Тип bool.  В случае значения false буфер создается для операций записи.
nShareMode: Режим общего доступа к файлам. Значение из перечисления FileShareMode.
nCreationDisposition: Условия создания / открытия файла. Значение из перечисления FileCreationDisposition.

Teigha.Runtime.FileStreamBuf.CopyTo(Teigha.Runtime.StreamBuf,UInt64,UInt64)
Метод копирует указанные данные из этого потокового буфера в другой потоковый буфер.
Метод копирует указанные данные из этого потокового буфера в другой потоковый буфер.
pDestination: Целевой потоковый буфер. Тип StreamBuf.
sourceStart: Начальная позиция в данном потоковом буфере. Тип UInt64.
sourceEnd: Конечная позиция  в данном потоковом буфере. Тип UInt64.

Teigha.Runtime.FileStreamBuf.Read(UInt32)
Метод читает указанное количество байтов, начиная с текущей позиции файлового указателя.
Метод читает указанное количество байтов, начиная с текущей позиции файлового указателя.
numBytes: Количество байтов, которые требуется прочитать. Тип UInt32.
Returns: Возвращает массив прочитанных байтов. Тип char[].

Teigha.Runtime.FileStreamBuf.Seek(Int64,Teigha.Runtime.FilerSeekType)
Метод выполняет заданное смещение текущей позиции файлового указателя в данном потоковом буфере относительно указанной позиции.
Метод реализует заданное смещение текущей позиции файлового указателя в данном потоковом буфере относительно указанной позиции (начало / конец файла или текущая позиция).
offset: Заданное смещение файлового указателя. Тип Int64.
seekType: Точка отсчета смещения. Значение из перечисления FilerSeekType.
Returns: Возвращает новое положение файлового указателя в данном потоковом буфере.
Тип UInt64.

Teigha.Runtime.FileStreamBuf.Write(unsigned char)
Метод записывает байт в текущую позицию файлового указателя в данном потоковом буфере, после чего перемещает указатель на следующую позицию.
Метод записывает байт в текущую позицию файлового указателя в данном потоковом буфере и смещает указатель на следующую позицию.
value: Записываемое значение. Тип unsigned char.

Teigha.Runtime.FileStreamBuf.Write(array,UInt32)
Метод записывает переданный массив байтов, начиная с текущей позиции файлового указателя для данного потокового буфера с соответствующим положительным смещением указателя.
Метод записывает указанный массив байтов в данный потоковый буфер, начиная с текущей позиции файлового указателя с соответствующим положительным смещением указателя.
buffer: Входной массив. Тип unsigned char[].
numBytes: Количество байтов, записываемых в данный потоковый буфер. Тип UInt32.

Teigha.Runtime.FileStreamBuf.FileName
Свойство FileName возвращает имя файла, связанного с данным потоковым буфером.
Свойство FileName возвращает имя файла, связанного с данным потоковым буфером.
Returns: Возвращает имя файла. Тип String.

Teigha.Runtime.FileStreamBuf.IsEof
Свойство IsEof позволяет проверить, находится ли текущая позиция файлового указателя для данного буфера потока в конце файла.
Свойство IsEof позволяет проверить, находится ли текущая позиция файлового указателя для данного буфера потока в конце файла.
Returns: Возвращает true, если текущая позиция файлового указателя соответствует концу файла.
В противном случае возвращает false.

Teigha.Runtime.FileStreamBuf.Length
Свойство Length возвращает выраженную в байтах длину файла, связанного с этим потоковым буфером.
Свойство Length возвращает выраженную в байтах длину файла, связанного с этим потоковым буфером.
Returns: Возвращает длину файла. Тип UInt64.

Teigha.Runtime.FileStreamBuf.ShareMode
Свойство ShareMode возвращает текущий режим общего доступа для данного потокового буфера.
Свойство ShareMode возвращает текущий режим общего доступа для данного потокового буфера.
Returns: Возвращает режим общего доступа. Тип UInt32. Константы определены в перечислении FileShareMode.

Teigha.Runtime.FileStreamBuf.Tell
Свойство Tell возвращает текущую позицию файлового указателя в данном потоковом буфере.
Свойство Tell возвращает текущую позицию файлового указателя в данном потоковом буфере.
Returns: Возвращает позицию файлового указателя. Тип UInt64.