Teigha.DatabaseServices.Filters.SpatialFilter.GetQueryBounds
Метод предназначен для получения ограничивающего бокса данного фильтра SpatialFilter.
Метод предназначен для получения ограничивающего бокса данного фильтра SpatialFilter.
Возвращаемый объект Extents3d характеризует проверяемую фильтром область пространства.
Returns: Возвращает ограничивающий бокс данного фильтра. Тип Extents3d.