Teigha.GraphicsInterface.DrawableOverrule.SetNoFilter
Метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.
Метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.