Teigha.DatabaseServices.TableContent
Класс TableContent представляет в базе данных содержимое таблицы.
Класс TableContent представляет в базе данных содержимое таблицы.
Он является производным от класса FormattedTableData и обеспечивает форматирование таблицы с использованием табличного стиля и стилей ячеек.

Teigha.DatabaseServices.TableContent.#ctor
Конструктор по умолчанию класса TableContent.
Конструктор по умолчанию класса TableContent.

Teigha.DatabaseServices.TableContent.GetCellStyle(System.Int32,System.Int32)
Метод предоставляет стиль указанной ячейки.
Метод предоставляет стиль указанной ячейки.
Имя стиля ячейки может принимать одно из следующих значений:
* _TITLE,
* _HEADER,
* _DATA.
row: Индекс строки таблицы. Тип int.
column: Индекс столбца таблицы. Тип int.
Returns: Возвращает имя стиля ячейки. Тип String.

Teigha.DatabaseServices.TableContent.GetColumnWidth(System.Int32)
Метод позволяет получить ширину столбца с указанным индексом.
Метод позволяет получить ширину столбца с указанным индексом.
column: Индекс столбца таблицы. Тип int.
Returns: Возвращает ширину столбца. Тип double.

Teigha.DatabaseServices.TableContent.GetRowHeight(System.Int32)
Метод позволяет получить высоту строки с указанным индексом.
Метод позволяет получить высоту строки с указанным индексом.
row: Индекс строки таблицы. Тип int.
Returns: Возвращает высоту строки. Тип double.

Teigha.DatabaseServices.TableContent.SetCellStyle(System.Int32,System.Int32,String)
Метод позволяет задать стиль указанной ячейки.
Метод позволяет задать стиль указанной ячейки.
Имя стиля ячейки может принимать одно из следующих значений:
* _TITLE,
* _HEADER,
* _DATA.
row: Индекс строки таблицы.  Тип int.
column: Индекс столбца таблицы. Тип int.
cellStyle: Имя стиля ячейки.       Тип String.

Teigha.DatabaseServices.TableContent.SetColumnWidth(System.Int32,System.Double)
Метод позволяет задать ширину столбца с указанным индексом.
Метод позволяет задать ширину столбца с указанным индексом.
column: Индекс столбца. Тип int.
width: Новая ширина указанного столбца. Тип double.

Teigha.DatabaseServices.TableContent.SetRowHeight(System.Int32,System.Double)
Метод позволяет задать высоту строки с указанным индексом.
Метод позволяет задать высоту строки с указанным индексом.
row: Индекс строки. Тип int.
height: Новое значение высоты строки. Тип double.

Teigha.DatabaseServices.TableContent.TableStyleId
Свойство TableStyleId представляет идентификатор табличного стиля.
Свойство TableStyleId представляет идентификатор табличного стиля.
Returns: Возвращает идентификатор табличного стиля.
Тип DatabaseServices.ObjectId.