Teigha.DatabaseServices.Filters
Пространство имен Teigha.DatabaseServices.Filters включает классы, предназначенные для создания программных фильтров.
Пространство имен Teigha.DatabaseServices.Filters включает классы, предназначенные для реализации программных фильтров.