Teigha.DatabaseServices.Database.RestoreForwardingXrefSymbols
Этот метод должен использоваться вместе с
RestoreOriginalXrefSymbols(), и должен окружать код, в
котором планируется редактировать и/или сохранить внешние
ссылки базы данных.
RestoreForwardingXrefSymbols() строго последовательно
возвращает все изменения (назад во времени) до достижения
надлежащего разрешенного состояния внешней ссылки.
Для того чтобы правильно разрешить внешнюю ссылку, методу
RestoreForwardingXrefSymbols() требуется доступ на запись к
таблице символов и записям таблицы символов в основном
чертеже. Следовательно, приложение должно закрыть все
открытые таблицы символов или записи таблиц символов перед
вызовом RestoreForwardingXrefSymbols().