Teigha.BoundaryRepresentation.Shell
Класс Shell является интерфейсным классом для оболочек BREP.
Класс Shell является интерфейсным классом для оболочек BREP.
Оболочки описывают наборы смежных граней твердых тел и, как вторичные элементы BREP, не имеют связанной геометрии.

Teigha.BoundaryRepresentation.Shell.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса Shell. Создает экземпляр класса, используя указанный путь подобъекта.
Конструктор класса Shell. Создает экземпляр класса, используя указанный путь подобъекта.
fullSubentPath: Путь подобъекта.  Тип DatabaseServices.FullSubentityPath.

Teigha.BoundaryRepresentation.Shell.GetFacesStartingFrom(Teigha.BoundaryRepresentation.Face)
Метод позволяет получить коллекцию граней оболочки, начиная с указанной стартовой грани.
Метод позволяет получить коллекцию граней оболочки, начиная с указанной стартовой грани.
startFrom: Входная стартовая грань, с которой начинается формируемая коллекция граней.
Returns: Возвращает коллекцию граней данной оболочки.
Тип ShellFaceCollection.

Teigha.BoundaryRepresentation.Shell.Complex
Свойство Complex представляет объект Complex, связанный с данной оболочкой Shell.
Свойство Complex представляет объект Complex, связанный с данной оболочкой Shell.
Returns: Возвращает комплекс, связанный с данной оболочкой.
Тип BoundaryRepresentation.Complex.

Teigha.BoundaryRepresentation.Shell.Faces
Свойство Faces предоставляет доступ ко всем граням данной оболочки.
Свойство Faces предоставляет доступ ко всем граням данной оболочки.
Returns: Возвращает коллекцию граней оболочки.
Тип ShellFaceCollection.