Teigha.DatabaseServices.Polyline2d.Straighten
Метод удаляет из полилинии все вершины сплайна и аппроксимирующей кривой и определяет все оставшиеся вершины в качестве простых вершин.
Эта операция эквивалентна команде PEDIT с опцией "Decurve".
Метод удаляет из полилинии все вершины сплайна и аппроксимирующей кривой и определяет все оставшиеся вершины в качестве простых вершин.
Эта операция эквивалентна команде PEDIT с опцией "Decurve".