Teigha.Geometry.EllipticalArc3d
Класс EllipticalArc3d представляет трехмерные эллиптические дуги и полные эллипсы в 3D-пространстве.
Класс EllipticalArc3d представляет трехмерные эллиптические дуги и полные эллипсы в 3D-пространстве.
Notes
Угол точки на эллипсе измеряется путем проецирования этой точки перпендикулярно большой оси на окружность, центр которой совпадает с центром эллипса, а радиус равен большому радиусу этого эллипса.  Угол между большой осью эллипса и вектором из центра эллипса в спроецированную точку на окружности, измеренный против часовой стрелки относительно векторного произведения большой и малой осей, является углом этой точки на эллипсе.
У полного эллипса разница между начальным и конечным углами составляет 2 x Pi.

Teigha.Geometry.EllipticalArc3d.#ctor
Конструктор по умолчанию класса EllipticalArc3d.
Конструктор по умолчанию класса EllipticalArc3d создает полный эллипс с центром в начале координат (0,0,0), большая и малая оси которого совпадают с осями X и Y, а большой и малый радиусы равны 1.
Значения начального и конечного углов равны 0 и 2 х PI, соответственно.
Таким образом, построенный эллипс геометрически представляет собой единичную окружность в плоскости XY с центром в начале координат.

Teigha.Geometry.EllipticalArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double)
Конструктор класса EllipticalArc3d.
Создает эллипс с указанными центром, осями и радиусами.
Конструктор класса EllipticalArc3d.
Создает эллипс с указанными центром, большой и малой осями, большим и малым радиусами.
center: Центр эллипса. Тип Point3d.
majorAxis: Большая ось эллипса. Тип Vector3d.
minorAxis: Малая ось эллипса. Тип Vector3d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса. Тип double.

Teigha.Geometry.EllipticalArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса EllipticalArc3d.
Создает эллипс или эллиптическую дугу с указанными центром, осями, радиусами, начальным и конечным углами.
Конструктор класса EllipticalArc3d.
Создает эллипс или эллиптическую дугу с указанными центром, большой и малой осями, большим и малым радиусами, начальным и конечным углами.
center: Центр эллипса. Тип Point3d.
majorAxis: Большая ось эллипса. Тип Vector3d.
minorAxis: Малая ось эллипса.   Тип Vector3d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса.   Тип double.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной  точки дуги). Тип double.

Teigha.Geometry.EllipticalArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity)
Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Геометрические вычисления выполняются с точностью по умолчанию.
Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Результат представляется в виде массива из двух точек.
Используется вызов метода EllipticalArc3d.ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance) со значением точности, равным Tolerance.Global.
plane: Плоский объект, по отношению к которому вычисляется ближайшая точка на данной эллиптической дуге.  Тип PlanarEntity.
Returns: Возвращает массив из двух элементов. Тип Point3d[].
Первый элемент представляет точку на плоскости plane, а второй — ближайшую к ней точку на данной эллиптической дуге.

Teigha.Geometry.EllipticalArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Геометрические вычисления выполняются с заданной точностью.
Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге.
Геометрические вычисления выполняются с заданной точностью.
Результатом является массив из двух найденных точек.
plane: Плоский объект, по отношению к которому вычисляется ближайшая точка на данной эллиптической дуге.  Тип PlanarEntity.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив из двух элементов. Тип Point3d[].
Первый элемент представляет точку на плоскости plane, а второй — ближайшую к ней точку на данной эллиптической дуге.

Teigha.Geometry.EllipticalArc3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип EllipticalArc3d.

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точки пересечения данной дуги с указанным линейным объектом.
Используется геометрическая точность по умолчанию.
Метод вычисляет точки пересечения данной дуги с указанным линейным объектом.
Используется вызов метода EllipticalArc3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) с геометрической точностью по умолчанию, которая равна Tolerance.Global.
Результатом является массив точек пересечения (если они существуют).
Notes
В случае отсутствия точек пересечения метод возвращает null.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
Returns: Возвращает массив из двух элементов. Тип Point3d[].
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данной дуги с указанным линейным объектом, используя заданную геометрическую точность.
Метод вычисляет точки пересечения данной дуги с указанным линейным объектом, используя заданную геометрическую точность.
Результатом является массив точек пересечения (если они существуют).
Notes
В случае отсутствия точек пересечения метод возвращает null.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип LinearEntity3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив из двух элементов. Тип Point3d[].
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.PlanarEntity)
Метод вычисляет точки пересечения данной дуги с указанным плоским объектом.
Используется геометрическая точность по умолчанию.
Метод вычисляет точки пересечения данной дуги с указанным плоским объектом.
Используется вызов метода EllipticalArc3d.IntersectWith(PlanarEntity plane, Tolerance tolerance) с геометрической точностью по умолчанию, которая равна Tolerance.Global.
Результатом является массив точек пересечения (если они существуют).
Notes
В случае отсутствия точек пересечения метод возвращает null.
plane: Плоский объект, точки пересечения с которым требуется вычислить. Тип PlanarEntity.
Returns: Возвращает массив из двух элементов. Тип Point3d[].
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данной дуги с указанным плоским объектом, используя заданную геометрическую точность.
Метод вычисляет точки пересечения данной дуги с указанным плоским объектом с использованием заданной геометрической точности.
Результатом является массив точек пересечения (если они существуют).
Notes
В случае отсутствия точек пересечения метод возвращает null.
plane: Плоский объект, точки пересечения с которым требуется вычислить. Тип PlanarEntity.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив из двух элементов. Тип Point3d[].
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IsCircular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой геометрической точности данную эллиптическую дугу можно считать круглой.
В противном случае возвращает false.

Teigha.Geometry.EllipticalArc3d.IsInside(Teigha.Geometry.Point3d)
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию.
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса.
Используется вызов метода EllipticalArc3d.IsInside(Point3d pointValue, Tolerance tolerance)
с геометрической точностью по умолчанию, которая равна Tolerance.Global.
pointValue: Проверяемая точка. Тип Point3d.
Returns: Возвращает true, если в пределах используемой точности можно считать, что проверяемая точка находится в пределах полного эллипса.
В противном случае возвращает false.

Teigha.Geometry.EllipticalArc3d.IsInside(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах заданной точности.
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах заданной точности.
pointValue: Проверяемая точка. Тип Point3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой точности можно считать, что проверяемая точка находится в пределах полного эллипса.
В противном случае возвращает false.

Teigha.Geometry.EllipticalArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d)
Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на указанную плоскость.
Используется геометрическая точность по умолчанию.
Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на плоскость с заданным направлением нормали.
Используется вызов метода EllipticalArc3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) с геометрической точностью по умолчанию, которая равна Tolerance.Global.
Результатом является массив 3D-точек.
Notes
В случае отсутствия точек пересечения метод возвращает null.
line: Трехмерный линейный объект, с которым вычисляется пересечение. Тип LinearEntity3d.
projectionDirection: Направление проецирования. Тип Vector3d.
Returns: Возвращает массив из четырех элементов. Тип Point3d[]. Элементы массива представляют следующие точки:
* 0 — первая точка пересечения на эллиптической дуге.
* 1 — вторая точка пересечения на эллиптической дуге (если она существует).
* 2 — первая точка пересечения на линии.
* 3 — вторая точка пересечения на линии (если она существует).
В случае отсутствия точек пересечения метод возвращает null.

Teigha.Geometry.EllipticalArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на указанную плоскость.
Используется заданная геометрическая точность.
Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на плоскость с заданным направлением нормали. Вычисление пересечений выполняется с переданной в метод геометрической точностью.
Результатом является массив 3D-точек.
line: Трехмерный линейный объект, с которым вычисляется пересечение. Тип LinearEntity3d.
projectionDirection: Направление проецирования. Тип Vector3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив из четырех элементов. Тип Point3d[]. Элементы массива представляют следующие точки:
* 0 — первая точка пересечения на эллиптической дуге.
* 1 — вторая точка пересечения на эллиптической дуге (если она существует).
* 2 — первая точка пересечения на линии.
* 3 — вторая точка пересечения на линии (если она существует).
В случае отсутствия точек пересечения метод возвращает null.

Teigha.Geometry.EllipticalArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double)
Метод позволяет переопределить данную дугу, используя новые центр, оси и радиусы.
Метод позволяет переопределить данную дугу, используя новые точку центра, большую и малую оси, большой и малый радиусы.
center: Центр эллипса. Тип Point3d.
majorAxis: Большая ось эллипса. Тип Vector3d.
minorAxis: Малая ось эллипса. Тип Vector3d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса. Тип double.

Teigha.Geometry.EllipticalArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу, используя новые центр, оси, радиусы, начальный и конечный углы.
Метод позволяет переопределить данную дугу, используя новые точку центра, большую и малую оси, большой и малый радиусы, начальный и конечный углы.
center: Центр эллипса. Тип Point3d.
majorAxis: Большая ось эллипса. Тип Vector3d.
minorAxis: Малая ось эллипса. Тип Vector3d.
majorRadius: Большой радиус эллипса. Тип double.
minorRadius: Малый радиус эллипса. Тип double.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной  точки дуги). Тип double.

Teigha.Geometry.EllipticalArc3d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы у данной эллиптической дуги.
Метод позволяет переопределить начальный и конечный углы у данной эллиптической дуги.
Notes
Метод проверяет, чтобы конечный угол превышал начальный, и в случае необходимости меняет местами переданные значения.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип double.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип double.

Teigha.Geometry.EllipticalArc3d.SetAxes(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
majorAxis: Новое направление большой оси эллиптической дуги. Тип Vector3d.
minorAxis: Новое направление малой оси   эллиптической дуги. Тип Vector3d.

Teigha.Geometry.EllipticalArc3d.Center
Свойство Center предоставляет доступ к точке центра данной эллиптической дуги.
Свойство Center предоставляет доступ к точке центра данной эллиптической дуги.
Returns: Возвращает точку центра дуги. Тип Point3d.

Teigha.Geometry.EllipticalArc3d.EndAngle
Свойство EndAngle представляет конечный угол данной эллиптической дуги.
Свойство EndAngle представляет конечный угол данной эллиптической дуги.
Returns: Возвращает конечный угол эллиптической дуги. Тип double.

Teigha.Geometry.EllipticalArc3d.EndPoint
Свойство EndPoint представляет конечную точку данной эллиптической дуги.
Свойство EndPoint представляет конечную точку данной эллиптической дуги.
Returns: Возвращает конечную точку эллиптической дуги. Тип Point3d.

Teigha.Geometry.EllipticalArc3d.MajorAxis
Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
Свойство MajorAxis представляет направление большой оси данной эллиптической дуги.
Returns: Возвращает направление большой оси эллиптической дуги.
Тип Vector3d.

Teigha.Geometry.EllipticalArc3d.MajorRadius
Свойство MajorRadius предоставляет доступ к значению большого радиуса данной эллиптической дуги.
Свойство MajorRadius предоставляет доступ к значению большого радиуса данной эллиптической дуги.
Returns: Возвращает значение большого радиуса эллиптической дуги.
Тип double.

Teigha.Geometry.EllipticalArc3d.MinorAxis
Свойство MinorAxis представляет направление малой оси данной эллиптической дуги.
Свойство MinorAxis представляет направление малой оси данной эллиптической дуги.
Returns: Возвращает направление малой оси эллиптической дуги.
Тип Vector3d.

Teigha.Geometry.EllipticalArc3d.MinorRadius
Свойство MinorRadius предоставляет доступ к значению малого радиуса данной эллиптической дуги.
Свойство MinorRadius предоставляет доступ к значению малого радиуса данной эллиптической дуги.
Returns: Возвращает значение малого радиуса данной эллиптической дуги.
Тип double.

Teigha.Geometry.EllipticalArc3d.Normal
Свойство Normal представляет единичный вектор нормали плоскости данного объекта.
Свойство Normal представляет направление нормали плоскости данного объекта.
Эллипс ориентирован против часовой стрелки вокруг этого вектора.
Возвращаемый вектор является единичным.
Returns: Возвращает направление нормали плоскости данного объекта.
Тип Vector3d.

Teigha.Geometry.EllipticalArc3d.StartAngle
Свойство StartAngle представляет значение начального угла данной эллиптической дуги.
Свойство StartAngle представляет значение начального угла данной эллиптической дуги.
Returns: Возвращает значение начального угла эллиптической дуги.
Тип double.

Teigha.Geometry.EllipticalArc3d.StartPoint
Свойство StartPoint представляет положение начальной точки данной эллиптической дуги.
Свойство StartPoint представляет положение начальной точки данной эллиптической дуги.
Returns: Возвращает начальную точку эллиптической дуги.
Тип Point3d.