Teigha.DatabaseServices.Face
Класс Face реализует трехмерную грань как объект в базе данных и наследует базовую функциональность объектов чертежа Entity.
Класс DatabaseServices.Face реализует трехмерную грань как объект в базе данных и наследует базовую функциональность объектов чертежа Entity.

Teigha.DatabaseServices.Face.#ctor
Конструктор класса Face по умолчанию.
Конструктор класса Face по умолчанию.

Teigha.DatabaseServices.Face.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Конструктор класса Face. Создает новую треугольную грань с указанными вершинами и значениями видимости ребер.
Конструктор класса Face. Создает новый объект Face с указанными вершинами и значениями видимости ребер.
Точки pointer1, pointer2 и pointer3 служат угловыми вершинами грани, при этом точка pointer2 используется дважды как для третьей, так и для четвертой угловой вершины.
В результате получается треугольная грань. Точки задаются в мировой системе координат WCS.
Аргументы value1 – value4 управляют видимостью ребер грани.
Флаг value1 задает видимость ребра между вершинами pointer1 и pointer2, value2 — видимость ребра между pointer2 и pointer3 и т.д.
Значение true означает, что ребро должно быть видимым.
Кроме того, выполняется стандартная процедура инициализации объекта Entity.
pointer1: Первая угловая вершина грани. Тип Point3d.
pointer2: Вторая угловая вершина грани. Тип Point3d.
pointer3: Третья угловая вершина грани. Тип Point3d.
value1: Флаг видимости первого ребра. Тип bool.
value2: Флаг видимости второго ребра. Тип bool.
value3: Флаг видимости третьего ребра. Тип bool.
value4: Флаг видимости четвертого ребра. Тип bool.

Teigha.DatabaseServices.Face.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Конструктор класса Face. Создает четырехугольную грань с указанными вершинами и значениями видимости ребер.
Конструктор класса Face.
Данный конструктор инициализирует объект Face с четырьмя угловыми вершинами, заданными точками от pointer1 до pointer4. Точки задаются в мировой системе координат WCS.
Аргументы value1 – value4 управляют видимостью ребер грани.
Флаг value1 задает видимость ребра между вершинами pointer1 и pointer2, value2 — видимость ребра между pointer2 и pointer3 и т.д.
Значение true означает, что ребро должно быть видимым.
Кроме того, выполняется стандартная процедура инициализации объекта Entity.
pointer1: Первая угловая вершина грани.    Тип Point3d.
pointer2: Вторая угловая вершина грани.    Тип Point3d.
pointer3: Третья угловая вершина грани.    Тип Point3d.
pointer4: Четвертая угловая вершина грани. Тип Point3d.
value1: Флаг видимости первого ребра.    Тип bool.
value2: Флаг видимости второго ребра.    Тип bool.
value3: Флаг видимости третьего ребра.   Тип bool.
value4: Флаг видимости четвертого ребра. Тип bool.

Teigha.DatabaseServices.Face.GetVertexAt(short)
Метод предназначен для получения точки в вершине с указанным индексом.
Метод предназначен для получения точки в вершине с указанным индексом.
Используется мировая система координат WCS.
value: Индекс вершины грани (0, 1, 2 или 3). Тип short.
Returns: Возвращает точку в WCS. Тип Point3d.

Teigha.DatabaseServices.Face.IsEdgeVisibleAt(short)
Метод позволяет проверить видимость ребра с указанным индексом.
Метод позволяет проверить видимость ребра с указанным индексом.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип short.
Returns: Возвращает true, если указанное ребро является видимым.
В противном случае возвращает false.

Teigha.DatabaseServices.Face.MakeEdgeInvisibleAt(short)
Метод позволяет сделать невидимым ребро с указанным индексом.
Метод позволяет сделать невидимым ребро с указанным индексом.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип short.

Teigha.DatabaseServices.Face.MakeEdgeVisibleAt(short)
Метод позволяет сделать видимым ребро с указанным индексом.
Метод позволяет сделать видимым ребро с указанным индексом.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип short.

Teigha.DatabaseServices.Face.SetVertexAt(short,Teigha.Geometry.Point3d)
Метод предоставляет возможность изменять положение в пространстве вершины с указанным индексом.
Метод предоставляет возможность изменять положение в пространстве вершины с указанным индексом.
Используется мировая система координат WCS.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип short.
vertexPosition: Новое положение вершины. Тип Point3d.