Teigha.GraphicsInterface.EdgeModifiers
Перечисление EdgeModifiers определяет битовые поля, используемые в качестве модификаторов режима отображения рёбер.
Перечисление EdgeModifiers определяет битовые поля, используемые в качестве модификаторов режима отображения рёбер.