Teigha.DatabaseServices.SubentityOverrule
Этот класс переопределяет подмножество связанных с подобъектом операций, которые определяет объект.
Используется в качестве базового класса для настройки поведения классов, производных от Entity.
Этот класс переопределяет подмножество связанных с подобъектом операций, которые определяет объект.
Используется в качестве базового класса для настройки поведения классов, производных от Entity.
Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.

Teigha.DatabaseServices.SubentityOverrule.AddSubentPaths(Teigha.DatabaseServices.Entity,array)
Данный метод переопределяет метод Entity.AddsubentPaths() и вызывает его при реализации по умолчанию.
Данный метод переопределяет метод Entity.AddsubentPaths() и вызывает его при реализации по умолчанию.
Метод Entity.AddSubentityPaths() в реализации по умолчанию добавляет к геометрическому объекту один или несколько геометрических подобъектов. С помощью метода AddSubentPaths() настоящего класса можно переопределить механизм работы метода.
entity: Объект чертежа, тип Entity.
paths: Массив полных путей подобъектов FullSubentityPath[], которые идентифицируют подобъекты, добавляемые к объекту entity.

Teigha.DatabaseServices.SubentityOverrule.DeleteSubentPaths(Teigha.DatabaseServices.Entity,array)
Данный метод переопределяет метод Entity.DeleteSubentPaths() и вызывает его при реализации по умолчанию.
Данный метод переопределяет метод Entity.DeleteSubentPaths() и вызывает его при реализации по умолчанию.
Метод Entity.DeleteSubentityPaths() в реализации по умолчанию удаляет из геометрического объекта один или несколько подобъектов. С помощью метода DeleteSubentPaths() настоящего класса можно переопределить этот механизм работы метода.
entity: Объект чертежа, тип Entity.
paths: Массив полных путей подобъектов FullSubentityPath[], которые идентифицируют подобъекты, предполагаемые к удалению из объекта entity.

Teigha.DatabaseServices.SubentityOverrule.GetCompoundObjectTransform(Teigha.DatabaseServices.Entity)
Данный метод переопределяет свойство Entity.CompoundObjectTransform и вызывает его при реализации по умолчанию.
Данный метод переопределяет свойство Entity.CompoundObjectTransform и вызывает его при реализации по умолчанию.
Свойство Entity.CompoundObjectTransform в реализации по умолчанию возвращает матрицу преобразования Matrix3d,
сформированную для вложенных подобъектов. С помощью метода GetCompoundObjectTransform() настоящего класса
можно переопределить механизм работы этого свойства.
entity: Объект чертежа, тип Entity.

Teigha.DatabaseServices.SubentityOverrule.GetGripPointsAtSubentPath(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath,Teigha.DatabaseServices.GripDataCollection,System.Double,System.Int32,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.GetGripPointsFlags)
Данный метод переопределяет метод Entity.GetGripPointsAtSubentityPath() и вызывает его при реализации по умолчанию.
Данный метод переопределяет метод Entity.GetGripPointsAtSubentityPath() и вызывает его при реализации по умолчанию.
Метод Entity.GetGripPointsAtSubentityPath() в реализации по умолчанию возвращает коллекцию ручек интересующего подобъекта.
С помощью метода GetGripPointsAtSubentPath() настоящего класса можно переопределить механизм работы этого метода.

Teigha.DatabaseServices.SubentityOverrule.GetGsMarkersAtSubentPath(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет метод Entity.GetGraphicsMarkersAtSubentityPathIntPtr() и вызывает его в случае реализации по умолчанию.
Данный метод переопределяет метод Entity.GetGraphicsMarkersAtSubentityPathIntPtr() и вызывает его в случае реализации по умолчанию.
Метод Entity.GetGraphicsMarkersAtSubentityPathIntPtr() в реализации по умолчанию возвращает массив GS маркеров указанного подобъекта.
Метод GetGsMarkersAtSubentPath() настоящего класса позволяет переопределить механизм работы этого метода.
entity: Объект чертежа, тип Entity.
subPath: Полный путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.SubentityOverrule.GetSubentClassId(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет свойство Entity.ClassId и вызывает его в случае реализации по умолчанию.
Данный метод переопределяет свойство Entity.ClassId и вызывает его в случае реализации по умолчанию.
Свойство Entity.ClassId в реализации по умолчанию возвращает Guid класса, представляющего подобъект.
Метод GetSubentClassId() настоящего класса позволяет переопределить механизм работы этого свойства.
entity: Объект чертежа, тип Entity.
path: Полный путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.SubentityOverrule.GetSubentPathGeomExtents(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет метод Entity.GetSubentityGeometricExtents() и вызывает его в случае реализации по умолчанию.
Данный метод переопределяет метод Entity.GetSubentityGeometricExtents() и вызывает его в случае реализации по умолчанию.
Метод Entity.GetSubentityGeometricExtents() в реализации по умолчанию возвращает экземпляр класса Extents3d с данными о
габаритах подобъекта. Метод GetSubentPathGeomExtents() настоящего класса позволяет переопределить механизм работы этого метода.
entity: Объект чертежа, тип Entity.
path: Полный путь к подобъекту. Тип FullSubentityPath.
Returns: Возвращает объект Extents3d с данными о габаритах подобъекта.

Teigha.DatabaseServices.SubentityOverrule.GetSubentPathsAtGsMarker(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityType,IntPtr,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,array)
Данный метод переопределяет метод Entity.GetSubentityPathsAtGraphicsMarker() и вызывает его в случае реализации по умолчанию.
Данный метод переопределяет метод Entity.GetSubentityPathsAtGraphicsMarker() и вызывает его при реализации по умолчанию.
Метод Entity.GetSubentityPathsAtGraphicsMarker() в реализации по умолчанию возвращает массив полных путей подобъектов, которые найдены с использованием GS маркера. Метод GetSubentityPathsAtGraphicsMarker() настоящего класса позволяет переопределить этот механизм.
entity: Объект чертежа, тип Entity.
type: Тип подобъекта, SubentityType.
gsMark: Маркер GS, представляющий конкретный подобъект. Тип IntPtr.
pickPoint: Координаты точки, выделенной во время выбора объекта. Тип Point3d в мировой системе координат (WCS).
viewXform: Матрица преобразования из мировой системы координат (WCS) в систему координат дисплея (DCS). Тип Matrix3d.

Teigha.DatabaseServices.SubentityOverrule.MoveGripPointsAtSubentPaths(Teigha.DatabaseServices.Entity,array,Teigha.DatabaseServices.GripDataCollection,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.MoveGripPointsFlags)
Данный метод переопределяет метод Entity.MoveGripPointsAtSubentityPaths() и вызывает его в случае реализации по умолчанию.
Данный метод переопределяет метод Entity.MoveGripPointsAtSubentityPaths() и вызывает его в случае реализации по умолчанию.
Метод Entity.MoveGripPointsAtSubentityPaths() в реализации по умолчанию перемещает ручки подобъектов на заданный вектор.
Метод MoveGripPointsAtSubentPaths() настоящего класса позволяет переопределить этот механизм.
entity: Объект чертежа, тип Entity.
path: Массив полных путей объектов, идентифицирующих подобъекты, которые подлежат перемещению. Тип FullSubentityPath[].
grips: Массив указателей на ручки, которые подлежат перемещению. Тип GripDataCollection.
offset: Вектор, определяющий направление и величину перемещения ручек. Тип Vector3d.
bitFlags: Маска из одного или нескольких флагов из перечисления MoveGripPointsFlags.

Teigha.DatabaseServices.SubentityOverrule.OnSubentGripStatusChanged(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.GripStatus,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет метод Entity.SetSubentityGripStatus() и вызывает его в случае реализации по умолчанию.
Данный метод переопределяет метод Entity.SetSubentityGripStatus() и вызывает его при реализации по умолчанию.
Метод Entity.SetSubentityGripStatus() в реализации по умолчанию возвращает состояние ручки подобъекта.
Метод OnSubentGripStatusChanged() настоящего класса позволяет переопределить этот механизм.
entity: Объект чертежа, тип Entity.
status: Состояние ручки из перечисления GripStatus.
subentity: Полный путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.SubentityOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD искал в словаре расширений запись с именем entryName.  Переопределения не будут вызываться, если запись с entryName не будет найдена в словаре расширений.
entryName: Имя записи, String.

Teigha.DatabaseServices.SubentityOverrule.SetIdFilter(array)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
ids: Входной массив идентификаторов объектов ObjectId[].

Teigha.DatabaseServices.SubentityOverrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
registeredApplicationName: Имя зарегистрированного приложения, String.

Teigha.DatabaseServices.SubentityOverrule.SubentPtr(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Этот метод переопределяет метод Entity.GetSubentity() и вызывает его в случае реализации по умолчанию.
Этот метод переопределяет метод Entity.GetSubentity() и вызывает его в случае реализации по умолчанию.
Метод Entity.GetSubentity() в реализации по умолчанию возвращает указатель на подобъект.
Метод SubentPtr() настоящего класса позволяет переопределить этот механизм.
entity: Объект чертежа, Entity.
id: Массив полных путей FullSubentityPath, идентифицирующий подобъекты.
Returns: Возвращает объект Entity.

Teigha.DatabaseServices.SubentityOverrule.TransformSubentPathsBy(Teigha.DatabaseServices.Entity,array,Teigha.Geometry.Matrix3d)
Этот метод переопределяет метод Entity.TransformSubentityPathsBy() и вызывает его в случае реализации по умолчанию.
Этот метод переопределяет метод Entity.TransformSubentityPathsBy() и вызывает его в случае реализации по умолчанию.
Метод Entity.TransformSubentityPathsBy() в реализации по умолчанию применяет указанное 3D-преобразование Matrix3d к заданному массиву подобъектов.  Метод TransformSubentPathsBy() настоящего класса позволяет переопределить этот механизм.
entity: Объект чертежа, тип Entity.
paths: Массив полных путей объектов, идентифицирующих подобъекты, которые подлежат преобразованию. Тип FullSubentityPath[].
xform: Матрица преобразования, применяемая к каждому подобъекту. Тип Matrix3d.