Teigha.Geometry.CurveBoundaryData.GetCurve3ds
Метод предоставляет массив трехмерных кривых для данного объекта.
Метод предоставляет массив трехмерных кривых для данного объекта.
Returns: Возвращает массив трехмерных кривых для данного объекта.
Тип Entity3d[].