Teigha.DatabaseServices.PolyFaceMesh
Класс PolyFaceMesh представляет специальный тип полилинии PolyFaceMesh в nanoCAD.
Класс PolyFaceMesh представляет специальный тип полилинии PolyFaceMesh в nanoCAD.

Teigha.DatabaseServices.PolyFaceMesh.#ctor
Конструктор по умолчанию. Инициализирует счетчики граней и вершин нулями.
Конструктор по умолчанию. Инициализирует счетчики граней и вершин нулями.

Teigha.DatabaseServices.PolyFaceMesh.AppendFaceRecord(Teigha.DatabaseServices.FaceRecord)
Данный метод добавляет запись FaceRecord, указанную в аргументе toAppend, в конец списка граней PolyFaceMesh, определяет объект PolyFaceMesh владельцем FaceRecord и добавляет FaceRecord в базу данных, содержащую PolyFaceMesh.
Данный метод добавляет запись FaceRecord, указанную в аргументе toAppend, в конец списка граней PolyFaceMesh, определяет объект PolyFaceMesh владельцем FaceRecord и затем добавляет FaceRecord в базу данных, содержащую PolyFaceMesh.  Обратите внимание, для успешной работы метода сеть PolyFaceMesh должна быть резидентной в базе данных.
Вызывающее приложение должно явно закрыть добавленную запись FaceRecord после возврата из метода AppendFaceRecord().
Предупреждение
Все вершины должны быть добавлены прежде, чем будут добавлены какие-либо записи FaceRecord.
После добавления хотя бы одного FaceRecord методы AppendVertex() перестают работать.
toAppend: Запись FaceRecord для добавления к сети.
Returns: Возвращает ObjectId.

Teigha.DatabaseServices.PolyFaceMesh.AppendVertex(Teigha.DatabaseServices.PolyFaceMeshVertex)
Этот метод добавляет вершину PolyFaceMeshVertex, указанную в аргументе vertexToAppend, в конец списка вершин PolyFaceMesh, определяет PolyFaceMesh владельцем вершины и добавляет эту вершину в базу данных, содержащую PolyFaceMesh.
Этот метод добавляет вершину PolyFaceMeshVertex, указанную в аргументе vertexToAppend, в конец списка вершин PolyFaceMesh, определяет PolyFaceMesh владельцем вершины и добавляет эту вершину в базу данных, содержащую PolyFaceMesh.
Для успешной работы метода сеть PolyFaceMesh должна быть резидентной в базе данных.
Добавленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода AppendVertex().
Предупреждение
Все вершины должны быть добавлены прежде, чем будут добавлены какие-либо записи FaceRecord.
После добавления хотя бы одного FaceRecord методы AppendVertex() перестают работать.
vertexToAppend: Добавляемая в сеть вершина PolyFaceMeshVertex.
Returns: Возвращает ObjectId.

Teigha.DatabaseServices.PolyFaceMesh.NumFaces
Свойство предоставляет доступ к количеству граней в сети PolyFaceMesh.
Свойство предоставляет доступ к количеству граней в сети PolyFaceMesh.
Для PolyFaceMeshes, созданных с помощью API, это значение будет точно отражать количество записей FaceRecord, добавленных к PolyFaceMesh.  Для PolyFaceMeshes, созданных с помощью команды PFACE, это значение может быть меньше, чем количество FaceRecord, принадлежащих PolyFaceMesh.
Returns: Возвращает количество граней в сети PolyFaceMesh, тип int.

Teigha.DatabaseServices.PolyFaceMesh.NumVertices
Свойство предоставляет доступ к количеству вершин по координатным точкам в списке вершин сети PolyFaceMesh.
Свойство предоставляет доступ к количеству вершин по координатным точкам в списке вершин сети PolyFaceMesh.
Это количество не включает FaceRecords в списке вершин.
Returns: Возвращает количество вершин в сети PolyFaceMesh, тип int.