Teigha.BoundaryRepresentation.Mesh2dElement2dCollection
Класс Mesh2dElement2dCollection представляет коллекцию объектов Element2d двумерной сети Mesh2d.
Класс Mesh2dElement2dCollection представляет коллекцию объектов Element2d двумерной сети Mesh2d.