Teigha.DatabaseServices.UnderlayReference
Класс UnderlayReference представляет подложки на чертеже.
Класс UnderlayReference представляет подложки на чертеже.
Подложки аналогичны растровым изображениям, за исключением того, что пользователю доступны привязки к содержимому подложки.

Teigha.DatabaseServices.UnderlayReference.GenerateClipBoundaryFromPline(DatabaseServices.ObjectId)
Метод предназначен для создания границы обрезки из заданной полилинии.
Метод предназначен для создания границы обрезки из заданной полилинии.
polyId: Идентификатор объекта полилинии. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.UnderlayReference.SetClipBoundary(array)
Метод позволяет задать массив точек, определяющих границу обрезки данной подложки.
Метод позволяет задать массив точек, определяющих границу обрезки данной подложки.
points: Массив точек границы обрезки. Тип Point2d[].

Teigha.DatabaseServices.UnderlayReference.AdjustColorForBackground
Свойство AdjustColorForBackground позволяет определить, настроено ли содержимое подложки для текущего цвета фона.
Свойство AdjustColorForBackground позволяет определить, настроено ли содержимое подложки для текущего цвета фона.
Returns: Возвращает true, если содержимое подложки настроено для текущего цвета фона.
В противном случае возвращает false.

Teigha.DatabaseServices.UnderlayReference.Contrast
Свойство Contrast представляет значение контраста подложки в диапазоне [0 – 100].
Свойство Contrast представляет значение контраста подложки в диапазоне [0 – 100].
Returns: Возвращает  в диапазоне [0 – 100]. Тип int.

Teigha.DatabaseServices.UnderlayReference.ContrastLowerLimit
Свойство ContrastLowerLimit представляет нижний предел возможных значений контраста.
Свойство ContrastLowerLimit представляет нижний предел возможных значений контраста.
Returns: Возвращает минимально возможное значение контраста. Тип int.

Teigha.DatabaseServices.UnderlayReference.ContrastUpperLimit
Свойство ContrastUpperLimit представляет верхний предел возможных значений контраста.
Свойство ContrastUpperLimit представляет верхний предел возможных значений контраста.
Returns: Возвращает максимально возможное значение контраста. Тип int.

Teigha.DatabaseServices.UnderlayReference.DefaultContrast
Свойство DefaultContrast представляет значение контраста по умолчанию.
Свойство DefaultContrast представляет значение контраста по умолчанию.
Returns: Возвращает значение контраста по умолчанию.
Тип int.

Teigha.DatabaseServices.UnderlayReference.DefaultFade
Свойство DefaultFade представляет значение затухания по умолчанию.
Свойство DefaultFade представляет значение затухания по умолчанию.
Returns: Возвращает значение затухания.
Тип int.

Teigha.DatabaseServices.UnderlayReference.DefinitionId
Свойство DefinitionId представляет идентификатор объекта определения подложки, на который ссылается данная подложка.
Свойство DefinitionId представляет идентификатор объекта определения подложки UnderlayDefinition, на который ссылается данная подложка.
Returns: Возвращает идентификатор объекта UnderlayDefinition.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.UnderlayReference.Fade
Свойство Fade представляет значение затухания для подложки в диапазоне [0 – 100].
Свойство Fade представляет значение затухания для подложки в диапазоне [0 – 100].
Returns: Возвращает значение затухания в диапазоне [0 – 100].
Тип int.

Teigha.DatabaseServices.UnderlayReference.FadeLowerLimit
Свойство FadeLowerLimit представляет нижнюю границу возможных значений затухания.
Свойство FadeLowerLimit представляет нижнюю границу возможных значений затухания.
Returns: Возвращает нижнюю границу возможных значений затухания.
Тип int.

Teigha.DatabaseServices.UnderlayReference.FadeUpperLimit
Свойство FadeUpperLimit представляет верхнюю границу возможных значений затухания.
Свойство FadeUpperLimit представляет верхнюю границу возможных значений затухания.
Returns: Возвращает верхнюю границу возможных значений затухания.
Тип int.

Teigha.DatabaseServices.UnderlayReference.Height
Свойство Height представляет высоту данной подложки на чертеже.
Свойство Height представляет высоту данной подложки на чертеже.
Returns: Возвращает высоту данной ссылки на подложку.
Тип double.

Teigha.DatabaseServices.UnderlayReference.IsClipped
Свойство IsClipped позволяет определить , обрезан ли по границе данный объект.
Свойство IsClipped позволяет определить , обрезан ли по границе данный объект.
Returns: Возвращает true, если обрезка по границе применена.
В противном случае возвращает false.

Teigha.DatabaseServices.UnderlayReference.IsOn
Свойство IsOn позволяет определить, отображается ли данная ссылка на подложку.
Свойство IsOn позволяет определить, отображается ли данная ссылка на подложку (является ли она видимой).
Returns: Возвращает true, если данный объект является видимым.
В противном случае возвращает false.

Teigha.DatabaseServices.UnderlayReference.Monochrome
Свойство Monochrome позволяет определить, отображается ли содержимое подложки в монохромном режиме.
Свойство Monochrome позволяет определить, отображается ли содержимое подложки в монохромном режиме.
Returns: Возвращает true, если используется монохромный режим.
В противном случае возвращает false.

Teigha.DatabaseServices.UnderlayReference.Name
Свойство Name представляет имя данного объекта.
Свойство Name представляет имя данного объекта.
Returns: Возвращает имя данного объекта.
Тип String.

Teigha.DatabaseServices.UnderlayReference.NameOfSheet
Свойство NameOfSheet представляет имя листа.
Свойство NameOfSheet представляет имя листа.
Returns: Возвращает имя листа.
Тип String.

Teigha.DatabaseServices.UnderlayReference.Normal
Свойство Normal представляет вектор нормали плоскости данной подложки.
Свойство Normal представляет вектор нормали плоскости данной подложки.
Returns: Возвращает нормаль плоскости данного объекта.
Тип Vector3d.

Teigha.DatabaseServices.UnderlayReference.Path
Свойство Path представляет полный путь к файлу подложки.
Свойство Path представляет полный путь к файлу подложки.
Returns: Возвращает полный путь к файлу подложки.
Тип String.

Teigha.DatabaseServices.UnderlayReference.position
Свойство Position представляет положение подложки в мировой системе координат (WCS).
Свойство Position представляет точку привязки (положение) подложки в мировой системе координат (WCS).
Returns: Возвращает 3D-точку, положение которой определяет положение подложки в WCS.
Тип Point3d.

Teigha.DatabaseServices.UnderlayReference.Rotation
Свойство Rotation представляет угол поворота (в радианах) вокруг оси, определяемой точкой привязки и вектором нормали плоскости данной подложки.
Свойство Rotation представляет угол поворота (в радианах) вокруг оси, определяемой точкой привязки и вектором нормали плоскости данной подложки.
Returns: Возвращает угол поворота подложки в радианах.
Тип double.

Teigha.DatabaseServices.UnderlayReference.scaleFactors
Свойство ScaleFactors представляет коэффициенты масштабирования данной подложки.
Свойство ScaleFactors представляет коэффициенты масштабирования данной подложки.
Returns: Возвращает коэффициенты масштабирования подложки.
Тип Scale3d.

Teigha.DatabaseServices.UnderlayReference.Transform
Свойство Transform представляет матрицу преобразования данной подложки.
Свойство Transform представляет матрицу преобразования данной подложки.
Returns: Возвращает матрицу геометрического преобразования данного объекта.
Тип Matrix3d.

Teigha.DatabaseServices.UnderlayReference.UnderlayLayerCollection
Свойство UnderlayLayerCollection представляет коллекцию слоев подложки в базе данных.
Свойство UnderlayLayerCollection представляет коллекцию слоев подложки в базе данных.
Returns: Возвращает коллекцию слоев подложки.
Тип DatabaseServices.UnderlayLayerCollection.

Teigha.DatabaseServices.UnderlayReference.Width
Свойство Width представляет ширину данной подложки на чертеже.
Свойство Width представляет ширину данной подложки на чертеже.
Returns: Возвращает  ширину подложки на чертеже.
Тип double.