HostMgd.EditorInput.JigPromptGeometryOptions.BasePoint
Базовая точка для операции Jig.
Свойство предназначено для определения базовой точки для операции Jig с геометрическим объектом.
Returns: Возвращает выбранную базовую точку.