Teigha.DatabaseServices.Rectangle3d
Структура Rectangle3d представляет четыре точки, которые определяют вершины 3D-прямоугольника.
Структура Rectangle3d представляет четыре точки, которые определяют вершины 3D-прямоугольника.

Teigha.DatabaseServices.Rectangle3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор структуры Rectangle3d. Создает 3D-прямоугольник, используя заданные вершины.
Конструктор структуры Rectangle3d. Создает 3D-прямоугольник, используя заданные вершины.
upperLeft: Вершина в верхнем левом  углу прямоугольника.  Тип Point3d.
upperRight: Вершина в верхнем правом углу прямоугольника.  Тип Point3d.
lowerLeft: Вершина в нижнем  левом  углу прямоугольника.  Тип Point3d.
lowerRight: Вершина в нижнем  правом углу прямоугольника.  Тип Point3d.

Teigha.DatabaseServices.Rectangle3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки, учитывающее заданные языковые и региональные настройки.
Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки, учитывающее заданные языковые и региональные настройки.
Возвращаемая строка содержит точки вершин данного прямоугольника в следующем порядке:
* Верхняя левая вершина.
* Верхняя правая вершина.
* Нижняя левая вершина.
* Нижняя правая вершина.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Тип String.

Teigha.DatabaseServices.Rectangle3d.LowerLeft
Свойство LowerLeft представляет нижнюю левую вершину прямоугольника.
Свойство LowerLeft представляет нижнюю левую вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип Point3d.

Teigha.DatabaseServices.Rectangle3d.LowerRight
Свойство LowerRight представляет правую нижнюю вершину прямоугольника.
Свойство LowerRight представляет правую нижнюю вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип Point3d.

Teigha.DatabaseServices.Rectangle3d.UpperLeft
Свойство UpperLeft представляет верхнюю левую вершину прямоугольника.
Свойство UpperLeft представляет верхнюю левую вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип Point3d.

Teigha.DatabaseServices.Rectangle3d.UpperRight
Свойство UpperRight представляет правую верхнюю вершину прямоугольника.
Свойство UpperRight представляет правую верхнюю вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип Point3d.