Teigha.DatabaseServices.Database.ObjectReappended
Событие
возникает, если добавление объекта в базу данных было
отменено по команде Undo, и объект повторно добавляется к
базе данных при выполнении команды REDO nanoCAD.