HostMgd.EditorInput.JigPromptGeometryOptions.UseBasePoint
Признак использования базовой точки во время операции Jig.
Свойство предназначено для определения признака использования базовой точки во время операции Jig с геометрическим объектом.
Returns: Возвращает признак использования базовой точки. true - базовая точка используется, false - базовая точка не используется.