Teigha.DatabaseServices.LayerTable.GetEnumerator
Метод предназначен для перебора в цикле содержимого таблицы
слоёв.
С помощью метода можно получить доступ к счетчику коллекции,
который осуществляет переход от одного элемента коллекции к
другому по порядку расположения этих элементов в коллекции.
Returns: Возвращает тип данных SymbolTableEnumerator.