HostMgd.ApplicationServices.InplaceTextEditor.Paste
Метод вставляет текст из буфера обмена в то место, где находится текущий выделенный объект (курсор или выделение).
В текущей версии не реализован.
Метод вставляет текст из буфера обмена в то место, где находится текущий выделенный объект (курсор или выделение).
Если в момент вызова метода существует выделенный текст, текущее выделение удаляется.
В текущей версии метод не реализован.