HostMgd.ApplicationServices.ConfigurationSectionNameAttribute
Класс определяет атрибут, который используется для
определения и получения имени секции конфигурации.

HostMgd.ApplicationServices.ConfigurationSectionNameAttribute.#ctor(System.String)
Конструктор.
name: Имя секции конфигурации

HostMgd.ApplicationServices.ConfigurationSectionNameAttribute.Name
Возвращает значение имени секции конфигурации.