Teigha.DatabaseServices.RasterImage.GetClipBoundary
Возвращает коллекцию вершин границ контура изображения в 2D
координатах. Инвертируйте PixelToModelTransform матрицу для
их преобразования в координаты пространства модели.