HostMgd.EditorInput.SelectedSubObject
Это базовый класс для описания подобъектов, выбранных
различными методами. Он определяет базовые данные,
описывающие выбранный подобъект С полный путь к
геометрическому подобъекту, GS маркер, метод выбора
подобъекта, а также необязательные детали.

HostMgd.EditorInput.SelectedSubObject.FullSubentityPath
Возвращает или задает полный путь геометричского подобъекта в
выбранном подобъекте.

HostMgd.EditorInput.SelectedSubObject.GraphicsSystemMarker
Устанавливает или возвращает GS маркер выбранного подобъекта.

HostMgd.EditorInput.SelectedSubObject.OptionalDetails
Устанавливает или возвращает необязательные детали выбранного
подобъекта.

HostMgd.EditorInput.SelectedSubObject.#ctor(Teigha.DatabaseServices.FullSubentityPath,HostMgd.EditorInput.SelectionMethod,System.Int32)
Конструктор класса.
path: Путь к объекту
method: Метод выбора
gsMarker: GS маркер

HostMgd.EditorInput.SelectedSubObject.SelectionMethod
Возвращает метод выбора для выбранного подобъекта.

HostMgd.EditorInput.SelectedSubObject.ToString(IFormatProvider)
Возвращает строку, соответствующую выбранному объекту в
соответствии с заданным форматом, зависящим от локализации.
provider: Формат, зависящей от локализации