HostMgd.ApplicationServices.LongTransactionManager.CheckedOut
Событие CheckedOut возникает после успешного завершения выгрузки объектов в длительную транзакцию (операция CheckOut). В текущей версии не реализовано.
Событие CheckedOut возникает после успешного завершения выгрузки объектов в длительную транзакцию (операция CheckOut).
В текущей версии не реализовано.