Teigha.GraphicsInterface.ViewportTraits
Класс ViewportTraits предоставляет видовым экранам возможность передавать специфические свойства конкретного видового экрана в системы отображения и рендеринга.
Аналогично графическим объектам, видовые экраны как в пространстве модели (Model), так и в пространстве листа (Layout), перед вызовом метода Viewport.WorldDraw() отрабатывают вызов своего метода Viewport.SetAttributes().
Это дает видовым экранам возможность передавать специфические свойства всякого видового экрана в системы отображения и рендеринга.
Конкретный экземпляр этого интерфейсного класса передается как в метод Viewport.SetAttributes(), так и в метод  ViewportTableRecord.SetAttributes().
Затем объект видового экрана должен выполнить вызовы Set этого интерфейса.
Класс ViewportTraits является производным от DrawableTraits.

Teigha.GraphicsInterface.ViewportTraits.#ctor
Конструктор по умолчанию класса ViewportTraits.
Конструктор по умолчанию класса ViewportTraits.

Teigha.GraphicsInterface.ViewportTraits.AmbientLightColor
Свойство AmbientLightColor представляет рассеянный свет, используемый видовым экраном.
Свойство AmbientLightColor представляет рассеянный свет (цвет в тенях), используемый видовым экраном.
Returns: Возвращает рассеянный свет в видовом экране.
Тип Colors.Color.

Teigha.GraphicsInterface.ViewportTraits.Background
Свойство Background представляет постоянный идентификатор объекта фона для этого видового экрана.
Свойство Background представляет постоянный идентификатор объекта фона для этого видового экрана.
Returns: Возвращает идентификатор объекта Background.
Тип ObjectId. Если фон не задан возвращается значение Null.

Teigha.GraphicsInterface.ViewportTraits.Brightness
Свойство Brightness представляет значение яркости для видового экрана.
Свойство Brightness представляет текущее значение яркости для видового экрана.
Returns: Возвращает значение яркости в диапазоне [0..200].
Тип double.

Teigha.GraphicsInterface.ViewportTraits.Contrast
Свойство Contrast представляет значение контраста для видового экрана.
Свойство Contrast представляет текущее значение контраста для видового экрана.
Returns: Возвращает значение контраста в диапазоне [0..100].
Тип double.

Teigha.GraphicsInterface.ViewportTraits.DefaultLightingOn
Свойство DefaultLightingOn позволяет определить, включено ли освещение по умолчанию.
Свойство DefaultLightingOn позволяет определить состояние освещения по умолчанию в данном видовом экране.
Notes
Установка данного флага переопределяет пользовательское освещение.
В этом случае вместо пользовательского освещения используются источники света по умолчанию.
Если пользовательские источники света не определены, используются источники света по умолчанию, а значение этого флага игнорируется.
Returns: Возвращает true, если в видовом экране используется освещение по умолчанию.
В противном случае возвращает false.

Teigha.GraphicsInterface.ViewportTraits.DefaultLightingType
Свойство DefaultLightingType представляет тип освещения по умолчанию для этого видового экрана.
Свойство DefaultLightingType представляет тип освещения по умолчанию, заданное для этого видового экрана.
Returns: Возвращает тип освещения по умолчанию.
Значение из перечисления GraphicsInterface.DefaultLightingType.

Teigha.GraphicsInterface.ViewportTraits.RenderEnvironment
Свойство RenderEnvironment представляет постоянный идентификатор объекта среды рендеринга для этого видового экрана.
Свойство RenderEnvironment представляет постоянный идентификатор объекта RenderEnvironment для этого видового экрана.  Используется только в полных рендерах.
Returns: Возвращает идентификатор объекта среды рендеринга.
Тип ObjectId.

Teigha.GraphicsInterface.ViewportTraits.RenderSettings
Свойство RenderSettings представляет постоянный идентификатор объекта RenderSettings  для этого видового экрана.
Свойство RenderSettings представляет постоянный идентификатор объекта RenderSettings с настройками  рендеринга, которые применяются к этому видовому экрану.  Используется только в полных рендерах.
Returns: Возвращает идентификатор объекта RenderSettings.
Тип ObjectId.