Teigha.DatabaseServices.MText.GetBoundingPoints
Метод возвращает граничные угловые точки WCS области текста данного объекта MText.
Метод возвращает граничные угловые точки WCS области текста данного объекта MText.
Последовательность точек в возвращаемой коллекции имеет следующий вид.
Индекс точки		Угол
-------------		--------------------
0   				Левый верхний угол.
1   				Правый верхний угол.
2   				Нижний левый угол.
3   				Нижний правый угол.
Returns: Возвращает коллекцию граничных угловых точек области текста данного объекта.
Тип Geometry.Point3dCollection.