HostMgd.EditorInput.PromptEntityResult.ToString
Метод возвращает строковое представление результата выбора объекта,
включая идентификатор и координаты точки выбора.
Переопределённый метод класса PromptEntityResult предоставляет строковое описание
выбранного геометрического объекта и точки его выбора.
Он используется для отладки, логирования или вывода информации в командную строку nanoCAD.
Метод формирует строку на основе данных о статусе операции, идентификаторе объекта (ObjectId)
и точке выбора (PickedPoint), если операция завершена успешно.
Returns: Возвращает значение типа string, содержащее:
* Статус операции (например, OK, Cancel).
* Идентификатор (ObjectId) выбранного объекта.
* Координаты точки выбора (Point3d), если доступны.
Если операция была прервана или объект не выбран, возвращается строка,
содержащая информацию об этом (например, "Operation cancelled" или "No entity selected").
Example
C#