Teigha.DatabaseServices.ObjectId
ObjectId хранит единственный неизменный в пределах сеанса локатор для резидентного объекта базы данных.
Механизм работы с находящимися в памяти резидентными объектами базы данных состоит из двух частей.
Первая – это сам резидентный объект базы данных, который находится в памяти и может быть выгружен на диск, если необходимо высвободить память.  Вторая часть – это объект-заглушка, который всегда находится в памяти и играет роль точки доступа к соответствующему резидентному объекту базы данных.
Когда некоторый объект (object / entity) впервые добавляется в базу данных, создается новый объект-заглушка с указателем на добавляемый в базу данных объект.  Адрес в памяти этой заглушки и является значением ObjectId для добавляемого в базу данных объекта.  Этот же механизм применяется, когда база данных считывается в память с диска.
При открытии резидентного объекта базы данных приложение видит, что в открывающий вызов передается ObjectId резидентного объекта базы данных и возвращается указатель на реальный резидентный объект базы данных.  В действительности ObjectId является просто адресом заглушки в памяти, обращение к которой необходимо лишь для получения указателя на реальный резидентный объект базы данных.  Когда выгруженный на диск резидентный объект базы данных подгружается обратно в память, то возвращается уже его новый адрес.
Как таковой, объект ObjectId служит контейнером для адреса заглушки резидентного объекта базы данных.  Это чрезвычайно важный объект, поскольку он хранит единственный неизменный в пределах сеанса локатор для резидентного объекта базы данных.

Teigha.DatabaseServices.ObjectId.#ctor(IntPtr)
Конструктор создает экземпляр ObjectId на основе целочисленного указателя в старом формате.
Конструктор создает экземпляр ObjectId на основе целочисленного указателя в старом формате.
oldId: Исходный указатель, тип IntPtr.
Returns: Возвращает новый экземпляр ObjectId.

Teigha.DatabaseServices.ObjectId.Compare(Teigha.DatabaseServices.ObjectId)
Метод сравнивает идентификатор данного объекта с указанным ObjectId и возвращает true, если они совпадают.
Метод сравнивает идентификатор данного объекта с указанным ObjectId и возвращает true, если они совпадают.
value1: ObjectId, с которым выполняется сравнение.
Returns: Возвращает true в случае совпадения идентификаторов, и false в противном случае.

Teigha.DatabaseServices.ObjectId.Equals(Object)
Возвращает true, если данный объект равен объекту в аргументе.
Возвращает true, если данный объект равен объекту в аргументе.
obj: Объект для сравнения, тип Object.
Returns: Возвращает true, если данный объект равен объекту в аргументе, иначе - false.

Teigha.DatabaseServices.ObjectId.GetObject(Teigha.DatabaseServices.OpenMode)
Возвращает объект, связанный с данным ObjectId.
Возвращает объект, связанный с данным ObjectId.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
Returns: Возвращает экземпляр класса DBObject
Example
В примере приведен фрагмент кода, демонстрирующий открытие объекта из базы данных.
По завершении работы с объектом, открытым таким образом, его необходимо принудительно удалить из памяти,
чтобы избежать ошибок в работе платформы и вашего приложения.
С#

Teigha.DatabaseServices.ObjectId.GetObject(Teigha.DatabaseServices.OpenMode,System.Boolean)
Возвращает объект, связанный с данным ObjectId.
Возвращает объект, связанный с данным ObjectId.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует получать ID удаленных объектов.
Returns: Возвращает экземпляр класса DBObject.

Teigha.DatabaseServices.ObjectId.GetObject(Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Возвращает объект, связанный с данным ObjectId.
Возвращает объект, связанный с данным ObjectId.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует получать ID удаленных объектов. Тип bool.
forceOpenOnLockedLayer: Задать true, если следует открывать заблокированные слои. Тип bool.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.Open(Teigha.DatabaseServices.OpenMode)
Метод открывает объект в указанном режиме доступа.
Метод открывает объект в указанном режиме доступа.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.Open(Teigha.DatabaseServices.OpenMode,System.Boolean)
Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует открывать удаленный объект. Тип bool.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.Open(Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует открывать удаленный объект. Тип bool.
forceOpenOnLockedLayer: Задать true, если следует открывать заблокированные слои. Тип bool.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.ToString(IFormatProvider)
Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает языковые и региональные настройки, определенные указанным поставщиком IFormatProvider.
Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает языковые и региональные настройки, определенные указанным поставщиком IFormatProvider. Подробнее см. в документации Microsoft .NET API.
provider: Поставщик IFormatProvider языковых и региональных настроек.
Returns: Возвращает тип String.

Teigha.DatabaseServices.ObjectId.Database
Свойство предоставляет доступ к базе данных, в которой ID объекта является резидентным.
Если идентификатор объекта равен NULL, то свойство возвращает NULL.
Предоставляет доступ к базе данных, в которой ID объекта является резидентным.
Если идентификатор объекта равен NULL, то свойство возвращает NULL.
Returns: Возвращает объект типа Teigha.DatabaseServices.Database.

Teigha.DatabaseServices.ObjectId.Handle
Свойство предоставляет доступ к дескриптору объекта с данным ObjectId.
Свойство предоставляет доступ к дескриптору объекта с данным ObjectId.
Returns: Возвращает тип Teigha.DatabaseServices.Handle.

Teigha.DatabaseServices.ObjectId.IsEffectivelyErased
Свойство определяет, удален или нет объект, связанный с этим ObjectId, а также не удален ли кто-либо из владельцев в иерархии владения этим объектом.
Свойство определяет, удален или нет объект, связанный с этим ObjectId.
Возвращает значение true, если этот объект удален, или если удален кто-либо из владельцев в иерархии владения этим объектом (другими словами, владелец объекта, владелец владельца объекта и т. д.).
Returns: Возвращает значение true, если объект, связанный с этим ObjectId, удален, или если удален кто-либо из владельцев в иерархии владения этим объектом.

Teigha.DatabaseServices.ObjectId.IsErased
Свойство возвращает true, если объект, связанный с данным ObjectId, удален.
Свойство возвращает true, если объект, связанный с данным ObjectId, удален.
Returns: Возвращает true, если объект, связанный с данным ObjectId, удален. В противном случае возвращает false.

Teigha.DatabaseServices.ObjectId.IsNull
Свойство возвращает true, если ObjectId данного объекта является нулевым.
Свойство возвращает true, если ObjectId данного объекта имеет значение Null.
Returns: Возвращает true, если ObjectId данного объекта имеет значение Null, иначе - false.

Teigha.DatabaseServices.ObjectId.IsResident
Свойство возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти.
Свойство возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти.
Returns: Возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти. В противном случае возвращает false.

Teigha.DatabaseServices.ObjectId.IsValid
Свойство определяет, связан ли ObjectId с базой данных, которая в данный момент загружена в память.
Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.
Свойство определяет, связан ли ObjectId с базой данных, которая в данный момент загружена в память.
Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.
Returns: Возвращает значение true, если этот ObjectId связан с базой данных, которая в данный момент находится в памяти. Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.

Teigha.DatabaseServices.ObjectId.NonForwardedHandle
Если данный ObjectId находится в базе данных внешних ссылок, а связанный с ним объект, был перенаправлен в главную базу данных, то значением этого свойства является дескриптор (handle) в базе данных внешних ссылок.
Если объект, связанный с этим ObjectId, не из базы данных внешних ссылок или не перенаправлен, то это свойство аналогично свойству ObjectId.Handle.
Если данный ObjectId находится в базе данных внешних ссылок, а связанный с ним объект, был перенаправлен в главную базу данных, то значением этого свойства является дескриптор (handle) в базе данных внешних ссылок.
Если объект, связанный с этим ObjectId, не из базы данных внешних ссылок или не перенаправлен, то это свойство аналогично свойству ObjectId.Handle.
Returns: Возвращает дескриптор Teigha.DatabaseServices.Handle.

Teigha.DatabaseServices.ObjectId.Null
Свойство обеспечивает доступ к нулевому ObjectId.  Данное свойство позволяет использовать более компактные выражения и помогает компилятору генерировать более эффективный код (если он знает, что ObjectId нулевой, то нет необходимости искать объект Null).
Свойство обеспечивает доступ к нулевому ObjectId.  Данное свойство позволяет использовать более компактные выражения и помогает компилятору генерировать более эффективный код (если он знает, что ObjectId нулевой, то нет необходимости искать объект Null).
Returns: Возвращает тип ObjectId.

Teigha.DatabaseServices.ObjectId.ObjectClass
Свойство предоставляет доступ к RXClass объекта, который ассоциирован с ObjectId, таким образом гарантируя, что результат может быть безопасно разыменован и корректно сравнен с любым классом, производным от DBObject.
Свойство предоставляет доступ к RXClass объекта, который ассоциирован с ObjectId, таким образом гарантируя, что результат может быть безопасно разыменован и корректно сравнен с любым классом, производным от DBObject.
Введение этого свойства имело своей целью упрощение разрабатываемого кода.  Необходимость всегда сравнивать результат с NULL отчасти противоречит цели функции.
Returns: Возвращает тип RXClass.

Teigha.DatabaseServices.ObjectId.OldId
Свойство устарело, вместо него следует использовать свойство OldIdPtr.
Свойство обеспечивает доступ к значению ObjectId как к длинному целому (long), что является старым форматом
(представляет собой массив из двух элементов типа long, в первом из которых содержится то же значение, что и в ObjectId).
Returns: Возвращает массив из двух элементов типа long.

Teigha.DatabaseServices.ObjectId.OldIdPtr
Свойство предоставляет доступ к значению ObjectId в старом формате - как к длинному целому (он представляет собой массив из двух long, первый элемент которого содержит то же значение, что и ObjectId).
Свойство предоставляет доступ к значению ObjectId в старом формате - как к длинному целому (он представляет собой массив из двух long, первый элемент которого содержит то же значение, что и ObjectId).
Returns: Возвращает IntPtr.

Teigha.DatabaseServices.ObjectId.OriginalDatabase
Если этот ObjectId находится в базе данных внешних ссылок (xref database), и связанный с ним объект был перенаправлен в главную базу данных, то данное свойство возвращает указатель на базу данных внешних ссылок.
Если связанный с этим ObjectId объект не из базы данных внешних ссылок или не был перенаправлен, то значение этого свойства совпадает с ObjectId.Database.
Если этот ObjectId находится в базе данных внешних ссылок (xref database), и связанный с ним объект был перенаправлен в главную базу данных, то данное свойство возвращает указатель на базу данных внешних ссылок.
Если связанный с этим ObjectId объект не из базы данных внешних ссылок или не был перенаправлен, то значение этого свойства совпадает с ObjectId.Database.
Returns: Возвращает объект типа DatabaseServices.Database.