HostMgd.EditorInput.Editor.DraggingEnded
Событие возникает при завершении пользователем операции перетаскивания объекта в чертеже.
Событие не реализовано.
Событие предназначено для обработки действий, которые должны быть выполнены
сразу после окончания интерактивной операции перетаскивания.
Оно позволяет подписаться на уведомление о том, что пользователь отпустил мышь
и перемещение объекта завершено. С помощью этого события можно выполнить финальные действия
— например, зафиксировать новое положение объекта, обновить состояние
или произвести визуальные изменения.
Notes
В текущей версии не реализовано.
Событие использует делегат DraggingEndedEventHandler,
который передаёт расширенную информацию через объект DraggingEndedEventArgs.
Example
C#