Teigha.GraphicsInterface.DiagnosticMode.Grid
Значение: 1.
Режим отрисовки диагностической сетки поверх всех объектов сцены, используя систему координат, заданную значением из перечисления DiagnosticGridMode.