Teigha.DatabaseServices.ObjectContextCollectionEnumerator
Этот класс представляет перечислитель для коллекции объектов ObjectContext.
Этот класс представляет перечислитель для коллекции объектов ObjectContext.

Teigha.DatabaseServices.ObjectContextCollectionEnumerator.Current
Свойство представляет элемент коллекции, на котором установлен указатель перечислителя.
Свойство представляет элемент коллекции, на котором установлен указатель перечислителя.
Returns: Возвращает элемент коллекции под указателем перечислителя.  Тип ObjectContext.