Teigha.DatabaseServices.Spline
Класс Spline представляет объекты Spline в базе данных.
Класс Spline представляет объекты сплайнов в базе данных.
Сам сплайн может представлять собой либо простую аппроксимацию кривой некоторого набора определяющих точек в пределах указанного допуска, который может быть равен 0, либо это может быть неоднородный рациональный B-сплайн (NURBS), для математического описания которого используются массивы управляющих вершин, узлов и весов.

Teigha.DatabaseServices.Spline.#ctor
Конструктор по умолчанию класса Spline.
Конструктор по умолчанию класса Spline.

Teigha.DatabaseServices.Spline.#ctor(System.Int32,System.Boolean,System.Boolean,System.Boolean,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection,System.Double,System.Double)
Конструктор класса Spline. Создает экземпляр класса с указанными параметрами.
Конструктор класса Spline. Создает экземпляр класса с указанными параметрами.
Если сплайн должен быть рациональным, то аргумент rational должен иметь значение true.
Если сплайн должен быть замкнутым, то аргумент closed должен иметь значение true.
Если сплайн должен быть периодическим, то аргумент periodic должен иметь значение true (допускается только для замкнутого сплайна). Сплайн является периодическим с периодом T, если точки сплайна, соответствующие параметрам t и t+T, совпадают для любого значения t.
Массив весов используется только для рационального сплайна. В этом случае он должен иметь то же количество элементов, что и коллекция управляющих вершин controlPoints. Все значения весов должны быть положительными.
В случае непериодического сплайна длина узлового вектора должна быль на degree+1 больше длины массива управляющих вершин controlPoints.
В случае периодического сплайна длина узлового вектора должна на единицу превышать длину массива управляющих вершин.
Первая и последняя управляющие вершины НЕ ДОЛЖНЫ быть идентичными.
Значение nodeTolerance используется для выявления совпадающих узлов. Если два узла отличаются менее, чем на nodeTolerance, то эти два значения будут считаться одинаковыми (и первое из них будет использоваться для обоих узлов).
Для выявления совпадающих управляющих вершин используется значение controlPointTolerance.
Управляющие вершины, расстояние между которыми (в единицах чертежа) оказывается меньше, чем controlPointTolerance, считаются совпадающими. Если первая и последняя управляющие вершины неразличимы в пределах допуска controlPointTolerance, сплайн будет замкнутым независимо от значения входного аргумента closed.
degree: Степень сплайна (его порядок). Тип int.
rational: Флаг, определяющий, является ли сплайн рациональным. Тип bool.
closed: Флаг, определяющий, является ли сплайн замкнутым. Тип bool.
periodic: Флаг, определяющий, является ли сплайн периодическим. Тип bool.
controlPoints: Коллекция управляющих вершин сплайна. Тип Point3dCollection.
knots: Узловой вектор сплайна. Тип DoubleCollection.
weights: Коллекция весов в управляющих вершинах. Тип DoubleCollection.
controlPointTolerance: Допуск для управляющих вершин сплайна. Тип double.
knotTolerance: Допуск для значений узлов сплайна. Тип double.

Teigha.DatabaseServices.Spline.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Конструктор класса Spline. Создает сплайн, геометрически представляющий эллиптическую дугу с заданными параметрами.
Конструктор класса Spline. Создает экземпляр класса, геометрически представляющий эллиптическую дугу с указанными параметрами (центр, направления осей, радиусы и т.д.).
center: Центр эллиптической дуги. Тип Point3d.
unitNormal: Нормаль плоскости эллиптической дуги. Тип Vector3d.
majorAxis: Направление главной оси эллипса. Тип Vector3d.
radiusRatio: Отношение малого и большого радиусов эллипса. Тип double.
startAngle: Угол для начальной точки дуги (в радианах). Тип double.
endAngle: Угол для конечной  точки дуги (в радианах). Тип double.

Teigha.DatabaseServices.Spline.#ctor(Teigha.Geometry.Point3dCollection,System.Int32,System.Double)
Конструктор класса Spline. Создает экземпляр класса, который аппроксимирует кривой указанного порядка переданный массив определяющих точек в пределах заданного допуска. Направления касательных на концах сплайна определяются автоматически.
Конструктор класса Spline. Создает сплайн, который аппроксимирует переданный массив определяющих точек point кривой порядка order в пределах заданного допуска fitTolerance.
Нулевой допуск обеспечивает точную интерполяцию, т.е. сплайн пройдет через все определяющие точки.
Порядок кривой order должен находиться в диапазоне от 2 до 26.
Направления касательных на концах сплайна определяются из условия наилучшей аппроксимации массива определяющих точек.
point: Массив определяющих точек. Тип Point3dCollection.
order: Порядок сплайна. Тип int.
fitTolerance: Точность аппроксимации определяющих точек. Тип double.

Teigha.DatabaseServices.Spline.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Int32,System.Double)
Конструктор класса Spline. Создает экземпляр класса, который аппроксимирует переданный массив определяющих точек сплайном указанного порядка в пределах заданного допуска. Направления касательных на концах сплайна настраиваются входными параметрами.
Конструктор класса Spline. Создает экземпляр класса, который аппроксимирует переданный массив определяющих точек point сплайном порядка order в пределах заданного допуска fitTolerance.
Нулевой допуск обеспечивает точную интерполяцию, т.е. сплайн пройдет через все определяющие точки.
Порядок кривой order должен находиться в диапазоне от 2 до 26.
Касательные в начальной и конечной точках сплайна определяются входными векторами startTangent и endTangent, соответственно.
point: Массив определяющих точек. Тип Point3dCollection.
startTangent: Направление касательной в начальной точке сплайна. Тип Vector3d.
endTangent: Направление касательной в конечной точке сплайна. Тип Vector3d.
order: Порядок сплайна. Тип int.
fitTolerance: Точность аппроксимации. Тип double.

Teigha.DatabaseServices.Spline.ElevateDegree(System.Int32)
Метод позволяет увеличить степень данного сплайна до указанного значения.
Метод позволяет увеличить степень данного сплайна до указанного значения newDegree.
Степень сплайна на единицу меньше его порядка.
После увеличения степени сплайна уменьшить ее нельзя.
Диапазон допустимых значений - от текущего значения степени до 25.
newDegree: Новое значение степени сплайна. Тип int.

Teigha.DatabaseServices.Spline.GetControlPointAt(System.Int32)
Метод предоставляет управляющую вершину данного объекта Spline по её индексу.
Метод предоставляет управляющую вершину данного объекта Spline по её индексу.
index: Индекс управляющей вершины сплайна. Тип int.
Returns: Возвращает управляющую вершину сплайна. Тип Point3d.

Teigha.DatabaseServices.Spline.GetFitPointAt(System.Int32)
Метод предоставляет указанную по индексу определяющую точку данного сплайна.
Метод предоставляет указанную по индексу определяющую точку данного сплайна.
index: Индекс точки в массиве определяющих точек сплайна. Тип int.
Returns: Возвращает определяющую точку с указанным индексом. Тип Point3d.

Teigha.DatabaseServices.Spline.InsertFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет вставить указанную точку в массив определяющих точек данного сплайна по заданному индексу.
Метод позволяет вставить указанную точку в массив определяющих точек данного сплайна по заданному индексу.
index: Индекс в массиве определяющих точек. Тип int.
point: Вставляемая определяющая точка. Тип Point3d.

Teigha.DatabaseServices.Spline.InsertKnot(System.Double)
Метод позволяет вставить новый узел в узловой вектор сплайна в позицию, определенную предоставленным значением параметра.
Метод позволяет вставить новый узел в узловой вектор сплайна в позицию, определенную предоставленным значением параметра value.
Значение value должно находиться в пределах параметрического диапазона сплайна.
Чтобы выяснить этот параметрический диапазон, используйте свойство Spline.NurbsData, возвращающее коллекцию текущих значений узлов сплайна. Значения для первого и последнего узлов определяют начальное и конечное значения параметра сплайна, соответственно.
value: Значение вставляемого узла. Тип double.

Teigha.DatabaseServices.Spline.RemoveFitPointAt(System.Int32)
Метод предназначен для удаления из данного сплайна определяющей точки с указанным индексом.
Метод предназначен для удаления из данного сплайна определяющей точки с указанным индексом.
index: Индекс определяющей точки. Тип int.

Teigha.DatabaseServices.Spline.SetControlPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет изменить координаты управляющей вершины данного сплайна с заданным индексом.
Метод позволяет изменить координаты управляющей вершины данного сплайна с заданным индексом.
index: Индекс новой управляющей вершины. Тип int.
point: Новое положение управляющей вершины в мировой системе координат (WCS). Тип Point3d.

Teigha.DatabaseServices.Spline.SetFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет изменить координаты определяющей точки данного сплайна с заданным индексом.
Метод позволяет изменить координаты определяющей точки данного сплайна с заданным индексом.
index: Индекс определяющей точки. Тип int.
point: Новое положение определяющей точки в мировой системе координат (WCS). Тип Point3d.

Teigha.DatabaseServices.Spline.SetWeightAt(System.Int32,System.Double)
Метод позволяет изменить вес управляющей вершины с указанным индексом.
Метод позволяет изменить вес управляющей вершины с указанным индексом.
Если сплайн не является рациональным, то он преобразуется в рациональный сплайн.
index: Индекс управляющей вершины. Тип int.
weight: Новое значение веса управляющей вершины. Тип double.

Teigha.DatabaseServices.Spline.ToPolyline(System.Boolean,System.Boolean)
Метод предназначен для аппроксимации данного сплайна полилинией.
Входные аргументы метода позволяют в случае плоского сплайна разрешить использование дуг и приведение результата к типу Polyline.
Метод позволяет получить полилинию, которая аппроксимирует данный сплайн.
Результирующая кривая может иметь тип Polyline, Polyline2d или Polyline3d.
Если хотя бы одна из точек сплайна не лежит в плоскости XY, то создается полилиния типа Polyline3d, состоящая всегда только из линейных сегментов.
Если сплайн является плоским, и аргумент bConvertAsArcs принимает значение true, то результирующая полилиния состоит из сегментов круглых дуг, иначе - из линейных сегментов.
Если сплайн является плоским, и аргумент bToLWPolyline принимает значение true, то результирующая полилиния имеет тип Polyline, в противном случае - Polyline2d.
bConvertAsArcs: Флаг, определяющий, следует ли сегменты полилинии конвертировать в дуги, если сплайн плоский.  Тип bool.
bToLWPolyline: Флаг, определяющий, следует ли привести результат аппроксимации к типу Polyline, если сплайн плоский. Тип bool.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип Curve.

Teigha.DatabaseServices.Spline.ToPolyline(unsigned int)
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргумент метода позволяет ограничить сверху количество вершин создаваемой полилинии.
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргумент numOfVertices позволяет ограничить сверху количество вершин создаваемой полилинии.
Увеличение количества вершин полилинии обеспечивает более точную аппроксимацию сплайна ценой снижения скорости отрисовки полилинии.
Результирующая кривая может иметь тип Polyline, Polyline2d или Polyline3d.
Если хотя бы одна из точек сплайна не лежит в плоскости XY, то создается полилиния типа Polyline3d, состоящая всегда только из линейных сегментов.
numOfVertices: Ограничение сверху на количество вершин у создаваемой полилинии. Тип unsigned int.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип Curve.

Teigha.DatabaseServices.Spline.ToPolyline(unsigned int,System.Boolean,System.Boolean)
Метод предназначен для аппроксимации данного сплайна полилинией.
Входные аргументы метода позволяют ограничить сверху количество вершин создаваемой полилинии, а в случае плоского сплайна разрешить использование круглых дуг и приведение результата к типу Polyline.
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргумент numOfVertices позволяет влиять на точность аппроксимации за счет ограничения сверху количества вершин создаваемой полилинии.
Результирующая кривая может иметь тип Polyline, Polyline2d или Polyline3d.
Если хотя бы одна из точек сплайна не лежит в плоскости XY, то создается полилиния типа Polyline3d, состоящая всегда только из линейных сегментов.
Если сплайн является плоским, и аргумент bConvertAsArcs принимает значение true, то результирующая полилиния состоит из сегментов круглых дуг, иначе - из линейных сегментов.
Если сплайн является плоским, и аргумент bToLWPolyline принимает значение true, то результирующая полилиния имеет тип Polyline, в противном случае - Polyline2d.
numOfVertices: Ограничение сверху на количество вершин у создаваемой полилинии. Тип unsigned int. Передаваемое значение не может быть меньше количества определяющих точек сплайна.
bConvertAsArcs: Флаг, определяющий, следует ли сегменты полилинии конвертировать в круглые дуги, если сплайн плоский.  Тип bool.
bToLWPolyline: Флаг, определяющий, следует ли приводить результат аппроксимации к типу Polyline, если сплайн плоский. Тип bool.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип Curve.

Teigha.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32)
Метод предназначен для аппроксимации данного сплайна полилинией с настраиваемой точностью.
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргумент precision позволяет настраивать точность аппроксимации.
Предполагается, что точность находится в диапазоне [0..99], но может быть и выше.
Если передать отрицательное значение, его модуль будет использован как максимально допустимая точность, вычисляемая внутри метода. Необоснованно высокие значения точности порождают избыточное количество вершин полилинии, что закономерно снижает производительность отрисовки полилинии.
precision: Входная точность для процедуры аппроксимации. Тип int.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип Curve.

Teigha.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32,System.Boolean,System.Boolean)
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргументы метода позволяют настраивать точность аппроксимации и управлять типом получаемой полилинии.
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргумент precision позволяет настраивать точность аппроксимации.
Предполагается, что точность находится в диапазоне [0..99], но может быть и выше.
Если передать отрицательное значение, его модуль будет использован как максимально допустимая точность, вычисляемая внутри метода. Необоснованно высокие значения точности порождают избыточное количество вершин полилинии, что закономерно снижает производительность отрисовки полилинии.
Результирующая кривая может иметь тип Polyline, Polyline2d или Polyline3d.
Если сплайн не является плоским, то создается 3D-полилиния Polyline3d, состоящая исключительно из линейных сегментов.
Если сплайн является плоским, и аргумент bConvertAsArcs принимает значение true, то результирующая полилиния состоит из сегментов круглых дуг, иначе - из линейных сегментов.
Если сплайн является плоским, и аргумент bToLWPolyline принимает значение true, то результирующая полилиния имеет тип Polyline, в противном случае - Polyline2d.
precision: Входная точность для процедуры аппроксимации. Тип int.
bConvertAsArcs: Флаг, определяющий, следует ли сегменты полилинии конвертировать в круглые дуги, если сплайн плоский.  Тип bool.
bToLWPolyline: Флаг, определяющий, следует ли приводить результат аппроксимации к типу Polyline, если сплайн плоский. Тип bool.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип Curve.

Teigha.DatabaseServices.Spline.WeightAt(System.Int32)
Метод позволяет получить значение веса по указанному индексу.
Метод позволяет получить значение веса по указанному индексу.
index: Входной индекс. Тип int.
Returns: Возвращает значение веса. Тип double.

Teigha.DatabaseServices.Spline.Degree
Свойство Degree представляет степень данного сплайна.
Свойство Degree представляет степень данного сплайна.
Returns: Возвращает степень сплайна. Тип int.

Teigha.DatabaseServices.Spline.EndFitTangent
Свойство EndFitTangent представляет касательный вектор в конечной определяющей точке.
Свойство EndFitTangent представляет касательный вектор в конечной определяющей точке.
Returns: Возвращает касательный вектор. Тип Vector3d.

Teigha.DatabaseServices.Spline.FitData
Свойство FitData представляет данные подгонки этого сплайна.
Свойство FitData представляет данные подгонки этого сплайна.
Возвращаемые данные содержат все определяющие точки сплайна (в координатах WCS), допуск аппроксимации и касательные на концах сплайна, если они определены.
Returns: Возвращает данные подгонки в виде объекта DatabaseServices.FitData.

Teigha.DatabaseServices.Spline.FitTolerance
Свойство FitTolerance представляет точность аппроксимации для данного сплайна.
Свойство FitTolerance представляет точность аппроксимации для данного сплайна.
Returns: Возвращает точность аппроксимации. Тип double.

Teigha.DatabaseServices.Spline.HasFitData
Свойство HasFitData позволяет выяснить, был ли данный сплайн создан методом определяющих точек.
Свойство HasFitData позволяет выяснить, был ли данный сплайн создан методом определяющих точек.
Returns: Возвращает true, если сплайн был создан методом определяющих точек.
В противном случае возвращает false.

Teigha.DatabaseServices.Spline.IsNull
Свойство IsNull позволяет проверить, что у данного сплайна нет управляющих вершин.
Свойство IsNull позволяет проверить, что у данного сплайна нет управляющих вершин.
Returns: Возвращает true, если у данного сплайна нет управляющих вершин.
В противном случае возвращает false.

Teigha.DatabaseServices.Spline.IsPlanar
Свойство IsPlanar позволяет проверить, что данный сплайн является плоским.
Свойство IsPlanar позволяет проверить, что данный сплайн является плоским.
Returns: Возвращает true, если сплайн является плоским.
В противном случае возвращает false.

Teigha.DatabaseServices.Spline.IsRational
Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
Returns: Возвращает true, если сплайн является рациональным.
В противном случае возвращает false.

Teigha.DatabaseServices.Spline.NumControlPoints
Свойство NumControlPoints представляет количество управляющих вершин у данного сплайна.
Свойство NumControlPoints представляет количество управляющих вершин у данного сплайна.
Returns: Возвращает количество управляющих вершин. Тип int.

Teigha.DatabaseServices.Spline.NumFitPoints
Свойство NumFitPoints представляет количество определяющих точек у данного сплайна.
Свойство NumFitPoints представляет количество определяющих точек у данного сплайна.
Returns: Возвращает количество определяющих точек. Тип int.

Teigha.DatabaseServices.Spline.NurbsData
Свойство NurbsData представляет данные NURBS этого сплайна, включающие узлы, значения веса, значения допуска для узлов и управляющих вершин точек и т.д.
Свойство NurbsData представляет данные NURBS этого сплайна, включающие узлы, значения веса, значения допуска для узлов и управляющих вершин точек и т.д.
Returns: Возвращает данные NURBS сплайна. Тип DatabaseServices.NurbsData.

Teigha.DatabaseServices.Spline.StartFitTangent
Свойство StartFitTangent представляет касательный вектор в начальной определяющей точке.
Свойство StartFitTangent представляет касательный вектор в начальной определяющей точке.
Returns: Возвращает касательный вектор. Тип Vector3d.