Teigha.DatabaseServices.PlotStyle
Класс PlotStyle представляет стили печати.
Класс PlotStyle представляет стили печати.

Teigha.DatabaseServices.PlotStyle.Data
Свойство Data представляет настройки стиля печати в виде объекта PlotStyleData.
Свойство Data предоставляет доступ к настройкам данного стиля печати в виде объекта PlotStyleData.
Returns: Возвращает настройки стиля печати.
Тип PlotStyleData.

Teigha.DatabaseServices.PlotStyle.Description
Свойство Description представляет описание стиля печати.
Свойство Description предоставляет доступ к описанию данного стиля печати.
Returns: Возвращает описание стиля печати.
Тип String.

Teigha.DatabaseServices.PlotStyle.LocalizedName
Свойство LocalizedName представляет локализованное имя стиля печати.
Свойство LocalizedName предоставляет доступ к локализованному имени стиля печати.
Returns: Возвращает локализованное имя стиля печати.
Тип String.

Teigha.DatabaseServices.PlotStyle.Name
Свойство Description представляет имя стиля печати.
Свойство Description предоставляет доступ к имени данного стиля печати.
Returns: Возвращает имя стиля печати.
Тип String.