Teigha.GraphicsInterface.MaterialRefractionComponent.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Оно включает карту материала и значение коэффициента преломления.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.