Teigha.DatabaseServices.AssocArrayParameters.Commit
Метод предназначен для коммита (фиксации) изменений в объекте AssocArrayParameters и синхронизации изменений с базой данных, таким образом, изменения в массиве становятся видны на экране.
Метод предназначен для коммита (фиксации) изменений в объекте AssocArrayParameters и синхронизации изменений с базой данных, таким образом, изменения в массиве становятся видны на экране.
Если у объекта AssocArrayParameters нет владельца, никакие изменения не фиксируются.