Teigha.Geometry.OffsetCurveExtensionType
Перечисление OffsetCurveExtensionType определяет варианты сопряжения смещаемых сегментов кривых в процессе операции смещения (offset).
Перечисление OffsetCurveExtensionType определяет варианты сопряжения смещаемых сегментов кривых в процессе операции смещения (offset).