HostMgd.ApplicationServices.LongTransactionManager
Класс LongTransactionManager представляет менеджер для создания и управления длительными транзакциями.
В текущей версии не реализован.
Класс LongTransactionManager представляет менеджер для создания и управления длительными транзакциями.
В текущей версии не реализован.
Notes
Типичным примером операций, выполняемых в рамках длительных транзакций, является редактирование внешних ссылок и блоков.

HostMgd.ApplicationServices.LongTransactionManager.AbortLongTransaction(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод прерывает длительную транзакцию с указанным идентификатором.
В текущей версии не реализован.
Метод предназначен для прерывания длительной транзакции с идентификатором transId.
Дополнительно метод дает возможность сохранить в базе данных объекты, созданные в рамках транзакции.
В текущей версии не реализован.
transId: Идентификатор длительной транзакции. Тип Teigha.DatabaseServices.ObjectId.
keepObjs: Флаг сохранения созданных объектов. Тип bool. Если равен true, созданные в рамках транзакции объекты рабочего набора сохраняются в целевом блоке. В случае false они удаляются.

HostMgd.ApplicationServices.LongTransactionManager.AddClassFilter(Teigha.Runtime.RXClass)
Метод добавляет указанный класс в фильтр классов, которым разрешается участие в длительной транзакции.
В текущей версии не реализован.
Метод AddClassFilter() добавляет класс, ассоциированный с указанным объектом filter, в фильтр классов, которым разрешается участие в длительной транзакции.
В текущей версии не реализован.
Notes
Аргумент filter не может быть указателем на объект RxClass, представляющий классы DbObject или Entity.
filter: Входной указатель на объект RXClass добавляемого класса. Тип Teigha.Runtime.RXClass.

HostMgd.ApplicationServices.LongTransactionManager.CheckIn(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.IdMapping,System.Boolean)
Метод завершает длительную транзакцию (Check-In), возвращая изменённые объекты обратно в основную базу данных.
В текущей версии не реализован.
Метод выполняет завершение длительной транзакции (Check-In), возвращая изменённые объекты обратно в основную базу данных.
Аргумент keepObjs управляет сохранением объектов рабочего набора в целевом блоке. Такие объекты можно сохранить, либо удалить, если на них больше не ссылаются другие объекты в базе данных транзакции.
В случае невозможности возврата каких-либо объектов в основную базу данных транзакция отменяется, а идентификаторы таких объектов сохраняются в карте errorMap.
В текущей версии не реализован.
transId: Входной идентификатор объекта длительной транзакции, которой предстоит операция CheckIn. Тип Teigha.DatabaseServices.ObjectId.
errorMap: Пустой объект IdMapping, в котором на выходе сохраняются идентификаторы объектов с обнаруженными ошибками в процессе операции CheckIn.  Тип Teigha.DatabaseServices.IdMapping.
keepObjs: Входной флаг сохранения созданных объектов. Тип bool. Если равен true, созданные в рамках транзакции объекты рабочего набора сохраняются в целевом блоке. В случае false они удаляются.

HostMgd.ApplicationServices.LongTransactionManager.CheckOut(Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.IdMapping,Teigha.DatabaseServices.ObjectId)
Метод создаёт новую длительную транзакцию и выгружает (CheckOut) в рабочий набор объекты, перечисленные в предоставленном списке.
В текущей версии не реализован.
Метод создаёт новую длительную транзакцию, выгружает (CheckOut) в рабочий набор объекты, перечисленные в предоставленном списке, и возвращает идентификатор объекта созданной длительной транзакции.
В текущей версии не реализован.
checkoutSet: Коллекция идентификаторов объектов, которые необходимо включить в транзакцию. Тип Teigha.DatabaseServices.ObjectIdCollection.
toBlock: Идентификатор блока, в который будут помещены выгруженные объекты.
errorMap: Карта с идентификаторами объектов, для которых при выгрузке (CheckOut) были выявлены ошибки. Тип Teigha.DatabaseServices.IdMapping.
blkRef: Идентификатор ссылки на блок (BlockReference), связанной с транзакцией. Тип Teigha.DatabaseServices.ObjectId.
Returns: Возвращает идентификатор объекта, представляющего созданную длительную транзакцию.
Тип Teigha.DatabaseServices.ObjectId.

HostMgd.ApplicationServices.LongTransactionManager.CurrentLongTransactionFor(HostMgd.ApplicationServices.Document)
Метод предоставляет идентификатор объекта длительной транзакции, если таковая существует в указанным объекте Document.
В текущей версии не реализован.
Метод предоставляет идентификатор объекта длительной транзакции, если таковая существует в указанным объекте Document.
Если в документе нет активной длительной транзакции, возвращает NULL.
В текущей версии не реализован.
doc: Запрашиваемый документ. Тип Document.
Returns: Возвращает идентификатор объекта длительной транзакции,связанной с документом doc.
Тип Teigha.DatabaseServices.ObjectId.
Если в документе нет активной длительной транзакции, возвращает NULL.

HostMgd.ApplicationServices.LongTransactionManager.IsFiltered(Teigha.Runtime.RXClass)
Метод позволяет проверить,находится ли в фильтре указанный класс.
В текущей версии не реализован.
Метод позволяет проверить,находится ли в фильтре класс, переданный аргументом rXClass.
В текущей версии не реализован.
rXClass: Входной указатель на объект RXClass проверяемого класса. Тип Teigha.Runtime.RXClass.
Returns: Возвращает true, если проверяемый класс находится в фильтре.
В противном случае возвращает false.