Teigha.Colors.EntityColorCollection.DefaultSize
Поле DefaultSize представляет ёмкость по умолчанию  новой коллекции EntityColorCollection, создаваемой конструктором по умолчанию EntityColorCollection().
Поле DefaultSize представляет ёмкость по умолчанию  новой коллекции EntityColorCollection, создаваемой конструктором по умолчанию EntityColorCollection().
Returns: Возвращает ёмкость по умолчанию для новой коллекции EntityColorCollection.
Тип int.