Teigha.GraphicsSystem.ImpDevice.Update
Метод уведомляет все принадлежащие устройству виды о необходимости обновиться, что принудительно актуализирует текущее изображение.
Метод уведомляет все принадлежащие устройству виды о необходимости обновиться, что принудительно актуализирует текущее изображение.