Teigha.Geometry.Entity2d
Класс Entity2d служит базовым классом для всех двумерных геометрических объектов.
Класс Entity2d служит базовым классом для всех двумерных геометрических объектов.

Teigha.Geometry.Entity2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Entity2d.

Teigha.Geometry.Entity2d.IsEqualTo(Teigha.Geometry.Entity2d)
Метод позволяет проверить равен ли данный объект указанному объекту.
Используется точность по умолчанию.
Метод позволяет проверить равен ли данный объект указанному объекту.
Вызывается метод Entity2d.IsEqualTo(Entity2d entity, Tolerance tolerance) с использованием точности по умолчанию, которая равна  Tolerance.Global.
entity: Входной объект, с которым выполняется сравнение. Тип Entity2d.
Returns: Возвращает true в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает false.

Teigha.Geometry.Entity2d.IsEqualTo(Teigha.Geometry.Entity2d,Teigha.Geometry.Tolerance)
Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
entity: Входной объект, с которым выполняется сравнение. Тип Entity2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает false.

Teigha.Geometry.Entity2d.IsOn(Teigha.Geometry.Point2d)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется геометрическая точность по умолчанию.
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Вызывается метод Entity2d.IsOn(Point2d point, Tolerance tolerance) с использованием геометрической точности по умолчанию, равная Tolerance.Global.
point: Проверяемая точка. Тип Point2d.
Returns: Возвращает true, если в рамках используемой точности точка point лежит на данном объекте.
В противном случае возвращает false.

Teigha.Geometry.Entity2d.IsOn(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется заданная геометрическая точность.
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется заданная геометрическая точность.
point: Проверяемая точка. Тип Point2d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в рамках используемой точности точка point лежит на данном объекте.
В противном случае возвращает false.

Teigha.Geometry.Entity2d.Mirror(Teigha.Geometry.Line2d)
Метод выполняет зеркальное отображение данного объекта относительно указанной 2D-линии.
Метод выполняет зеркальное отображение данного объекта относительно указанной 2D-линии.
line: Ось зеркального отображения. Тип Line2d.

Teigha.Geometry.Entity2d.RotateBy(System.Double,Teigha.Geometry.Point2d)
Метод предназначен для вращения данного объекта вокруг указанной точки на заданный угол.
Метод предназначен для вращения данного объекта вокруг указанной точки на заданный угол.
angle: Угол поворота.  Тип double.
point: Центр вращения. Тип Point2d.

Teigha.Geometry.Entity2d.ScaleBy(System.Double,Teigha.Geometry.Point2d)
Метод позволяет изменить масштаб данного объекта на заданную величину относительно указанной точки.
Метод позволяет изменить масштаб данного объекта на заданную величину относительно указанной точки.
scaleFactor: Коэффициент масштабирования объекта. Тип double.
point: Точка, относительно которой выполняется масштабирование объекта. Тип Point2d.

Teigha.Geometry.Entity2d.TransformBy(Teigha.Geometry.Matrix2d)
Метод применяет к данному объекту указанное двумерное геометрическое преобразование.
Метод применяет к данному объекту указанное двумерное геометрическое преобразование.
transform: Матрица двумерного геометрического преобразования. Тип Matrix2d.

Teigha.Geometry.Entity2d.TranslateBy(Teigha.Geometry.Vector2d)
Метод выполняет трансляцию данного объекта на заданный двумерный вектор.
Метод выполняет трансляцию (параллельный перенос) данного объекта на заданный двумерный вектор.
translateVector: Вектор, определяющий операцию 2D-трансляции. Тип Vector2d.