Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator
Этот класс реализует перечислитель в коллекции свойств динамического блока DynamicBlockReferencePropertyCollection.
Этот класс реализует перечислитель в коллекции свойств динамического блока DynamicBlockReferencePropertyCollection.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Current
Свойство Current возвращает объект коллекции свойств динамического блока, на который указывает указатель.
Свойство Current возвращает объект коллекции свойств динамического блока, на который указывает указатель.
Returns: Возвращает текущий объект коллекции. Тип Object.