HostMgd.Windows.PaletteSet
Набор панелей

HostMgd.Windows.PaletteSet.Activate(System.Int32)
Активация (переключение) на панель по её номеру в коллекции

HostMgd.Windows.PaletteSet.Add(System.String,System.Windows.Forms.Control)
Добавление новой вкладки с использованием элемента управления Windows Forms
Добавление новой вкладки с использованием элемента управления Windows Forms
Returns: При неудаче возвращает nullptr.

HostMgd.Windows.PaletteSet.AddVisual(System.String,System.Windows.Media.Visual)
Добавление новой вкладки с использованием визуального элемента WPF
Добавление новой вкладки с использованием визуального элемента WPF
Returns: При неудаче возвращает nullptr.

HostMgd.Windows.PaletteSet.CopyTo(Array,System.Int32)
Получение массива указателей на панели

HostMgd.Windows.PaletteSet.Remove(System.Int32)
Удаление панели из набора по её индексу