Teigha.GraphicsInterface.DrawableType.WebLight
Значение: 10. Сеточный источник света.  Такие источники испускают свет, интенсивность которого зависит от направления распространения. Анизотропное распределение интенсивности обычно описывается в файлах световой сетки (web file), который поставляется изготовителями реальных осветительных приборов.