HostMgd.PlottingServices.AppPlotStatus
Данное перечисление определяет состояния задания на печать, условия или результаты выполнения задания на печать.
Перечисление AppPlotStatus определяет состояния задания на печать, условия или результаты выполнения задания на печать.