Teigha.Geometry.EllipticalCone.GetHalfAngles
Метод предоставляет косинус и синус половинного угла данного эллиптического конуса.
Метод предоставляет косинус и синус половинного угла данного эллиптического конуса в виде двухэлементного массива.
Returns: Возвращает двухэлементный массив. Первый элемент массива соответствует косинусу половинного угла, а второй элемент - синусу половинного угла.
Тип double[].