Teigha.DatabaseServices.LayerTable
Класс предназначен для хранения определений слоёв в базе данных чертежа.
Класс предназначен для хранения определений слоёв в базе данных чертежа,
то есть является коллекцией/таблицей, в которой каждая запись – это определение слоя.
Определение слоя – это набор данных, определяющий его характеристики: название,
цвет, прозрачность и пр. Для определения слоя используется класс LayerTableRecord.
Соответственно, все записи таблицы слоёв имеют тип данных LayerTableRecord.
Итератор таблицы устроен так, что при переборе коллекции перебираются ObjectId
каждого элемента. По ObjectId можно открыть каждую запись и получить подробные
данные, либо изменить их.
В интерфейсе nanoCAD каждое определение слоя (запись в таблице слоёв) является
слоём в менеджере слоёв. Сам менеджер слоёв отражает всё содержимое и возможности
таблицы слоёв. Слои создаются для упорядочивания работы с чертежом. Каждый объект
чертежа расположен на каком-либо слое. По умолчанию в новом чертеже всегда есть
слой «0». В таблицу слоёв можно добавлять нужное количество слоёв, изменять свойства
этих слоёв и удалять неиспользуемые.
На рисунке приведено диалоговое окно менеджера слоёв, которое можно вызвать
либо через меню nanoCAD (Формат -> Слои), либо командой LAYERS (ДИАЛСЛОЙ).
В окне можно увидеть все слои, которые есть в документе и их основные свойства:
статус, имя, видимость, заморозка, защита от изменений, цвет, тип линий, вес линий,
прозрачность, стиль печати, печать, заморозка в новых видовых экранах.
К каждому слою можно делать пояснения, которые будут видны в графе «Пояснения»
окна менеджера слоёв. Вся эта информация хранится в таблице слоёв и её записях
по каждому отдельному слою.
Example
В качестве примера работы с таблицей слоёв приведена команда LayerTableReading,
которая открывает таблицу слоёв и перебирает её содержимое, выводя в командную строку
название каждого слоя и его тип.
C#

Teigha.DatabaseServices.LayerTable.IncludingHidden
В свойстве хранится коллекция слоёв, включающая в себя
скрытые слои.
В свойстве хранится коллекция всех слоёв документа, включая
скрытые, то есть те, у которых свойство
= true.
Такие слои не отображаются в диалоговом окне «Слои», но
информация о них хранятся в документе.
Returns: Возвращает тип данных LayerTable.

Teigha.DatabaseServices.LayerTable.SkippingReconciled
\ \
В свойстве хранится коллекция несогласованных слоёв
документа.
\ \
С помощью свойства можно получить коллекцию несогласованных
слоёв документа. Несогласованные слои – слои, которые были
добавлены в документ после того, как коллекция слоёв была
обновлена. У несогласованных слоёв свойство
= false.
Returns: Возвращает пропущенные согласованные слои.
Возвращает тип данных LayerTable.