Teigha.DatabaseServices.Material
Класс Material представляет свойства материала, используемые при визуализации затененных объектов.
Класс Material представляет свойства материала, используемые при визуализации затененных объектов.
Объект Material включает целый ряд компонентов затенения, включая диффузный, зеркальный, рассеянный, непрозрачности, отражения, рельефности, преломления.
Каждый компонент определяет отдельный аспект затенения объекта сцены.

Teigha.DatabaseServices.Material.#ctor
Конструктор по умолчанию класса Material.
Конструктор по умолчанию класса Material.

Teigha.DatabaseServices.Material.Ambient
Свойство представляет теневой компонент рассеянного цвета данного материала.
Свойство представляет теневой компонент рассеянного цвета данного материала.
Returns: Возвращает компонент рассеянного цвета.
Тип MaterialColor.

Teigha.DatabaseServices.Material.Anonymous
Свойство позволяет проверить, является ли этот материал «анонимным».
Только для внутреннего использования.
Свойство позволяет проверить, является ли этот материал «анонимным».
Такой материал предназначен исключительно для программного использования через API и не должен быть доступен через какой-либо пользовательский интерфейс.
Returns: Возвращает true, если материал является «анонимным».
В противном случае возвращает false.

Teigha.DatabaseServices.Material.Bump
Свойство представляет компонент рельефности данного материала.
Свойство представляет компонент рельефности данного материала.
Returns: Возвращает карту рельефности (выдавливания).
Тип MaterialMap.

Teigha.DatabaseServices.Material.ChannelFlags
Свойство представляет флаги канала для данного материала и позволяет настраивать требуемые комбинации каналов.
Свойство представляет флаги канала для данного материала и позволяет настраивать требуемые комбинации каналов.
Returns: Возвращает комбинацию флагов из перечисления GraphicsInterface.ChannelFlags.

Teigha.DatabaseServices.Material.ColorBleedScale
Свойство, которое представляет коэффициент цветового заполнения для данного материала.
Свойство, которое представляет коэффициент цветового заполнения для данного материала (color bleed scale).
Returns: Возвращает коэффициент цветового заполнения. Тип double.

Teigha.DatabaseServices.Material.Description
Свойство представляет описание данного материала.
Свойство представляет описание данного материала.
Returns: Возвращает описание материала.  Тип String.

Teigha.DatabaseServices.Material.Diffuse
Свойство представляет основной диффузный компонент этого материала.
Свойство представляет основной диффузный компонент этого материала.
Returns: Возвращает диффузный компонент материала.
Тип MaterialDiffuseComponent.

Teigha.DatabaseServices.Material.FinalGather
Свойство представляет режим финальной сборки для данного материала.
Свойство представляет режим финальной сборки для данного материала.
Используется при расчете общего освещения.
Returns: Возвращает текущий режим финальной сборки.
Перечисление GraphicsInterface.FinalGatherMode.

Teigha.DatabaseServices.Material.GlobalIllumination
Свойство представляет текущий режим общего освещения для этого материала.
Свойство представляет текущий режим общего освещения для этого материала.
Returns: Возвращает режим общего освещения.
Перечисление GraphicsInterface.GlobalIlluminationMode.

Teigha.DatabaseServices.Material.IlluminationModel
Свойство представляет модель освещения, которая используется для этого материала в расширенном процессе рендеринга.
Свойство представляет модель освещения, которая используется для этого материала в расширенном процессе рендеринга.
Returns: Возвращает модель освещения материала.
Перечисление GraphicsInterface.IlluminationModel.

Teigha.DatabaseServices.Material.IndirectBumpScale
Свойство представляет коэффициент непрямой рельефности данного материала.
Свойство представляет коэффициент непрямой рельефности данного материала (indirect bump scale).
Используется для масштабирования карты рельефности материала в условиях непрямого освещения.
Returns: Возвращает коэффициент непрямой рельефности материала. Тип double.

Teigha.DatabaseServices.Material.Luminance
Свойство представляет значение яркости материала.
Свойство представляет значение яркости материала.
Мерой воспринимаемой яркости или затемнённости поверхности материала служит интенсивность света, отражаемого поверхностью данного материала.
Returns: Возвращает яркость материала.  Тип double.

Teigha.DatabaseServices.Material.LuminanceMode
Свойство представляет режим яркости данного материала.
Свойство представляет режим яркости данного материала.
Он определяет, видим мы этот материал в отраженном свете, или же он обладает свойством самосвечения.
Returns: Возвращает режим яркости материала.
Перечисление GraphicsInterface.LuminanceMode.

Teigha.DatabaseServices.Material.Mode
Свойство представляет режим представления данного материала.
Свойство представляет режим представления данного материала (Advanced / Realistic).
Returns: Возвращает режим представления материала.
Перечисление GraphicsInterface.Mode.

Teigha.DatabaseServices.Material.Name
Свойство представляет наименование данного материала.
Свойство представляет наименование данного материала.
Returns: Возвращает наименование материала.  Тип String.

Teigha.DatabaseServices.Material.NormalMap
Свойство представляет компонент NormalMap этого материала.
Свойство представляет компонент NormalMap этого материала.
Returns: Возвращает компонент NormalMap материала.
Тип MaterialNormalMapComponent.

Teigha.DatabaseServices.Material.Opacity
Свойство представляет компонент непрозрачности этого материала.
Свойство представляет компонент непрозрачности этого материала.
Returns: Возвращает компонент непрозрачности материала.
Тип MaterialOpacityComponent.

Teigha.DatabaseServices.Material.ReflectanceScale
Свойство представляет коэффициент отражения данного материала.
Свойство представляет коэффициент отражения данного материала.
Returns: Возвращает коэффициент отражения материала. Тип double.

Teigha.DatabaseServices.Material.Reflection
Свойство представляет компонент отражения данного материала.
Свойство представляет компонент отражения данного материала.
Returns: Возвращает компонент отражения материала. Тип MaterialMap.

Teigha.DatabaseServices.Material.Reflectivity
Свойство представляет степень отражающей способности этого материала.
Свойство представляет степень отражающей способности этого материала.
Более высокие значения характерны для материалов с более высокой отражающей способностью.
Returns: Возвращает отражающую способность материала. Тип double.

Teigha.DatabaseServices.Material.Refraction
Свойство представляет компонент преломления данного материала.
Свойство представляет компонент преломления данного материала.
Returns: Возвращает компонент преломления материала.
Тип MaterialRefractionComponent.

Teigha.DatabaseServices.Material.SelfIllumination
Свойство представляет значение самосвечения данного материала.
Свойство представляет значение самосвечения данного материала.
Returns: Возвращает значение самосвечения материала. Тип double.

Teigha.DatabaseServices.Material.Specular
Свойство представляет компонент зеркального отражения этого материала.
Свойство представляет компонент зеркального отражения этого материала.
Returns: Возвращает компонент зеркального отражения материала.
Тип MaterialSpecularComponent.

Teigha.DatabaseServices.Material.Translucence
Свойство представляет полупрозрачность этого материала.
Свойство представляет полупрозрачность этого материала, характеризующую рассеивание света при прохождении через объект.
Returns: Возвращает полупрозрачность материала. Тип double.

Teigha.DatabaseServices.Material.TransmittanceScale
Свойство представляет коэффициент пропускания данного материала.
Свойство представляет коэффициент пропускания данного материала.
Он определяет долю энергии, которая проходит сквозь материал.
Returns: Возвращает коэффициент пропускания материала. Тип double.

Teigha.DatabaseServices.Material.TwoSided
Свойство позволяет указать или проверить, что материал является двусторонним.
Свойство позволяет указать или проверить, что материал является двусторонним.
Returns: Возвращает true, если материал является двусторонним.
В противном случае возвращает false.