Teigha.Geometry.EllipticalCylinder.IsClosed
Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом.
Метод позволяет проверить, является ли основание этого эллиптического цилиндра полным эллипсом.
Notes
Используется вызов метода EllipticalCylinder.IsClosed(Tolerance) с точностью, равной Tolerance.Global.
Returns: Возвращает true, если основание эллиптического цилиндра представляет собой полный эллипс.
В противном случае возвращает false.