Teigha.DatabaseServices.FileDependencyInfo.ToString
Метод формирует эквивалентное строковое представление данного объекта.
Метод формирует эквивалентное строковое представление данного объекта.
Notes
Возвращаемая строка содержит информацию о зависимостях файлов в следующем порядке (используется разделение запятыми):
* Полное имя файла;
* Собственное имя файла;
* Путь, по которому был найден файл;
* Идентификатор GUID файла;
* GUID версии файла;
* Имя приложения или функции, создавшей эту запись;
* Флаг, указывающий, была ли изменена база данных с момента последнего сохранения;
* Флаг, указывающий, влияет ли запись на вид экрана;
* Уникальный индекс в списке зависимостей файлов;
* Количество секунд с момента 01.01.1980;
* Текущий размер файла;
* Текущее количество ссылок на файл в базе данных.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.