Teigha.GraphicsInterface.ScaleBehavior.ScreenLocalOrigin
Значение: 4.
Преобразование масштаба выполняется в абсолютных пикселях, но, в отличие от опции Screen, используется 2D-привязка локальной 3D-системы координат.