Teigha.Geometry.PointOnCurve2d
Класс PointOnCurve2d представляет точку на параметрической 2D-кривой.
Класс PointOnCurve2d представляет точку на параметрической 2D-кривой.
Этот класс инкапсулирует всю геометрическую информацию о точке на 2D-кривой, включая соответствующее точке значение параметра, 2D-координаты точки и производные кривой в этой точке.

Teigha.Geometry.PointOnCurve2d.#ctor
Конструктор по умолчанию класса PointOnCurve2d.
Конструктор по умолчанию класса PointOnCurve2d.
Создает экземпляр класса с точкой, которая не лежит ни на одной кривой и имеет значение параметра 0.

Teigha.Geometry.PointOnCurve2d.#ctor(Teigha.Geometry.Curve2d)
Конструктор класса PointOnCurve2d.
Создает на указанной кривой точку с нулевым значением параметра.
Конструктор класса PointOnCurve2d.
Создает на указанной кривой точку с нулевым значением параметра.
curve: Входная кривая. Тип Curve2d.

Teigha.Geometry.PointOnCurve2d.#ctor(Teigha.Geometry.Curve2d,System.Double)
Конструктор класса PointOnCurve2d.
Создает на указанной кривой точку с заданным значением параметра.
Конструктор класса PointOnCurve2d.
Создает на указанной кривой точку с заданным значением параметра.
curve: Входная кривая. Тип Curve2d.
parameter: Значение параметра для создаваемой точки. Тип double.

Teigha.Geometry.PointOnCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип PointOnCurve2d.

Teigha.Geometry.PointOnCurve2d.GetDerivative(System.Int32)
Метод вычисляет производную первого или второго порядка в данной точке на кривой.
Метод вычисляет производную первого или второго порядка в данной точке на кривой.
order: Входной порядок производной. Тип int. Может принимать значения 1 или 2.
Returns: Возвращает вектор производной порядка order в данной точке на кривой.
Тип Vector2d.

Teigha.Geometry.PointOnCurve2d.GetDerivative(System.Int32,System.Double)
Метод переопределяет для данного объекта значение параметра и вычисляет в новой позиции производную кривой указанного порядка.
Метод переопределяет для данного объекта значение параметра и вычисляет в новой позиции производную кривой указанного порядка.
order: Входной порядок производной. Тип int. Может принимать значения 1 или 2.
parameter: Новое значение параметра в данной точке на кривой. Тип double.
Returns: Возвращает вектор производной порядка order в данной точке на кривой.
Тип Vector2d.

Teigha.Geometry.PointOnCurve2d.GetDerivative(System.Int32,Teigha.Geometry.Curve2d,System.Double)
Метод переопределяет для данного объекта кривую и значение параметра в точке и вычисляет в этой точке производную указанного порядка.
Метод переопределяет для данного объекта кривую и значение параметра в точке и вычисляет в этой точке производную указанного порядка.
order: Входной порядок производной. Тип int. Может принимать значения 1 или 2.
curve: Новая кривая. Тип Curve2d.
parameter: Новое значение параметра в данной точке на кривой. Тип double.
Returns: Возвращает вектор производной порядка order в данной точке на кривой.
Тип Vector2d.

Teigha.Geometry.PointOnCurve2d.GetPointAtParameter(System.Double)
Метод переопределяет значение параметра у данного объекта и возвращает точку на кривой, соответствующую этому параметру.
Метод переопределяет значение параметра у данного объекта и возвращает соответствующую этому значению точку на кривой.
parameter: Новое значение параметра. Тип double.
Returns: Возвращает точку, соответствующую значению параметра parameter. Тип Point2d.

Teigha.Geometry.PointOnCurve2d.GetPointOnCurve(Teigha.Geometry.Curve2d,System.Double)
Метод переопределяет для данного объекта кривую и значение параметра и возвращает соответствующую этому значению точку на указанной кривой.
Метод переопределяет для данного объекта кривую и значение параметра и возвращает соответствующую этому значению точку на указанной кривой.
curve: Новая кривая. Тип Curve2d.
parameter: Новое значение параметра. Тип double.
Returns: Возвращает на кривой curve точку, соответствующую значению параметра parameter. Тип Point2d.

Teigha.Geometry.PointOnCurve2d.Curve
Свойство Curve обеспечивает доступ к кривой, точку на которой представляет данный объект.
Свойство Curve обеспечивает доступ к кривой, точку на которой представляет данный объект.
Returns: Возвращает двумерную кривую. Тип Curve2d.

Teigha.Geometry.PointOnCurve2d.Parameter
Свойство Parameter обеспечивает доступ к значению параметра точки на кривой, которую представляет данный объект.
Свойство Parameter обеспечивает доступ к значению параметра точки на кривой, которую представляет данный объект.
Returns: Возвращает значение параметра точки на кривой.
Тип double.

Teigha.Geometry.PointOnCurve2d.Point
Свойство Point возвращает точку, которую представляет данный объект.
Свойство Point возвращает точку, которую представляет данный объект.
Returns: Возвращает точку на кривой. Тип Point2d.