HostMgd.ApplicationServices.InplaceTextEditor.HightlightColorDialog
Метод вызывает диалог настройки цвета подсветки.
В текущей версии не реализован.
Метод вызывает диалог настройки цвета подсветки объектов в редакторе.
В текущей версии метод не реализован.