Teigha.DatabaseServices.LayerViewportProperties.RemoveOverrides
Метод предназначен для удаления всех переопределений, связанных со слоем и видовым экраном.
Метод предназначен для удаления всех переопределений, связанных со слоем и видовым экраном.