Teigha.DatabaseServices.SweepOptionsBuilder.ToSweepOptions
Метод позволяет извлечь параметры операции вытягивания по траектории, связанные с данным объектом.
Метод позволяет извлечь параметры операции вытягивания по траектории, связанные с данным объектом.
Returns: Возвращает объект настроек операции. Тип SweepOptions.