HostMgd.Windows.ToolPalette.CustomToolBase.BeginEdit
Метод начинает редактирование свойств инструмента.
Вызывается фреймворком после вызова метода Load() перед отображением диалогового окна для редактирования свойств инструмента.
Не реализован.
Метод начинает редактирование свойств инструмента.
Вызывается фреймворком после вызова метода Load() перед отображением диалогового окна для редактирования свойств инструмента.
Этот метод вызывается только тогда, когда редактирование выполняется фреймворком, но не инструментом.
В текущей версии не реализован.