HostMgd.EditorInput.PointFilterEventHandler
Делегат предназначен для обработки событий, связанных с фильтрацией
и модификацией координат точки при перемещении мыши в редакторе nanoCAD.
Делегат используется как сигнатура метода-обработчика для события PointFilter,
которое вызывается при каждом перемещении мыши в графической области чертежа.
Он позволяет динамически изменять или фильтровать текущую точку ввода,
что может применяться для реализации пользовательских привязок,
ограничений по осям, интерактивной коррекции положения объектов
и других задач, где требуется контроль над движением указателя.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект события, содержащий