Teigha.DatabaseServices.DxfFiler.ReadVector3d
Метод возвращает 3D-вектор из текущего элемента этого объекта Filer.
Метод возвращает 3D-вектор из текущего элемента этого объекта Filer.
Returns: Возвращает 3D-вектор. Тип Vector3d.