HostMgd.EditorInput.PromptEntityResultEventArgs
Класс предоставляет данные для события PromptedForEntity,
включая информацию о выбранном геометрическом объекте и статусе операции.
Класс наследуется от EventArgs и используется в .NET API nanoCAD
для передачи результатов выбора геометрического объекта пользователем.
Он применяется совместно с событием PromptedForEntity
и делегатом PromptEntityResultEventHandler.
Объект этого класса содержит:
* Идентификатор (ObjectId) выбранного объекта.
* Точку выбора (PickedPoint) в мировых координатах (WCS).
* Статус выполнения операции (PromptStatus.OK, PromptStatus.Cancel и др.).
Этот класс позволяет разработчикам плагинов обрабатывать результаты выборки объектов,
проверять допустимость выбора, а также выполнять действия на основе точки и объекта,
указанных пользователем.
Example
C#

HostMgd.EditorInput.PromptEntityResultEventArgs.Result
Свойство предоставляет доступ к результату операции выбора геометрического объекта,
включая статус и данные о выбранном элементе.
Свойство возвращает объект типа PromptEntityResult, который содержит информацию
о завершении операции выбора объекта — например, после вызова метода GetEntity()
или при обработке события PromptedForEntity.
Оно позволяет получить:
* ObjectId — идентификатор выбранного объекта.
* PickedPoint — точку указания объекта в мировой системе координат (WCS).
* Статус операции (OK, Cancel, Error и др.).
Это свойство используется для анализа результата выбора объекта,
проверки его допустимости и выполнения дальнейших действий с ним.
Доступно только для чтения и обновляется автоматически при завершении интерактивной операции.
Returns: Возвращает экземпляр класса PromptEntityResult, содержащий:
* Status — статус завершения операции выбора (PromptStatus.OK, если выбор успешен).
* Value — значение типа PromptEntityResult.ValueType, содержащее ObjectId и Point3d PickedPoint.
* StringResult — строковое значение, если операция была прервана пользователем через клавиатуру.
Если операция не была завершена корректно, результат может содержать null или статус, отличный от OK.
Example
C#