Teigha.DatabaseServices.ScaleEstimationMethod
Данное перечисление определяет поддерживаемые алгоритмы компенсации искажений масштабного коэффициента сетки, которые вносит проецирование, используемое в конкретных типах систем координат сеток.
Данное перечисление определяет поддерживаемые алгоритмы компенсации искажений масштабного коэффициента сетки, которые вносит проецирование, используемое в конкретных типах систем координат сеток.