Teigha.Geometry.Vector3dCollectionEnumerator
Класс Vector3dCollectionEnumerator представляет перечислитель для коллекции Vector3dCollection.
Класс Vector3dCollectionEnumerator представляет перечислитель для коллекции трехмерных векторов Vector3dCollection.

Teigha.Geometry.Vector3dCollectionEnumerator.Current
Свойство Current представляет текущий элемент перечислителя.
Свойство Current представляет текущий элемент перечислителя.
Returns: Возвращает текущий элемент перечислителя.
Тип Object.