Teigha.GraphicsInterface.Context.DisableFastMoveDrag
Метод уведомляет графическую систему, что отрисовка объектов при перетаскивании требует обращения к самим объектам вместо использования кэшированных графических примитивов.
Для преобразований в плоскости графическая система поддерживает кэш графических примитивов и применяет геометрические преобразования к этим примитивам вместо повторных запросов самих объектов. Для многих объектов этот подход оказывается очень эффективным.
Однако если объект при перетаскивании должен как-то изменяться, то изображение с использованием кэшированных примитивов уже не будет отражать требуемое состояние объекта.  Вызов данного метода заставляет графическую систему при каждом преобразовании повторно запрашивать графику для всех объектов в текущем перетаскивании.
Эту опцию следует использовать только в случае реальной необходимости.
Реализация по умолчанию представляет собой просто заглушку.