Teigha.Geometry.Line2dCollection
Класс Line2dCollection представляет коллекцию двумерных линий.
Класс Line2dCollection представляет коллекцию двумерных линий.

Teigha.Geometry.Line2dCollection.#ctor
Конструктор по умолчанию класса Line2dCollection.
Создает пустую коллекцию 2D-линий.
Конструктор по умолчанию класса Line2dCollection.
Создает пустую коллекцию 2D-линий.

Teigha.Geometry.Line2dCollection.Add(Teigha.Geometry.Line2d)
Метод добавляет в коллекцию указанную линию.
Метод добавляет в коллекцию указанную линию.
value: Линия, которую требуется добавить в коллекцию.
Returns: Возвращает индекс только что добавленного элемента коллекции. Тип int.
Индексация элементов коллекции начинается с нуля.

Teigha.Geometry.Line2dCollection.Contains(Teigha.Geometry.Line2d)
Метод позволяет проверить, содержится ли указанная линия в данной коллекции.
Метод позволяет проверить, содержится ли указанная линия в данной коллекции.
value: Проверяемая линия. Тип Line2d.
Returns: Возвращает true, если проверяемая линия присутствует в данной коллекции.
В противном случае возвращает false.

Teigha.Geometry.Line2dCollection.CopyTo(array,System.Int32)
Метод копирует элементы данной коллекции в указанный массив по указанному индексу.
Метод копирует элементы данной коллекции в указанный массив по указанному индексу.
array: Целевой массив, в который требуется скопировать элементы данной коллекции. Тип Line2d[].
index: Индекс в массиве, начиная с которого в массиве сохраняются элементы коллекции. Тип int.

Teigha.Geometry.Line2dCollection.IndexOf(Teigha.Geometry.Line2d)
Метод вычисляет индекс элемента коллекции, который соответствует указанному объекту Line2d.
Метод вычисляет индекс элемента коллекции, который соответствует указанному объекту Line2d.
Notes
Индексация элементов в данной коллекции начинается с нуля.
value: Проверяемая линия. Тип Line2d.
Returns: Возвращает индекс элемента коллекции, который соответствует проверяемой линии. Тип int.
Если элемент не найден, возвращает -1.

Teigha.Geometry.Line2dCollection.Insert(System.Int32,Teigha.Geometry.Line2d)
Метод вставляет в коллекцию новый элемент в позицию с указанным индексом.
Метод вставляет в коллекцию новый элемент в позицию с указанным индексом.
index: Позиция нового элемента. Тип int.
value: Вставляемый в коллекцию элемент. Тип Line2d.

Teigha.Geometry.Line2dCollection.Remove(Teigha.Geometry.Line2d)
Метод удаляет из коллекции указанную 2D-линию.
Метод удаляет из коллекции указанную 2D-линию.
value: Удаляемая линия. Тип Line2d.

Teigha.Geometry.Line2dCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент с указанным индексом.
Метод удаляет из коллекции элемент с указанным индексом.
index: Индекс удаляемого элемента. Тип int.

Teigha.Geometry.Line2dCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.
Тип int.

Teigha.Geometry.Line2dCollection.Item
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
index: Входной индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции с указанным индексом. Тип Line2d.