Teigha.DatabaseServices.LoftOptionsNormalOption.AllNormal
Значение: 4. Если установлено это значение, направление поверхности в каждом поперечном сечении будет совпадать с нормалью плоскости этого поперечного сечения.