Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut
Класс SweepOptionsCheckSweepCurveOut представляет опции проверки вытянутых кривых.
Класс SweepOptionsCheckSweepCurveOut представляет опции проверки вытянутых кривых.

Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.#ctor
Конструктор по умолчанию класса SweepOptionsCheckSweepCurveOut.
Конструктор по умолчанию класса SweepOptionsCheckSweepCurveOut.

Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.ApproximateArcLength
Свойство ApproximateArcLength представляет аппроксимированную длину дуги.
Свойство ApproximateArcLength представляет аппроксимированную длину дуги.
Returns: Возвращает аппроксимированную длину дуги.
Тип double.

Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Closed
Свойство Closed позволяет проверить, является ли вытянутый объект замкнутым.
Свойство Closed позволяет проверить, является ли вытянутый объект замкнутым.
Returns: Возвращает true, если вытянутый по траектории объект является замкнутым.
В противном случае возвращает false.

Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Planarity
Свойство Planarity представляет оценку планарности объекта.
Свойство Planarity представляет оценку планарности (плоскостности) объекта.
Returns: Возвращает оценку планарности объекта как значение из перечисления DatabaseServices.Planarity.

Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Point
Свойство Point представляет точку на вытягиваемом объекте, если он плоский, или точку на линии, если объект линейный.
Свойство Point представляет точку на вытягиваемом объекте, если он плоский (Planarity.Planar),
или точку на линии, если объект линейный (Planarity.Linear).
Returns: Возвращает точку на вытягиваемом объекте.
Тип Point3d.

Teigha.DatabaseServices.SweepOptionsCheckSweepCurveOut.Vector
Свойство Vector представляет вектор нормали к вытягиваемому объекту, если он плоский, или направление линии, если объект линейный.
Свойство Vector представляет вектор нормали к вытягиваемому объекту, если он плоский (Planarity.Planar),
или направление прямой, если объект линейный (Planarity.Linear).
Returns: Возвращает характерный вектор объекта (нормаль плоскости, либо направляющий вектор прямой).
Тип Vector3d.