Teigha.DatabaseServices.XrefSubCommandEventArgs
Класс XrefSubCommandEventArgs представляет данные для событий базы данных, связанных с подкомандами внешних ссылок (XrefSubCommandStart, XrefSubCommandEnd и XrefSubCommandAborted).
Класс XrefSubCommandEventArgs представляет данные для событий базы данных, связанных с подкомандами внешних ссылок (XrefSubCommandStart, XrefSubCommandEnd и XrefSubCommandAborted).

Teigha.DatabaseServices.XrefSubCommandEventArgs.btrIds
Свойство btrIds представляет коллекцию идентификаторов записей таблицы блоков.
Свойство btrIds представляет коллекцию идентификаторов записей таблицы блоков.
Returns: Возвращает коллекцию идентификаторов объектов.
Тип ObjectIdCollection.

Teigha.DatabaseServices.XrefSubCommandEventArgs.btrNames
Свойство btrNames представляет массив имён записей таблицы блоков.
Свойство btrNames представляет массив имён записей таблицы блоков.
Returns: Возвращает массив имён.
Тип String[].

Teigha.DatabaseServices.XrefSubCommandEventArgs.paths
Свойство paths представляет пути записей таблицы блоков.
Свойство paths представляет пути записей таблицы блоков.
Returns: Возвращает массив путей.
Тип String[].

Teigha.DatabaseServices.XrefSubCommandEventArgs.xrefOp
Свойство xrefOp представляет связанную с событием подкоманду внешних ссылок.
Свойство xrefOp представляет связанную с событием подкоманду внешних ссылок.
Returns: Возвращает подкоманду внешних ссылок. Значение из перечисления XrefOperation.