Teigha.Geometry.Interval
Класс Interval представляет конечный, бесконечный или полубесконечный интервал на действительной оси, границы которого определены с некоторой заданной точностью.
Класс Interval представляет конечный, бесконечный или полубесконечный интервал на действительной оси, границы которого определены с некоторой заданной точностью.

Teigha.Geometry.Interval.#ctor(System.Double)
Конструктор класса Interval.
Создает бесконечный (в обоих направлениях) интервал и определяет точность для задания границ.
Конструктор класса Interval.
Создает бесконечный (в обоих направлениях) интервал и определяет точность для задания границ.
tolerance: Входная точность определения границ интервала.

Teigha.Geometry.Interval.#ctor(System.Double,System.Double,System.Double)
Конструктор класса Interval.
Создает конечный интервал с указанными нижней и верхней границами, а также с заданной точностью определения границ.
Конструктор класса Interval.
Создает конечный интервал с заданными нижней и верхней границами, а также с указанной точностью определения границ.
lower: Нижняя  граница интервала. Тип double.
upper: Верхняя граница интервала. Тип double.
tolerance: Заданная точность определения границ. Тип double.

Teigha.Geometry.Interval.#ctor(System.Int32,System.Double,System.Double)
Конструктор класса Interval.
Создает полубесконечный интервал с указанной верхней границей и заданной точностью определения границ.
Возможно также создать интервал, ограниченный снизу.
Конструктор класса Interval.
Создает интервал с верхней границей, равной bound.
Если значение аргумента boundedBelow равно 1, то он задает нижнюю границу, равной bound, в противном случае интервал остается неограниченным снизу. Конструктор принимает также точность определения границ интервала tolerance.
boundedBelow: Флаг, который определяет, что интервал является ограниченным снизу. Тип int.
bound: Значение верхней и, возможно, нижней границы. Тип double.
tolerance: Заданная точность определения границ. Тип double.

Teigha.Geometry.Interval.#ctor(Teigha.Geometry.Interval)
Конструктор класса Interval. Создает экземпляр класса, являющийся копией указанного интервала.
Конструктор класса Interval. Создает экземпляр класса, являющийся копией указанного интервала.
other: Входной интервал, копию которого требуется создать. Тип Interval.

Teigha.Geometry.Interval.Contains(System.Double)
Метод позволяет проверить, принадлежит ли указанное значение данному интервалу с учетом используемой точности.
Метод позволяет проверить, принадлежит ли указанное значение value данному интервалу с учетом настроенной в интервале точности определения границ.
value: Проверяемое значение. Тип double.
Returns: Возвращает true, если значение value принадлежит данному интервалу.
В противном случае возвращает false.

Teigha.Geometry.Interval.Contains(Teigha.Geometry.Interval)
Метод позволяет проверить, принадлежит ли указанный интервал данному интервалу с учетом используемой точности задания границ.
Метод позволяет проверить, принадлежит ли интервал otherInterval данному интервалу с учетом используемой точности задания границ.
otherInterval: Проверяемый интервал. Тип Interval.
Returns: Возвращает true, если интервал otherInterval включается в данный интервал.
В противном случае возвращает false.

Teigha.Geometry.Interval.GetMerge(Teigha.Geometry.Interval)
Метод реализует слияние данного интервала с указанным интервалом.
Результатом является наименьший интервал, который включает в себя оба интервала.
Метод реализует слияние данного интервала с интервалом otherInterval.
Результатом является наименьший интервал, который включает в себя оба интервала.
otherInterval: Входной интервал. Тип Interval.
Returns: Возвращает наименьший интервал, который включает в себя как данный интервал, так и интервал otherInterval.
Тип Interval.

Teigha.Geometry.Interval.IntersectWith(Teigha.Geometry.Interval)
Метод позволяет получить интервал, являющийся пересечением данного и указанного интервалов с учетом настроенной точности определения границ.
Метод позволяет получить интервал, являющийся пересечением данного объекта с интервалом otherInterval.
Результат вычисляется с использованием настроенной в данном объекте точности задания границ.
otherInterval: Входной интервал. Тип Interval.
Returns: Возвращает интервал, являющийся пересечением данного интервала и интервала otherInterval.
Тип Interval. В случае непересекающихся интервалов возвращает NULL.

Teigha.Geometry.Interval.IsContinuousAtUpper(Teigha.Geometry.Interval)
Метод позволяет проверить, совпадает ли верхняя граница данного интервала с нижней границей указанного интервала в пределах заданной точности определения границ.
Метод позволяет проверить, совпадает ли верхняя граница данного интервала с нижней границей интервала otherInterval в пределах заданной точности определения границ.
Предполагается, что данный интервал ограничен сверху, а интервал otherInterval ограничен снизу.
otherInterval: Проверяемый интервал. Тип Interval.
Returns: Возвращает true, если данный интервал ограничен сверху, интервал otherInterval ограничен снизу, а верхняя граница данного интервала совпадает с нижней границей интервала otherInterval в пределах точности определения границ, настроенной в данном интервале.
В противном случае возвращает false.

Teigha.Geometry.Interval.IsDisjoint(Teigha.Geometry.Interval)
Метод позволяет убедиться, что в пределах заданной точности данный интервал не пересекается с указанным интервалом.
Метод позволяет убедиться, что в пределах заданной точности данный интервал не пересекается с интервалом otherInterval.
otherInterval: Проверяемый интервал. Тип Interval.
Returns: Возвращает true, если данный интервал не пересекается с интервалом otherInterval.
В противном случае возвращает false.

Teigha.Geometry.Interval.IsEqualAtLower(System.Double)
Метод проверяет, совпадает ли нижняя граница данного интервала с указанным значением в пределах заданной точности.
Метод проверяет, совпадает ли нижняя граница данного интервала с указанным значением в пределах заданной точности.
value: Проверяемое значение. Тип double.
Returns: Возвращает true, если данный интервал ограничен снизу, и его нижняя граница равна значению value в пределах заданной в данном объекте точности определения границ.  В противном случае возвращает false.

Teigha.Geometry.Interval.IsEqualAtLower(Teigha.Geometry.Interval)
Метод проверяет, совпадают ли нижние границы данного и указанного интервалов в пределах заданной точности.
Метод проверяет, совпадают ли нижние границы данного и указанного интервалов в пределах заданной в данном объекте точности определения границ.
otherInterval: Проверяемый интервал. Тип Interval.
Returns: Возвращает true, если нижние границы двух интервалов совпадают в пределах заданной в данном объекте точности, либо если оба интервала не ограничены снизу. В противном случае возвращает false.

Teigha.Geometry.Interval.IsEqualAtUpper(System.Double)
Метод проверяет, совпадает ли верхняя граница данного интервала с указанным значением в пределах заданной точности.
Метод проверяет, совпадают ли верхняя граница данного интервала с указанным значением в пределах заданной в данном объекте точности определения границ.
value: Проверяемое значение. Тип double.
Returns: Возвращает true, если данный интервал ограничен сверху, и его верхняя граница равна значению value в пределах заданной в данном объекте точности определения границ.  В противном случае возвращает false.

Teigha.Geometry.Interval.IsEqualAtUpper(Teigha.Geometry.Interval)
Метод проверяет, совпадают ли верхние границы данного и указанного интервалов в пределах заданной точности.
Метод проверяет, совпадают ли верхние границы данного и указанного интервалов в пределах заданной в данном объекте точности определения границ.
otherInterval: Проверяемый интервал. Тип Interval.
Returns: Возвращает true, если верхние границы двух интервалов совпадают в пределах заданной в данном объекте точности, либо если оба интервала не ограничены сверху. В противном случае возвращает false.

Teigha.Geometry.Interval.IsOverlapAtUpper(Teigha.Geometry.Interval,Teigha.Geometry.Interval)
Метод позволяет проверить, перекрывается ли данный интервал по верхней границе с указанным интервалом.
Метод позволяет проверить, перекрывается ли данный интервал по верхней границе с указанным интервалом.
Перекрытие имеет место только в том случае, если одновременно выполняются следующие условия:
* Данный интервал ограничен сверху;
* Интервал otherInterval ограничен снизу;
* Ни один из интервалов не является синглтоном (когда нижняя граница совпадает с верхней);
* Интервалы пересекаются;
* Пересечение интервалов не совпадает с данным интервалом, т.е. данный интервал не включен целиком в интервал otherInterval;
* Верхняя граница данного интервала принадлежит интервалу otherInterval;
* Нижняя граница интервала otherInterval принадлежит данному интервалу.
Если перекрытие интервалов имеет место, то собственно интервал перекрытия возвращается параметром overlap.
otherInterval: Проверяемый интервал. Тип Interval.
overlap: Интервал перекрытия. Тип Interval. Значение действительно, только если метод возвращает true.
Returns: Возвращает true, если данный интервал по своей верхней границе перекрывается с указанным интервалом.
В противном случае возвращает false.
Если метод возвращает true, то действительный интервал перекрытия передается через параметр overlap.

Teigha.Geometry.Interval.IsPeriodicallyOn(System.Double,[Out]double%)
Метод позволяет проверить, является ли указанное значение периодическим на этом интервале с заданным периодом.
Метод позволяет проверить, является ли указанное значение периодическим на этом интервале с заданным периодом. Другими словами,
существует ли такое положительное целое число N, что значение value + N * period принадлежит данному интервалу.
period: Входное значение периода. Тип double.
value: Выходное значение. Тип double. Если метод возвращает true, то value получает значение, которое с периодом period целое количество раз попадает в данный интервал.
Returns: Возвращает true, если существует положительное целое число N, такое что значение value + N * period принадлежит данному интервалу. В противном случае возвращает false.

Teigha.Geometry.Interval.Subtract(Teigha.Geometry.Interval)
Метод вычитает указанный интервал из данного интервала.
Метод вычитает указанный интервал из данного интервала.
Результат операции возвращается в виде двухэлементного массива интервалов.
otherInterval: Вычитаемый интервал. Тип Interval.
Returns: Возвращает массив из двух интервалов, образование которых возможно в результате операции вычитания. Тип Interval[].
Элемент с индексом 0 представляет левый или единственный интервал, образующийся в результате операции вычитания.
Если результатом являются два интервала, то элемент с индексом 1 представляет правый интервал.
Два интервала образуются только в том случае, если otherInterval полностью включен в данный интервал, не касаясь его границ своими концами.

Teigha.Geometry.Interval.Element
Свойство Element представляет границу данного интервала.
Свойство Element
* возвращает верхнюю границу, если этот интервал ограничен сверху;
* возвращает нижнюю границу, если этот интервал не ограничен сверху, но ограничен снизу;
* возвращает 0.0, если этот интервал не ограничен в обоих направлениях.
Returns: Возвращает границу данного интервала. Тип double.

Teigha.Geometry.Interval.IsBounded
Свойство IsBounded позволяет проверить, является ли данный интервал ограниченным с обеих сторон.
Свойство IsBounded позволяет проверить, является ли данный интервал ограниченным с обеих сторон, т.е. конечным.
Returns: Возвращает true, если данный интервал является ограниченным как сверху, так и снизу.
В противном случае возвращает false.

Teigha.Geometry.Interval.IsBoundedAbove
Свойство IsBoundedAbove позволяет проверить, является ли данный интервал ограниченным сверху.
Свойство IsBoundedAbove позволяет проверить, является ли данный интервал ограниченным сверху.
Returns: Возвращает true, если данный интервал является ограниченным сверху.
В противном случае возвращает false.

Teigha.Geometry.Interval.IsBoundedBelow
Свойство IsBoundedBelow позволяет проверить, является ли данный интервал ограниченным снизу.
Свойство IsBoundedBelow позволяет проверить, является ли данный интервал ограниченным снизу.
Returns: Возвращает true, если данный интервал является ограниченным снизу.
В противном случае возвращает false.

Teigha.Geometry.Interval.IsSingleton
Свойство IsSingleton позволяет проверить, не является ли данный интервал синглтоном (вырожденным в точку).
Возвращает true, если этот интервал ограничен и нижняя граница равна верхней границе в пределах допуска. В противном случае возвращает false.
Свойство IsSingleton позволяет проверить, не является ли данный интервал синглтоном (вырожденным в точку).
Вырождение интервала имеет место, если интервал ограничен, и его нижняя граница совпадает с верхней в пределах заданной в этом объекте точности определения границ.
Returns: Возвращает true, если интервал ограничен, а его нижняя граница совпадает с верхней в пределах заданной в этом объекте точности определения границ. В противном случае возвращает false.

Teigha.Geometry.Interval.IsUnbounded
Свойство IsUnbounded позволяет убедиться, что данный интервал является неограниченным по крайней мере с одной из сторон.
Свойство IsUnbounded позволяет убедиться, что данный интервал является неограниченным по крайней мере с одной из сторон.
Returns: Возвращает true, если интервал не является ограниченным по крайней мере в одном из двух направлений.
В противном случае возвращает false.

Teigha.Geometry.Interval.Length
Свойство Length возвращает длину данного интервала, если он ограничен, и -1 в противном случае.
Свойство Length возвращает длину данного интервала, если он ограничен, и -1 в противном случае.
Returns: Возвращает длину данного интервала, если он ограничен, и -1 в противном случае.
Тип double.

Teigha.Geometry.Interval.LowerBound
Свойство LowerBound представляет нижнюю границу данного интервала.
Возвращаемое значение имеет смысл только в случае интервала, ограниченного снизу.
Свойство LowerBound представляет нижнюю границу данного интервала.
Возвращаемое значение имеет смысл только в случае интервала, ограниченного снизу.
Returns: Возвращает нижнюю границу данного интервала.
Тип double.

Teigha.Geometry.Interval.Tolerance
Свойство Tolerance представляет точность, используемую для определения границ данного интервала.
Свойство Tolerance представляет точность, используемую для определения границ данного интервала.
Returns: Возвращает точность, используемую для определения границ данного интервала.
Тип double.

Teigha.Geometry.Interval.Unbounded
Свойство Unbounded возвращает интервал, неограниченный с какой-либо одной стороны.
Свойство Unbounded возвращает интервал, неограниченный с какой-либо одной стороны.
Returns: Возвращает интервал, неограниченный с какой-либо одной стороны.
Тип Interval.

Teigha.Geometry.Interval.UpperBound
Свойство UpperBound представляет верхнюю границу данного интервала.
Свойство UpperBound представляет верхнюю границу данного интервала.
Returns: Возвращает верхнюю границу данного интервала.
Тип double.