HostMgd.EditorInput.PromptEntityResultEventHandler
Делегат предназначен для обработки событий,
возникающих после завершения выбора геометрического объекта пользователем в редакторе nanoCAD.
Делегат используется как сигнатура метода-обработчика для событий,
связанных с операцией выбора объекта — таких как PromptedForEntity.
Он позволяет получить информацию о результате выбора:
идентификатор (ObjectId) выбранного объекта,
точку выбора (PickedPoint) и статус выполнения операции (PromptStatus).
Делегат предоставляет доступ к этим данным через параметр e,
который является экземпляром класса PromptEntityResultEventArgs.
Этот тип делегата особенно полезен при разработке плагинов или надстроек,
где требуется реагировать на выбор объектов в чертеже и выполнять дальнейшие действия
— например, модификацию, анализ или создание новых объектов на основе выбранного элемента.
sender: Источник события, обычно представляет собой экземпляр редактора (Editor),
e: Объект, содержащий данные о результате выбора