Teigha.DatabaseServices.DBObject.SubObjectModified
Cобытие происходит каждый раз, когда подобъект данного объекта открывается для изменений, в режиме OpenMode.ForWrite,
изменяется и закрывается с изменениями.
Cобытие происходит каждый раз, когда подобъект данного объекта открывается для изменений, в режиме OpenMode.ForWrite,
изменяется и закрывается с изменениями.
Returns: Тип данных EventHandler, представляющий обработчик события.