Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter
Структура ProcedureAndDestinationParameter содержит информацию о процедуре и параметрах направления вывода для свойства RenderGlobal.ProcedureAndDestination.
Структура ProcedureAndDestinationParameter содержит информацию о процедуре и параметрах направления вывода для свойства RenderGlobal.ProcedureAndDestination.

Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.#ctor(Procedure,Destination)
Конструктор структуры ProcedureAndDestinationParameter.
Создает экземпляр структуры с указанными параметрами.
Конструктор структуры ProcedureAndDestinationParameter.
Создает экземпляр структуры с указанными параметрами.
p: Процедура рендеринга (тип визуального контента). Значение из перечисления Procedure.
d: Направление вывода рендеринга. Значение из перечисления Destination.

Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Destination
Свойство Destination представляет текущее значение параметра направления вывода рендеринга.
Свойство Destination представляет текущее значение параметра направления вывода рендеринга.
Returns: Возвращает направление вывода рендеринга. Значение из перечисления Destination.

Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Procedure
Свойство Procedure представляет текущее значение параметра процедуры рендеринга.
Свойство Procedure представляет текущее значение параметра процедуры рендеринга, который определяет заданный тип визуального контента в настройках рендеринга.
Returns: Возвращает процедуру рендеринга. Значение из перечисления Procedure.