HostMgd.GraphicsSystem.LinePattern
Данное перечисление определяет типы линий (паттерны), отображение которых не зависит от масштабирования чертежа на экране.
Перечисление LinePattern определяет типы линий (паттерны), отображение которых не зависит от масштабирования чертежа на экране.