Teigha.DatabaseServices.HighlightOverrule.SetNoFilter
Отключает при переопределении использование всех методов предварительной фильтрации объектов (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метода IsApplicable() базового класса Overrule.
Отключает при переопределении использование всех методов предварительной фильтрации объектов (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метода IsApplicable() базового класса Overrule.