HostMgd.EditorInput.PromptNestedEntityResult.ToString
Метод возвращает строковое представление результата выбора вложенного объекта,
включая статус и идентификатор выбранного элемента.
Переопределённый метод предоставляет читаемую строку,
описывающую результат операции выбора вложенного геометрического объекта.
Метод возвращает информацию о статусе операции (OK, Cancel, Error) и,
при успешном завершении, идентификатор (ObjectId) выбранного объекта
и точку выбора (PickedPoint), если она доступна.
Этот метод удобен для отладки, логирования
или вывода информации в командную строку nanoCAD.
Returns: Возвращает значение типа string, представляющее собой текстовое описание результата выбора:
* Если операция успешна (Status == PromptStatus.OK) — строка содержит идентификатор объекта и координаты точки выбора.
* Если операция отменена или произошла ошибка — возвращается сообщение о статусе, например: "Operation cancelled" или "Input error".
Примеры:
* Успешный выбор: "Object ID: 12345, Point: (100.0, 50.0, 0.0)"
* Операция отменена: "Operation cancelled"