Teigha.GraphicsSystem.GsModule.GsToBeUnloaded
Событие GsToBeUnloaded создается непосредственно перед выгрузкой GsModule.
Событие GsToBeUnloaded создается непосредственно перед выгрузкой GsModule.
Предоставляет приложениям возможность выполнить необходимые операции (напр., освободить ресурсы) перед завершением работы модуля.