Teigha.DatabaseServices.LinetypeTableRecord
Объекты этого класса представляют записи в LinetypeTable.
Объекты этого класса представляют записи в LinetypeTable.
Каждая из этих записей содержит информацию об одном типе
линии в чертеже в базе данных.
Внутри LinetypeTableRecord, штриховые линии (сегменты линий,
которые составляют характеристику типа линий) хранятся в
списке с индексом, отсчитывающимся от 0. Если тип линии
является составным, то встроенные формы или текстовые
строки хранятся в списке в строке с тем же индексом, что и
штриховка, которая предшествует им в определении типа линии.
Таким образом, всегда будет значение длины штриховки для любого
корректного индекса в списке, даже если это форма или
текстовая строка, разделяющие тот же самый индекс. Когда тип
линии уточняется, точка вставки формы будет добавлена вместе
с концом штриховки, с которым эта форма содержится под одним
индексом.

Teigha.DatabaseServices.LinetypeTableRecord.AsciiDescription
Это свойство является устаревшим, используйте вместо него
свойство Comments.

Teigha.DatabaseServices.LinetypeTableRecord.Comments
Обеспечивает доступ к строке, используемой объектом
LinetypeTableRecord для описания типа линии в виде такого же
простого ASCII текста, который вы можете найти в файле
описания типа линии (в поле "Описание").

Teigha.DatabaseServices.LinetypeTableRecord.IsScaledToFit
Обеспечивает доступ к типу выравнивания для
LinetypeTableRecord.
Если ScaledToFit равен true, выравнивание будет равно
quot;растянуть по размеруquot; (эквивалентно quot;Squot;
в поле quot;выравниваниеquot; определения типа линии).
Если ScaledToFit равен false, то выравнивание не будет
quot;растянуть по размеруquot; (эквивалентно quot;Aquot;
в поле quot;выравниваниеquot; определения типа линии).

Teigha.DatabaseServices.LinetypeTableRecord.NumDashes
Обеспечивает доступ к количеству штрихов в
LinetypeTableRecord.

Teigha.DatabaseServices.LinetypeTableRecord.PatternLength
Возвращает длину (в единицах чертежа nanoCAD - образец
появится этой длины, если масштаб линий равен 1.0) образца в
LinetypeTableRecord.
Длина образца — это общая длина всех шриховок (включая
пробелы).
Встроенные формы или текстовые строки не добавляются к длине
образца, поскольку они накладываются поверх и не прерывают
реальный образец штриховки.

Teigha.DatabaseServices.LinetypeTableRecord.#ctor
Конструктор по умолчанию.
Приложения могут не использовать этот
конструктор. Класс Database создает свою собственную копию и
нет никаких причин использовать этот конструктор.

Teigha.DatabaseServices.LinetypeTableRecord.SetDashLengthAt(System.Int32,System.Double)
Этот метод устанавливает значение длины (в единицах чертежа
nanoCAD — штриховка будет отображаться с этой длиной, если
масштаб типа линии равен 1.0) в строке index штриховки в
LinetypeTableRecord.
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) штриховки, для которой
value: Значение длины для штриховки

Teigha.DatabaseServices.LinetypeTableRecord.DashLengthAt(System.Int32)
Этот метод возвращает длину (в единицах чертежа nanoCAD —
штриховка будет отображаться с этой длиной, если масштаб типа
линии равен 1.0) из строки с индексом index штриховки в
LinetypeTableRecord.
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) штриховки, для которой

Teigha.DatabaseServices.LinetypeTableRecord.SetShapeIsUcsOrientedAt(System.Int32,System.Boolean)
Этот метод устанавливает бит UcsOriented (бит 1) для формы
(или текстовой строки) в строке, определенной параметром
index в LinetypeTableRecord. Если IsUcsOriented равен true,
то этот бит устанавливается, и форма будет ориентирована
относительно текущего UCS при отображении. Если параметр
IsUcsOriented равен false, то форма будет ориентирована
относительно встроенной в форму линии.
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) строки, содержащей
isOriented: Признак, определяющий, будет или нет форма

Teigha.DatabaseServices.LinetypeTableRecord.SetShapeNumberAt(System.Int32,System.Int32)
Этот метод задает для строки со значением индекса index
встроенную форму с номером, заданным параметром shapeNumber
(shapeNumber из файла формы). Если в строке не должна
использоваться форма, значение shapeNumber должно быть равно
0.
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля, (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) строки, для которой
shapeNumber: Идентификационный номер формы для вставляемой в

Teigha.DatabaseServices.LinetypeTableRecord.SetShapeOffsetAt(System.Int32,Teigha.Geometry.Vector2d)
Этот метод устанавливает для строки LinetypeTableRecord со
значением индекса index значения смещения X и Y для формы
(или текстовой строки) из координат X и Y параметра offset.
Если в строке не должна использоваться форма, значения X и Y
параметра offset должны быть 0.0.
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) строки, для которой
offset: Вектор, значения X и Y которого являются WCS

Teigha.DatabaseServices.LinetypeTableRecord.SetShapeRotationAt(System.Int32,System.Double)
Этот метод устанавливает для строки LinetypeTableRecord со
значением индекса index значение угла поворота формы
(текстовой строки). Если бит isUcsOriented установлен в
inetypeTableRecord, то угол относится к текущему UCS. В
противном случае он отсчитывается от линии направления.
Положительный угол считается против часовой стрелки при
взгляде сверху вниз по нормали к плоскости, содержащей текст
(или нормали UCS, если isUcsOriented установлен в 1).
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) строки, содержащей форму
rotation: Угол поворота для формы (текстовой строки)

Teigha.DatabaseServices.LinetypeTableRecord.SetShapeScaleAt(System.Int32,System.Double)
Этот метод устанавливает для строки LinetypeTableRecord со
значением индекса index используемый масштаб в соответствии
со значением параметра scale. Если в строке нет формы, то
масштаб должен быть 1.0.
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) строки, содержащей форму
scale: Коэффициент масштаба, который должен быть приложен к

Teigha.DatabaseServices.LinetypeTableRecord.SetShapeStyleAt(System.Int32,DatabaseServices.ObjectId)
Этот метод устанавливает для строки LinetypeTableRecord со
значением индекса index используемое значение ObjectId для
TextStyleTableRecord для формы (или textStyle, если вместо
формы текстовая строка). Если в строке LinetypeTableRecord
нет ни формы, ни текстовой строки, то значение ObjectId
должно быть null.
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) строки, содержащей форму
id: Значение Id объекта для определения

Teigha.DatabaseServices.LinetypeTableRecord.SetTextAt(System.Int32,String)
Этот метод устанавливает для строки LinetypeTableRecord со
значением индекса index значение поля текста из параметра
value (это значение копируется).
Значение index должно быть больше или равно 0, но меньше чем
значение, возвращаемое LinetypeTableRecord.NumDashes. index
представляет собой индекс, начинающийся с нуля (формы и
текстовые строки имеют тот же самый индекс, как и штриховка,
предшествующая им в определении типа линии) с первым
элементом типа линии, соответствующим индексу, равному 0.
Для получения дополнительной информации об определении типа
линии и длины штриховки, смотри раздел "Типы линий" в
Инструкции пользователя по nanoCAD.
index: Индекс (начинающийся с 0) строки, содержащей форму
value: указатель на значение задаваемого текстового поля

Teigha.DatabaseServices.LinetypeTableRecord.ShapeIsUcsOrientedAt(System.Int32)
Этот метод возвращает true, если форма (текстовая строка) в
строке LinetypeTableRecord с индексом index имеет бит
UcsOriented (бит 1) установленным в 1, и false в противном
случае.
index: Индекс (начинающийся с 0) строки, содержащей форму

Teigha.DatabaseServices.LinetypeTableRecord.ShapeNumberAt(System.Int32)
Этот метод возвращает номер формы в строке
LinetypeTableRecord с индексом index. Если в этой строке нет
формы, то метод возвращает 0.
index: Индекс (начинающийся с 0) строки, для которой

Teigha.DatabaseServices.LinetypeTableRecord.ShapeOffsetAt(System.Int32)
Этот метод возвращает объект Vector2d, координаты X и Y
которого представляют значения смещения X и Y для формы (или
текстовой строки) из строки LinetypeTableRecord со значением
индекса index. Если в строке не используется форма, значения
X и Y возвращаемого вектора равны 0.0.
index: Индекс (начинающийся с 0) строки, для которой

Teigha.DatabaseServices.LinetypeTableRecord.ShapeRotationAt(System.Int32)
Этот метод возвращает значение угла поворота (в радианах)
формы (текстовой строки) для строки LinetypeTableRecord со
значением индекса index. Если бит isUcsOriented установлен в
inetypeTableRecord, то угол относится к текущему UCS. В
противном случае он отсчитывается от линии направления.
Положительный угол считается против часовой стрелки при
взгляде сверху вниз по нормали к плоскости, содержащей текст
(или нормали UCS, если isUcsOriented установлен в 1). Если в
строке LinetypeTableRecord нет формы (текстовой строки),
возвращается 0.
index: Индекс (начинающийся с 0) строки, для которой

Teigha.DatabaseServices.LinetypeTableRecord.ShapeScaleAt(System.Int32)
Этот метод возвращает используемый масштаб для строки
LinetypeTableRecord со значением индекса index. Если в строке
нет формы, то масштаб должен быть 1.0.
index: Индекс (начинающийся с 0) строки, для которой

Teigha.DatabaseServices.LinetypeTableRecord.ShapeStyleAt(System.Int32)
Этот метод возвращает используемое значение ObjectId для
TextStyleTableRecord для формы (или textStyle если вместо
формы текстовая строка) для строки LinetypeTableRecord со
значением индекса index. Если в строке нет ни формы, ни
текста, то возвращается значение null .
index: Индекс (начинающийся с 0) строки, для которой

Teigha.DatabaseServices.LinetypeTableRecord.TextAt(System.Int32)
Этот метод возвращает для строки LinetypeTableRecord со
значением индекса index значение поля текста.
index: Индекс (начинающийся с 0) строки, для которой