Teigha.DatabaseServices.SectionSettings.Reset
Метод сбрасывает к значениям по умолчанию все настройки для всех типов сечений.
Метод сбрасывает к значениям по умолчанию все настройки для всех типов сечений.