HostMgd.Runtime.DistanceUnitFormat
Перечисление возможных форматов единиц измерения.
Члены                     Описание
-------------  --------------------------------------------------
Current = -1              Текущий формат единиц измерения
Scientific = 1            Научный
Decimal = 2               Десятичный
Engineering = 3           Инженерный
Architectural = 4         Архитектурный
Fractional = 5            Дробный