Teigha.GraphicsInterface.NonEntityTraits
Класс NonEntityTraits реализует пустые интерфейсы, которые позволяют предоставить доступ к уникальным графическим атрибутам отображаемых негеометрических объектов через интерфейс DrawableTraits.
Класс NonEntityTraits реализует пустые интерфейсы, которые позволяют предоставить доступ к уникальным графическим атрибутам отображаемых негеометрических объектов через интерфейс DrawableTraits.

Teigha.GraphicsInterface.NonEntityTraits.AddLight(DatabaseServices.ObjectId)
Метод позволяет добавить освещение, привносимое в модель отображаемыми объектами, которые сами являются источниками света.
Метод позволяет добавить освещение, привносимое в модель отображаемыми негеометрическими объектами, которые сами являются источниками света.
В графическую систему передается положение источников света, их интенсивности и прочие свойства.
Реализация по умолчанию этого метода выбрасывает исключение NotSupportedException.
lightId: Уникальный идентификатор источника освещения. Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.NonEntityTraits.SetSelectionMarker(IntPtr)
Метод назначает объекту SubEntityTraits использование нового текущего графического маркера для всех графических примитивов, отображаемых до следующего вызова этого метода или до завершения выполнения методов WorldDraw() или ViewportDraw().
Метод назначает объекту SubEntityTraits использование нового текущего графического маркера для всех графических примитивов, отображаемых до следующего вызова этого метода или до завершения выполнения методов WorldDraw() или ViewportDraw().
Notes
Реализация по умолчанию этого метода выбрасывает исключение NotSupportedException.
markerId: Входной указатель маркера графической системы.

Teigha.GraphicsInterface.NonEntityTraits.SetupForEntity(DatabaseServices.Entity)
Метод предназначен для полной инициализации объектов SubEntityTraits и DrawableTraits, используя в качестве источника заданный объект чертежа.
Метод предназначен для полной инициализации объектов SubEntityTraits и DrawableTraits, используя в качестве источника переданный в метод объект entity.
Это обычно эффективнее, чем переопределять каждое свойство по отдельности.
Notes
Реализация по умолчанию этого метода выбрасывает исключение NotSupportedException.
entity: Входной объект чертежа.

Teigha.GraphicsInterface.NonEntityTraits.Color
Свойство Color предоставляет доступ к текущему индексу цвета данного объекта.
Свойство Color предоставляет доступ к текущему индексу цвета данного объекта.
Notes
Свойство не реализовано.
Returns: Возвращает текущий индекс цвета данного объекта.
Тип short.

Teigha.GraphicsInterface.NonEntityTraits.DrawFlags
Свойство DrawFlags возвращает или изменяет текущее значение флагов отрисовки.
Свойство DrawFlags возвращает или изменяет текущее значение флагов отрисовки. По умолчанию используется флаг kNoDrawFlags.
Notes
Свойство не реализовано.
Returns: Возвращает текущее значение флагов отрисовки.
Тип int.

Teigha.GraphicsInterface.NonEntityTraits.FillType
Свойство FillType обеспечивает доступ к текущему типу заполнения FillType в данном объекте.
Свойство FillType обеспечивает доступ к текущему типу заполнения FillType в данном объекте.
Notes
Свойство не реализовано.
Returns: Возвращает тип заполнения как значение из перечисления GraphicsInterface.FillType.

Teigha.GraphicsInterface.NonEntityTraits.Layer
Свойство Layer предоставляет доступ к ObjectId текущего слоя, который в объекте SubEntityTraits назначен для отображения графических примитивов.
Свойство Layer предоставляет доступ к идентификатору ObjectId слоя, который в объекте SubEntityTraits назначен текущим слоем для отображения графических примитивов.
Notes
Свойство не реализовано.
Returns: Возвращает идентификатор записи LayerTableRecord в таблице слоёв.
Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.NonEntityTraits.LineType
Свойство LineType предоставляет доступ к идентификатору ObjectId объекта LinetypeTableRecord, который в объекте SubEntityTraits назначен текущим типом линии для отрисовки графических примитивов.
Свойство LineType предоставляет доступ к идентификатору ObjectId объекта LinetypeTableRecord, который в объекте SubEntityTraits назначен текущим типом линии для отрисовки графических примитивов.
Notes
Свойство не реализовано.
Returns: Возвращает идентификатор записи LinetypeTableRecord в таблице типов линий.
Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.NonEntityTraits.LineTypeScale
Свойство LineTypeScale предоставляет доступ к масштабному коэффициенту типа линии, который в объекте SubEntityTraits назначен для отрисовки графических примитивов.
Свойство LineTypeScale предоставляет доступ к масштабному коэффициенту типа линии, который в объекте SubEntityTraits назначен для отрисовки графических примитивов.
Значение 1.0 соответствует стандартному масштабу, значение 2.0 приведет к увеличению длины штрихов вдвое, а значение 0.5 уменьшит их до половины обычной длины.
Notes
Свойство не реализовано.
Returns: Возвращает масштабный коэффициент типа линии.
Тип double.

Teigha.GraphicsInterface.NonEntityTraits.LineWeight
Свойство LineWeight предоставляет доступ к весу линии, который в объекте SubEntityTraits назначен для отрисовки графических примитивов.
Свойство LineWeight предоставляет доступ к весу (толщину) линии, который в объекте SubEntityTraits назначен для отрисовки графических примитивов.
Notes
Свойство не реализовано.
Returns: Возвращает вес (толщину) линии как значение из перечисления DatabaseServices.LineWeight.

Teigha.GraphicsInterface.NonEntityTraits.Mapper
Свойство Mapper представляет  доступ к определению активного маппера GraphicsInterface.Mapper.
Свойство Mapper представляет  доступ к определению активного маппера GraphicsInterface.Mapper.
Notes
Свойство не реализовано.
Returns: Возвращает активный маппер.
Тип GraphicsInterface.Mapper.

Teigha.GraphicsInterface.NonEntityTraits.Material
Свойство Material предоставляет доступ к идентификатору текущего материала, который в объекте SubEntityTraits назначен для отображения графических примитивов.
Свойство Material предоставляет доступ к идентификатору текущего материала, который в объекте SubEntityTraits назначен для отображения графических примитивов.
Notes
Свойство не реализовано.
Returns: Возвращает идентификатор текущего материала в базе данных.
Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.NonEntityTraits.PlotStyleDescriptor
Свойство PlotStyleDescriptor предоставляет доступ к дескриптору стиля печати, который в объекте SubEntityTraits определяет стиль отображения графических примитивов при выводе на печать.
Свойство PlotStyleDescriptor предоставляет доступ к дескриптору стиля печати, который в объекте SubEntityTraits определяет стиль отображения графических примитивов при выводе на печать.
Notes
Свойство не реализовано.
Returns: Возвращает дескриптор текущего стиля печати.
Тип DatabaseServices.PlotStyleDescriptor.

Teigha.GraphicsInterface.NonEntityTraits.Sectionable
Свойство Sectionable предоставляет доступ к логическому флагу, определяющему участие отображаемых с помощью этого объекта графических примитивов в операциях построения сечений.
Свойство Sectionable предоставляет доступ к логическому флагу, определяющему участие отображаемых с помощью этого объекта графических примитивов в операциях построения сечений.
Notes
Свойство не реализовано.
Returns: Возвращает true, если отображаемые графические примитивы будут участвовать в построении сечений.
Возвращает false, если операции построения сечений не влияют на графические примитивы.

Teigha.GraphicsInterface.NonEntityTraits.SelectionFlags
Свойство SelectionFlags предоставляет доступ к текущим значениям флагов выделения.
Свойство SelectionFlags предоставляет доступ к текущим значениям флагов выделения.
Notes
Свойство не реализовано.
Returns: Возвращает состояния флагов выделения. Перечисление SelectionFlags.

Teigha.GraphicsInterface.NonEntityTraits.SelectionOnlyGeometry
Свойство SelectionOnlyGeometry позволяет определить, что геометрия предназначена только для выделения.
Свойство SelectionOnlyGeometry позволяет определить, что геометрия предназначена только для выделения.
Notes
Свойство не реализовано.
Returns: Возвращает true, если геометрия предназначена только для выделения.
В противном случае возвращает false.

Teigha.GraphicsInterface.NonEntityTraits.ShadowFlags
Свойство ShadowFlags предоставляет доступ к текущему состоянию флагов отображения теней.
Свойство ShadowFlags предоставляет доступ к текущему состоянию флагов отображения теней из перечисления GraphicsInterface.ShadowFlags.
По умолчанию используется значение ShadowsCastAndReceive.
Notes
Свойство не реализовано.
Returns: Возвращает флаги отображения теней из перечисления GraphicsInterface.ShadowFlags.

Teigha.GraphicsInterface.NonEntityTraits.Thickness
Свойство Thickness обеспечивает доступ к значению толщины выдавливания отображаемых объектов.
Свойство Thickness обеспечивает доступ к значению толщины выдавливания отображаемых объектов.
Эта толщина представляет собой выдавливание в единицах WCS в положительном направлении оси Z.
Вектор выдавливания рассчитывается как (Z * thickness) * modelTransform.
Применимо лишь к следующим примитивам: линия, полилиния, дуга, окружность и текст shx.
Notes
Свойство не реализовано.
Returns: Возвращает значение толщины выдавливания.
Тип double.

Teigha.GraphicsInterface.NonEntityTraits.Transparency
Свойство Transparency предоставляет доступ к прозрачности отображаемых объектов.
Свойство Transparency предоставляет доступ к настройке прозрачности отображаемых объектов.
Notes
Свойство не реализовано.
Returns: Возвращает прозрачность отображаемых объектов.
Тип Colors.Transparency.

Teigha.GraphicsInterface.NonEntityTraits.TrueColor
Свойство TrueColor предоставляет доступ к текущему цвету в виде экземпляра класса Colors.EntityColor.
Свойство TrueColor предоставляет доступ к текущему цвету в виде экземпляра класса Colors.EntityColor.
Значение EntityColor.ColorMethod влияет на метод определения цвета - RGB, ACI, по слою и т.д.
Notes
Свойство не реализовано.
Returns: Возвращает текущий цвет.
Тип Colors.EntityColor.

Teigha.GraphicsInterface.NonEntityTraits.VisualStyle
Свойство VisualStyle предоставляет доступ к идентификатору визуального стиля отображения графических объектов.
Свойство VisualStyle предоставляет доступ к идентификатору визуального стиля отображения графических объектов.
Notes
Свойство не реализовано.
Returns: Возвращает идентификатор объекта визуального стиля.
Тип DatabaseServices.ObjectId.