HostMgd.ApplicationServices.DocumentWindowCollection.Cascade
Метод реализует каскадное размещение дочерних окон MDI.
В текущей версии  не реализован.
Метод реализует каскадное размещение дочерних окон MDI (Multiple Document Interface).
В текущей версии  не реализован.