Teigha.GraphicsInterface.LightTraits
Класс LightTraits представляет состояние источника излучения света (вкл./выкл.).
Класс LightTraits представляет состояние источника излучения света (вкл./выкл.).

Teigha.GraphicsInterface.LightTraits.#ctor
Конструктор по умолчанию класса LightTraits.
Конструктор по умолчанию класса LightTraits.

Teigha.GraphicsInterface.LightTraits.On
Свойство On позволяет определить состояние источника света.
Свойство On позволяет определить состояние источника света (on/off).
Returns: Возвращает true, если источник света активен.
В противном случае возвращает false.