Teigha.BoundaryRepresentation.ErrorStatus.WrongDatabase
Значение: 40 = 0x28.
Неверная база данных.
Владелец списка траверсера и позиция в списке не указывают на один и тот же объект.
Невозможно установить позицию в списке траверсера, поскольку подобъект не связан с владельцем списка.