Teigha.DatabaseServices.CellBorders
Класс представляет границы ячеек таблицы.
Класс представляет границы ячеек таблицы.

Teigha.DatabaseServices.CellBorders.Bottom
Свойство возвращает границу ячейки на верхней или нижней горизонтальной линиях сетки таблицы, в зависимости от направления данных в таблице.
Свойство возвращает границу ячейки на верхней или нижней горизонтальной линиях сетки таблицы, в зависимости от направления данных в таблице.
Returns: Возвращает границу ячейки. Тип CellBorder.

Teigha.DatabaseServices.CellBorders.Horizontal
Свойство возвращает границу ячейки на всех горизонтальных линиях сетки, кроме верхней и нижней.
Свойство возвращает границу ячейки на всех горизонтальных линиях сетки, кроме верхней и нижней.
Returns: Возвращает границу ячейки. Тип CellBorder.

Teigha.DatabaseServices.CellBorders.Left
Свойство возвращает границу ячейки на крайней левой линии сетки таблицы.
Свойство возвращает границу ячейки на крайней левой линии сетки таблицы.
Returns: Возвращает границу ячейки. Тип CellBorder.

Teigha.DatabaseServices.CellBorders.Right
Свойство возвращает границу ячейки на крайней правой линии сетки таблицы.
Свойство возвращает границу ячейки на крайней правой линии сетки таблицы.
Returns: Возвращает границу ячейки. Тип CellBorder.

Teigha.DatabaseServices.CellBorders.Top
Свойство возвращает границу ячейки на верхней или нижней горизонтальной линиях сетки таблицы, в зависимости от направления данных в таблице.
Свойство возвращает границу ячейки на верхней или нижней горизонтальной линиях сетки таблицы, в зависимости от направления данных в таблице.
Returns: Возвращает границу ячейки. Тип CellBorder.

Teigha.DatabaseServices.CellBorders.Vertical
Свойство возвращает границу ячейки на всех вертикальных линиях сетки таблицы, кроме крайней левой и крайней правой.
Свойство возвращает границу ячейки на всех вертикальных линиях сетки таблицы, кроме крайней левой и крайней правой.
Returns: Возвращает границу ячейки. Тип CellBorder.