Teigha.GraphicsInterface.EdgeData
Класс EdgeData представляет массивы атрибутов ребер сетей и оболочек.
Класс EdgeData представляет массивы атрибутов ребер сетей и оболочек.
Экземпляры этого класса используются в качестве аргумента в методах Mesh() и Shell() классов WorldGeometry и ViewportGeometry, которые создают и вводят примитивы сетей и оболочек в контекст векторизации.
Notes
Задание некорректного размера любого массива может привести к непредсказуемым результатам.

Teigha.GraphicsInterface.EdgeData.SetColors(array)
Метод задаёт массив индексов цвета рёбер, используемых данным объектом.
Метод позволяет задать массив индексов цвета для рёбер, используемых данным объектом.
Размерность массива должна точно соответствовать количеству рёбер в сети или оболочке, с которыми он используется.
Порядок элементов массива должен строго соответствовать порядку ребер в сети или оболочке.
Каждый элемент массива управляет цветом "своего" ребра независимо от цвета других ребер.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Для определения цвета ребер допускается использовать либо индексированные цвета посредством метода SetColors(), либо "истинные" цвета EntityColor с помощью метода SetTrueColors(), но не оба способа одновременно.
Предупреждение:
Преждевременное освобождение или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
colors: Массив индексов цвета рёбер.

Teigha.GraphicsInterface.EdgeData.SetLayers(array)
Метод задаёт массив слоёв, используемых данным объектом.
Метод задаёт используемые данным объектом слои как массив идентификаторов объектов LayerTableRecord.
Размерность массива должна точно соответствовать количеству рёбер в сети или оболочке, с которыми он используется.
Порядок элементов в массиве должен строго соответствовать порядку ребер в сети или оболочке.
Каждый элемент массива определяет слой, на котором располагается соответствующее ребро сети или оболочки, индивидуально.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Предупреждение:
Преждевременное освобождение памяти или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
layers: Массив идентификаторов объектов LayerTableRecord.

Teigha.GraphicsInterface.EdgeData.SetLineTypes(array)
Метод задаёт массив типов линий, используемых данным объектом.
Метод задаёт используемые данным объектом типы линий как массив идентификаторов объектов LinetypeTableRecord.
Размерность массива должна точно соответствовать количеству рёбер, а порядок элементов в массиве должен строго соответствовать порядку рёбер в сети или оболочке, с которыми массив используется.
Каждый элемент массива определяет тип линии для соответствующего ребра индивидуально.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Предупреждение:
Преждевременное освобождение памяти или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
lineTypes: Массив идентификаторов типов линий LinetypeTableRecord.

Teigha.GraphicsInterface.EdgeData.SetSelectionMarkers(array)
Метод задает массив маркеров выделения графической системы (gsmarkers), используемых данным объектом EdgeData.
Метод задает массив маркеров выделения графической системы (gsmarkers), используемых данным объектом EdgeData.
Размерность массива должна точно соответствовать количеству рёбер, а порядок элементов в массиве должен строго соответствовать порядку рёбер в сети или оболочке, с которыми массив используется.  Первый элемент массива определяет маркер выделения, используемый для первого ребра, второй элемент — для второго ребра и т.д.
selectionMarkers: Массив маркеров выделения графической системы.

Teigha.GraphicsInterface.EdgeData.SetTrueColors(array)
Метод задаёт массив значений цвета для рёбер, используемых данным объектом.
Метод позволяет задать массив значений цвета для рёбер, используемых данным объектом.
Размерность массива должна точно соответствовать количеству рёбер в сети или оболочке, с которыми он используется.
Порядок элементов в массиве должен строго соответствовать порядку ребер в сети или оболочке.
Первый элемент массива определяет цвет для первого ребра сети или оболочки, второй элемент — для второго ребра и т.д.
Каждый элемент массива управляет цветом "своего" ребра индивидуально, независимо от цвета других ребер.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Для определения цвета ребер допускается использовать либо индексированные цвета посредством метода SetColors(), либо "истинные" цвета EntityColor с помощью метода SetTrueColors(), но не оба способа одновременно.
Предупреждение:
Преждевременное освобождение выделенной памяти или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
colors: Массив значений цвета рёбер.

Teigha.GraphicsInterface.EdgeData.SetVisibility(array)
Метод задаёт массив флагов видимости рёбер, используемых этим объектом.
Метод определяет массив флагов видимости рёбер, по одному для каждого ребра в сети или оболочке, с которыми используется данный объект.
Значение 1 означает видимое состояние, значение 0 - невидимое.
Размерность массива должна точно соответствовать количеству рёбер в сети или оболочке, с которыми он используется.
Порядок элементов в массиве должен строго соответствовать порядку ребер в сети или оболочке.
Первый элемент массива определяет видимость первого ребра сети или оболочки, второй элемент — второго ребра и т.д.
Каждый элемент массива управляет видимостью "своего" ребра индивидуально, независимо от состояния других ребер.
Notes
За выделение и освобождение памяти для массива отвечает вызывающее приложение.
Данный метод принимает указатель на массив и использует массив непосредственно, не создавая его копий.
Предупреждение:
Преждевременное освобождение выделенной памяти или удаление массива, переданного в этот метод, чревато непредсказуемыми последствиями для платформы.
visibility: Массив флагов видимости рёбер