Teigha.DatabaseServices.Entity.GetPlane
Метод предназначен для получения плоскости, в которой расположен объект.
Метод позволяет получить плоскость, в которой расположен текущий геометрический объект.
Используется для определения координатной плоскости, содержащей геометрию кривой.
Returns: Возвращает плоскость, в которой расположен текущий объект. Тип Plane