Teigha.GraphicsInterface.PositionBehavior
Перечисление PositionBehavior определяет способ позиционирования временной графики.
Перечисление PositionBehavior определяет способ позиционирования временной графики.