HostMgd.EditorInput.FenceSelectedSubObject
Класс, инкапулирующий подобъект, который выбран при выборе по
пересечению с линией выбора.
В настоящее время нигде не используется.

HostMgd.EditorInput.FenceSelectedSubObject.#ctor(Teigha.DatabaseServices.FullSubentityPath,HostMgd.EditorInput.SelectionMethod,System.Int32,array)
Конструктор.
path: Путь к вложенному объкту
method: Метод выбора
gsMarker: GS маркер
descriptors: Точки ломаной линии