Teigha.Geometry.NurbCurve2d.MakeClosed
Метод позволяет сделать данную кривую замкнутой, если она еще не замкнута.
Метод позволяет сделать данную кривую замкнутой, если она еще незамкнутая.
Кривая замыкается путем построения периодического сплайна, вид которого определяется имеющимися управляющими вершинами или определяющими точками.
Если кривая уже является замкнутой, метод ничего не делает.