Teigha.Runtime.RXClass
Объекты данного класса используются в качестве узлов в иерархическом дереве классов среды выполнения.
Объекты данного класса используются в качестве узлов в иерархическом дереве классов среды выполнения. Каждый экземпляр класса представляет собой класс, производный от RxObject. Информация среды выполнения о таких классах и их иерархических отношениях доступна через объекты класса, образующие дерево в среде выполнения.

Teigha.Runtime.RXClass.AddX(Teigha.Runtime.RXClass,Teigha.Runtime.RXObject)
Метод создает расширение протокола для указанного RxClass.
Метод создает расширение протокола для указанного RxClass.
runtimeClass: Указатель на класс расширения протокола. Тип RXClass.
protocolExtension: Указатель на объект расширения протокола. Тип RXObject.
Returns: Возвращает интеллектуальный указатель на расширение протокола. Тип IntPtr.

Teigha.Runtime.RXClass.DelX(Teigha.Runtime.RXClass)
Метод удаляет расширение протокола для указанного класса расширения протокола.
Метод удаляет расширение протокола для указанного класса расширения протокола.
В случае успешного завершения операции возвращает интеллектуальный указатель на удаленный объект расширения протокола. В противном случае возвращает NULL.
runtimeClass: Указатель на класс расширения протокола. Тип RXClass.
Returns: В случае успешного завершения возвращает интеллектуальный указатель на удаленный объект расширения протокола. В противном случае возвращает NULL.

Teigha.Runtime.RXClass.GetX(Teigha.Runtime.RXClass)
Метод возвращает объект расширения протокола для указанного класса расширения протокола.
Метод возвращает объект расширения протокола для указанного класса расширения протокола.
runtimeClass: Указатель на класс расширения протокола. Тип RXClass.
Returns: Возвращает интеллектуальный указатель на объект расширения протокола. Тип IntPtr.

Teigha.Runtime.RXClass.IsDerivedFrom(Teigha.Runtime.RXClass)
Метод позволяет проверить, является ли данный объект наследником указанного класса RXClass.
Метод позволяет проверить, является ли данный объект наследником класса runtimeClass.
runtimeClass: Входной объект искомого базового класса. Тип RXClass.
Returns: Возвращает true, если данный объект является наследником класса runtimeClass.
В противном случае возвращает false.

Teigha.Runtime.RXClass.AppName
Свойство возвращает имя приложения, которое соответствует данному классу.
Свойство возвращает имя приложения, которое соответствует данному классу.
Returns: Возвращает имя приложения. Тип String.

Teigha.Runtime.RXClass.ClassVersion
Свойство возвращает версию класса в виде значений DWG_VERSION и MAINTENANCE_VERSION, указанных при регистрации данного класса.
Свойство возвращает версию класса в виде значений DWG_VERSION и MAINTENANCE_VERSION, указанных при регистрации данного класса.  Они являются обязательными, не имеют значений по умолчанию. Эти члены данных не являются постоянными и не сохраняются в файлах DWG/DXF.
Returns: Возвращает версию данного класса. Тип Version.

Teigha.Runtime.RXClass.DxfName
Свойство возвращает имя DXF данного класса.
Свойство возвращает имя DXF данного класса.
Эта строка должна отличаться от NULL только для классов, производных от DBObject.
Если строка dxfName не задана, свойство возвращает NULL.
Returns: Возвращает имя DXF данного класса.  Тип String.

Teigha.Runtime.RXClass.MyParent
Свойство возвращает необработанный указатель на экземпляр класса, который описывает родительский класс для этого класса как объект OdRxClass.
Свойство возвращает необработанный указатель на экземпляр класса, который описывает родительский класс для этого класса как объект OdRxClass.
Returns: Возвращает необработанный указатель на объект RXClass.

Teigha.Runtime.RXClass.Name
Свойство возвращает имя класса C++, представленного данным объектом.
Свойство возвращает имя класса C++, представленного данным объектом.
Returns: Возвращает имя класса. Тип String.

Teigha.Runtime.RXClass.ProxyFlags
Свойство возвращает значения флагов ProxyFlag данного класса.
Свойство возвращает значения флагов ProxyFlag данного класса.
Для классов, производных (прямо или косвенно) от DBObject, сочетание этих флагов определяет допустимые варианты редактирования объекта, когда он представлен в чертеже своим прокси-объектом (например, ProxyEntity.kNoOperation).
Returns: Возвращает значения флагов ProxyFlag. Тип Int32.