Teigha.GraphicsSystem.SelectionReactorResult
Перечисление SelectionReactorResult определяет возможные результаты, которые предоставляют объекты SelectionReactor в рамках уведомлений о событиях выбора объектов.
Перечисление SelectionReactorResult определяет возможные результаты, которые предоставляют объекты SelectionReactor в рамках уведомлений о событиях выбора объектов.