Teigha.DatabaseServices.XrefNotificationStatus.ResolvedWithUpdate
Значение: 3.
Статус означает, что внешняя ссылка была разрешена с использованием чертежа, который был обновлен с момента последнего сохранения ссылочного чертежа.