Teigha.GraphicsInterface.GroundPlaneBackgroundTraits
Класс GroundPlaneBackgroundTraits представляет характеристики фона нулевой плоскости.
Класс GroundPlaneBackgroundTraits представляет характеристики фона нулевой плоскости.

Teigha.GraphicsInterface.GroundPlaneBackgroundTraits.ColorGroundPlaneFar
Свойство ColorGroundPlaneFar представляет цвет нулевой плоскости на дальнем плане.
Свойство ColorGroundPlaneFar представляет цвет нулевой плоскости на дальнем плане.
Returns: Возвращает цвет нулевой плоскости на дальнем плане.
Тип EntityColor.

Teigha.GraphicsInterface.GroundPlaneBackgroundTraits.ColorGroundPlaneNear
Свойство ColorGroundPlaneNear представляет цвет нулевой плоскости на ближнем плане.
Свойство ColorGroundPlaneNear представляет цвет нулевой плоскости на ближнем плане.
Returns: Возвращает цвет нулевой плоскости на ближнем плане.
Тип EntityColor.

Teigha.GraphicsInterface.GroundPlaneBackgroundTraits.ColorSkyHorizon
Свойство ColorSkyHorizon представляет цвет неба на горизонте.
Свойство ColorSkyHorizon представляет цвет неба на горизонте.
Returns: Возвращает цвет неба на горизонте.
Тип EntityColor.

Teigha.GraphicsInterface.GroundPlaneBackgroundTraits.ColorSkyZenith
Свойство ColorSkyZenith представляет цвет неба в зените.
Свойство ColorSkyZenith представляет цвет неба в зените (над наблюдателем).
Returns: Возвращает цвет неба в зените.
Тип EntityColor.

Teigha.GraphicsInterface.GroundPlaneBackgroundTraits.ColorUndergroundAzimuth
Свойство ColorUndergroundAzimuth представляет цвет поднятой нулевой плоскости на ближнем плане.
Свойство ColorUndergroundAzimuth представляет цвет поднятой нулевой плоскости на ближнем плане.
Returns: Возвращает цвет поднятой нулевой плоскости на ближнем плане.
Тип EntityColor.

Teigha.GraphicsInterface.GroundPlaneBackgroundTraits.ColorUndergroundHorizon
Свойство ColorUndergroundHorizon представляет цвет поднятой нулевой плоскости на дальнем плане.
Свойство ColorUndergroundHorizon представляет цвет поднятой нулевой плоскости на дальнем плане.
Returns: Возвращает цвет поднятой нулевой плоскости на дальнем плане.
Тип EntityColor.