Teigha.Runtime.FileStreamBuf.Rewind
Метод устанавливает на нуль текущую позицию файлового указателя в данном потоковом буфере.
Метод устанавливает на нуль текущую позицию файлового указателя в данном потоковом буфере.