Teigha.DatabaseServices.SweepOptions.Clone
Метод предназначен для клонирования данного объекта.
Метод предназначен для клонирования данного объекта.
Returns: Возвращает полный клон данного объекта. Тип Object.