Teigha.Geometry.Cylinder.Cylinder.#ctor
Конструктор по умолчанию класса Cylinder.
Конструктор по умолчанию класса Cylinder.
Создает бесконечный цилиндр с осью цилиндра (0,1,0), радиусом основания 2.0, началом в точке (0,0,0) и опорным направлением отсчета углов (1,0,0).