Teigha.DatabaseServices.LayoutCopiedEventArgs
Этот класс представляет данные для события LayoutCopied в диспетчере листов.
Этот класс представляет данные для события LayoutCopied в диспетчере листов.

Teigha.DatabaseServices.LayoutCopiedEventArgs.Id
Свойство представляет идентификатор объекта исходного листа.
Свойство представляет идентификатор объекта исходного листа.
Returns: Возвращает идентификатор объекта исходного листа. Тип ObjectId.

Teigha.DatabaseServices.LayoutCopiedEventArgs.Name
Свойство представляет имя исходного листа.
Свойство представляет имя исходного листа.
Returns: Возвращает имя листа. Тип String.

Teigha.DatabaseServices.LayoutCopiedEventArgs.NewId
Свойство представляет идентификатор объекта нового (скопированного) листа.
Свойство представляет идентификатор объекта нового (скопированного) листа.
Returns: Возвращает идентификатор объекта нового листа-копии. Тип ObjectId.

Teigha.DatabaseServices.LayoutCopiedEventArgs.NewName
Свойство представляет имя нового листа (копии).
Свойство представляет имя нового листа (копии).
Returns: Возвращает имя нового листа-копии. Тип String.