Teigha.DatabaseServices.MLeaderStyle.OverwritePropChanged
Метод позволяет проверить, были ли изменены свойства данного объекта.
Метод позволяет проверить, были ли изменены свойства данного объекта.
Returns: Возвращает true, если свойства были изменены.
В противном случае возвращает false.