Teigha.DatabaseServices.ObjectId.ConvertToRedirectedId
Метод преобразует ObjectId данного объекта, если он был перенаправлен из другой базы данных, в действительный идентификатор объекта в другой базе данных.
Метод принимает ObjectId данного объекта, если он был перенаправлен из другой базы данных, и преобразует его в действительный идентификатор объекта в другой базе данных (например: идентификатор объекта е базе данных внешних ссылок).
Если этот ID объекта не перенаправлен или имеет значение Null, функция не делает ничего.
Returns: Возвращает ObjectId.