Teigha.GraphicsInterface.GlobalIlluminationMode
Данное перечисление определяет доступные режимы общего освещения для материала.
Данное перечисление определяет доступные режимы общего освещения для материала.