Teigha.Geometry.Curve3d.GetReverseParameterCurve
Метод изменяет параметрическое направление кривой на противоположное.
Метод изменяет параметрическое направление кривой на противоположное.
Множество точек кривой остается неизменным, но параметрически направление кривой меняется на противоположное.
Returns: Возвращает кривую Curve3d с инвертированным направлением изменения параметра.