HostMgd.PlottingServices.PlotCancelledEventHandler
Делегат PlotCancelledEventHandler предназначен для обработки события PlotReactorManager.PlotCancelled,
возникающего, когда пользователь отменил вывод задания на плоттер.
Делегат PlotCancelledEventHandler предназначен для обработки события PlotReactorManager.PlotCancelled,
возникающего, когда пользователь отменил вывод задания на плоттер.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события,
а аргумент e содержит параметры события.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип EventArgs.