Teigha.GraphicsInterface.MaterialSpecularComponent.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Результирующая строка включает карту материала, цвет отражения и степень глянца.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.