Teigha.DatabaseServices.DatabaseSummaryInfoBuilder
Класс DatabaseSummaryInfoBuilder предназначен для создания объекта DatabaseSummaryInfo, в котором хранится набор строк с дополнительной информацией о файле .dwg.
Класс DatabaseSummaryInfoBuilder предназначен для создания объекта DatabaseSummaryInfo, в котором хранится набор строк с дополнительной информацией о файле .dwg.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.#ctor
Конструктор по умолчанию класса DatabaseSummaryInfoBuilder.
Конструктор по умолчанию класса DatabaseSummaryInfoBuilder.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.#ctor(Teigha.DatabaseServices.DatabaseSummaryInfo)
Конструктор класса, предназначенный для создания копии объекта DatabaseSummaryInfoBuilder.
Конструктор класса, предназначенный для создания копии объекта DatabaseSummaryInfoBuilder.
value: Исходный объект для копирования. Тип DatabaseSummaryInfo.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Author
Свойство обеспечивает доступ к имени автора.
Свойство обеспечивает доступ к имени автора.
Returns: Возвращает имя автора. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Comments
Свойство обеспечивает доступ к комментарию для объекта DatabaseSummaryInfo.
Свойство обеспечивает доступ к комментарию для объекта DatabaseSummaryInfo.
Returns: Возвращает комментарий. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.CustomProperties
Свойство обеспечивает доступ к объекту CustomProperties.
Устарело, используйте свойство CustomPropertyTable.
Свойство обеспечивает доступ к объекту CustomProperties.
Устарело, используйте свойство CustomPropertyTable.
Returns: Возвращает словарь StringDictionary.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.CustomPropertyTable
Свойство обеспечивает доступ к таблице пользовательских свойств.
Свойство обеспечивает доступ к таблице пользовательских свойств.
Returns: Возвращает словарь типа System.Collections.IDictionary.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.HyperlinkBase
Свойство обеспечивает доступ к базовому URL данного объекта.
Свойство обеспечивает доступ к базовому URL данного объекта.
Returns: Возвращает базовый URL. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Keywords
Свойство обеспечивает доступ к ключевым словам.
Свойство обеспечивает доступ к ключевым словам.
Returns: Возвращает строку с ключевыми словами. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.LastSavedBy
Свойство предоставляет доступ к данным о пользователе, который внёс в этот объект наиболее поздние изменения.
Свойство предоставляет доступ к данным о пользователе, который внёс в этот объект наиболее поздние изменения.
Returns: Возвращает значение LastSavedBy. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.RevisionNumber
Свойство обеспечивает доступ к номеру ревизии объекта.
Свойство обеспечивает доступ к номеру ревизии объекта.
Returns: Возвращает номер ревизии объекта. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Subject
Свойство предоставляет доступ к описанию назначения данного объекта или предметной области, к которой он относится.
Свойство предоставляет доступ к описанию назначения данного объекта или предметной области, к которой он относится.
Returns: Возвращает значение поля Subject. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfoBuilder.Title
Свойство обеспечивает доступ заголовку Title.
Свойство обеспечивает доступ заголовку Title.
Returns: Возвращает значение поля Title. Тип String