Teigha.DatabaseServices.PlotPaperUnit
Данное перечисление определяет единицы измерения при печати на бумажном носителе.
Данное перечисление определяет единицы измерения при печати на бумажном носителе.