Teigha.Runtime.RxVariant
Класс RxVariant реализует объекты Variant на платформе nanoCAD.
Класс RxVariant реализует объекты Variant на платформе nanoCAD.

Teigha.Runtime.RxVariant.#ctor
Конструктор по умолчанию класса RxVariant.
Конструктор по умолчанию класса RxVariant.

Teigha.Runtime.RxVariant.#ctor(System.Boolean)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного логического значения.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного логического значения.
value: Входное логическое значение. Тип bool.

Teigha.Runtime.RxVariant.#ctor(System.Double)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения double.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения double.
value: Входное значение. Тип double.

Teigha.Runtime.RxVariant.#ctor(System.Int16)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.Int16.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.Int16.
value: Входное значение. Тип System.Int16.

Teigha.Runtime.RxVariant.#ctor(System.Int32)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.Int32.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.Int32.
value: Входное значение. Тип System.Int32.

Teigha.Runtime.RxVariant.#ctor(System.Int64)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.Int64.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.Int64.
value: Входное значение. Тип System.Int64.

Teigha.Runtime.RxVariant.#ctor(System.IntPtr)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного указателя System.IntPtr.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного указателя System.IntPtr.
value: Входной указатель. Тип System.IntPtr.

Teigha.Runtime.RxVariant.#ctor(System.UInt16)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.UInt16.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.UInt16.
value: Входное значение. Тип System.UInt16.

Teigha.Runtime.RxVariant.#ctor(System.UInt32)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.UInt32.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения System.UInt32.
value: Входное значение. Тип System.UInt32.

Teigha.Runtime.RxVariant.#ctor(unsigned char)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения unsigned char.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения unsigned char.
value: Входное значение. Тип unsigned char.

Teigha.Runtime.RxVariant.#ctor(Teigha.Runtime.RXObject)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного объекта RXObject.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного объекта RXObject.
obj: Входное значение. Тип RXObject.

Teigha.Runtime.RxVariant.#ctor(String)
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения String.
Конструктор класса RxVariant.
Создает экземпляр класса на основе переданного значения String.
value: Входное значение. Тип String.

Teigha.Runtime.RxVariant.Boolean
Свойство Boolean представляет хранимое логическое значение.
Свойство Boolean представляет хранимое логическое значение.
Returns: Возвращает логическое значение. Тип bool.

Teigha.Runtime.RxVariant.Double
Свойство Double представляет хранимое значение типа double.
Свойство Double представляет хранимое значение типа double.
Returns: Возвращает вещественное значение. Тип double.

Teigha.Runtime.RxVariant.Int16
Свойство Int16 представляет 16-битное целое значение, хранящееся в данном объекте.
Свойство Int16 представляет 16-битное целое значение, хранящееся в данном объекте.
Returns: Возвращает 16-битное целое значение. Тип System.Int16.

Teigha.Runtime.RxVariant.Int32
Свойство Int32 представляет 32-битное целое значение, хранящееся в данном объекте.
Свойство Int32 представляет 32-битное целое значение, хранящееся в данном объекте.
Returns: Возвращает 32-битное целое значение. Тип System.Int32.

Teigha.Runtime.RxVariant.Int64
Свойство Int64 представляет 64-битное целое значение, хранящееся в данном объекте.
Свойство Int64 представляет 64-битное целое значение, хранящееся в данном объекте.
Returns: Возвращает 64-битное целое значение. Тип System.Int64.

Teigha.Runtime.RxVariant.Int8
Свойство Int8 представляет хранимое значение типа char.
Свойство Int8 представляет хранимое значение типа char.
Returns: Возвращает значение типа char.

Teigha.Runtime.RxVariant.IntPtr
Свойство IntPtr представляет хранимое значение типа System.IntPtr.
Свойство IntPtr представляет хранимое значение типа System.IntPtr.
Returns: Возвращает значение типа System.IntPtr.

Teigha.Runtime.RxVariant.Str
Свойство Str представляет хранимое значение типа String.
Свойство Str представляет хранимое значение типа String.
Returns: Возвращает значение типа String.

Teigha.Runtime.RxVariant.Type
Свойство Type представляет тип значения, хранящегося в данном объекте RxVariant.
Свойство Type представляет тип значения, хранящегося в данном объекте RxVariant.
Returns: Возвращает тип значения. Тип RxVariantType.

Teigha.Runtime.RxVariant.UInt16
Свойство UInt16 представляет хранимое значение типа System.UInt16.
Свойство UInt16 представляет хранимое значение типа System.UInt16.
Returns: Возвращает хранимое значение. Тип System.UInt16.

Teigha.Runtime.RxVariant.UInt32
Свойство UInt32 представляет хранимое значение типа System.UInt32.
Свойство UInt32 представляет хранимое значение типа System.UInt32.
Returns: Возвращает хранимое значение. Тип System.UInt32.

Teigha.Runtime.RxVariant.UInt8
Свойство UInt8 представляет хранимое значение типа unsigned char.
Свойство UInt8 представляет хранимое значение типа unsigned char.
Returns: Возвращает хранимое значение. Тип char.