Teigha.DatabaseServices.Rectangle3d.ToString
Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки.
Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки.
Возвращаемая строка содержит точки вершин данного прямоугольника в следующем порядке:
* Верхняя левая вершина.
* Верхняя правая вершина.
* Нижняя левая вершина.
* Нижняя правая вершина.
Returns: Возвращает эквивалентное строковое представление данного объекта. Тип String.