Teigha.Geometry.Surface
Класс Surface является абстрактным классом для всех параметрических поверхностей.
Класс Surface является абстрактным классом для всех параметрических поверхностей.

Teigha.Geometry.Surface.ClosestPointTo(Teigha.Geometry.Point3d)
Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке.
Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке.
Notes
Используется вызов метода Surface.ClosestPointTo(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
point: Входная точка, для которой следует найти ближайшую к ней точку на данной поверхности. Тип Point3d.
Returns: Возвращает точку на поверхности, минимально удаленную от точки point.
Тип Point3d.

Teigha.Geometry.Surface.ClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке в пределах заданной точности.
Метод вычисляет на данной поверхности точку, которая является ближайшей к указанной точке в пределах заданной точности.
point: Входная точка, для которой следует найти ближайшую к ней точку на данной поверхности. Тип Point3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает точку на поверхности, минимально удаленную от точки point.
Тип Point3d.

Teigha.Geometry.Surface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Surface.

Teigha.Geometry.Surface.DistanceTo(Teigha.Geometry.Point3d)
Метод вычисляет минимальное расстояние от заданной точки до этой поверхности.
Используется точность по умолчанию.
Метод вычисляет минимальное расстояние между заданной точкой point и этой поверхностью.
Notes
Используется вызов метода Surface.DistanceTo(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
point: Входная точка, минимальное расстояние до которой требуется определить. Тип Point3d.
Returns: Возвращает минимальное расстояние от точки point до данной поверхности.
Тип double.

Teigha.Geometry.Surface.DistanceTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод вычисляет минимальное расстояние от заданной точки до этой поверхности с заданной точностью.
Метод вычисляет минимальное расстояние между заданной точкой point и этой поверхностью.
Используется переданная в метод точность tolerance.
point: Входная точка, минимальное расстояние до которой требуется определить. Тип Point3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает минимальное расстояние от точки point до данной поверхности.
Тип double.

Teigha.Geometry.Surface.EvaluatePoint(Teigha.Geometry.Point2d)
Метод вычисляет 3D-точку на данной поверхности, которая соответствует указанной параметрической точке.
Метод вычисляет 3D-точку на данной поверхности, которая соответствует указанной параметрической точке.
parameter: Входная точка (U,V) в пространстве параметров поверхности. Тип Point2d.
Returns: Возвращает 3D-точку, которая соответствует входным значениям параметров (U,V).
Тип Point3d.

Teigha.Geometry.Surface.GetClosestPointTo(Teigha.Geometry.Point3d)
Метод находит на поверхности точку, которая в пределах точности по умолчанию является ближайшей к некоторой заданной 3D-точке.
Метод находит на поверхности точку, которая в пределах точности по умолчанию является ближайшей к некоторой заданной 3D-точке.
Notes
Используется вызов метода Surface.GetClosestPointTo(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
point: Входная произвольная точка в пространстве. Тип Point3d.
Returns: Возвращает точку на поверхности, которую с предписанной точностью можно считать ближайшей к заданной точке point.
Тип PointOnSurface.

Teigha.Geometry.Surface.GetClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод находит на поверхности точку, которая в пределах указанной точности является ближайшей к некоторой заданной 3D-точке.
Метод находит на поверхности точку, которая в пределах указанной точности является ближайшей к некоторой заданной 3D-точке.
point: Входная произвольная точка в пространстве. Тип Point3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает точку на поверхности, которую с предписанной точностью можно считать ближайшей к заданной точке point.
Тип PointOnSurface.

Teigha.Geometry.Surface.IsClosedInU(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении U в пределах некоторой заданной точности.
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении U в пределах заданной точности tolerance.
Предполагает реализацию в производных классах.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данную поверхность можно считать замкнутой в направлении U.
В противном случае возвращает false.

Teigha.Geometry.Surface.IsClosedInV(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V в пределах некоторой заданной точности.
Метод позволяет проверить, является ли данная поверхность замкнутой в направлении V в пределах заданной точности tolerance.
Предполагает реализацию в производных классах.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данную поверхность можно считать замкнутой в направлении V.
В противном случае возвращает false.

Teigha.Geometry.Surface.IsOn(Teigha.Geometry.Point3d,[Out]Point2d%)
Метод проверяет принадлежность указанной 3D-точки данной поверхности в пределах точности по умолчанию.  Для точки на поверхности метод вычисляет соответствующую ей параметрическую 2D-точку (U, V) в параметрическом пространстве поверхности.
Метод проверяет принадлежность указанной 3D-точки данной поверхности в пределах точности по умолчанию.  Для точки на поверхности метод вычисляет соответствующую ей параметрическую 2D-точку (U, V) в параметрическом пространстве поверхности.
Notes
Используется вызов метода Surface.IsOn(Point3d point, Point2d parameterPoint, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
point: Входная точка в пространстве моделирования. Тип Point3d.
parameterPoint: Выходная точка. Тип Point2d. Представляет в пространстве параметров входную точку point, если та в пределах используемой точности принадлежит данной поверхности.
Returns: Возвращает true, если в пределах используемой точности точка point лежит на данной поверхности.
В противном случае возвращает false.

Teigha.Geometry.Surface.IsOn(Teigha.Geometry.Point3d,[Out]Point2d%,Teigha.Geometry.Tolerance)
Метод проверяет принадлежность указанной 3D-точки данной поверхности в пределах заданной точности.  Для точки на поверхности метод вычисляет соответствующую ей параметрическую 2D-точку (U, V) в параметрическом пространстве поверхности.
Метод проверяет принадлежность указанной 3D-точки данной поверхности в пределах заданной точности tolerance.  Для точки на поверхности метод вычисляет соответствующую ей параметрическую 2D-точку (U, V) в параметрическом пространстве поверхности.
point: Входная точка в пространстве моделирования. Тип Point3d.
parameterPoint: Выходная точка. Тип Point2d. Представляет в пространстве параметров входную точку point, если та в пределах используемой точности принадлежит данной поверхности.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах используемой точности точка point лежит на данной поверхности.
В противном случае возвращает false.

Teigha.Geometry.Surface.ParameterOf(Teigha.Geometry.Point3d)
Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную
3D-точку на поверхности в пространстве моделирования. Используется точность по умолчанию.
Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную
3D-точку на поверхности в пространстве моделирования.
Работу выполняет вызов метода Surface.ParameterOf(Point3d point, Tolerance tolerance) с точностью по умолчанию Tolerance.Global.
Notes
Входная точка point обязана находиться на данной поверхности.
Чтобы в этом убедиться, используйте метод IsOn().
point: Входная точка на поверхности, для которой требуется вычислить соответствующую параметрическую 2D-точку. Тип Point3d.
Returns: Возвращает 2D-точку в параметрическом пространстве, которая соответствует входной 3D-точке point в пространстве моделирования.
Тип Point2d.

Teigha.Geometry.Surface.ParameterOf(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную
3D-точку на поверхности в пространстве моделирования. Используется заданная геометрическая точность.
Метод вычисляет параметрическую точку (U, V), которая в параметрическом пространстве поверхности представляет указанную
3D-точку на поверхности в пространстве моделирования.
Используется геометрическая точность tolerance.
Notes
Входная точка point обязана находиться на данной поверхности.
Чтобы в этом убедиться, используйте метод IsOn().
point: Входная точка на поверхности, для которой требуется вычислить соответствующую параметрическую 2D-точку. Тип Point3d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает 2D-точку в параметрическом пространстве, которая соответствует входной 3D-точке point в пространстве моделирования.
Тип Point2d.

Teigha.Geometry.Surface.IsNormalReversed
Свойство IsNormalReversed позволяет проверить, была ли нормаль этой поверхности инвертирована нечетное количество раз.
Свойство IsNormalReversed позволяет проверить, была ли нормаль этой поверхности инвертирована нечетное количество раз.
Returns: Возвращает true, если ориентация нормали поверхности соответствует направлению  - partialU.crossProduct(partialV).normalize().
Возвращает false, если направление нормали совпадает с  + partialU.crossProduct(partialV).normalize().

Teigha.Geometry.Surface.ReverseNormal
Свойство ReverseNormal инвертирует ориентацию нормали данной поверхности.
Свойство ReverseNormal инвертирует ориентацию нормали данной поверхности.
Возвращаемая поверхность геометрически остается без изменений, но нормаль получает обратное направление.
Notes
Направление нормали поверхности вычисляется либо по формуле  + partialU.crossProduct(partialV).normalize(), либо
по формуле  - partialU.crossProduct(partialV).normalize().
При создании поверхности всегда используется положительное направление нормали.
Returns: Возвращает поверхность с обратным направлением нормали.
Тип Surface.