Teigha.BoundaryRepresentation.VertexLoopEnumerator
Класс VertexLoopEnumerator представляет представляет перечислитель циклов, связанных с вершиной.
Класс VertexLoopEnumerator представляет представляет перечислитель циклов, связанных с вершиной.

Teigha.BoundaryRepresentation.VertexLoopEnumerator.Current
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Свойство Current предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип BoundaryLoop.