Teigha.DatabaseServices.Surface.GetArea
Метод предназначен для вычисления общей площади данной поверхности.
Метод предназначен для вычисления общей площади данной поверхности.
Метод вычисляет площадь одной стороны поверхности.
Notes
Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
Returns: Возвращает площадь одной стороны данной поверхности. Тип double.