!!OVERLOADED_Methods_GetObjectSaveVersion_Teigha.DatabaseServices.DBObject
Чтобы определить, какую версию данного объекта сохранить, необходимо переопределить этот метод.
Чтобы определить, какую версию данного объекта сохранить, необходимо переопределить этот метод. Это не требует обращения к
данному методу родительского класса.
Notes
Предупреждение
Не следует использовать Dwg(Dxf)Filer-\>Dwg(Dxf)Version() в ваших методах
dwg(In/Out) и dxf(In/Out) — это не работает в
экземплярах, производных от вашего класса. Вместо этого
используйте GetObjectSaveVersion().