Teigha.DatabaseServices.Entity.Highlight
Метод предназначен для подсвечивания геометрического объекта на экране.
Если объект использует графическую очередь для регенерации,
перед вызовом метода необходимо вручную обновить отображение с
помощью Draw() или TransactionManager.FlushGraphics(),
иначе подсветка не будет отображена.
Использование метода
Метод подсвечивает все геометрические объекты на экране.
Не является необходимым соответствие каждого вызова метода
Highlight() с вызовом метода Unhighlight(). Вызов метода
Unhighlight() снимает выделение геометрического объекта
независимо от того, сколько раз до этого вызывался метод
Highlight().
Предупреждение
Если геометрический объект, для которого вызывается данный
метод, имеет графическую очередь для регенерации (это
означает, что изменения, сделанные в объекте, сразу не
отображаются на экране), то этот метод не приводит к
подсветке. Также, вызов этого метода для геометрического
объекта, который открыт на запись и графика которого ставится
в очередь для регенерации, может снять nanoCAD.
Чтобы снять это ограничение, перед вызовом метода
Highlight(), вы должны очистить очередь графики вызовом
метода Draw() или вызвать метод
TransactionManager.FlushGraphics().
Разработка метода в производных классах
Реализация метода Entity.Highlight() делает всю необходимую
работу для подсветки любых геометрических подобъектов
объекта. Поэтому, нет необходимости переопределять этот
метод, за исключением случая, когда вы хотите выполнить
некоторые до- или после- операционные действия, или вы хотите
отменить возможность подсвечивать геометрические подобъекты.
Если метод переопределен и он подсвечивает геометрические
подобъекты, то метод Entity.Highlight() должен быть вызван в
некоторой точке переопределенного метода, чтобы выполнить
реальное подсвечивание.