Teigha.GraphicsInterface.GIRasterImage
Класс GIRasterImage представляет абстракцию растрового изображения в графической подсистеме платформы.
Класс GIRasterImage представляет абстракцию растрового изображения в графической подсистеме платформы.

Teigha.GraphicsInterface.GIRasterImage.CalcBMPScanLineSize(unsigned int,unsigned int)
Метод предоставляет размер в байтах одной строки развертки в формате BMP для данного растрового объекта.
Метод предоставляет размер в байтах одной строки развертки в формате BMP для данного растрового объекта.
pixelWidth: Ширина изображения в пикселях. Тип unsigned int.
colorDepth: Глубина цветности изображения в битах на один пиксель. Тип unsigned int.
Returns: Возвращает размер в байтах одной строки изображения.
Тип int.

Teigha.GraphicsInterface.GIRasterImage.ChangeImageSource(Teigha.GraphicsInterface.RasterImageSource)
Метод позволяет задать для данного объекта новый источник изображения и получить дескриптор этого растрового изображения.
Метод позволяет задать для данного объекта новый источник изображения и получить дескриптор этого растрового изображения.
source: Новый источник изображения. Тип RasterImageSource.
Returns: Возвращает дескриптор измененного растрового изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.ChangeTransparencyMode(Teigha.GraphicsInterface.TransparencyMode)
Метод задает режим прозрачности для форматов с глубиной цветности 32 бита на пиксель и возвращает дескриптор этого растрового изображения.
Метод позволяет задать режим прозрачности для форматов с глубиной цветности 32 бита на пиксель и возвращает дескриптор этого растрового изображения.
mode: Режим прозрачности. Перечисление TransparencyMode.
Returns: Возвращает изображение с указанным режимом прозрачности. Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.Convert(System.Boolean,System.Double,System.Double,System.Double,Drawing.Color,System.Boolean,System.Boolean,System.Boolean,Teigha.GraphicsInterface.GIRasterImage)
Метод позволяет изменить яркость, контраст, затухание, цвет фона данного изображения, опционально преобразовать его палитру в формат RGB и применить к изображению зеркальные отражения и поворот на угол 90°, а также импортировать ряд иных настроек из другого изображения.
Метод позволяет изменить яркость, контраст, затухание, цвет фона данного изображения, опционально преобразовать его палитру в формат RGB и применить к изображению зеркальные отражения относительно осей X и Y и поворот на угол 90°, а также импортировать ряд иных настроек из другого изображения.
convertPaletteToRGB: Флаг преобразования палитры изображения. Тип bool. В случае значения true, палитра преобразуется в формат RGB.
brightness: Новое значение яркости изображения в диапазоне [0 .. 100]. Тип double.
contrast: Новое значение контраста изображения в диапазоне [0 .. 100]. Тип double.
fade: Новое значение затухания изображения в диапазоне [0 .. 100]. Тип double.
backgroundColor: Новый цвет фона изображения. Тип System.Drawing.Color.
flipX: Если установлено значение true, к изображению применяется зеркальное отражение относительно оси X. Тип bool.
flipY: Если установлено значение true, к изображению применяется зеркальное отражение относительно оси Y. Тип bool.
rotate90: Если установлено значение true, изображение будет повернуто на угол 90°. Тип bool.
image: Изображение, из которого заимствуется ряд прочих настроек, таких как ширина, высота, графический формат, глубина цветности и т.д. Тип GIRasterImage.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.Crop(UInt32,UInt32,UInt32,UInt32)
Метод обрезает данное растровое изображение по указанному прямоугольному контуру. Формат изображения не изменяется.
Метод позволяет обрезать данное растровое изображение по указанному прямоугольному контуру.
Формат результирующего изображения идентичен формату исходного.
x: Координата X начальной точки прямоугольного контура обрезки. Тип UInt32.
y: Координата Y начальной точки прямоугольного контура обрезки. Тип UInt32.
width: Ширина прямоугольного контура обрезки. Тип UInt32.
height: Высота прямоугольного контура обрезки. Тип UInt32.
Returns: Возвращает дескриптор преобразованного изображения.
Тип GIRasterImage.

Teigha.GraphicsInterface.GIRasterImage.DefaultResolution([Out] double,[Out] double)
Метод предоставляет разрешение по умолчанию по каждой из осей.
Метод предоставляет разрешение по умолчанию для данного изображения по осям X и Y.
xPelsPerUnit: Разрешение по умолчанию по оси X в пикселях. Тип double.
yPelsPerUnit: Разрешение по умолчанию по оси Y в пикселях. Тип double.
Returns: Возвращает единицу измерения длины для выходных параметров xPelsPerUnit и yPelsPerUnit.
Тип Units.

Teigha.GraphicsInterface.GIRasterImage.getColor(UInt32)
Метод предоставляет цвет по его индексу в палитре данного объекта.
Метод позволяет получить цвет по его индексу в цветовой палитре данного объекта.
colorIndex: Входной индекс цвета в палитре. Тип UInt32.
Returns: Возвращает цвет с индексом colorIndex в цветовой палитре данного объекта.
Тип System.Drawing.Color.

Teigha.GraphicsInterface.GIRasterImage.ScanLines(System.Int32,System.Int32)
Метод позволяет извлечь из данного растрового объекта указанный диапазон строк развертки в формате BMP.
Метод позволяет извлечь из данного растрового объекта указанный диапазон строк развертки в формате BMP.
firstScanline: Индекс первой извлекаемой строки развертки. Тип int.
numLines: Количество извлекаемых строк развертки. Тип int.
Returns: Возвращает массив строк развертки растрового изображения в формате BMP.
Тип unsigned char[].

Teigha.GraphicsInterface.GIRasterImage.ColorDepth
Свойство ColorDepth представляет глубину цветности данного растрового объекта.
Свойство ColorDepth представляет глубину цветности данного растрового объекта.
Returns: Возвращает глубину цветности. Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImage.imageSource
Свойство imageSource представляет тип источника данного растрового объекта.
Свойство imageSource представляет тип источника данного растрового объекта (напр., файл, рендер, подложка и т.д.).
Returns: Возвращает тип источника изображения из перечисления RasterImageSource.

Teigha.GraphicsInterface.GIRasterImage.ImgTransparencyMode
Свойство ImgTransparencyMode представляет текущий режим прозрачности данного растрового объекта.
Свойство ImgTransparencyMode представляет текущий режим прозрачности данного растрового объекта (для форматов с глубиной цветности 32 бита на пиксель).
Returns: Возвращает режим прозрачности растрового изображения. Перечисление TransparencyMode.

Teigha.GraphicsInterface.GIRasterImage.NumColors
Свойство NumColors представляет количество цветов в данном растровом изображении.
Свойство NumColors представляет количество цветов в данном растровом изображении.
Returns: Возвращает количество цветов в растровом изображении.
Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImage.PaletteDataSize
Свойство PaletteDataSize представляет размер цветовой палитры данного объекта.
Свойство PaletteDataSize представляет размер цветовой палитры данного объекта.
Returns: Возвращает размер цветовой палитры растрового изображения.
Тип int.

Teigha.GraphicsInterface.GIRasterImage.PixelHeight
Свойство PixelHeight представляет высоту изображения в пикселях.
Свойство PixelHeight представляет высоту изображения в пикселях.
Returns: Возвращает высоту изображения в пикселях.
Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImage.PixelWidth
Свойство PixelWidth представляет ширину изображения в пикселях.
Свойство PixelWidth представляет ширину изображения в пикселях.
Returns: Возвращает ширину изображения в пикселях.
Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImage.ScanLinesAlignment
Свойство ScanLinesAlignment представляет величину выравнивания строк развертки для данного растрового объекта.
Свойство ScanLinesAlignment представляет величину выравнивания строк развертки для данного растрового объекта.
Returns: Возвращает величину выравнивания строк развертки.
Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImage.ScanLineSize
Свойство ScanLineSize представляет размер в байтах одной строки развертки в данном растровом объекте.
Свойство ScanLineSize представляет размер в байтах одной строки развертки в данном растровом объекте с учетом выравнивания.
Returns: Возвращает размер строки развертки в байтах (с учетом выравнивания).
Тип unsigned int.

Teigha.GraphicsInterface.GIRasterImage.TransparentColor
Свойство TransparentColor представляет прозрачный цвет для данного объекта.
Свойство TransparentColor представляет цвет , который интерпретируется как прозрачный в данном растровом изображении.
Returns: Возвращает индекс прозрачного цвета. Тип int.