HostMgd.EditorInput.DraggingEventArgs
Класс предоставляет дополнительные данные о событии,
возникающем перед началом операции перетаскивания в nanoCAD.
Класс является производным от EventArgs и используется для передачи
контекстной информации при возникновении события, связанного
с началом операции перетаскивания. Он содержит данные и методы,
позволяющие получить информацию о текущем состоянии перетаскивания,
взаимодействовать с реакторами и при необходимости изменить
поведение операции до её начала.
Данный класс применяется совместно с делегатом DraggingEventHandler.
Example
C#

HostMgd.EditorInput.DraggingEventArgs.#ctor(String)
Конструктор создаёт новый экземпляр класса DraggingEventArgs,
используя приглашающее сообщение.
Конструктор инициализирует объект класса DraggingEventArgs,
который используется для передачи контекстной информации в обработчики событий,
связанных с началом операции перетаскивания.
Он принимает строковый параметр — приглашение, которое может отображаться пользователю
перед началом перетаскивания.
prompt: Сообщение-приглашение, связанное с операцией перетаскивания

HostMgd.EditorInput.DraggingEventArgs.Prompt
Свойство предоставляет строку запроса, отображаемую пользователю при начале операции перетаскивания.
Свойство возвращает текстовое сообщение, которое выводится в командной строке nanoCAD
перед началом операции перетаскивания. Оно может использоваться для информирования пользователя
о текущем действии или указании дальнейших шагов.
Это свойство доступно только для чтения и инициализируется при создании объекта DraggingEventArgs.
Returns: Возвращает значение типа string, представляющее собой строку запроса (приглашения)
к пользователю — например, "Перетащите объект сюда".
Если запрос не задан, может вернуть пустую строку или null.
Example
C#