Teigha.BoundaryRepresentation.BrepEdgeCollection
Класс BrepEdgeCollection представляет набор ребер, соответствующих граничному представлению.
Класс BrepEdgeCollection представляет набор ребер, соответствующих граничному представлению.