Teigha.DatabaseServices.Line
Этот класс представляет геометрический объект "линия"
nanoCAD.
Этот класс представляет геометрический объект "линия"
nanoCAD. Объект линия представляет собой 3D объект,
определенный своей начальной и конечными точками, а также
вектором нормали. Кроме того, объект "линия" поддерживает
ширину, вдоль направления вектора нормали (это, высота или
"выталкивание").

Teigha.DatabaseServices.Line.#ctor
Конструктор по умолчанию. Инициализирует объект с вектором
нормали (0,0,1), начальной и конечными точками, равными
(0,0,0) и шириной, равной 0.0. Все координаты задаются в WCS.

Teigha.DatabaseServices.Line.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Этот конструктор инициализирует объект "линия" с
использованием параметров, задающих начальную и конечную
точки. Обе точки должны быть в WCS координатах.
stPoint: Точка начала линии (в WCS координатах)
endPoint: Точка конца линии (в WCS координатах)

Teigha.DatabaseServices.Line.Angle
Возвращает угол линии в радианах относительно мировой
координатной системы.

Teigha.DatabaseServices.Line.Delta
Возвращает вектор, полученный из начальной и конечной точек
линии.

Teigha.DatabaseServices.Line.Length
Возвращает длину линии.

Teigha.DatabaseServices.Line.Normal
Обеспечивает доступ к единичному вектору нормали к линии в
мировой системе координат.

Teigha.DatabaseServices.Line.EndPoint
Обеспечивает доступ к координатам конечной точки линии в
мировых координатах.

Teigha.DatabaseServices.Line.StartPoint
Обеспечивает доступ к координатам начальной точки линии в
мировых координатах.

Teigha.DatabaseServices.Line.Thickness
Обеспечивает доступ к значению ширины линии. Ширина
представляет собой размер линии вдоль направления ее вектора
нормали (иногда называемого направлением "вытеснения").