Teigha.Geometry.Vector3dCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для данной коллекции.
Тип Vector3dCollectionEnumerator.