Teigha.DatabaseServices.SectionManager
Класс SectionManager используется для управления секущими плоскостями в базе данных.
Класс SectionManager используется для управления секущими плоскостями в базе данных.

Teigha.DatabaseServices.SectionManager.#ctor
Конструктор по умолчанию класса SectionManager.
Конструктор по умолчанию класса SectionManager.

Teigha.DatabaseServices.SectionManager.GetSection(String)
Метод позволяет получить секущую плоскость по указанному имени в базе данных.
Метод позволяет получить секущую плоскость по указанному имени в базе данных.
pszName: Входное имя секущей плоскости. Тип String.
Returns: Возвращает идентификатор объекта секущей плоскости.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.SectionManager.GetUniqueSectionName(String)
Метод позволяет получить уникальное имя секущей плоскости.
Метод позволяет получить уникальное имя секущей плоскости.
pszBaseName: Базовое имя секущей плоскости. Тип String.
Returns: Возвращает уникальное имя секущей плоскости. Тип String.

Teigha.DatabaseServices.SectionManager.LiveSection
Свойство LiveSection представляет в базе данных идентификатор объекта активной в данный момент секущей плоскости.
Свойство LiveSection представляет в базе данных идентификатор объекта активной в данный момент секущей плоскости.
Returns: Возвращает идентификатор объекта секущей плоскости.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.SectionManager.NumSections
Свойство NumSections представляет количество секущих плоскостей в базе данных.
Свойство NumSections представляет количество секущих плоскостей в базе данных.
Returns: Возвращает количество секущих плоскостей. Тип int.