Teigha.GraphicsInterface.LinetypeCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет объект перечислителя для данной коллекции.
Returns: Возвращает объект перечислителя для данной коллекции.
Тип IEnumerator.