Teigha.DatabaseServices.XrefRedirectedEventArgs
Класс XrefRedirectedEventArgs представляет данные для события XrefRedirected базы данных.
Класс XrefRedirectedEventArgs представляет данные для события XrefRedirected базы данных.

Teigha.DatabaseServices.XrefRedirectedEventArgs.NewId
Свойство NewId представляет идентификатор объекта записи таблицы символов, на которую перенаправляется запись таблицы символов внешней ссылки.
Свойство NewId представляет идентификатор объекта записи таблицы символов, на которую перенаправляется запись таблицы символов внешней ссылки.
Returns: Возвращает идентификатор объекта записи таблицы символов.
Тип ObjectId.

Teigha.DatabaseServices.XrefRedirectedEventArgs.OldId
Свойство OldId представляет идентификатор объекта записи таблицы символов внешней ссылки, к которой в данный момент применяется перенаправление.
Свойство OldId представляет идентификатор объекта записи таблицы символов внешней ссылки, к которой в данный момент применяется перенаправление.
Returns: Возвращает идентификатор объекта записи таблицы символов.
Тип ObjectId.