Teigha.GraphicsInterface.LightAttenuation
Класс LightAttenuation представляет параметры затухания излучения источника света.
Класс LightAttenuation представляет параметры затухания излучения источника света.

Teigha.GraphicsInterface.LightAttenuation.#ctor
Конструктор по умолчанию класса LightAttenuation.
Конструктор по умолчанию класса LightAttenuation.
Создает объект с отсутствующим затуханием излучения источника света.
Начальный предел затухания равен 1.0, а конечный предел затухания равен 10.0.
Пределы затухания не используются.

Teigha.GraphicsInterface.LightAttenuation.Equals(Object)
Метод предназначен для проверки на равенство данного объекта и указанного объекта.
Метод предназначен для проверки на равенство данного объекта и указанного объекта.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.LightAttenuation.SetLimits(System.Double,System.Double)
Метод определяет диапазон расстояний от источника света, в пределах которого излучаемый свет оказывает влияние на модель.
Метод определяет диапазон расстояний от источника света, в пределах которого излучаемый свет оказывает влияние на модель.
startLimit: Нижняя  граница диапазона затухания. Тип double.
endLimit: Верхняя граница диапазона затухания. Тип double.

Teigha.GraphicsInterface.LightAttenuation.AttenuationType
Свойство AttenuationType представляет тип затухания излучения источника света.
Свойство AttenuationType представляет тип затухания излучения источника света (отсутствует, линейное, квадратичное).
Returns: Возвращает тип затухания излучения источника света.
Значение из перечисления GraphicsInterface.AttenuationType.

Teigha.GraphicsInterface.LightAttenuation.EndLimit
Свойство EndLimit представляет верхнюю границу диапазона затухания излучения источника света.
Свойство EndLimit представляет верхнюю границу диапазона затухания излучения источника света.
На удалении свыше EndLimit от источника света, его излучение уже перестает оказывать влияние на сцену.
Returns: Возвращает расстояние от источника света, свыше которого излучение источника уже не оказывает никакого влияния на сцену.
Тип double.

Teigha.GraphicsInterface.LightAttenuation.StartLimit
Свойство StartLimit представляет нижнюю границу диапазона затухания излучения источника света.
Свойство StartLimit представляет нижнюю границу диапазона затухания излучения источника света.
Когда расстояние от источника света достигает значения StartLimit, его излучение начинает оказывать влияние на сцену.
Влиянием источника на объекты, расположенные к источнику ближе этого расстояния, пренебрегаем.
Returns: Возвращает расстояние от источника света, начиная с которого его излучение уже оказывает влияние на сцену.
Тип double.

Teigha.GraphicsInterface.LightAttenuation.UseLimits
Свойство UseLimits позволяет определить, используется ли диапазон затухания излучения источника света.
Свойство UseLimits позволяет определить, используется ли диапазон затухания излучения источника света.
Returns: Возвращает true, если диапазон затухания излучения используется.
В противном случае возвращает false.