HostMgd.EditorInput.PickPointSelectedObject
Класс, описывающий подобъект, который выбранн по одиночной
точке выбора.

HostMgd.EditorInput.PickPointSelectedObject.PickPoint
Возвращает точку выбора, которая была использована при выборе
объекта.

HostMgd.EditorInput.PickPointSelectedObject.#ctor(Teigha.DatabaseServices.ObjectId,HostMgd.EditorInput.SelectionMethod,System.Int32,HostMgd.EditorInput.PickPointDescriptor)
Конструктор.
id: ID объекта
method: Метод выбора
gsMarker: GS маркеры
descriptor: Описание выбора точки