Teigha.Geometry.AugmentedPolylineCurve3d
Класс AugmentedPolylineCurve3d представляет математический объект, используемый для поддержки различных типов сплайновых кривых в трехмерном пространстве.
Класс AugmentedPolylineCurve3d представляет математический объект, используемый для поддержки различных типов сплайновых кривых в трехмерном пространстве.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor
Конструктор по умолчанию класса AugmentedPolylineCurve3d.
Конструктор по умолчанию класса AugmentedPolylineCurve3d.
Создает объект без присвоения действительных данных.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor(Teigha.Geometry.Curve3d,System.Double,System.Double,System.Double)
Конструктор класса AugmentedPolylineCurve3d.
Создает полилинию, которая аппроксимирует переданную кривую в указанном параметрическом диапазоне с заданной точностью.
Конструктор класса AugmentedPolylineCurve3d.  Создает полилинию, которая аппроксимирует переданную кривую с заданной точностью в указанном параметрическом диапазоне.
Все вершины полилинии лежат на входной кривой curve.
Максимальное отклонение входной кривой на любом сегменте полилинии не превышает заданную точность eps.
curve: Входная 3D-кривая.  Тип Curve3d.
fromParameter: Входная начальная точка параметрического диапазона, на котором выполняется аппроксимация кривой. Тип double.
toParameter: Входная конечная  точка параметрического диапазона, на котором выполняется аппроксимация кривой. Тип double.
eps: Заданная точность аппроксимации кривой.  Тип double.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection)
Конструктор класса AugmentedPolylineCurve3d.
Создает экземпляр класса с указанными управляющими вершинами, узлами и векторами.
Конструктор класса AugmentedPolylineCurve3d.
Создает экземпляр класса с указанными управляющими вершинами, узлами и векторами.
knots: Входной узловой вектор.  Тип KnotCollection.
controlPoints: Входной массив управляющих 3D-вершин.  Тип Point3dCollection.
vectorBundle: Входной массив 3D-векторов.  Тип Vector3dCollection.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection)
Конструктор класса AugmentedPolylineCurve3d.
Создает трехмерную полилинию с заданным вектором в каждой управляющей вершине.
Конструктор класса AugmentedPolylineCurve3d.
Создает трехмерную полилинию с заданным вектором в каждой управляющей вершине.
controlPoints: Входной массив 3D управляющих вершин.     Тип Point3dCollection.
vectorBundle: Массив 3D-векторов для вершин полилинии.  Тип Vector3dCollection.

Teigha.Geometry.AugmentedPolylineCurve3d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта AugmentedPolylineCurve3d на основе переданного указателя.
Метод предназначен для создания объекта AugmentedPolylineCurve3d на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на базе которого создается новый объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый объект.  Тип AugmentedPolylineCurve3d.

Teigha.Geometry.AugmentedPolylineCurve3d.GetD2VectorAt(System.Int32)
Метод предоставляет вектор второй производной по указанному индексу.
Метод предоставляет вектор второй производной по указанному индексу.
index: Индекс извлекаемого вектора. Тип int.
Returns: Возвращает вектор второй производной.  Тип Vector3d.

Teigha.Geometry.AugmentedPolylineCurve3d.GetPointAt(System.Int32)
Метод позволяет получить точку с указанным индексом.
Метод позволяет получить точку с указанным индексом.
index: Входной индекс искомой точки. Тип int.
Returns: Возвращает точку с указанным индексом.
Тип Point3d.

Teigha.Geometry.AugmentedPolylineCurve3d.GetVectorAt(System.Int32)
Метод позволяет получить вектор с указанным индексом.
Метод позволяет получить вектор с указанным индексом.
index: Входной индекс искомого вектора. Тип int.
Returns: Возвращает вектор с указанным индексом.
Тип Vector3d.

Teigha.Geometry.AugmentedPolylineCurve3d.SetD2VectorAt(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет задать вектор второй производной с указанным индексом.
Метод позволяет задать вектор второй производной с указанным индексом.
index: Входной индекс вектора.  Тип int.
point: Входной вектор второй производной.  Тип Vector3d.

Teigha.Geometry.AugmentedPolylineCurve3d.SetPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет задать новое положение точки с указанным индексом.
Метод позволяет задать новое положение точки с указанным индексом.
index: Входной индекс точки.  Тип int.
point: Новые координаты точки.  Тип Point3d.

Teigha.Geometry.AugmentedPolylineCurve3d.SetVectorAt(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет задать вектор с указанным индексом.
Метод позволяет задать вектор с указанным индексом.
index: Входной индекс вектора.  Тип int.
point: Входной вектор.  Тип Vector3d.

Teigha.Geometry.AugmentedPolylineCurve3d.ApproximateTolerance
Свойство ApproximateTolerance представляет точность, которая использовалась при аппроксимации данной полилинией трехмерной кривой.
Свойство ApproximateTolerance представляет точность, которая использовалась при аппроксимации данной полилинией трехмерной кривой.
Returns: Возвращает точность аппроксимации.  Тип double.

Teigha.Geometry.AugmentedPolylineCurve3d.D1Vectors
Свойство D1Vectors предоставляет доступ к коллекции касательных векторов в вершинах полилинии.
Свойство D1Vectors предоставляет доступ к коллекции касательных векторов в вершинах полилинии.
Returns: Возвращает коллекцию касательных векторов в вершинах полилинии.  Тип Vector3dCollection.

Teigha.Geometry.AugmentedPolylineCurve3d.D2Vectors
Свойство D2Vectors предоставляет доступ к коллекции векторов второй производной в вершинах полилинии.
Свойство D2Vectors предоставляет доступ к коллекции векторов второй производной в вершинах полилинии.
Returns: Возвращает коллекцию векторов второй производной в вершинах полилинии.
Тип Vector3dCollection.

Teigha.Geometry.AugmentedPolylineCurve3d.Points
Свойство Points предоставляет доступ к коллекции точек, которые определяют данную полилинию.
Свойство Points предоставляет доступ к коллекции точек, которые определяют данную полилинию.
Returns: Возвращает коллекцию точек.  Тип Point3dCollection.