HostMgd.EditorInput.InputPointContext.GetKeyPointEntities
Метод предназначен для получения массива геометрических объектов,
участвующих в вычислении привязанной точки (оснапа).
Метод используется в контексте интерактивного ввода точки и возвращает набор объектов,
которые непосредственно участвуют в определении положения привязанной (osnapped) точки.
Эти объекты являются основой для расчёта координат при использовании режимов объектной привязки (OSNAP),
таких как конечная точка, пересечение, центр, касательная и других.
Этот метод особенно полезен при реализации пользовательских фильтров ввода (PointFilter) или мониторов (PointMonitor),
где требуется анализировать, к каким именно объектам производится привязка,
чтобы корректно обработать или визуализировать результат.
Returns: Возвращает массив объектов типа FullSubentityPath[], каждый из которых указывает на:
* ObjectId контейнера (полного объекта),
* путь к подобъекту (например, сегменту, ребру, грани), если применимо.
Если привязка не активна — возвращается пустой массив.
Если привязка выполнена к одиночному объекту — массив содержит один элемент.
При сложных привязках (например, пересечение) — может содержать два и более элемента.
Example
C#