HostMgd.EditorInput.JigPromptDistanceOptions.GetDefaultValueString
Вспомогательный метод. Предназначен для преобразования значения расстояния по умолчанию в строку (string).
Метод преобразовывает значение свойства DefaultValue в строку.
Returns: Возвращает строку string, в которой указано значение расстояния, заданное по умолчанию.