Teigha.GraphicsInterface.MaterialDiffuseComponent.ToString
Метод предоставляет эквивалентное строковое представление данного объекта.
Метод предоставляет эквивалентное строковое представление данного объекта, содержащее информацию о цвете и текстуре материала.
Returns: Возвращает строковое представление данного объекта.
Тип String.