Teigha.DatabaseServices.Viewport.UpdateDisplay
Метод обновляет представление на экране, чтобы отразить изменения в данном видовом экране.
Метод обновляет изображение данного видового экрана, приводя его в соответствие с произошедшими изменениями.