HostMgd.Windows.ToolPalette.CustomToolBase.DragLeave
Метод вызывается, когда перетаскиваемый объект стандартного инструмента покидает область панели инструментов.
Не реализован.
Метод предназначен для поддержки панелями инструментов процесса перетаскивания (Drag-and-Drop) и вызывается, когда перетаскиваемый объект стандартного инструмента покидает область панели инструментов.
В текущей версии не реализован.