Teigha.GraphicsInterface.ContextForDbDatabase
Класс ContextForDbDatabase представляет операции и свойства, используемые для векторизации объектов базы данных.
Класс ContextForDbDatabase представляет операции и свойства, используемые для векторизации объектов базы данных.

Teigha.GraphicsInterface.ContextForDbDatabase.#ctor(DatabaseServices.Database)
Конструктор класса ContextForDbDatabase.
Создает контекст с базой данных для векторизации.
Конструктор класса ContextForDbDatabase.
Создает контекст с базой данных для векторизации.
A_0: База данных, для которой создается контекст. Тип DatabaseServices.Database.

Teigha.GraphicsInterface.ContextForDbDatabase.LoadPlotStyleTable(Teigha.Runtime.StreamBuf)
Метод загружает в данный объект контекста указанную таблицу стилей чертежа.
Метод загружает в данный объект контекста указанную таблицу стилей чертежа.
pStreamBuf: Потоковый буфер для чтения данных. Тип StreamBuf.

Teigha.GraphicsInterface.ContextForDbDatabase.SetPlotGeneration(System.Boolean)
Метод управляет опцией печати чертежа.
Метод управляет опцией печати чертежа.
A_0: Входной флаг печати. Тип bool. Для генерации печати следует передать значение true

Teigha.GraphicsInterface.ContextForDbDatabase.Database
Свойство Database представляет базу данных, которая векторизуется в данный момент.
Свойство Database представляет базу данных, которая векторизуется в данный момент.
Returns: Возвращает векторизуемую базу данных.
Тип DatabaseServices.Database.

Teigha.GraphicsInterface.ContextForDbDatabase.EnableConstantModelSpaceLineweights
Свойство EnableConstantModelSpaceLineweights управляет режимом использования постоянных весов линий.
Свойство EnableConstantModelSpaceLineweights управляет режимом использования постоянных весов линий.
Returns: Возвращает true, если режим использования постоянных весов линий включен.
В противном случае возвращает false.

Teigha.GraphicsInterface.ContextForDbDatabase.IsBoundaryClipping
Свойство IsBoundaryClipping позволяет проверить, активна ли в данный момент обрезка по границам.
Свойство IsBoundaryClipping представляет флаг режима обрезки по границам.
Returns: Возвращает true, если обрезка по границам в данный момент активна.
В противном случае возвращает false.

Teigha.GraphicsInterface.ContextForDbDatabase.IsPlotGeneration
Свойство IsPlotGeneration позволяет проверить, включена ли опция печати чертежа.
Свойство IsPlotGeneration позволяет проверить, включена ли опция печати чертежа.
Returns: Возвращает true, если печать чертежа включена.
В противном случае возвращает false.

Teigha.GraphicsInterface.ContextForDbDatabase.IsPostScriptOut
Свойство IsPostScriptOut позволяет проверить, предполагает ли данный контекст вывод в формате PostScript.
Свойство IsPostScriptOut позволяет проверить, предполагает ли данный контекст вывод в формате PostScript.
Returns: Возвращает true, если данный контекст предполагает вывод в формате PostScript.
В противном случае возвращает false.

Teigha.GraphicsInterface.ContextForDbDatabase.PaletteBackground
Свойство PaletteBackground представляет цвет фона в используемой палитре.
Свойство PaletteBackground представляет цвет фона в используемой палитре.
Returns: Возвращает цвет фона в палитре.
Тип System.Drawing.Color.

Teigha.GraphicsInterface.ContextForDbDatabase.UseGsModel
Свойство UseGsModel позволяет определить, предполагает ли данный контекст отрисовку с использованием GS-модели.
Свойство UseGsModel позволяет определить, предполагает ли данный контекст отрисовку объектов базы данных с использованием GS-модели.
Returns: Возвращает true, если отрисовка объектов базы данных предполагает использование GS-модели.
В противном случае возвращает false.