Teigha.Runtime.Marshaler
Класс Marshaler представляет служебные методы для преобразования растровых изображений и путей подобъектов между управляемыми объектами и неуправляемыми указателями.
Класс Marshaler представляет служебные методы для преобразования растровых изображений и путей подобъектов между управляемыми объектами и неуправляемыми указателями.  Предназначен для разработчиков, которым требуется реализовать взаимодействие между их собственными объектами C++ и управляемым кодом.

Teigha.Runtime.Marshaler.BitmapInfoToBitmap(IntPtr)
Метод позволяет преобразовать BitmapInfo в объект Bitmap.
Метод позволяет преобразовать BitmapInfo в объект Bitmap.
bitmapInfo: Входной объект с информацией о растровом изображении. Тип IntPtr.
Returns: Возвращает сформированное изображение. Тип System.Drawing.Bitmap.

Teigha.Runtime.Marshaler.BitmapToBitmapInfo(Drawing.Bitmap)
Метод позволяет преобразовать объект Bitmap в BitmapInfo.
Метод позволяет преобразовать объект Bitmap в BitmapInfo.
bitmap: Входное изображение.  Тип Drawing.Bitmap.
Returns: Возвращает указатель BitmapInfo. Тип IntPtr.

Teigha.Runtime.Marshaler.CopyToManagedFullSubentityPath(IntPtr)
Метод преобразует переданный путь в управляемый объект пути.
Метод преобразует переданный путь в управляемый объект пути.
Предназначен для разработчиков, которым требуется реализовать взаимодействие между их собственными объектами C++ и управляемым кодом.
path: Входной путь. Тип IntPtr.
Returns: Возвращает полный путь к подобъекту.  Тип FullSubentityPath.

Teigha.Runtime.Marshaler.CopyToUnmanagedFullSubentityPath(Teigha.DatabaseServices.FullSubentityPath,IntPtr)
Метод преобразует переданный путь в неуправляемый объект пути.
Метод преобразует переданный путь в неуправляемый объект пути.
Предназначен для разработчиков, которым требуется реализовать взаимодействие между их собственными объектами C++ и управляемым кодом.
path: Входной полный путь к подобъекту.   Тип FullSubentityPath.
newPath: Выходной неуправляемый объект пути. Тип IntPtr.

Teigha.Runtime.Marshaler.ViewportDraw(IntPtr,System.Boolean)
Метод преобразует переданный неуправляемый объект в управляемый объект ViewportDraw.
Метод преобразует переданный неуправляемый объект в управляемый объект ViewportDraw.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает результат преобразования. Тип GraphicsInterface.ViewportDraw.

Teigha.Runtime.Marshaler.WorldDraw(IntPtr,System.Boolean)
Метод преобразует переданный неуправляемый объект в управляемый объект WorldDraw.
Метод преобразует переданный неуправляемый объект в управляемый объект WorldDraw.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает результат преобразования. Тип GraphicsInterface.WorldDraw.