Teigha.GraphicsInterface.EdgeVisibilityModes
Перечисление EdgeVisibilityModes представляет битовые флаги, комбинация которых определяет видимость рёбер геометрических объектов при отрисовке.
Перечисление EdgeVisibilityModes представляет битовые флаги, определяющие видимость рёбер геометрических объектов при отрисовке.
Комбинация флагов для сложных режимов отрисовки рёбер задается с помощью побитового ИЛИ (OR).