HostMgd.ApplicationServices.TabbedDialogEventHandler
Делегат используется для обработки событий, возникающих в диалоговых окнах с вкладками.
Делегат TabbedDialogEventHandler используется классом TabbedDialogExtension для обработки событий в диалоговых окнах с вкладками, например, возникающих при нажатии кнопок.
Контекст события передается через параметры sender и e, где e передает параметры и действия, относящиеся к событиям диалога с вкладками.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип TabbedDialogEventArgs.