HostMgd.EditorInput.PromptOptions.UseDefaultValue
Признак использования значения по умолчанию.
Возвращает или устанавливает признак использования значения по умолчанию.
Returns: Возвращает признак использования значения по умолчанию. true - значение по умолчанию используется, false - значение по умолчанию не используется.