Teigha.Colors.Transparency
Класс реализует объекты, которые представляют информацию о прозрачности объектов Drawable.
Класс реализует объекты, которые представляют информацию о прозрачности объектов Drawable.

Teigha.Colors.Transparency.#ctor(Teigha.Colors.TransparencyMethod)
Конструктор создает новый экземпляр Transparency, используя входной объект TransparencyMethod.
Конструктор создает новый экземпляр Transparency, используя входной объект TransparencyMethod.
method: Входной объект для копирования.  Тип TransparencyMethod.

Teigha.Colors.Transparency.#ctor(unsigned char)
Конструктор создает новый экземпляр Transparency с использованием входного символа.
Конструктор создает новый экземпляр Transparency с использованием входного символа.
alpha: Входной символ. Тип unsigned char.

Teigha.Colors.Transparency.Equals(Object)
Метод проверяет идентичность объектов Transparency.
Метод используется для проверки идентичности данного и входного объектов.
obj: Объект, проверяемый на идентичность. Тип Object.
Returns: Возвращает true, если данный объект идентичен объекту obj.
В противном случае возвращает false.

Teigha.Colors.Transparency.ToString(IFormatProvider)
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек.
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек, определяемых указанным провайдером.
provider: Провайдер формата региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Colors.Transparency.!=(Teigha.Colors.Transparency,Teigha.Colors.Transparency)
Оператор неравенства.
Оператор неравенства.
a: Левый операнд.  Тип Transparency.
b: Правый операнд. Тип Transparency.
Returns: Возвращает true, если a не равен b. В противном случае возвращает false.

Teigha.Colors.Transparency.==(Teigha.Colors.Transparency,Teigha.Colors.Transparency)
Оператор равенства.
Оператор равенства.
a: Левый операнд.  Тип Transparency.
b: Правый операнд. Тип Transparency.
Returns: Возвращает true, если a равен b. В противном случае возвращает false.

Teigha.Colors.Transparency.Alpha
Свойство предоставляет альфа-значение данного объекта Transparency.
Свойство предоставляет альфа-значение данного объекта Transparency.
Диапазон допустимых значений варьируется от значения 0, означающего полную прозрачность, до значения 255, которое соответствует полной непрозрачности.
Returns: Возвращает альфа-значение. Тип Byte.
0 - полная прозрачность, 255 - полная непрозрачность.

Teigha.Colors.Transparency.IsByAlpha
Свойство позволяет проверить, что методом задания прозрачности является ByAlpha.
Свойство позволяет проверить, что методом задания прозрачности является ByAlpha.
Returns: Возвращает true, если метод задания прозрачности - ByAlpha. В противном случае возвращает false.

Teigha.Colors.Transparency.IsByBlock
Свойство позволяет проверить, что методом задания прозрачности является ByBlock.
Свойство позволяет проверить, что методом задания прозрачности является ByBlock.
Returns: Возвращает true, если используется метод задания прозрачности ByBlock. В противном случае возвращает false.

Teigha.Colors.Transparency.IsByLayer
Свойство позволяет проверить, что методом задания прозрачности является ByLayer.
Свойство позволяет проверить, что методом задания прозрачности является ByLayer.
Returns: Возвращает true, если используется метод задания прозрачности ByLayer. В противном случае возвращает false.

Teigha.Colors.Transparency.IsClear
Свойство позволяет проверить, что для данного объекта Transparency методом задания прозрачности является ByALpha, и значение альфа равно нулю, что соответствует совершенно прозрачному состоянию.
Свойство позволяет проверить, что для данного объекта Transparency методом задания прозрачности является ByALpha, и значение альфа равно нулю, что соответствует совершенно прозрачному состоянию.
Returns: Возвращает true, если для задания прозрачности используется метод ByALpha, и значение альфа равно нулю.
В противном случае возвращает false.

Teigha.Colors.Transparency.IsSolid
Свойство позволяет проверить, что для данного объекта Transparency методом задания прозрачности является ByALpha, и значение альфа равно 255, что соответствует совершенно непрозрачному состоянию.
Свойство позволяет проверить, что для данного объекта Transparency методом задания прозрачности является ByALpha, и значение альфа равно 255, что соответствует совершенно непрозрачному состоянию.
Returns: Возвращает true, если для задания прозрачности используется метод ByALpha, а значение альфа равно 255.
В противном случае возвращает false.