Teigha.GraphicsInterface.LinetypeCollection.Clear
Метод очищает данную коллекцию.
Метод очищает данную коллекцию типов линий.
После выполнения метода количество элементов в данной коллекции становится равным нулю.