Teigha.GraphicsSystem.SelectionReactorResult.Break
Значение: 1.
Процесс выявления коллизий прерван.
Может быть полезно, например, для процедуры обнаружения коллизий, которой неважно, какие именно объекты участвуют в коллизии.