Teigha.Colors.EntityColorCollectionEnumerator
Класс EntityColorCollectionEnumerator представляет перечислитель для класса EntityColorCollection.
Класс EntityColorCollectionEnumerator представляет перечислитель для класса EntityColorCollection.

Teigha.Colors.EntityColorCollectionEnumerator.Current
Свойство Current возвращает текущий элемент коллекции.
Свойство Current возвращает текущий элемент коллекции.
Returns: Возвращает текущий элемент перечислителя. Тип Object.