HostMgd.EditorInput.Editor.PromptedForSelection
Событие возникает после завершения операции выбора объектов в редакторе nanoCAD,
предоставляя доступ к набору выбранных элементов.
Событие не реализовано.
Событие инициируется системой .NET API nanoCAD после завершения интерактивного выбора
одного или нескольких геометрических объектов — например, через методы GetSelection(),
SelectAll() или при использовании рамки выделения.
Оно предоставляет результат выборки в виде объекта SelectionSet,
а также статус операции (OK, Cancel, Error и др.).
Это позволяет разработчикам надстроек реагировать на изменения в выборке,
обрабатывать выделенные объекты или отменять выполнение команды
на основе пользовательского ввода.
Событие реализуется через делегат PromptSelectionResultEventHandler, который передаёт:
* источник события ,
* объект PromptSelectionResultEventArgs ,
содержащий результат выбора: SelectionSet,
статус, строковое представление ввода и параметры приглашения.
Example
C#