Teigha.DatabaseServices.Hatch
Класс представляет объект "штриховка" или "заливка" на чертеже.
Hatch (заливка) является геометрическим объектом на
плоскости, который может быть создан и размещен на
произвольной плоскости в 3D пространстве.
Плоскость заливки может быть однозначно определена по
значению вектора нормали в WCS (Мировых координатах) и
расстоянию от начала координат (в WCS) до плоскости заливки.
Плоскость заливки принимает стандартную систему координат
объекта nanoCAD (OCS). Ее начало совпадает с WCS источника,
а оси X и Y вычисляются с использованием алгоритма задания
осей nanoCAD.
Контур заливки определяет область, заполняемую определенным
образцом заливки. Внутреннее представление контура заливки
состоит из набора петель на плоскости. Каждая такая петля
состоит из коллекции ребер, дуг окружности и эллипса или
сплайнов. Если контур заливки содержит две или более петель,
области внутри каждой из них должны быть полностью не
связанными или быть полностью включены одна в другую.
Петля должна быть простой и протяженной, пересекающей саму
себя только в конечной точке. Более того, ее начальная и
конечная точки должны совпадать. При определении контура
заливки, приложение должно убедиться, что замкнутые линии и
ребра полностью определены. Если контур содержит две или
более петель, они должны быть организованы во вложенные
структуры, в которых внешняя петля создается первой, затем
все вложенные петли в том порядке, как они вложены одна в
другую. Если есть более чем одна внешняя петля контура, то
этот процесс повторяется. nanoCAD обеспечивает некоторые
проверки корректности контура заливки, чтобы обеспечить
эффективность и производительность API.
Внутреннее представление ребер контура заливки производится
объектами GELIB в геометрии 2D, включая LineSegment2d,
CircularArc2d, EllipticalArc2d и NurbCurve2d. Если контур
заливки содержит полилинию, то конструирование петель
производится с помощью специальных методов.
Ассоциативная заливка позволяет приложению создать объект
заливки, ассоциированный с контуром существующих в nanoCAD
объектов, таких как LINE, ARC, CIRCLE, ELLIPSE, SPLINE,
POLYLINE, TEXT, MTEXT, ATTRIBUTE DEFINITION, ATTRIBUTE,
SHAPE, SOLID, TRACE, TOLERANCE, REGION, VIEWPORT, 3D FACE,
BLOCK INSERT, XREF, LWPOLYLINE, RASTER и т.д. Когда вы
редактируете исходную геометрию, объект заливки будет
автоматически учитывать эти изменения.
При использовании пользовательских геометрических объектов,
вы должны определить метод разрыва для него, чтобы заливка
работала. Ваш метод разрыва должен разбить ваш геометрический
объект на более простые объекты. Этот может потребовать,
чтобы Hatch рекурсивно вызывал метод разрыва геометрических
объектов, возвращаемых этим же методом до тех пор, пока не
произойдет разбивка на встроенные геометрические объекты
nanoCAD.
При определении контура заливки с использованием
геометрических объектов в существующей базе данных,
приложение должно гарантировать, что выбранные объекты имеют
корректный контур заливки и являются компланарными с
плоскостью заливки. Выбранные объекты должны также
формировать однозначные определения петель. Вам также
необходимо установить признак ассоциативности до установки
контура заливки. Если контур заливки не удовлетворяет
указанным требованиям, результат может быть непредсказуемым
при создании заливки и ее заполнении.
Mультилинии и сложные геометрические объекты, которые могут
порождать более чем одну петлю, отклоняются в качестве границ
заливки. Если вы используете API Hatch и выбираете объект
MLine для заливки, заливка не будет отображена. Для того
чтобы работать с таким объектом, вы должны разорвать
мультилинию, получить результирующие ребра и строить границы
уже по ним. Если метод Mline.Explode() создает множество
ребер, которые не создают простой замкнутой линии, вы можете
создать регион, используя ребра для создания объекта Region.
Вы можете затем разбить регион для получения простых
замкнутых линий и передать их в объект Hatch.
В настоящее время nanoCAD поддерживает три типа Образцов
заливки — пользовательская, стандартная и ранее созданная
пользовательская. Для получения дополнительной информации,
смотрите описание перечисления HatchPatternType.
Следующие методы позволяют приложению установить или получить
данные образцов, относящиеся к ее наполнению. Если вы
используете Hatch.PatternScale (или любые из свойств
образцов), значение масштаба изменяется, но на экране
отображение заливки не меняется. Вам необходимо использовать
Hatch.Pattern после изменения масштаба образца, угла наклона
линий, имени и т.д. Один вызов метода достаточен для
применения всех сделанных изменений наполнения.
nanoCAD поддерживает три стиля заливки — "Нормальный", "Внешний",
и "Игнорировать". Для получения дополнительной информации
смотрите описание перечисления HatchStyle.
После определения контура заливки и определения образца и
стиля заливки, приложение должно выполнить создание линий
заливки или ее сплошное заполнение для отображения. Класс
Hatch обслуживает и вычисляет линии заливки и ее сплошное
заполнение для поддержки методов WorldDraw() и ViewportDraw()
для отображения объекта заливки. Тем не менее, вычисленные
линии заливки и сплошное наполнение не сохраняются с чертежом
или DXF файлом для экономии размера файла. nanoCAD
перевычисляет линии заливки или ее сплошное наполнение, когда
DWG или DXF файл открывается в nanoCAD.
Если определение петель контура заливки или ее ребра
удаляются или меняются, приложение должно перерасчитать линии
заливки или ее сплошное заполнение для обновления
отображения.
Определение петель контура заливки и ее ребра не
отображаются. Это не создает проблем, поскольку объект
заливки всегда сопоставлен с существующей геометрией базы
данных nanoCAD.

Teigha.DatabaseServices.Hatch.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Hatch.AppendLoop(Teigha.DatabaseServices.HatchLoop)
\ \
Этот метод добавляет новую петлю контура (полилинию) объекта
заливки.
hatchLoop: Тип петли

Teigha.DatabaseServices.Hatch.AppendLoop(Teigha.DatabaseServices.HatchLoopTypes,Teigha.DatabaseServices.ObjectIdCollection)
\ \
Метод добавляет новую петлю контура (путь или полилинию) к
объекту заливки. Параметр loopType определяет тип для
контура, который должен быть в перечислении Default или
External. Параметр dbObjIds определяет множество Id объектов,
из которых состоит петля границы. Id объектов будут
поддерживаться, если объект заливки является ассоциированным.
loopType: Тип замкнутой линии
dbObjIds: Множество Id объектов

Teigha.DatabaseServices.Hatch.EvaluateGradientColorAt(System.Single)
Метод обеспечивает способ для вычисления вставляемого цвета с
учетом заданного определения градиента и цвета, который
вычисляется как определенное значение вдоль изменения
градиента. Возвращает градиент цвета, вычисленный в указанном
диапазоне. Этот диапазон задается параметром метода.
value: Нормализованная величина [0.0...1.0], по которой

Teigha.DatabaseServices.Hatch.EvaluateHatch(System.Boolean)
Метод вычисляет линии заливки или ее сплошное наполнение для
объекта заливки с использованием определенного образца. Для
обычных образцов заливок, за исключением сплошной, метод
выполняет расчет пересечений между линиями заданного образца
и кривыми контура для формирования линий заливки. Для
сплошной заливки, метод производит разбивку области заливки
на треугольники и заполнение этих сцепленных треугольников
указанным цветом.
Note
Убедитесь, что вы вызываете метод SetHatchPattern() перед
использованием данного метода, для того чтобы изображение
обновлялось.

Teigha.DatabaseServices.Hatch.GetAssociatedObjectIdsAt(System.Int32)
Метод возвращает все Id объектов исходных контуров,
ассоциированных с выбранной петлей контура.
loopIndex: Индекс для определения выбранной петли контура

Teigha.DatabaseServices.Hatch.GetHatchLineDataAt(System.Int32)
Метод возвращает линию данных заливки из объекта заливки.
index: Номер линии объекта заливки, которая должна быть

Teigha.DatabaseServices.Hatch.GetLoopAt(System.Int32)
Эта функция возвращает определение петли (полилинии)
выбранной петли контура объекта заливки. Параметр loopIndex
определяет индекс выбранной петли.
Пустое множество может быть возвращено, если петля полилинии
содержит только сегменты линий.
loopIndex: Индекс выбранной петли

Teigha.DatabaseServices.Hatch.GetPatternDefinitionAt(System.Int32)
Метод возвращает определение линий образца для рисовки
объекта заливки по заданному индексу образца.
index: Индекс образца

Teigha.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Teigha.DatabaseServices.HatchLoop)
Метод вставляет новую петлю контура (путь или полилинию) в
объект заливки. Параметр loopIndex задает индекс, под которым
петля будет вставлена в список петель контура заливки.
hatchLoop задает тип петли.
loopIndex: Индекс вставляемой петли
hatchLoop: Тип петли

Teigha.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Teigha.DatabaseServices.HatchLoopTypes,Teigha.DatabaseServices.ObjectIdCollection)
Метод вставляет новую петлю контура (путь или полилинию) в
объект заливки. Параметр loopIndex задает индекс, под которым
петля будет вставлена в список петель контура заливки.
hatchLoop задает тип петли. dbObjIds представляет множество
Id объектов, которые составляют петлю контура. Id объектов
будут использоваться, если объект заливки является
ассоциированным.
loopIndex: Индекс вставляемой петли
loopType: Тип петли
dbObjIds: Множество Id объектов

Teigha.DatabaseServices.Hatch.LoopTypeAt(System.Int32)
Метод возвращает тип петли выбранной петли контура из
геометрического объекта.
loopIndex: Индекс выбранной петли

Teigha.DatabaseServices.Hatch.RemoveLoopAt(System.Int32)
Метод удаляет петлю и все ее данные из объекта заливки.
loopIndex: Индекс удаляемой петли

Teigha.DatabaseServices.Hatch.SetGradient(Teigha.DatabaseServices.GradientPatternType,String)
Метод представляет механизм для задания определения
заполнения градиента.
gradientType: Тип градиента
gradientName: Имя градиента для применения

Teigha.DatabaseServices.Hatch.SetGradientColors(array)
Метод предоставляет механизм для определения цветов, который
должен быть применен к градиента. В простейшем случае,
определение содержит начальный и конечный цвета. Начальный
цвет относится к colors[0], а конечный — к colors[count-1].
Текущая реализация поддерживает не более двух цветов. Объект
Hatch создает копию переданного в качестве параметра массива.
value: Массив действительных чисел, представляющих

Teigha.DatabaseServices.Hatch.SetHatchPattern(Teigha.DatabaseServices.HatchPatternType,String)
Метод устанавливает и тип образца, и его имя для объекта
заливки. patternType определяет номер в перечислениях
UserDefined (пользовательский), PreDefined (стандартный), или
CustomDefined (ранее определенный пользователем). patternName
задает имя образца, которое может быть установлено в NULL для
типа образца UserDefined.
Для типа образца UserDefined (пользовательское) вам может
потребоваться использование методов SetPatternAngle(angle),
SetPatternSpace (space), and SetPatternDouble (double) для
определения данных образца до вызова данного метода.
Для типа образца PreDefined (стандартный), метод читает
данные образца из стандартного файла nanoCAD acad.pat и
заносит их в объект заливки.
Для типа CustomDefined вы должны предоставить ваш собственный
.pat файл, имя которого должно совпадать с именем образца
заливки. Например, вы должны сохранить образец заливки TEST в
файл с именем test.pst и файл должен находиться в каталоге, в
котором он может быть найден nanoCAD.
Когда вы используете не предопределенный образец, вы также
можете определить масштаб и угол для того, чтобы изменить вид
заливки.
Note
Убедитесь, что вы вызвали метод SetPattern() до вызова метода
Hatch.EvaluateHatch.
patternType: Номер в перечислении типа образца
patternName: Имя образца

Teigha.DatabaseServices.Hatch.Associative
Обеспечивает доступ к признаку, устанавливаемому в true или
false в зависимости от того, ассоциируется ли объект заливки
со своей исходной геометрией границ. Исходная геометрия
границ должна быть представлена резидентными объектами базы
данных nanoCAD, такими как линия, дуга и т.д. Использование
ассоциированной заливки обеспечивает автоматическое
перевычисление линий заливки при изменении исходной геометрии
границ.

Teigha.DatabaseServices.Hatch.Elevation
Обеспечивает доступ к расстоянию между плоскостью заливки и
началом мировых координат.

Teigha.DatabaseServices.Hatch.GradientAngle
Возвращает угол, в радианах, под которым применяется текущее
определение градиента.

Teigha.DatabaseServices.Hatch.GradientName
Обеспечивает доступ к имени текущего градиента.

Teigha.DatabaseServices.Hatch.GradientOneColorMode
Обеспечивает доступ к признаку, является ли градиент
переходящим от исходного к конечному цвету (двухцветный), или
от цвета к яркому варианту того же цвета (одноцветный). В
последнем случае, вариант с полной яркостью является
"окрашенным", а с нулевой яркостью — "затемненным".

Teigha.DatabaseServices.Hatch.GradientShift
Возвращает текущее интерполированное значение между значением
определения градиента по умолчанию и измененным значением.

Teigha.DatabaseServices.Hatch.GradientType
Возвращает eнумератор, определяющий тип образца градиента.

Teigha.DatabaseServices.Hatch.HatchObjectType
Обеспечивает доступ к текущему состоянию объекта градиент.

Teigha.DatabaseServices.Hatch.HatchStyle
Обеспечивает доступ к стилю заливки объекта заливки.

Teigha.DatabaseServices.Hatch.IsGradient
Возвращает признак того, что объект имеет градиент.

Teigha.DatabaseServices.Hatch.IsHatch
Возвращает признак того, что объект заливки является
образцом, а не сплошной или градиентно заполненной заливкой.

Teigha.DatabaseServices.Hatch.IsSolidFill
Возвращает признак того, что объект заливки сконфигурирован
для сплошной заливки.

Teigha.DatabaseServices.Hatch.Normal
Обеспечивает доступ к вектору нормали для объекта заливки.
Вектор нормали выражен в мировых координатах и нормализован к
единичной длине.

Teigha.DatabaseServices.Hatch.NumberOfHatchLines
Возвращает общее количество линий заливки, которые есть в
объекте заливки. Линии заливки объекта вычисляет функция
EvaluateHatch().
Свойство возвращает 0, если образец заливки является
сплошным.

Teigha.DatabaseServices.Hatch.NumberOfLoops
Возвращает общее количество петель контура в объекте заливки.
Петли контура определяют области, которые будут заливаться.

Teigha.DatabaseServices.Hatch.NumberOfPatternDefinitions
Возвращает общее количество образцов определения линий в
образце объекта заливки.

Teigha.DatabaseServices.Hatch.Origin
Обеспечивает доступ к исходной точке для образца заливки для
объекта заливки. Эта точка возвращается в мировых
координатах.

Teigha.DatabaseServices.Hatch.PatternAngle
Обеспечивает доступ к углу наклона образца (в радианах)
объекта заливки.

Teigha.DatabaseServices.Hatch.PatternDouble
Обеспечивает доступ к значению признака двойного образца для
объекта заливки.

Teigha.DatabaseServices.Hatch.PatternName
Возвращает имя образца для объекта заливки.

Teigha.DatabaseServices.Hatch.PatternScale
Обеспечивает доступ к масштабу образца для объекта заливки.

Teigha.DatabaseServices.Hatch.PatternSpace
Обеспечивает доступ к размеру образца объекта заливки.

Teigha.DatabaseServices.Hatch.PatternType
Возвращает тип образца как элемент перечислений UserDefined,
PreDefined или CustomDefined для объекта заливки.

Teigha.DatabaseServices.Hatch.ShadeTintValue
Обеспечивает доступ к значению яркости одноцветного
градиента.