Teigha.DatabaseServices.RasterImageDef.Load
Эта функция использует "ленивую загрузку" данных растрового
изображения из исходного файла (определенного
RasterImageDef.SourceFileName) в объект OdGiRasterImage.
Необходимо, чтобы RasterImageDef был открыт на запись).
Уведомления будут посланы всем зависимым геометрическим
объектам RasterImage для их перерисовки.
Заметим, что при ленивой загрузке, изображение физически не
загружается в память до тех пор, пока оно не потребуется
(например, чтобы появиться на экране). Уведомление может быть
задержано до того, как изображение физически будет загружено.