Teigha.BoundaryRepresentation.MassProperties
Класс MassProperties представляет массо-центровочные характеристики объекта BREP - объем, масса, центр тяжести, радиусы инерции, моменты инерции твердого тела, центробежные моменты инерции, главные моменты и главные оси объекта BREP.
Класс MassProperties представляет массо-центровочные характеристики объекта BREP:
* Объем объекта;
* Масса (численно равна объему, если не указана плотность, отличающаяся от единицы);
* Центр тяжести;
* Радиусы инерции;
* Моменты инерции;
* Центробежные моменты инерции;
* Главные моменты;
* Главные оси.
Notes
Массо-центровочные характеристики определены лишь для тех объектов BREP, для которых определено свойство объема.

Teigha.BoundaryRepresentation.MassProperties.Centroid
Свойство Centroid предоставляет доступ к центру тяжести твердого тела.
Свойство Centroid предоставляет доступ к центру тяжести твердого тела.
Returns: Возвращает точку центра тяжести твердого тела.
Тип Point3d.

Teigha.BoundaryRepresentation.MassProperties.Mass
Свойство Mass представляет массу твердого тела.
Свойство Mass представляет массу твердого тела.
Масса численно равна объему объекта, если не указана плотность, отличающаяся от единицы.
Returns: Возвращает массу твердого тела.
Тип double.

Teigha.BoundaryRepresentation.MassProperties.MomentsOfIntertia
Свойство MomentsOfIntertia предоставляет доступ к моментам инерции твердого тела.
Свойство MomentsOfIntertia предоставляет доступ к моментам инерции твердого тела.
Returns: Возвращает моменты инерции твердого тела.
Тип Vector3d.

Teigha.BoundaryRepresentation.MassProperties.PrincipalMoments
Свойство PrincipalMoments предоставляет доступ к главным моментам твердого тела.
Свойство PrincipalMoments предоставляет доступ к главным моментам твердого тела.
Returns: Возвращает главные моменты твердого тела.
Тип Vector3d.

Teigha.BoundaryRepresentation.MassProperties.ProductsOfIntertia
Свойство ProductsOfIntertia представляет центробежные моменты инерции твердого тела.
Свойство ProductsOfIntertia представляет центробежные моменты инерции твердого тела.
Returns: Возвращает центробежные моменты инерции.
Тип Vector3d.

Teigha.BoundaryRepresentation.MassProperties.RadiiOfGyration
Свойство RadiiOfGyration представляет радиусы инерции твердого тела.
Свойство RadiiOfGyration представляет радиусы инерции твердого тела.
Returns: Возвращает радиусы инерции твердого тела.
Тип Vector3d.

Teigha.BoundaryRepresentation.MassProperties.Volume
Свойство Volume представляет объем твердого тела.
Свойство Volume представляет объем твердого тела.
Returns: Возвращает объем твердого тела.
Тип double.