Teigha.DatabaseServices.Transaction.GetAllObjects
Метод формирует коллекцию всех объектов, открытых в этой транзакции на данный момент.
Метод формирует коллекцию всех объектов, открытых в этой транзакции на данный момент.
Returns: Возвращает коллекцию объектов, тип DBObjectCollection.