HostMgd.Runtime.AngularUnitFormat
Перечисление возможных форматов угловых единиц.
Члены                       Описание
--------------------------  -----------------------------------
Current = -1                Текущий формат угловых единиц
Degrees = 0                 Градусы
DegreesMinutesSeconds = 1   ГрадусыМинутыСекунды
Grads = 2                   Грады
Radians = 3                 Радианы
Surveyor = 4                Топографические единицы