HostMgd.ApplicationServices.BeginDoubleClickEventArgs
Класс предназначен для хранения информации о событии двойного щелчка.
Класс представляет собой тип данных для параметров, относящихся к событиям
двойного щелчка.
Содержит параметры, относящиеся к событиям
двойного щелчка.
Содержит параметры, относящиеся к событиям
двойного щелчка.

HostMgd.ApplicationServices.BeginDoubleClickEventArgs.Location
Свойство предназначено для хранения координат точки на чертеже, где произошел двойной щелчек.
В свойстве хранятся координатф точки на чертеже, где произошел двойной щелчек левой клавишей мыши.
Указывает координаты события
переменной.
Указывает координаты события
переменной.
Returns: Возвращает координаты точки. Тип .