Teigha.DatabaseServices.DBObject.GetPersistentReactorIds
Метод предназначен для получения коллекции идентификаторов постоянных реакторов данного объекта.
Метод предоставляет коллекцию идентификаторов постоянных реакторов данного объекта.
Returns: Возвращает идентификаторы постоянных реакторов этого объекта. Тип ObjectIdCollection