HostMgd.EditorInput.PromptPointOptionsEventHandler
Делегат предназначен для обработки события, возникающего при начале операции ввода точки,
и позволяет программно настраивать параметры приглашения.
Делегат используется как сигнатура метода-обработчика для событий,
связанных с началом интерактивного ввода точки в nanoCAD — таких как PromptingForCorner
или PromptingForPoint. Он позволяет разработчикам надстроек и плагинов изменять параметры ввода, например:
* текст приглашения (Message),
* базовую точку (BasePoint),
* режимы привязки ,
* ограничения по вводу .
Это даёт возможность гибко управлять поведением команды ввода точки,
в зависимости от контекста или текущего состояния чертежа.
sender: Источник события — обычно экземпляр редактора (Editor), в котором происходит ввод точки.
e: Объект, содержащий данные о параметрах ввода точки