HostMgd.ApplicationServices.InplaceTextEditor.StackPropertyDialog
Метод вызывает диалоговое окно свойств дробного текста.
В текущей версии не реализован.
Метод вызывает диалоговое окно свойств дробного текста.
Оно позволяет настроить как верхний и нижний текст, так и опции форматирования дробного текста (стиль, выравнивание, высота текста).
В текущей версии не реализован.