Teigha.DatabaseServices.Assoc2dConstraintGroup.RegenDimensionSystem
Метод восстанавливает внутреннюю систему размеров. Предназначен только для внутреннего использования.
Метод восстанавливает внутреннюю систему размеров. Предназначен только для внутреннего использования.