Teigha.DatabaseServices.ObjectContextCollection.IEnumerable_GetEnumerator
Метод предоставляет перечислитель для данного объекта.
Метод предоставляет перечислитель для данного объекта.
Returns: Возвращает перечислитель для данной коллекции. Тип System.Collections.IEnumerator.