Teigha.DatabaseServices.GripData.GetTooltip
Метод задает функцию, используемую для получения строки подсказки для этой ручки.
Метод задает функцию, используемую для получения строки подсказки для этой ручки.
Returns: Возвращает строку подсказки для ручки. Тип String.