Teigha.DatabaseServices.PolygonMesh.MakeMOpen
Метод делает сеть PolygonMesh незамкнутой в направлении М.
Метод делает сеть PolygonMesh незамкнутой в направлении М.
Это означает, что сеть будет иметь разрыв между последней и первой строками.