HostMgd.EditorInput.JigPromptOptions
Класс предназначен для хранения набора параметров, которые используются во время операции .
Абстрактный класс, предназначенный для для хранения набора параметров, которые используются во время операции .
Является базовым классом для классов  и .
Класс предоставляет возможность установить для опрерации  приглашающее сообщение, ключевые слова,
внешний вид курсора и изменить пользовательские настройки ввода.

HostMgd.EditorInput.JigPromptOptions.CalculateResult(HostEdJig.DragStatus,PromptResult%)
Вспомогательный метод, который проверяет значение переменной  во время операции Jig и сохраняет результат
операции, т.е. запрашиваемое значение, в переменную .
Вспомогательный метод, вызывается во всех методах класса . Метод проверяет значение переменной
result: Набор данных, полученных от пользователя после запроса.

HostMgd.EditorInput.JigPromptOptions.#ctor
Конструктор класса
Конструктор класса. Присваивает свойству Message пустую строку. Также устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие). Настройки пользовательского ввода из свойства UserInputControls остаются по умолчанию.

HostMgd.EditorInput.JigPromptOptions.#ctor(System.String)
Конструктор класса
Конструктор класса. Присваивает свойству Message значение параметра  Также конструктор устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие). Настройки пользовательского ввода из свойства UserInputControls остаются по умолчанию.
message: Текстовое сообщение, приглашающее предоставить данные для дальнейших действий с объектом или группой объектов.

HostMgd.EditorInput.JigPromptOptions.#ctor(System.String,System.String)
Конструктор класса
Конструктор класса. Присваивает свойству Message значение параметра , выделяет из этого параметра ключевые слова,
записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра .
Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Также конструктор устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие). Настройки пользовательского ввода из свойства UserInputControls остаются по умолчанию.
Если список ключевых слов ошибочный или пустой, то возникает событие System.ArgumentException.
Если количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов, возникает событие System.ArgumentException.
messageAndKeywords: Cтрока, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе данных.
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.