Teigha.DatabaseServices.MoveGripPointsFlags
Перечисление MoveGripPointsFlags определяет флаги для точек перемещения ручек.
Перечисление MoveGripPointsFlags определяет флаги для точек перемещения ручек.