Teigha.GraphicsInterface.MaterialRefractionComponent
Структура MaterialRefractionComponent представляет компонент преломления материала.
Структура MaterialRefractionComponent представляет компонент (канал) преломления материала, который включает коэффициент преломления материала и карту материала.

Teigha.GraphicsInterface.MaterialRefractionComponent.#ctor(System.Double,Teigha.GraphicsInterface.MaterialMap)
Конструктор структуры MaterialRefractionComponent.
Создает экземпляр структуры с указанными картой материала и коэффициентом преломления.
Конструктор структуры MaterialRefractionComponent.
Создает экземпляр структуры с указанными картой материала и коэффициентом преломления.
index: Коэффициент преломления материала. Тип double.
map: Карта материала. Тип MaterialMap.

Teigha.GraphicsInterface.MaterialRefractionComponent.Equals(Object)
Метод реализует проверку равенства данного и указанного объектов.
Метод реализует проверку равенства данного и указанного объектов.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если сравниваемые объекты равны.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialRefractionComponent.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки.
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки.  Результирующая строка включает карту материала и значение коэффициента преломления.
provider: Провайдер языковых и региональных настроек.  Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.

Teigha.GraphicsInterface.MaterialRefractionComponent.!=(Teigha.GraphicsInterface.MaterialRefractionComponent,Teigha.GraphicsInterface.MaterialRefractionComponent)
Оператор неравенства структуры MaterialRefractionComponent.
Оператор неравенства структуры MaterialRefractionComponent.
Позволяет установить факт неравенства двух экземпляров MaterialRefractionComponent.
Notes
Критерием неравенства двух экземпляров структуры MaterialRefractionComponent является невыполнение хотя бы одного из следующих условий:
* Карты материалов операндов равны (либо обе равны null);
* Значения коэффициентов преломления операндов равны.
a: Левый операнд.  Тип MaterialRefractionComponent.
b: Правый операнд. Тип MaterialRefractionComponent.
Returns: Возвращает true, если левый операнд не равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialRefractionComponent.==(Teigha.GraphicsInterface.MaterialRefractionComponent,Teigha.GraphicsInterface.MaterialRefractionComponent)
Оператор равенства структуры MaterialRefractionComponent.
Оператор равенства структуры MaterialRefractionComponent.
Позволяет установить факт равенства двух экземпляров MaterialRefractionComponent.
Notes
Критерием равенства двух экземпляров структуры MaterialRefractionComponent является совместное выполнение следующих условий:
* Карты материалов операндов равны (либо обе равны null);
* Значения коэффициентов преломления операндов равны.
a: Левый операнд.  Тип MaterialRefractionComponent.
b: Правый операнд. Тип MaterialRefractionComponent.
Returns: Возвращает true, если левый операнд равен правому.
В противном случае возвращает false.

Teigha.GraphicsInterface.MaterialRefractionComponent.Index
Свойство Index представляет текущее значение коэффициента преломления.
Свойство Index представляет текущее значение коэффициента преломления.
Returns: Возвращает значение коэффициента преломления.
Тип double.

Teigha.GraphicsInterface.MaterialRefractionComponent.Map
Свойство Map представляет карту материала, связанную с данным объектом.
Свойство Map представляет карту материала, связанную с данным объектом.
Returns: Возвращает карту материала.
Тип MaterialMap.