HostMgd.PlottingServices.EndDocumentEventHandler
Делегат EndDocumentEventHandler предназначен для обработки события PlotReactorManager.EndDocument, возникающего
сразу после завершения вывода документа на плоттер.
Делегат EndDocumentEventHandler предназначен для обработки события PlotReactorManager.EndDocument, возникающего
сразу после завершения вывода документа на плоттер.
Контекст события передается через параметры sender и e, где sender определяет объект-инициатор события,
а аргумент e типа EndDocumentEventArgs передает состояние флага PlotCancelStatus.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип EndDocumentEventArgs.