Teigha.DatabaseServices.XrefNotificationStatus.ResolvedElsewhere
Значение: 2.
Статус означает, что внешняя ссылка была разрешена с использованием чертежа из другого расположения, которое отличается от указанного  в записи таблицы блоков.