Teigha.DatabaseServices.LayoutPaperPE
Класс LayoutPaperPE является классом расширения протокола для объектов Layout, позволяющий настраивать фон чертежа во время векторизации пространства PaperSpace.
Класс LayoutPaperPE является классом расширения протокола для объектов Layout.
Класс расширения протокола может быть зарегистрирован в классе Layout, чтобы предоставить клиентскому приложению для векторизации возможность настраивать фон чертежа во время векторизации пространства PaperSpace.

Teigha.DatabaseServices.LayoutPaperPE.DrawBorder(Teigha.DatabaseServices.Layout,GraphicsInterface.WorldDraw,Teigha.Geometry.Point3dCollection)
Этот метод вызывается в процессе векторизации для отрисовки границы бумажного листа.
Этот метод вызывается в процессе векторизации для отрисовки границы бумажного листа.
layout: Векторизуемый лист. Тип Layout.
worldDraw: Объект WorldDraw, используемый данным методом для настройки необходимых атрибутов и создания требуемой геометрии. Тип GraphicsInterface.WorldDraw.
points: Коллекция точек, определяющих координаты четырех углов листа бумаги. Тип Point3dCollection.
Returns: Возвращает true, если отрисовка границ бумаги завершена успешно, и false, если лист использует для границ рендеринг по умолчанию.

Teigha.DatabaseServices.LayoutPaperPE.DrawMargins(Teigha.DatabaseServices.Layout,GraphicsInterface.WorldDraw,Teigha.Geometry.Point3dCollection)
Этот метод вызывается в процессе векторизации для отрисовки полей листа бумаги.
Этот метод вызывается в процессе векторизации для отрисовки полей листа бумаги.
layout: Векторизуемый лист. Тип Layout.
worldDraw: Объект WorldDraw, используемый данным методом для настройки необходимых атрибутов и создания требуемой геометрии. Тип GraphicsInterface.WorldDraw.
points: Коллекция точек, определяющих координаты четырех углов листа бумаги. Тип Point3dCollection.
Returns: Возвращает true, если отрисовка полей листа бумаги завершена успешно, и false, если лист использует для полей рендеринг по умолчанию.

Teigha.DatabaseServices.LayoutPaperPE.DrawPaper(Teigha.DatabaseServices.Layout,GraphicsInterface.WorldDraw,Teigha.Geometry.Point3dCollection)
Этот метод вызывается в процессе векторизации для отрисовки листа бумаги.
Этот метод вызывается в процессе векторизации для отрисовки листа бумаги.
layout: Векторизуемый лист. Тип Layout.
worldDraw: Объект WorldDraw, используемый данным методом для настройки необходимых атрибутов и создания требуемой геометрии. Тип GraphicsInterface.WorldDraw.
points: Коллекция точек, определяющих координаты четырех углов листа бумаги. Тип Point3dCollection.
Returns: Возвращает true, если отрисовка листа бумаги завершена успешно, и false, если для отрисовки листа используется рендеринг по умолчанию.