Teigha.DatabaseServices.LoftOptionsNormalOption
Данное перечисление определяет варианты поведения вытягиваемой поверхности при прохождении поперечных сечений.
Данное перечисление определяет варианты поведения вытягиваемой поверхности при прохождении поперечных сечений.