Teigha.GraphicsInterface.TransparencyMode.TransparencyDef
Значение: -1.
Альфа-канал по умолчанию для нативного растрового изображения (значение 0 означает полную прозрачность, значения 1 - 255 — полную ненепрозрачность).