Teigha.Geometry.NurbCurve3d.GetFitTangents
Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
Returns: Возвращает векторы производных в начальной и конечной точках в виде массива из двух элементов.
Тип Vector3d[].