Teigha.DatabaseServices.DxfFiler.ReadInt32
Метод возвращает 32-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Метод возвращает 32-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Returns: Возвращает 32-разрядное целое число со знаком. Тип int.