Teigha.Runtime.CommandMethodAttribute
Этот класс помечает экземпляр или статическую функцию как команду.
Этот класс помечает экземпляр или статическую функцию как команду.

Teigha.Runtime.CommandMethodAttribute.#ctor(String)
Данный конструктор создает объект с глобальным именем.
Данный конструктор создает объект с глобальным именем.
globalName: Глобальное имя объекта. Тип String.

Teigha.Runtime.CommandMethodAttribute.#ctor(String,Teigha.Runtime.CommandFlags)
Данный конструктор создает объект с глобальным именем и командными флагами.
Данный конструктор создает объект с глобальным именем и командными флагами.
globalName: Глобальное имя объекта. Тип String.
flags: Командные флаги. Значение из перечисления CommandFlags.

Teigha.Runtime.CommandMethodAttribute.#ctor(String,String,Teigha.Runtime.CommandFlags)
Данный конструктор создает объект с глобальным именем, командными флагами и именем группы.
Данный конструктор создает объект с глобальным именем, командными флагами и именем группы.
groupName: Имя группы команд. Тип String.
globalName: Глобальное имя объекта. Тип String.
flags: Командные флаги. Значение из перечисления CommandFlags.

Teigha.Runtime.CommandMethodAttribute.#ctor(String,String,String,Teigha.Runtime.CommandFlags)
Данный конструктор создает объект с глобальным именем, командными флагами, именем группы и локализованным идентификатором.
Данный конструктор создает объект с глобальным именем, командными флагами, именем группы и локализованным идентификатором.
groupName: Имя группы команд. Тип String.
globalName: Глобальное имя объекта. Тип String.
localizedNameId: Идентификатор локализованного имени команды. Тип String.
flags: Командные флаги. Значение из перечисления CommandFlags.

Teigha.Runtime.CommandMethodAttribute.#ctor(String,String,String,Teigha.Runtime.CommandFlags,String)
Данный конструктор создает объект с глобальным именем, флагами команд, именем группы, локализованным идентификатором и статьей справки.
Данный конструктор создает объект с глобальным именем, командными флагами, именем группы, локализованным идентификатором и статьей справки.
groupName: Имя группы команд. Тип String.
globalName: Глобальное имя объекта. Тип String.
localizedNameId: Идентификатор локализованного имени команды. Тип String.
flags: Командные флаги. Значение из перечисления CommandFlags.
helpTopic: Текст справки. Тип String.

Teigha.Runtime.CommandMethodAttribute.#ctor(String,String,String,Teigha.Runtime.CommandFlags,Type)
Данный конструктор создает объект с глобальным именем, именем группы, локализованным идентификатором, командными флагами и типом расширения контекстного меню.
Данный конструктор создает объект с глобальным именем, именем группы, локализованным идентификатором, командными флагами и типом расширения контекстного меню.
groupName: Имя группы команд. Тип String.
globalName: Глобальное имя объекта. Тип String.
localizedNameId: Идентификатор локализованного имени команды. Тип String.
flags: Командные флаги. Значение из перечисления CommandFlags.
contextMenuExtensionType: Тип расширения контекстного меню. Тип Type.

Teigha.Runtime.CommandMethodAttribute.#ctor(String,String,String,Teigha.Runtime.CommandFlags,Type,String,String)
Данный конструктор создает объект с именем группы, глобальным именем, локализованным идентификатором, командными флагами, темой справки, именем файла справки и типом расширения контекстного меню.
Данный конструктор создает объект с именем группы, глобальным именем, локализованным идентификатором, командными флагами, темой справки, именем файла справки и типом расширения контекстного меню.
groupName: Имя группы команд. Тип String.
globalName: Глобальное имя объекта. Тип String.
localizedNameId: Идентификатор локализованного имени команды. Тип String.
flags: Командные флаги. Значение из перечисления CommandFlags.
contextMenuExtensionType: Тип расширения контекстного меню. Тип Type.
helpFileName: Имя файла справки. Тип String.
helpTopic: Тема справки. Тип String.

Teigha.Runtime.CommandMethodAttribute.ContextMenuExtensionType
Свойство предоставляет доступ к типу расширения контекстного меню ContextMenuExtensionType.
Свойство предоставляет доступ к типу расширения контекстного меню ContextMenuExtensionType.
Returns: Возвращает тип Type.

Teigha.Runtime.CommandMethodAttribute.Flags
Свойство предоставляет доступ установленным командным флагам.
Свойство предоставляет доступ установленным командным флагам.
Returns: Возвращает командные флаги из перечисления CommandFlags.

Teigha.Runtime.CommandMethodAttribute.GlobalName
Свойство предоставляет доступ к глобальному имени.
Свойство предоставляет доступ к глобальному имени.
Returns: Возвращает глобальное имя. Тип String.

Teigha.Runtime.CommandMethodAttribute.GroupName
Свойство предоставляет доступ к имени группы GroupName.
Свойство предоставляет доступ к имени группы GroupName.
Returns: Возвращает имя группы. Тип String.

Teigha.Runtime.CommandMethodAttribute.HelpFileName
Свойство предоставляет доступ к имени файла справки HelpFileName.
Свойство предоставляет доступ к имени файла справки HelpFileName.
Returns: Возвращает имени файла справки.  String.

Teigha.Runtime.CommandMethodAttribute.HelpTopic
Свойство предоставляет доступ к теме справки HelpTopic.
Свойство предоставляет доступ к теме справки HelpTopic.
Returns: Возвращает тему справки. Тип String.

Teigha.Runtime.CommandMethodAttribute.LocalizedNameId
Свойство предоставляет доступ идентификатору локализованного имени LocalizedNameId.
Свойство предоставляет доступ идентификатору локализованного имени LocalizedNameId.
Returns: Возвращает идентификатор локализованного имени. Тип String.