HostMgd.PlottingServices.Dwf3dOptions
Класс Dwf3dOptions представляет опции публикации в формате 3D DWF.
Класс Dwf3dOptions представляет опции публикации в формате 3D DWF.

HostMgd.PlottingServices.Dwf3dOptions.GroupByXrefHierarchy
Свойство GroupByXrefHierarchy позволяет определить, включен ли режим группировки объекта 3D DWF согласно иерархии Xref.
Свойство GroupByXrefHierarchy позволяет определить, включен ли режим группировки объекта 3D DWF согласно иерархии внешних ссылок (Xref).
Returns: Возвращает true, если режим группировки согласно иерархии внешних ссылок включен.
В противном случае возвращает false.

HostMgd.PlottingServices.Dwf3dOptions.PublishWithMaterials
Свойство PublishWithMaterials позволяет определить, включен ли режим публикации объекта 3D DWF с назначенными материалами.
Свойство PublishWithMaterials позволяет определить, включен ли режим публикации объекта 3D DWF с назначенными материалами.
Returns: Возвращает true, если режим публикации объекта 3D DWF с назначенными материалами включен.
В противном случае возвращает false.