Teigha.DatabaseServices.CellContent.DeleteContent
Метод удаляет из ячейки всё содержимое.
Метод удаляет из ячейки всё её содержимое.
Notes
Если содержимое ячейки защищено от редактирования, метод выбрасывает исключение eIsWriteProtected.