Teigha.DatabaseServices.BlockInsertionPointsEventArgs
Класс представляет данные для события BlockInsertionPoints в записи таблицы блоков.
Класс представляет данные для события BlockInsertionPoints в записи таблицы блоков.

Teigha.DatabaseServices.BlockInsertionPointsEventArgs.#ctor(Teigha.DatabaseServices.BlockTableRecord,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection)
Конструктор класса BlockInsertionPointsEventArgs.
Конструктор класса BlockInsertionPointsEventArgs.
blockTableRecord: Запись в таблице блоков. Тип BlockTableRecord.
points: Коллекция точек вставки. Тип Point3dCollection.
alignmentVectors: Коллекция векторов выравнивания.  Тип Vector3dCollection.

Teigha.DatabaseServices.BlockInsertionPointsEventArgs.AlignmentVectors
Свойство предоставляет доступ к коллекции векторов выравнивания.
Свойство предоставляет доступ к коллекции векторов выравнивания.
Returns: Возвращает коллекцию векторов выравнивания. Тип Vector3dCollection

Teigha.DatabaseServices.BlockInsertionPointsEventArgs.BlockTableRecord
Свойство предоставляет доступ к измененной записи в таблице блоков.
Свойство предоставляет доступ к измененной записи в таблице блоков.
Returns: Возвращает запись в таблице блоков. Тип DatabaseServices.BlockTableRecord.

Teigha.DatabaseServices.BlockInsertionPointsEventArgs.InsertionPoints
Свойство предоставляет доступ к коллекции точек вставки.
Свойство предоставляет доступ к коллекции точек вставки.
Returns: Возвращает коллекцию точек вставки. Тип Point3dCollection.