HostMgd.EditorInput.JigPromptGeometryOptions
Класс предназначен для хранения набора параметров, которые используются во время операции  с геометрическими объектами.
Абстрактный класс, предназначенный для для хранения набора параметров, которые используются во время операции  с геометрическими объектами.
Является базовым классом для классов , ,
.
Класс предоставляет возможность установить для опрерации  базовую точку, приглашающее сообщение, ключевые слова,
внешний вид курсора и изменить пользовательские настройки ввода.

HostMgd.EditorInput.JigPromptGeometryOptions.#ctor
Конструктор класса без параметров.
Конструктор класса. Присваивает свойству Message пустую строку. Также устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие).

HostMgd.EditorInput.JigPromptGeometryOptions.#ctor(System.String)
Конструктор класса с одним параметром.
Конструктор класса. Присваивает свойству Message значение параметра  Также конструктор устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие).
message: Текстовое сообщение, приглашающее предоставить данные для дальнейших действий с объектом или группой объектов.

HostMgd.EditorInput.JigPromptGeometryOptions.#ctor(System.String,System.String)
Конструктор класса с двумя параметрами.
Конструктор класса. Присваивает свойству Message значение параметра , выделяет из этого параметра ключевые слова,
записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра .
Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Также конструктор устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие).
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.