Teigha.DatabaseServices.PlotSettings
Этот класс представляет настройки печати в экземпляре базы данных.
Этот класс представляет настройки печати в виде именованного описания в экземпляре базы данных.
Объекты настроек PlotSettings сохраняются в словаре PlotSettingsDictionary.

Teigha.DatabaseServices.PlotSettings.#ctor(System.Boolean)
Конструктор класса PlotSettings.
Создает экземпляр настроек печати на выбор для пространства модели, либо для пространства листа.
Конструктор класса PlotSettings.
Создает экземпляр настроек печати для пространства модели, либо для пространства листа.
Выбор пространства определяется значением входного аргумента modelType.
modelType: Входное логическое значение, определяющее тип настроек печати. Тип bool.

Teigha.DatabaseServices.PlotSettings.AddToPlotSettingsDictionary(DatabaseServices.Database)
Метод добавляет данный объект PlotSettings в словарь настроек печати в указанной базе данных.
Метод добавляет данный объект PlotSettings в словарь настроек печати в указанной базе данных.
toWhichDatabase: База данных, в которую необходимо добавить объект настроек печати.

Teigha.DatabaseServices.PlotSettings.SetShadePlot(Teigha.DatabaseServices.PlotSettingsShadePlotType,DatabaseServices.ObjectId)
Метод задает параметры для печати тонированных объектов.
Метод задает параметры для печати тонированных объектов.
Если для режима тонированной печати установлено значение AsDisplayed или Rendered, параметр shadePlotId игнорируется, а для идентификатора объекта тонированной печати  автоматически устанавливается значение Null.
Если для режима тонированной печати установлено значение VisualStyle или RenderPreset, идентификатор объекта тонированной печати должен указывать на валидный объект VisualStyle или RenderSettings.
type: Режим тонированной печати. Тип PlotSettingsShadePlotType.
shadePlotId: Идентификатор объекта визуального стиля (VisualStyle) или объекта настроек рендеринга (RenderSettings), который будет использоваться в качестве объекта тонированной печати.

Teigha.DatabaseServices.PlotSettings.CanonicalMediaName
Свойство CanonicalMediaName представляет независимое от локализации (каноническое) имя текущего настроенного бумажного носителя.
Свойство CanonicalMediaName представляет независимое от локализации (каноническое) имя текущего настроенного бумажного носителя.
Returns: Возвращает имя бумажного носителя.
Тип String.

Teigha.DatabaseServices.PlotSettings.CurrentStyleSheet
Свойство CurrentStyleSheet представляет текущую таблицу стилей печати.
Свойство CurrentStyleSheet представляет текущую таблицу стилей печати.
Returns: Возвращает имя текущей таблицы стилей печати. Тип String.

Teigha.DatabaseServices.PlotSettings.CustomPrintScale
Свойство CustomPrintScale представляет пользовательский масштаб печати для данного объекта PlotSettings.
Свойство CustomPrintScale представляет пользовательский масштаб печати для данного объекта PlotSettings.
Пользовательский масштаб печати всегда отражает тот масштаб, который реально будет использоваться при печати, т.е. отношение единиц на бумажном носителе к единицам исходного пространства.
Returns: Возвращает объект пользовательского масштаба. Тип CustomScale.

Teigha.DatabaseServices.PlotSettings.DrawViewportsFirst
Свойство DrawViewportsFirst определяет, должны ли видовые экраны печататься раньше других объектов в пространстве листа для этого объекта PlotSettings.
Свойство DrawViewportsFirst определяет, должны ли видовые экраны печататься раньше других объектов в пространстве листа для этого объекта PlotSettings.
Returns: Возвращает true, если первыми должны выводиться плавающие видовые экраны.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.ModelType
Свойство ModelType определяет, к какому типу относится данный объект PlotSettings - к настройкам печати для пространства модели или для пространства листа.
Свойство ModelType определяет, к какому типу относится данный объект PlotSettings - к настройкам печати для пространства модели или для пространства листа.
Returns: Возвращает true, если данный объект представляет настройки для пространства модели.
В случае настроек для пространства листа возвращает false.

Teigha.DatabaseServices.PlotSettings.PlotAsRaster
Свойство PlotAsRaster позволяет выяснить, предусмотрен ли текущими настройками печати растровый вывод видового экрана с тонированными объектами.
Свойство PlotAsRaster позволяет выяснить, предусмотрен ли текущими настройками печати растровый вывод видового экрана с тонированными объектами.
Returns: Возвращает true, если настройками задан растровый вывод тонированных объектов.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.PlotCentered
Свойство PlotCentered позволяет проверить, предусмотрено ли настройками данного PlotSettings центрирование  на листе при печати.
Свойство PlotCentered позволяет проверить, предусмотрено ли настройками данного PlotSettings центрирование  на листе при печати.
Returns: Возвращает true, если используется центрирование при печати.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.PlotConfigurationName
Свойство PlotConfigurationName представляет имя системного принтера или файла конфигурации печати для этого объекта PlotSettings.
Свойство PlotConfigurationName представляет имя системного принтера или файла конфигурации печати для этого объекта PlotSettings.
Returns: Возвращает имя системного принтера или файла конфигурации печати.
Тип String.

Teigha.DatabaseServices.PlotSettings.PlotHidden
Свойство PlotHidden позволяет определить, предусмотрено ли удаление при печати скрытых линий у объектов.
Свойство PlotHidden позволяет определить, предусмотрено ли удаление при печати скрытых линий у объектов.
Заметим, что эта настройка не влияет на объекты в плавающих видовых экранах пространства модели.
Удалением скрытых линий в этих видовых экранах управляют собственные отдельные элементы управления.
Returns: Возвращает true, если алгоритм удаления скрытых линий не используется.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.PlotOrigin
Свойство PlotOrigin представляет смещение начала координат области печати на печатаемом листе.
Свойство PlotOrigin представляет смещение начала координат области печати для этого объекта PlotSettings.
Это смещение измеряется относительно границ печатаемого листа и всегда в миллиметрах независимо от единиц чертежа.
Returns: Возвращает смещение начала координат. Тип Point2d.

Teigha.DatabaseServices.PlotSettings.PlotPaperMargins
Свойство PlotPaperMargins представляет поля бумаги, настроенные для этого объекта PlotSettings.
Свойство PlotPaperMargins представляет поля бумаги, настроенные для этого объекта PlotSettings.
Поля измеряются от соответствующих краев физического носителя до области печати и не зависят от поворота при печати.
Все расстояния представлены в миллиметрах независимо от единиц и текущего масштаба чертежа.
Returns: Возвращает размеры полей бумаги. Тип Extents2d.

Teigha.DatabaseServices.PlotSettings.PlotPaperSize
Свойство PlotPaperSize представляет ширину и высоту листов бумаги, которые заданы в этом объекте PlotSettings.
Свойство PlotPaperSize представляет ширину и высоту листов бумаги, которые заданы в этом объекте PlotSettings.
Размер бумаги — это физический размер носителя, включающий поля.
Все расстояния представлены в миллиметрах независимо от единиц и текущего масштаба чертежа.
Returns: Возвращает ширину и высоту листов бумаги. Тип Point2d.

Teigha.DatabaseServices.PlotSettings.PlotPaperUnits
Свойство PlotPaperUnits представляет единицы измерения на бумаге, используемые для полей, смещений, размера бумаги и единиц чертежа для данного объекта PlotSettings.
Свойство PlotPaperUnits представляет единицы измерения на бумаге, используемые для полей, смещений, размера бумаги и единиц чертежа для данного объекта PlotSettings.
Returns: Возвращает настроенные единицы измерения на бумаге из перечисления DatabaseServices.PlotPaperUnit.

Teigha.DatabaseServices.PlotSettings.PlotPlotStyles
Свойство PlotPlotStyles позволяет определить, применяются ли стили печати для данного объекта PlotSettings.
Свойство PlotPlotStyles позволяет определить, применяются ли стили печати для данного объекта PlotSettings.
т.е. выводятся ли на печать стили печати (а не просто показываются).
Returns: Возвращает true, если стили печати выводятся на печать.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.PlotRotation
Свойство PlotRotation представляет поворот при печати в настройках этого объекта PlotSettings.
Свойство PlotRotation представляет поворот при печати в настройках этого объекта PlotSettings.
Returns: Возвращает поворот при печати. Значение из перечисления Teigha.DatabaseServices.PlotRotation.

Teigha.DatabaseServices.PlotSettings.PlotSettingsName
Свойство PlotSettingsName представляет имя данного объекта PlotSettings.
Свойство PlotSettingsName представляет имя данного объекта PlotSettings.
Returns: Возвращает имя данного объекта. Тип String.

Teigha.DatabaseServices.PlotSettings.PlotTransparency
Свойство PlotTransparency позволяет определить, включён ли учет прозрачности при печати.
Свойство PlotTransparency позволяет определить, включён ли учет прозрачности при печати.
Returns: Возвращает true, если прозрачность учитывается при печати.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.PlotType
Свойство PlotType представляет тип печати чертежа, определенный для данного объекта PlotSettings.
Свойство PlotType представляет тип печати чертежа, определенный для данного объекта PlotSettings.
Returns: Возвращает тип печати чертежа. Значение из перечисления DatabaseServices.PlotType.

Teigha.DatabaseServices.PlotSettings.PlotViewName
Свойство PlotViewName представляет доступ к именованному виду, который, в свою очередь, определяет, какая часть листа должна быть выведена на печать.
Свойство PlotViewName представляет доступ к именованному виду, который, в свою очередь, определяет, какая часть листа должна быть выведена на печать.
Returns: Возвращает имя вида. Тип String.

Teigha.DatabaseServices.PlotSettings.PlotViewportBorders
Свойство PlotViewportBorders позволяет определить, должны ли отображаться границы видового экрана согласно настройкам этого объекта PlotSettings.
Свойство PlotViewportBorders позволяет определить, должны ли отображаться границы видового экрана согласно настройкам этого объекта PlotSettings.
Returns: Возвращает true, если границы отображаться должны.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.PlotWindowArea
Свойство PlotWindowArea представляет углы прямоугольной рамки окна печати для этого объекта PlotSettings.
Свойство PlotWindowArea представляет углы прямоугольной рамки окна печати для этого объекта PlotSettings.
Границы рамки учитываются только при условии, что тип печати принимает значение PlotType.Window.
Returns: Возвращает углы прямоугольной рамки окна печати. Тип Extents2d.

Teigha.DatabaseServices.PlotSettings.PlotWireframe
Свойство PlotWireframe позволяет определить, будет ли каркасной печать видового экрана, исходя из текущих настроек печати тонированного видового экрана.
Свойство PlotWireframe позволяет определить, будет ли каркасной печать видового экрана, исходя из текущих настроек печати тонированного видового экрана.
Returns: Возвращает true, если печать будет каркасной.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.PrintLineweights
Свойство PrintLineweights позволяет определить, печатаются ли веса линий для этого объекта PlotSettings.
Свойство PrintLineweights позволяет определить, печатаются ли веса линий для этого объекта PlotSettings.
Returns: Возвращает true, если веса линий печатаются.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.ScaleLineweights
Свойство ScaleLineweights позволяет определить, масштабируются ли толщины (веса) линий у этого объекта PlotSettings.
Свойство ScaleLineweights позволяет определить, масштабируются ли толщины (веса) линий у этого объекта PlotSettings.
Returns: Возвращает true, если толщины (веса) линий масштабируются.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.ShadePlot
Свойство ShadePlot представляет тип тонированной печати, предусмотренный данным объектом PlotSettings.
Свойство ShadePlot представляет тип тонированной печати, предусмотренный данным объектом PlotSettings.
Returns: Возвращает тип печати тонированных объектов. Перечисление PlotSettingsShadePlotType.

Teigha.DatabaseServices.PlotSettings.ShadePlotCustomDpi
Свойство ShadePlotCustomDpi представляет пользовательское разрешение, с которым будут выводиться на печать тонированные и векторизованные видовые экраны, если свойству ShadePlotResLevel задано значение ShadePlotResLevel.Custom.
Свойство ShadePlotCustomDpi представляет пользовательское разрешение, с которым будут выводиться на печать тонированные и векторизованные видовые экраны, если свойству ShadePlotResLevel задано значение ShadePlotResLevel.Custom.
Returns: Возвращает пользовательское разрешение при печати в единицах dpi (точки на дюйм).
Тип short.

Teigha.DatabaseServices.PlotSettings.ShadePlotId
Свойство ShadePlotId предоставляет доступ к ObjectId объекта VisualStyle или RenderSettings, на который ссылается данный объект PlotSettings.
Свойство ShadePlotId предоставляет доступ к ObjectId объекта визуального стиля VisualStyle или объекта настроек рендеринга RenderSettings, на который ссылается данный объект PlotSettings.
Returns: Возвращает идентификатор объекта.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.PlotSettings.ShadePlotResLevel
Свойство ShadePlotResLevel представляет уровень разрешения при тонированной печати, предусмотренный данным объектом PlotSettings.
Свойство ShadePlotResLevel представляет уровень разрешения при тонированной печати, предусмотренный данным объектом PlotSettings (черновая печать, предварительный просмотр, нормальная печать и т.д.).
Returns: Возвращает уровень разрешения при печати.
Значение из перечисления Teigha.DatabaseServices.ShadePlotResLevel.

Teigha.DatabaseServices.PlotSettings.ShowPlotStyles
Свойство ShowPlotStyles определяет, отображаются ли стили печати для этого объекта PlotSettings в режиме листа.
Свойство ShowPlotStyles определяет, отображаются ли стили печати для этого объекта PlotSettings в режиме листа.
Returns: Возвращает true, если стили печати отображаются.
В противном случае возвращает false.

Teigha.DatabaseServices.PlotSettings.StdScale
Свойство StdScale представляет стандартный масштаб для этого объекта PlotSettings в виде значения с плавающей точкой.
Свойство StdScale представляет стандартный масштаб для этого объекта PlotSettings в виде значения с плавающей точкой.
Returns: Возвращает значение стандартного масштаба. Тип double.

Teigha.DatabaseServices.PlotSettings.StdScaleType
Свойство StdScaleType представляет стандартный тип масштаба для этого объекта PlotSettings.
Свойство StdScaleType представляет стандартный тип масштаба для этого объекта PlotSettings как значение перечислимого типа StdScaleType.
Это перечисление отражает желаемый масштаб при печати, который платформа использует вместе с другой информацией, такой как размеры области печати, для вычисления значения CustomPrintScale, когда свойство UseStandardScale имеет значение true.
Returns: Возвращает стандартный тип масштаба.
Значение из перечисления DatabaseServices.StdScaleType.

Teigha.DatabaseServices.PlotSettings.UseStandardScale
Свойство UseStandardScale определяет, используется ли листом свойство StdScaleType для расчета текущего масштаба печати.
Свойство UseStandardScale определяет, используется ли листом свойство StdScaleType для расчета текущего масштаба печати.
Если используется, то свойство CustomPrintScale отражает вычисленный масштаб, соответствующий номенклатуре StdScaleType. В противном случае свойства CustomPrintScale и StdScaleType никак не связаны, и следует использовать только свойство CustomPrintScale.  Другими словами, свойство CustomPrintScale всегда отражает текущий масштаб, используемый для печати, независимо от того, был ли он вычислен на основе стандартного масштаба или задан непосредственно пользователем.
Свойство UseStandardScale определяет, как было получено значение CustomPrintScale (вычислено исходя из стандартного масштаба, включая подгонку масштаба под размер текущего формата листа, или же было непосредственного указано пользователем).
У свойства StdScaleType значение задано всегда, но используется оно для вычисления CustomPrintScale только в том случае, если свойство UseStandardScale имеет значение true.
Returns: Возвращает true, если свойство StdScaleType используется для определения текущего масштаба печати.
В противном случае возвращает false.