Teigha.Geometry.Matrix2dBuilder.ToMatrix2d
Метод предоставляет двумерную матрицу, связанную с данным объектом.
Метод предоставляет двумерную матрицу, связанную с данным объектом.
Returns: Возвращает двумерную матрицу, связанную с данным объектом.
Тип Matrix2d.