HostMgd.GraphicsSystem.Manager
Класс Manager представляет менеджер графической системы dwg-документа nanoCAD.
Класс Manager скрывает низкоуровневые подробности подключения приложений nanoCAD к графической системе (GS) платформы nanoCAD.
Объекты класса взаимно однозначно сопоставлены клиентским окнам MDI и открытым документам nanoCAD.
Доступ к объектам Manager предоставляет свойство HostMgd.ApplicationServices.Document.GraphicsManager dwg-документа.

HostMgd.GraphicsSystem.Manager.CreateAutoCADDevice(System.IntPtr)
Метод создает объект Teigha.GraphicsSystem.Device с заданным дескриптором окна, в котором отображается чертеж.
Метод создаёт устройство как объект Teigha.GraphicsSystem.Device с заданным дескриптором окна hwnd.
Дескриптор hwnd представляет окно графического интерфейса, используемого графической системой для отрисовки объектов чертежа.
hwnd: Входной дескриптор окна. Тип System.IntPtr.
Returns: Возвращает созданный объект типа Teigha.GraphicsSystem.Device.

HostMgd.GraphicsSystem.Manager.CreateAutoCADView(Teigha.GraphicsInterface.Drawable)
Метод создаёт объект Teigha.GraphicsSystem.View и добавляет в этот вид переданный отображаемый объект Drawable.
Метод создаёт новый вид как объект Teigha.GraphicsSystem.View, а также добавляет в этот вид указанный отображаемый объект drawable.
drawable: Входной отображаемый объект. Тип Teigha.GraphicsInterface.Drawable.
Returns: Возвращает созданный вид графической системы.
Тип Teigha.GraphicsSystem.View.

HostMgd.GraphicsSystem.Manager.CreateAutoCADViewport(Teigha.DatabaseServices.ViewportTableRecord)
Метод создаёт объект Teigha.GraphicsSystem.View и добавляет в него объект Drawable, соответствующий указанной записи в таблице видовых экранов ViewportTableRecord.
Метод аналогичен CreateAutoCADView(Drawable) с той разницей, что к виду добавляется объект Drawable, соответствующий указанной записи в таблице видовых экранов ViewportTableRecord. Этот метод упрощает визуализацию всего видового экрана целиком.
vp: Входная запись таблицы видовых экранов. Тип Teigha.DatabaseServices.ViewportTableRecord.
Returns: Возвращает созданный вид графической системы.
Тип Teigha.GraphicsSystem.View.

HostMgd.GraphicsSystem.Manager.GetGsModel(Teigha.GraphicsInterface.TransientDrawingMode,System.Int32,System.Int32)
Метод предоставляет модель GS, которая соответствует заданным режиму и подрежиму отрисовки временной графики, а также идентификационному номеру видового экрана.
Метод предоставляет модель GS, которая соответствует переданным в метод входным параметрам: режиму и подрежиму отрисовки временной графики, а также идентификационному номеру видового экрана.
mode: Входной режим отрисовки временной графики. Тип Teigha.GraphicsInterface.TransientDrawingMode.
subDrawingMode: Входной подрежим для указанного режима отрисовки mode.  Тип int. Значение не должно быть отрицательным.
viewportNumber: Входной идентификационный номер видового экрана. Тип int. Это тот же самое значение, которое возвращает системная переменная CVPORT.
Returns: Возвращает модель GS, соответствующую входным аргументам.
Тип Teigha.GraphicsSystem.Model.

HostMgd.GraphicsSystem.Manager.GetGsView(System.Int32,System.Boolean)
Метод позволяет получить объект View графической системы для указанного видового экрана.
Метод позволяет получить объект вида графической системы для указанного видового экрана.
При необходимости вид будет создан.
viewportNumber: Номер видового экрана. Тип int.
createIfNone: Когда флаг установлен (true), то если связанный с видовым экраном вид не существует, он будет создан. Тип bool.
Returns: Возвращает объект вида графической системы.
Тип Teigha.GraphicsSystem.View.

HostMgd.GraphicsSystem.Manager.SetViewFromViewport(Teigha.GraphicsSystem.View,System.Int32)
Метод позволяет переопределить заданный вид GS, используя параметры указанного видового экрана.
Метод позволяет переопределить вид GS view, используя параметры видового экрана с номером viewportNumber.
view: Переопределяемый вид графической системы. Тип Teigha.GraphicsSystem.View.
viewportNumber: Входной номер видового экрана. Тип int.

HostMgd.GraphicsSystem.Manager.SetViewportFromView(System.Int32,Teigha.GraphicsSystem.View)
Метод позволяет переопределить настройки видового экрана на основе параметров указанного вида GS.
Метод позволяет переопределить параметры указанного видового экрана на основе параметров вида GS view.
viewportNumber: Входной номер переопределяемого видового экрана. Тип int.
view: Вид, который служит источником значений параметров для видового экрана. Тип Teigha.GraphicsSystem.View.

HostMgd.GraphicsSystem.Manager.SetViewportFromView(System.Int32,Teigha.GraphicsSystem.View,System.Boolean)
Метод переопределяет параметры видового экрана, используя указанный вид в качестве источника значений параметров.
Опционально можно потребовать синхронизацию параметров двумерного вида.
Метод позволяет переопределить параметры видового экрана, используя указанный вид view в качестве источника значений параметров.
Флаг syncRequired используется для синхронизации параметров 2D-вида.
Это бывает полезно после изменения вида в 3D-видовых экранах, когда регенерация больше не требуется, но нужна синхронизация  2D-вида.
viewportNumber: Номер переопределяемого видового экрана. Тип int.
view: Вид-источник параметров. Тип Teigha.GraphicsSystem.View.
syncRequired: Флаг синхронизации. Тип bool. Передать значение true, если требуется синхронизация двумерного вида, и false в противном случае.

HostMgd.GraphicsSystem.Manager.SetViewportFromView(System.Int32,Teigha.GraphicsSystem.View,System.Boolean,System.Boolean,System.Boolean)
Метод переопределяет параметры видового экрана, используя указанный вид в качестве источника значений параметров.
Опционально можно потребовать регенерацию, либо масштабирование 2D-вида, а также синхронизацию его параметров.
Метод позволяет переопределить параметры видового экрана, используя указанный вид view в качестве источника значений параметров.
Используйте значение regenRequired = true, если для корректной синхронизации нового вида требуется 2D-регенерация.
В противном случае можно использовать значение rescaleRequired = true, если для корректной синхронизации 2D-3D достаточно простого 2D-масштабирования. Если не требуется ни то, ни другое, передайте значение false для обоих аргументов.
Флаг syncRequired используется для синхронизации параметров 2D-вида. Это бывает полезно после изменения вида в 3D-видовых экранах, когда регенерация больше не требуется, но нужна синхронизация  2D-вида.
viewportNumber: Номер переопределяемого видового экрана. Тип int.
view: Вид-источник параметров. Тип Teigha.GraphicsSystem.View.
regenRequired: Задать true, если для видового экрана требуется регенерация. Тип bool.
rescaleRequired: Задать true, если для видового экрана требуется изменение масштаба. Тип bool.
syncRequired: Передать значение true, если требуется синхронизация двумерного вида. Тип bool.

HostMgd.GraphicsSystem.Manager.DisplaySize
Свойство DisplaySize представляет текущий размер экрана.
Свойство DisplaySize представляет текущий размер экрана.
Returns: Возвращает текущий размер экрана.
Тип System.Drawing.Size.