Teigha.Geometry.ExternalCurve3d
Класс ExternalCurve3d представляет 3D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
Класс ExternalCurve3d представляет 3D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.
С экземплярами ExternalCurve2d можно работать как с любыми объектами Curve3d.
Доступ к ExternalCurve3d можно получить так же, как к кривой Curve3d, если она существует.
Кроме того, возможно получить доступ к внешним данным в их нативной форме (что может оказаться более эффективным).
Одним из примеров использования ExternalCurve3d является доступ к кривым ACIS.
Следует, однако, иметь ввиду, что определения внешних кривых отличаются от соответствующих определений в геометрической библиотеке nanoCAD. Например, могут отличаться способы параметризации кривых.

Teigha.Geometry.ExternalCurve3d.#ctor
Конструктор по умолчанию класса ExternalCurve3d.
Конструктор по умолчанию класса ExternalCurve3d.
Создает пустой экземпляр по умолчанию с нулевым указателем на определение кривой, неопределенным типом кривой (другими словами, нет информации о системе, в которой была создана внешняя кривая) и опцией предотвращения копирования внешней кривой.

Teigha.Geometry.ExternalCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип ExternalCurve3d.

Teigha.Geometry.ExternalCurve3d.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
Если текущий экземпляр определен и является владельцем данных своего определения, то существующее определение будет удалено.
curveDef: Указатель на определение внешней кривой. Тип IntPtr.
curveKind: Информация о системе, в которой было создано определение внешнего объекта. Тип ExternalEntityKind.

Teigha.Geometry.ExternalCurve3d.ExternalCurve
Свойство ExternalCurve представляет внешнюю кривую в ее исходном виде.
Свойство ExternalCurve представляет внешнюю кривую в ее исходном виде.
Знание точного определения внешнего объекта потенциально обеспечивает эффективный доступ к объекту в его исходном виде.
Вызывающая сторона несет ответственность за высвобождение использованной при этом памяти.
Returns: Возвращает указатель на внешнюю кривую.
Тип IntPtr.

Teigha.Geometry.ExternalCurve3d.ExternalCurveKind
Свойство ExternalCurveKind представляет информацию о нативной системе, в которой было создано определение внешней кривой.
Свойство ExternalCurveKind представляет информацию о нативной системе, в которой было создано определение внешней кривой.
Returns: Возвращает информацию о системе, в которой было создано определение внешнего объекта.
Тип Geometry.ExternalEntityKind.

Teigha.Geometry.ExternalCurve3d.IsCircularArc
Свойство IsCircularArc позволяет проверить, представляет ли данный объект круглую дугу.
Свойство IsCircularArc позволяет проверить, представляет ли данный объект круглую дугу.
Returns: Возвращает true, если внешняя кривая представлена нативным определением в геометрической библиотеке платформы nanoCAD. В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsDefined
Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
Свойство IsDefined позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
Returns: Возвращает true, если данный объект имеет определение кривой.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsEllipticalArc
Свойство IsEllipticalArc позволяет проверить, представляет ли данный объект эллиптическую дугу.
Returns: Возвращает true, если данный объект представляет эллиптическую дугу.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsLine
Свойство IsLine позволяет проверить, представляет ли данный объект прямую линию.
Свойство IsLine позволяет проверить, представляет ли данный объект прямую линию.
Returns: Возвращает true, если данный объект представляет прямую линию.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsLineSegment
Свойство IsLineSegment позволяет проверить, представляет ли данный объект прямолинейный сегмент.
Свойство IsLineSegment позволяет проверить, представляет ли данный объект прямолинейный сегмент.
Returns: Возвращает true, если данный объект представляет прямолинейный сегмент.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsNativeCurve
Свойство IsNativeCurve позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней кривой.
Свойство IsNativeCurve позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней кривой.
Returns: Возвращает true, если геометрической библиотекой платформы поддерживается нативное представление данной внешней кривой.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsNurbCurve
Свойство IsNurbCurve позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
Свойство IsNurbCurve позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
Returns: Возвращает true, если внешняя кривая имеет точное нативное представление в графической системе платформы.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsOwnerOfCurve
Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
Свойство IsOwnerOfCurve позволяет убедиться, что данный объект является владельцем данных своего определения.
Returns: Возвращает true, если данный объект является владельцем данных своего определения.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.IsRay
Свойство IsRay позволяет проверить, представляет ли данный объект луч.
Свойство IsRay позволяет проверить, представляет ли данный объект луч.
Returns: Возвращает true, если данный объект представляет луч.
В противном случае возвращает false.

Teigha.Geometry.ExternalCurve3d.NativeCurve
Свойство NativeCurve обеспечивает доступ к нативному представлению данной внешней кривой в геометрической библиотеке платформы.
Свойство NativeCurve обеспечивает доступ к нативному представлению данной внешней кривой в геометрической библиотеке платформы.
Returns: Возвращает нативное представление данной внешней кривой в геометрической библиотеке платформы.
Тип Curve3d.