HostMgd.ApplicationServices.LongTransactionEventArgs
Класс LongTransactionEventArgs представляет данные событий длительных транзакций.
В текущей версии не реализован.
Класс LongTransactionEventArgs является наследником класса EventArgs и используется для
предоставления данных событий длительных транзакций, определенных в классе LongTransactionManager.
В текущей версии не реализован.
Notes
Типичным примером операций, выполняемых в рамках длительных транзакций, является редактирование внешних ссылок и блоков.