HostMgd.EditorInput.SelectionDetails
Класс, представляющий дополнительные детали выбора объектов.

HostMgd.EditorInput.SelectionDetails.ToString(IFormatProvider)
Возвращает строку, представляющую объект в соответствии с
заданным форматом, зависящим от локализации.
provider: Формат, зависящий от локализации

HostMgd.EditorInput.SelectionDetails.Transform
Возвращает матрицу преобразования, которая прикладывается к
базовым объектам из их контейнеров.