Teigha.BoundaryRepresentation.Mesh2dFilter
Класс Mesh2dFilter представляет интерфейсный класс для фильтров 2D-сети.
Класс Mesh2dFilter представляет интерфейсный класс для фильтров 2D-сети.
Он определяет соответствие между объектами топологии и элементами управления 2D-сети, используемыми в качестве фильтров при генерации 2D-сети.
Notes
Класс Mesh2dFilter реализован только в среде пространственного моделирования.

Teigha.BoundaryRepresentation.Mesh2dFilter.#ctor
Конструктор по умолчанию класса Mesh2dFilter.
Конструктор по умолчанию класса Mesh2dFilter.

Teigha.BoundaryRepresentation.Mesh2dFilter.Insert(Teigha.BoundaryRepresentation.BrepEntity,Teigha.BoundaryRepresentation.Mesh2dControl)
Метод позволяет связать указанный элемент управления 2D-сетью с заданным топологическим объектом BREP.
Метод позволяет связать указанный элемент управления 2D-сетью с заданным топологическим объектом BREP.
brepEntity: Входной топологический BREP-объект, с которым связывается объект meshControl.  Тип BrepEntity.
meshControl: Входной элемент управления 2D-сети.  Тип Mesh2dControl.