HostMgd.ApplicationServices.InplaceTextEditor.Copy
Метод копирует выделенный текст в буфер обмена.
В текущей версии не реализован.
Метод копирует в буфер обмена выделенный в редакторе текст.
На текущее выделение эта операция не влияет.
В текущей версии метод не реализован.