Teigha.DatabaseServices.CellContent
Класс CellContent представляет содержимое ячейки таблицы.
Класс CellContent представляет содержимое ячейки таблицы.

Teigha.DatabaseServices.CellContent.GetBlockAttributeValue(DatabaseServices.ObjectId)
Метод предоставляет значение атрибута для указанного определения атрибута.
Метод предоставляет значение атрибута для указанного идентификатора объекта определения атрибута.
attDefId: Входной идентификатор объекта определения атрибута.
Returns: Возвращает значение атрибута.
Тип String.

Teigha.DatabaseServices.CellContent.GetTextString(Teigha.DatabaseServices.FormatOption)
Метод предоставляет содержимое ячейки в виде текстовой строки с предписанным форматированием.
Метод предоставляет содержимое ячейки в виде текстовой строки, формат которой определяется аргументом formatOption.
formatOption: Опции форматирования значений в ячейке. Перечисление FormatOption.
Returns: Возвращает содержимое ячейки в виде отформатированной текстовой строки.
Тип String.

Teigha.DatabaseServices.CellContent.GetValue(Teigha.DatabaseServices.FormatOption)
Метод предоставляет значение ячейки таблицы.
Метод предоставляет значение ячейки таблицы.
formatOption: Опции форматирования значения ячейки. Перечисление FormatOption.
Returns: Возвращает объект, представляющий значение ячейки.
Тип Object.

Teigha.DatabaseServices.CellContent.SetBlockAttributeValue(DatabaseServices.ObjectId,String)
Метод переопределяет значение атрибута с указанным определением атрибута.
Метод переопределяет значение атрибута с указанным определением атрибута.
Notes
Если тип содержимого ячейки отличается от CellContentTypes.Block, выбрасывается исключение eInvalidInput.
attDefId: Входной идентификатор объекта определения атрибута. Тип DatabaseServices.ObjectId.
value: Новое значение атрибута. Тип String.

Teigha.DatabaseServices.CellContent.SetValue(Object,Teigha.DatabaseServices.ParseOption)
Метод позволяет переопределить значение содержимого ячейки.
Метод позволяет переопределить значение содержимого ячейки.
value: Новое значение содержимого ячейки. Тип Object.
parseOption: Опции парсинга значения. Перечисление ParseOption.

Teigha.DatabaseServices.CellContent.BlockTableRecordId
Свойство BlockTableRecordId предоставляет доступ к идентификатору ObjectId записи в таблице блоков для содержимого ячейки.
Свойство BlockTableRecordId предоставляет доступ к идентификатору ObjectId записи в таблице блоков для содержимого ячейки.
Returns: Возвращает идентификатор ObjectId записи в таблице блоков.

Teigha.DatabaseServices.CellContent.ContentColor
Свойство ContentColor представляет цвет содержимого ячейки.
Свойство ContentColor представляет цвет содержимого ячейки.
Returns: Возвращает цвет содержимого ячейки.
Тип Colors.Color.

Teigha.DatabaseServices.CellContent.ContentTypes
Свойство ContentTypes представляет тип содержимого ячейки таблицы.
Свойство ContentTypes представляет тип содержимого ячейки таблицы (блок, поле, значение, неизвестный тип).
Returns: Возвращает тип содержимого ячейки таблицы.
Перечисление CellContentTypes.

Teigha.DatabaseServices.CellContent.DataFormat
Свойство DataFormat представляет строку форматирования содержимого ячейки таблицы.
Свойство DataFormat представляет строку форматирования содержимого ячейки таблицы.
Returns: Возвращает строку форматирования содержимого ячейки.
Тип String.

Teigha.DatabaseServices.CellContent.DataType
Свойство DataType представляет тип данных содержимого ячейки таблицы.
Свойство DataType представляет тип данных содержимого ячейки таблицы.
Returns: Возвращает тип данных ячейки.  Тип DataTypeParameter.

Teigha.DatabaseServices.CellContent.FieldId
Свойство FieldId представляет идентификатор ObjectId поля, хранящегося в ячейке.
Свойство FieldId представляет идентификатор ObjectId поля, хранящегося в ячейке.
Returns: Возвращает идентификатор поля в ячейке.
Тип ObjectId.

Teigha.DatabaseServices.CellContent.Formula
Свойство Formula представляет формулу в содержимом ячейки таблицы.
Свойство Formula представляет формулу в содержимом ячейки таблицы.
Returns: Возвращает формулу в содержимом ячейки таблицы.
Тип String.

Teigha.DatabaseServices.CellContent.HasFormula
Свойство HasFormula позволяет проверить, хранится ли в ячейке формула.
Свойство HasFormula позволяет проверить, хранится ли в ячейке формула.
Returns: Возвращает true, если в ячейке хранится формула.
В противном случае возвращает false.

Teigha.DatabaseServices.CellContent.IsAutoScale
Свойство IsAutoScale позволяет определить состояние флага автомасштабирования содержимого ячейки таблицы.
Свойство IsAutoScale позволяет определить состояние флага автомасштабирования содержимого ячейки таблицы.
Если этот флаг установлен, то при размещении блока в ячейке объект Table автоматически вычисляет масштаб и точку вставки для содержимого блока.
Returns: Возвращает true, если флаг автомасштабирования содержимого ячейки установлен.
В противном случае возвращает false.

Teigha.DatabaseServices.CellContent.Overrides
Свойство Overrides предоставляет доступ к типу переопределения содержимого ячейки таблицы.
Свойство Overrides предоставляет доступ к типу переопределения содержимого ячейки таблицы.
Returns: Возвращает тип переопределенияе содержимого ячейки таблицы.
Перечисление CellProperties.

Teigha.DatabaseServices.CellContent.Rotation
Свойство Rotation контролирует угол поворота содержимого ячейки.
Свойство Rotation контролирует угол поворота содержимого ячейки.
Returns: Возвращает угол поворота содержимого ячейки.
Тип double.

Teigha.DatabaseServices.CellContent.Scale
Свойство Scale контролирует масштаб содержимого ячейки.
Свойство Scale контролирует масштаб содержимого ячейки.
Returns: Возвращает масштабный множитель для содержимого ячейки.
Тип double.

Teigha.DatabaseServices.CellContent.TextHeight
Свойство TextHeight контролирует высоту текста содержимого ячейки таблицы.
Свойство TextHeight контролирует высоту текста содержимого ячейки таблицы.
Returns: Возвращает высоту текста содержимого ячейки.
Тип double.

Teigha.DatabaseServices.CellContent.TextString
Свойство TextString обеспечивает доступ к текстовому представлению содержимого ячейки.
Свойство TextString обеспечивает доступ к текстовому представлению содержимого ячейки.
Returns: Возвращает строку, которая представляет содержимое ячейки.
Тип String.

Teigha.DatabaseServices.CellContent.TextStyleId
Свойство TextStyleId представляет ObjectId текстового стиля содержимого ячейки.
Свойство TextStyleId представляет идентификатор объекта текстового стиля содержимого ячейки.
Returns: Возвращает идентификатор объекта текстового стиля.
Тип ObjectId.

Teigha.DatabaseServices.CellContent.Value
Свойство Value предоставляет доступ к значению содержимого ячейки.
Свойство Value предоставляет доступ к текущему значению содержимого ячейки.
Returns: Возвращает объект, которым представлено содержимое ячейки.
Тип Object.