Teigha.DatabaseServices.SymbolTableRecord
Базовый класс для классов записей таблиц базы данных чертежа.
Этот класс является базовым классом для всех типов записей,
соответствующих различным таблицам символов.

Teigha.DatabaseServices.SymbolTableRecord.IsDependent
Возвращает true, если запись таблицы символов является
зависимой (т.е. частью присоединенной внешней ссылки
чертежа), в противном случае возвращает false.

Teigha.DatabaseServices.SymbolTableRecord.IsResolved
Возвращает true, если запись таблицы символов является частью
внешней ссылки, которая является успешно "разрешенной"
(загруженной в чертеж). Если запись не является частью
внешней ссылки, или она не загружена в чертеж, возвращается
false. Для определения того, является ли запись частью
внешней ссылки, можно использовать свойство
SymbolTableRecord.IsDependent.

Teigha.DatabaseServices.SymbolTableRecord.Name
Обеспечивает доступ к имени записи таблицы символов.
Строка имени записи таблицы символов используется для DXF как
групповой код 2.