Teigha.Geometry.Cone.GetAngles
Метод позволяет получить начальный и конечный углы поворота образующей для данного конуса.
Метод позволяет получить начальный и конечный углы поворота образующей для данного конуса.
Returns: Возвращает массив, содержащий углы поворота. Тип double[].
Элемент массива с индексом 0 представляет начальный угол, а с индексом 1 — конечный угол.