Teigha.Geometry.CurveCurveIntersector2d
Класс CurveCurveIntersector2d представляет геометрию пересечений 2D-кривых общего вида.
Класс CurveCurveIntersector2d представляет геометрию пересечений 2D-кривых общего вида.
В классах LinearEntity2d, CircularArc2d и EllipticalArc2d есть специальные методы IntersectWith() для поиска точек пересечения двух линий, линии и дуги, двух дуг или линии и эллипса. Однако нет метода для поиска точек пересечения двух 2D-кривых общего вида.  Для решения этой задачи предназначен класс CurveCurveIntersector2d.
Создание объектов этого класса сопровождается указанием двух кривых, пересечения которых требуется вычислить.
Указатели на эти кривые сохраняются как элементы данных этого класса.
Для поиска пересечений возможно дополнительно конкретизировать параметрические интервалы для каждой из кривых.
Класс поддерживает запросы, которые возвращают точки пересечения и интервалы перекрытия кривых.
В классе имеются методы для получения информации о каждой точке пересечения, например, является ли пересечение касательным или трансверсальным.
Если передать в конструктор две совпадающие кривые, можно получить точки самопересечения этой кривой.

Teigha.Geometry.CurveCurveIntersector2d.#ctor
Конструктор по умолчанию класса CurveCurveIntersector2d.
Конструктор по умолчанию для класса CurveCurveIntersector2d.
Создает объект с нулевыми указателями на кривые и допуском по умолчанию.
Предполагается, что реальные данные будут заданы позднее с использованием одного из методов Set().

Teigha.Geometry.CurveCurveIntersector2d.#ctor(IntPtr,System.Boolean)
Конструктор класса CurveCurveIntersector2d.
Создает объект на основе переданного неуправляемого указателя.
Конструктор класса CurveCurveIntersector2d.
Создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d)
Конструктор класса CurveCurveIntersector2d. Создает объект с двумя переданными кривыми.
Конструктор класса CurveCurveIntersector2d.
Создает объект с двумя переданными кривыми.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Geometry.Tolerance)
Конструктор класса CurveCurveIntersector2d.
Создает объект с двумя переданными кривыми и заданной геометрической точностью.
Конструктор класса CurveCurveIntersector2d.
Создает объект с двумя переданными кривыми.
Точки пересечения вычисляются в пределах заданной точности.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.
tolerance: Входное значение геометрической точности. Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval)
Конструктор класса CurveCurveIntersector2d.
Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
Конструктор класса CurveCurveIntersector2d.
Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
Используется точность по умолчанию.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Geometry.Tolerance)
Конструктор класса CurveCurveIntersector2d.
Создает объект для вычисления с заданной точностью пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
Конструктор класса CurveCurveIntersector2d.
Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
Используется указанная геометрическая точность.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.
tolerance: Входное значение геометрической точности. Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector2d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта на основе переданного указателя.
Метод предназначен для создания объекта на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает новый объект CurveCurveIntersector2d.

Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionParameters(System.Int32)
Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
intersection: Индекс точки пересечения, в которой требуется вычислить параметры для пересекающихся кривых. Тип int.
Returns: Возвращает массив из двух элементов. Тип double[].
Первое значение представляет параметр для первой кривой в точке пересечения, а второе значение — параметр для второй кривой в точке пересечения.

Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionPoint(System.Int32)
Метод предоставляет 2D-точку пересечения с указанным индексом.
Метод предоставляет 2D-точку пересечения с указанным индексом.
number: Порядковый индекс искомой точки пересечения. Тип int.
Returns: Возвращает 2D-точку пересечения с индексом number. Тип Point2d.

Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionPointTolerance(System.Int32)
Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
intersection: Индекс интересующей точки пересечения. Тип int.
Returns: Возвращает геометрическую точность вычисления указанной точки пересечения. Тип double.

Teigha.Geometry.CurveCurveIntersector2d.GetOverlapRanges(System.Int32)
Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
overlapNumber: Индекс участка перекрытия (совпадения) кривых. Тип int. Значение overlapNumber должно быть неотрицательным и быть меньше количества перекрытий, возвращаемого свойством OverlapCount.
Returns: Возвращает массив из двух элементов, которые представляют параметрические интервалы для первой и второй кривой, соответственно.  Тип Interval[].

Teigha.Geometry.CurveCurveIntersector2d.GetPointOnCurve1(System.Int32)
Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на первой кривой.
Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на первой кривой.
Класс PointOnCurve2d предоставляет доступ к 2D-координатам и значению параметра возвращаемой точки.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает объект PointOnCurve2d для точки пересечения на первой кривой.

Teigha.Geometry.CurveCurveIntersector2d.GetPointOnCurve2(System.Int32)
Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на второй кривой.
Метод позволяет получить точку пересечения с заданным индексом как точку PointOnCurve2d на второй кривой.
Класс PointOnCurve2d предоставляет доступ к 2D-координатам и значению параметра возвращаемой точки.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает объект PointOnCurve2d для точки пересечения на второй кривой.

Teigha.Geometry.CurveCurveIntersector2d.IsTangential(System.Int32)
Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает true, если в указанной точке кривые являются касательными.
В противном случае возвращает false.

Teigha.Geometry.CurveCurveIntersector2d.IsTransversal(System.Int32)
Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения.
Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения.
В такой точке пересечения вектора касательных к кривым 1 и 2 не параллельны друг другу.
intersection: Входной индекс точки пересечения кривых. Тип int.
Returns: Возвращает true, если пересечение кривых в указанной точке является трансверсальным.
В противном случае возвращает false.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах точности по умолчанию.
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Geometry.Tolerance)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах указанной точности.
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.
tolerance: Входное значение геометрической точности. Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах точности по умолчанию.
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Geometry.Tolerance)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах указанной точности.
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения на заданных параметрических интервалах вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип Curve2d.
curve2: Вторая входная кривая. Тип Curve2d.
range1: Параметрический интервал для первой кривой. Тип Interval.
range2: Параметрический интервал для второй кривой. Тип Interval.
tolerance: Входная геометрическая точность.  Тип Geometry.Tolerance.

Teigha.Geometry.CurveCurveIntersector2d.Curve1
Свойство Curve1 представляет указатель на первую кривую в данном объекте.
Свойство Curve1 представляет указатель на первую кривую в данном объекте.
Returns: Возвращает первую кривую. Тип Geometry.Curve2d.

Teigha.Geometry.CurveCurveIntersector2d.Curve2
Свойство Curve2 представляет указатель на вторую кривую в данном объекте.
Свойство Curve2 представляет указатель на вторую кривую в данном объекте.
Returns: Возвращает вторую кривую. Тип Geometry.Curve2d.

Teigha.Geometry.CurveCurveIntersector2d.NumberOfIntersectionPoints
Свойство NumberOfIntersectionPoints представляет количество найденных точек пересечения двух кривых.
Свойство NumberOfIntersectionPoints представляет количество найденных точек пересечения двух кривых.
Returns: Возвращает количество точек пересечения двух кривых. Тип int.

Teigha.Geometry.CurveCurveIntersector2d.OverlapCount
Свойство OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
Свойство OverlapCount представляет количество интервалов перекрытия для двух кривых в данном объекте.
Returns: Возвращает количество интервалов перекрытия двух кривых. Тип int.

Teigha.Geometry.CurveCurveIntersector2d.OverlapDirection
Свойство OverlapDirection позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
Свойство OverlapDirection позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
Returns: Возвращает true, если две кривые ориентированы в одном направлении на участке их перекрытия.
В случае противоположной ориентации перекрывающихся кривых возвращает значение false. Тип bool.

Teigha.Geometry.CurveCurveIntersector2d.Tolerance
Свойство Tolerance представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
Свойство Tolerance представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
Returns: Возвращает текущее значение точности. Тип Geometry.Tolerance.