HostMgd.PlottingServices.DsdData.GetDsdEntryCollection
Метод предназначен для получения коллекции листов, настроенных для публикации.
Не реализован.
Метод предназначен для получения коллекции листов, настроенных для публикации.
Каждый лист представлен в этой коллекции своим объектом DsdEntry.
В текущей версии не реализован.
Returns: Возвращает коллекцию листов, сохранённых в данном объекте.
Тип HostMgd.PlottingServices.DsdEntryCollection.