Teigha.Colors.EntityColorCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для данной коллекции.
Тип EntityColorCollectionEnumerator.