Teigha.Geometry.Cone.IsClosed
Метод позволяет проверить, является ли основание данного конуса полным кругом.
Метод позволяет проверить, является ли основание данного конуса полным кругом.
Используется вызов метода Cone.IsClosed(Tolerance tolerance) с точностью, равной Tolerance.Global.
Returns: Возвращает true тогда и только тогда, когда основание этого конуса является полным кругом.
В противном случае возвращает false.