HostMgd.ApplicationServices.DrawingOpenEventHandler
Делегат предназначен для обработки события Document.EndDwgOpen, возникающего непосредственно после открытия файла чертежа в nanoCAD.
Делегат DrawingOpenEventHandler определяет тип обработчика события Document.EndDwgOpen.
Он передаёт контекст события через параметры sender и e, где e содержит имя файла и ссылку на базу данных чертежа.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип DrawingOpenEventArgs.