Teigha.Runtime.FileStreamBuf.Read
Метод cчитывает байт в текущей позиции файлового указателя.
Метод cчитывает байт в текущей позиции файлового указателя.
Returns: Возвращает прочитанный байт. Тип char.