Teigha.Geometry.NurbSurface.GetDefinition
Метод предоставляет определение данной NURBS поверхности.
Метод предоставляет определение данной NURBS поверхности.
Определение поверхности NURBS содержит следующую информацию:
* Степени сплайна в направлениях U и V;
* Свойства сплайна в направлениях U и V;
* Количество управляющих вершин в направлениях U и V;
* Сами управляющие вершины;
* Значения веса;
* Узлы в направлениях U и V.
Returns: Возвращает определение данной NURBS поверхности
Тип NurbSurfaceDefinition.