HostMgd.EditorInput.Editor.GetSelection
Метод предназначен для получения набора объектов, выбранных пользователем в текущем чертеже.
Метод используется для получения множества графических объектов,
выделенных пользователем в интерактивном режиме. Пользователь может выбрать один
или несколько объектов с помощью мыши в графической области nanoCAD.
Метод возвращает результат в виде объекта PromptSelectionResult,
который содержит идентификаторы выбранных объектов и информацию о статусе операции.
Если пользователь не выбрал ни одного допустимого объекта или отменил операцию,
статус результата будет отличаться от OK.
Returns: Возвращает объект типа PromptSelectionResult, который содержит:
* Status — статус выполнения операции (OK, Cancel, Error и др.).
* Value — объект типа SelectionSet, содержащий список идентификаторов (ObjectId`) выбранных геометрических объектов.
* StringResult — строковое значение, если выбор был выполнен через ввод с клавиатуры.
Если операция завершена успешно, Status будет равен PromptStatus.OK, и в Value будет содержаться набор выбранных объектов.
Example
C#