Teigha.DatabaseServices.RowsCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для коллекции строк таблицы.
Returns: Возвращает перечислитель для коллекции строк таблицы.
Тип System.Collections.Generic.IEnumerator.