Teigha.GraphicsInterface.DiagnosticPhotonMode
Перечисление DiagnosticPhotonMode определяет поддерживаемые режимы фотонной диагностики.
Перечисление DiagnosticPhotonMode определяет поддерживаемые режимы фотонной диагностики.