Teigha.Geometry.CircularArc2d.SetToComplement
Метод позволяет изменить направление данной дуги при сохранении ее конечных точек.
Метод позволяет переопределить данную дугу, изменив ее направление при сохранении конечных точек.