Teigha.DatabaseServices.Extents2d.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает целочисленный идентификатор, представляющий уникальное для каждого экземпляра класса число. Тип int.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать Extents2d.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.