HostMgd.EditorInput.Editor.PromptedForKeyword
Событие возникает после завершения операции ввода
ключевого слова пользователем в редакторе nanoCAD.
Событие не реализовано.
Событие инициируется, когда пользователь завершает ввод
одного из допустимых ключевых слов через интерактивное приглашение
— например, после вызова метода GetString() с заданным списком ключевых слов.
Это событие позволяет получить результат ввода,
включая введённое слово и статус операции (OK, Cancel, Error и др.).
Событие используется в надстройках и плагинах для реакции
на ввод пользователем определённых команд или параметров,
таких как "Да/Нет", "Открыть/Сохранить" и т. д.
Оно реализуется через делегат PromptStringResultEventHandler,
который передаёт данные в виде объекта PromptStringResultEventArgs.
Example
C#