Teigha.DatabaseServices.AuditPass.Pass2
Значение: 2.
На этапе Pass2 участники аудита должны проверять существование связанных объектов и связей между объектами.
На этом проходе выполняется восстановление объектов (воссоздаются отсутствующие объекты, перенаправляются ссылки и т.п.).