HostMgd.EditorInput.Editor.PromptingForEntity
Событие возникает при начале операции выбора геометрического объекта
и позволяет настроить параметры команды выбора до её запуска.
Событие не реализовано.
Событие инициируется перед началом интерактивного выбора объекта — например,
при вызове метода GetEntity() в .NET API nanoCAD.
Оно предоставляет доступ к параметрам выбора через объект PromptEntityOptionsEventArgs,
что позволяет разработчику динамически изменять:
* текст приглашения (Message),
* допустимые типы объектов (линии, окружности, блоки и др.),
* ключевые слова ,
* режимы ввода (например, AllowNone, AllowArbitraryInput).
Это событие особенно полезно при реализации команд, где требуется фильтрация объектов
или контекстная настройка поведения ввода — например, при создании редакторов,
фильтров выборки или параметрических операций.
Событие вызывается до отображения запроса пользователю,
что позволяет модифицировать параметры ввода в реальном времени.
Example
C#