Teigha.GraphicsSystem.View.Flush
Метод позволяет очистить графический конвейер и отобразить данный объект View.
Этот метод следует вызывать только в интерактивном режиме.
Метод позволяет очистить графический конвейер и отобразить данный объект View.
Этот метод следует вызывать только в интерактивном режиме.