Teigha.GraphicsInterface.TransparencyMode.Transparency1Bit
Значение: 1.
Однобитный альфа-канал кодирует полную прозрачность в каждом пикселе значениями от 0 до 254, значение 255 означает полную непрозрачность.