Teigha.DatabaseServices.DxfFiler.ReadUInt64
Метод возвращает 64-разрядное целое число без знака (ulong) из текущего элемента этого объекта Filer.
Метод возвращает 64-разрядное целое число без знака (ulong) из текущего элемента этого объекта Filer.
Returns: Возвращает 64-разрядное целое число без знака. Тип ulong.