Teigha.DatabaseServices.PolygonMesh
Класс PolygonMesh представляет полигональную сеть в nanoCAD.
Класс PolygonMesh представляет полигональную сеть в nanoCAD.
Сеть PolygonMesh имеет размерность M x N, где M это количество вершин в строке сети, а N это количество вершин в столбце сети.
Сеть может быть открытой или замкнутой в одном или обоих направлениях M и N.
Сеть, замкнутая в некотором направлении, считается непрерывной на стыке последней и первой строк (или, соответственно, столбцов).
Все вершины сети хранятся в одном списке.
Для сети без подгонки к поверхности  первые N вершин образуют первый столбец, вторые N вершин - второй столбец и так далее, пока вершины не закончатся.  Вершины не обязаны полностью заполнять сеть размера M x N.
В случае сети с подгонкой к поверхности вместо размерностей M и N для строк и столбцов используются значения поверхностной плотности вершин.

Teigha.DatabaseServices.PolygonMesh.#ctor
Конструктор по умолчанию.
Этот конструктор инициализирует флаг полилинии равным 16 (это означает, что сеть PolygonMesh не замкнута как в направлении M, так и в направлении N).
Он также присваивает значения 0 для MeshType, для количества вершин в направлении M и в направлении N, поверхностной плотности в направлении M и в направлении N.

Teigha.DatabaseServices.PolygonMesh.#ctor(Teigha.DatabaseServices.PolyMeshType,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,System.Boolean,System.Boolean)
Данный конструктор создает новый объект PolygonMesh с переданными в аргументах параметрами.
Данный конструктор создает новый объект PolygonMesh с переданными в аргументах параметрами.
type: Геометрический тип сети из перечисления PolyMeshType.
size: Количество вершин в направлении M, тип int.
sizeValue: Количество вершин в направлении N, тип int.
vertices: Коллекция вершин данного объекта, тип Point3dCollection.
closedValue: Флаг замкнутости сети в направлении M, тип bool.
closed: Флаг замкнутости сети в направлении N, bool.

Teigha.DatabaseServices.PolygonMesh.AppendVertex(Teigha.DatabaseServices.PolygonMeshVertex)
Метод предназначен для добавления вершины PolygonMeshVertex в список вершин сети PolygonMesh.
Этот метод добавляет к списку вершин PolygonMesh объект PolygonMeshVertex, указанный аргументом toAppend, устанавливает сеть PolygonMesh в качестве владельца вершины и добавляет новую вершину в базу данных, которой принадлежит PolygonMesh.
Чтобы этот метод мог выполняться успешно, сеть PolygonMesh должна быть резидентной в базе данных.
Добавленная вершина должна быть явно закрыта вызывающим приложением после возврата из метода AppendVertex().
toAppend: Вершина PolygonMeshVertex, добавляемая в сеть.
Returns: Возвращает ObjectId вершины.

Teigha.DatabaseServices.PolygonMesh.ConvertToPolyMeshType(Teigha.DatabaseServices.PolyMeshType)
Метод предназначен для преобразования сети PolygonMesh в заданный тип, используя метод SurfaceFit().
Этот метод использует метод SurfaceFit() для преобразования сети PolygonMesh в тип, заданный аргументом newVal.
Допустимые значения для newVal:
Значение            Описание
------------------  ------------------------------------------------------
SimpleMesh 			Простая сеть без аппроксимации или сглаживания поверхности.
QuadSurfaceMesh 	Квадратичная B-сплайновая аппроксимация поверхности.
CubicSurfaceMesh 	Аппроксимация кубической B-сплайновой поверхностью.
BezierSurfaceMesh 	Аппроксимация поверхностью Безье.
newVal: Новый тип сети из перечисления PolyMeshType.

Teigha.DatabaseServices.PolygonMesh.SurfaceFit(Teigha.DatabaseServices.PolyMeshType,System.Int32,System.Int32)
Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети.
Результат эквивалентен команде PEDIT с опцией "Smooth surface".
Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети.
Эта операция обеспечивает те же изменения, что и команда PEDIT с опцией "Smooth surface".
surfType: Тип поверхности из перечисления PolyMeshType (переопределяет системную переменную SURFTYPE).
surfU: Поверхностная плотность M (переопределяет системную переменную SURFU), тип int.
surfV: Поверхностная плотность N (переопределяет системную переменную SURFV), тип int.

Teigha.DatabaseServices.PolygonMesh.IsMClosed
Свойство позволяет определить, является ли сеть замкнутой в направлении M.
Свойство позволяет определить, является ли сеть замкнутой в направлении M.
Returns: Возвращает true, если сеть является замкнутой в направлении M. В противном случае возврщает false.

Teigha.DatabaseServices.PolygonMesh.IsNClosed
Свойство позволяет определить, является ли сеть замкнутой в направлении N.
Свойство позволяет определить, является ли сеть замкнутой в направлении N.
Returns: Возвращает true, если сеть является замкнутой в направлении N. В противном случае возврщает false.

Teigha.DatabaseServices.PolygonMesh.MSize
Свойство предоставляет доступ к количеству вершин в направлении M.
Свойство предоставляет доступ к количеству вершин в направлении M.
Если тип сети PolyMeshType равен SimpleMesh, это количество вершин будет использоваться для создания М строк в PolygonMesh.
Для любого другого типа сети в качестве размера строки будет использоваться поверхностная плотность M.
Returns: Возвращает или задает значение M, тип short.

Teigha.DatabaseServices.PolygonMesh.NSize
Свойство предоставляет доступ к количеству вершин в направлении N.
Свойство предоставляет доступ к количеству вершин в направлении N.
Если тип сети PolyMeshType равен SimpleMesh, это количество вершин будет использоваться для создания N столбцов в PolygonMesh.
Для любого другого типа сети в качестве размера столбца будет использоваться поверхностная плотность N.
Returns: Возвращает или задает значение N, тип short.

Teigha.DatabaseServices.PolygonMesh.MSurfaceDensity
Свойство предоставляет доступ к поверхностной плотности сети в направлении M.
Свойство предоставляет доступ к поверхностной плотности сети в направлении M.
Поверхностная плотность М — это количество вершин в направлении М после выполнения аппроксимации поверхности.
Она используется вместо значения размера M, если тип сети PolyMeshType отличается от SimpleMesh.
Returns: Возвращает или задает поверхностную плотность сети в направлении M.

Teigha.DatabaseServices.PolygonMesh.NSurfaceDensity
Свойство предоставляет доступ к поверхностной плотности сети в направлении N.
Свойство предоставляет доступ к поверхностной плотности сети в направлении N.
Поверхностная плотность N — это количество вершин в направлении N после выполнения операции аппроксимации поверхности.
Она используется вместо значения размера N, если PolyMeshType отличается от SimpleMesh.
Returns: Возвращает или задает поверхностную плотность сети в направлении M.

Teigha.DatabaseServices.PolygonMesh.PolyMeshType
Свойство предоставляет доступ к типу PolyMeshType сети PolygonMesh.
Свойство предоставляет доступ к типу PolyMeshType сети PolygonMesh.
Returns: Возвращает тип PolyMeshType сети.