Teigha.Geometry.CoordinateSystem2d.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Возвращаемая строка включает начало этой системы координат и направления её осей X и Y.
Returns: Возвращает строковое представление данного объекта.
Тип String.