Teigha.DatabaseServices.Cell.GetExtents
Метод предназначен для получения ограничивающего бокса данной ячейки в виде коллекции трехмерных точек.
Метод предназначен для получения ограничивающего бокса данной ячейки в виде коллекции трехмерных точек Point3dCollection.
Returns: Возвращает коллекцию трехмерных точек, которые определяют ограничивающий бокс данной ячейки.
Тип Point3dCollection.