HostMgd.Windows.OpenFileDialog
Диалог открытия файла или выбора папки

HostMgd.Windows.OpenFileDialog.#ctor(System.String,System.String,System.String,System.String,OpenFileDialog.OpenFileDialogFlags)
Конструктор класса