HostMgd.ApplicationServices.InplaceTextEditor.WipeoutDialog
Метод вызывает диалоговое окно маскирования текста.
В текущей версии не реализован.
Метод вызывает диалоговое окно маскирования текста в данном встроенном текстовом редакторе.
В текущей версии этот метод не реализован.