Teigha.DatabaseServices.DxfFiler.ReadDouble
Метод возвращает значение типа double из текущего элемента этого объекта Filer.
Метод возвращает значение типа double из текущего элемента этого объекта Filer.
Returns: Возвращает значение типа double.