Teigha.BoundaryRepresentation.BrepFaceEnumerator
Класс BrepFaceEnumerator представляет перечислитель граней, соответствующих граничному представлению.
Класс BrepFaceEnumerator представляет перечислитель граней, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepFaceEnumerator.Current
Свойство Current представляет текущий элемент данного перечислителя.
Свойство Current представляет текущий элемент данного перечислителя.
Returns: Возвращает грань, которая является текущим элементом данного перечислителя.
Тип Face.