Teigha.DatabaseServices.Filters.LayerIndex
Этот класс представляет собой реализацию индекса для фильтра слоев.
Этот класс представляет собой реализацию индекса для фильтра слоев.

Teigha.DatabaseServices.Filters.LayerIndex.#ctor
Конструктор класса LayerIndex по умолчанию.
Конструктор класса LayerIndex по умолчанию.

Teigha.DatabaseServices.Filters.LayerIndex.Compute(Teigha.DatabaseServices.LayerTable,Teigha.DatabaseServices.BlockTableRecord)
Метод предназначен для вычисления данного фильтра, используя указанные таблицу слоев и запись таблицы блоков.
Метод предназначен для вычисления данного фильтра, используя переданные в метод таблицу слоев и запись таблицы блоков.
pLT: Входная таблица слоев в объекте Database. Тип LayerTable.
record: Входная запись таблицы блоков, для которой должен быть вычислен фильтр. Тип BlockTableRecord.