Teigha.Runtime.CommandFlags.Defun
Значение: 2048 (0x800).
Команда может быть вызвана как функция LISP и, следовательно, может использовать функцию NRX ncedGetArgs() для получения аргументов из LISP и может использовать функцию NRX ncedRetXxx() для возврата значений в LISP.
Этот флаг может быть установлен только в Visual LISP.