Teigha.DatabaseServices.PolygonMesh.SurfaceFit
Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети.
Результат эквивалентен команде PEDIT с опцией "Smooth surface".
Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети.
Эта операция обеспечивает те же изменения, что и команда PEDIT с опцией "Smooth surface".