Teigha.DatabaseServices.Helix.CreateHelix
Метод создает спираль с параметрами, установленными при предыдущих вызовах метода.
Метод создает спираль с параметрами, установленными при предыдущих вызовах метода.
Без вызова этого метода никакая геометрия на экране отображаться не будет.