Teigha.DatabaseServices.Mline
Класс Mline представляет в базе данных объекты мультилиний.
Класс Mline представляет в базе данных объекты мультилиний.

Teigha.DatabaseServices.Mline.#ctor
Конструктор по умолчанию класса Mline.
Конструктор по умолчанию класса Mline.

Teigha.DatabaseServices.Mline.AppendSegment(Teigha.Geometry.Point3d)
Метод добавляет новую вершину в конец этого объекта MLine.
Метод добавляет вершину в конец этого объекта MLine.
Новая вершина получается проецированием указанной 3D-точки newVertex на плоскость данного объекта MLine.
newVertex: Точка, которая используется для создания новой вершины мультилинии. Тип Point3d.

Teigha.DatabaseServices.Mline.Element(Teigha.Geometry.Point3d)
Метод позволяет найти индекс элемента объекта Mline, который содержит указанную точку.
Метод позволяет найти элемент объекта Mline, который содержит переданную в метод точку pt.
Если элемент, на котором точка pt лежит непосредственно, не найден, и объект Mline не является замкнутым, предпринимается попытка проверить, не окажется ли указанная точка на «виртуальных» продолжениях конечных сегментов мультилинии.
В случае успеха метод возвращает индекс найденного элемента мультилинии.
pt: Точка, проверяемая на пересечения с элементами мультилинии.  Тип Point3d.
Returns: В случае успеха возвращает индекс элемента мультилинии, который содержит указанную точку pt.  Тип int.
В противном случае возвращает -1.

Teigha.DatabaseServices.Mline.GetClosestPointTo(Teigha.Geometry.Point3d,System.Boolean,System.Boolean)
Метод позволяет найти точку на объекте MLine, которая является ближайшей к заданной точке.
Метод позволяет найти точку на объекте MLine, которая является ближайшей к заданной точке givenPoint.
Если аргумент extend равен true, то конечные элементы объекта MLine будут «виртуально» продлены для поиска ближайшей точки. Если аргумент excludeCaps равен true, то любые торцевые ограничители и обозначения стыков сегментов объекта MLine будут игнорироваться.
givenPoint: Точка, для которой выполняется поиск ближайшей точки на объекте Mline. Тип Point3d.
extend: Флаг, который определяет, следует ли в процессе поиска ближайшей точки «виртуально» продлевать конечные сегменты объекта Mline. Тип bool.
excludeCaps: Флаг, определяющий, следует ли исключить из рассмотрения торцевые ограничители и обозначения стыков сегментов данной мультилинии. Тип bool.
Returns: Возвращает точку на объекте MLine, ближайшую к заданной.  Тип Point3d.

Teigha.DatabaseServices.Mline.GetClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean)
Метод позволяет найти точку на объекте MLine, которая является ближайшей к проекции заданной точки на плоскость данной мультилинии.
Метод позволяет найти точку на объекте MLine, которая является ближайшей к проекции заданной точки givenPoint на плоскость  данной мультилинии.
Сначала точка givenPoint проецируется вдоль вектора normal на плоскость, содержащую объект MLine.
Затем спроецированная точка используется для поиска ближайшей точки на объекте MLine.
Если аргумент extend равен true, то конечные элементы объекта MLine будут «виртуально» продлены для поиска ближайшей точки.
Если аргумент excludeCaps равен true, то любые торцевые ограничители и обозначения стыков сегментов объекта MLine будут игнорироваться.
givenPoint: Точка, для которой выполняется поиск ближайшей точки на объекте Mline. Тип Point3d.
normal: Нормаль плоскости, на которую выполняется проецирование.  Тип Vector3d.
extend: Флаг, который определяет, следует ли в процессе поиска ближайшей точки продлевать конечные элементы объекта Mline. Тип bool.
excludeCaps: Флаг, определяющий, следует ли исключить из рассмотрения торцевые ограничители и обозначения стыков сегментов данной мультилинии. Тип bool.
Returns: Возвращает точку на объекте MLine, ближайшую к проекции заданной точки givenPoint.  Тип Point3d.

Teigha.DatabaseServices.Mline.MoveVertexAt(System.Int32,Teigha.Geometry.Point3d)
Метод перемещает указанную вершину данного объекта MLine в новое положение, определяемое проекцией указанной 3D-точки на плоскость мультилинии.
Метод перемещает указанную по индексу вершину данного объекта MLine в новое положение, определяемое проекцией указанной 3D-точки newPosition на плоскость мультилинии.  Вершины мультилинии индексируются с нуля.
index: Индекс перемещаемой вершины. Тип int.
newPosition: Точка в мировой системе координат (WCS), проекция которой на плоскость мультилинии задает новое положение вершины с индексом index.  Тип Point3d.

Teigha.DatabaseServices.Mline.RemoveLastSegment([Out]Point3d%)
Метод удаляет текущую последнюю вершину данной мультилинии, что приводит к удалению последнего сегмента объекта Mline, и возвращает новую последнюю вершину мультилинии.
Метод удаляет текущую последнюю вершину данной мультилинии, что приводит к удалению последнего сегмента объекта Mline, и возвращает новую последнюю вершину мультилинии.
lastVertex: Точка новой последней вершины мультилинии. Тип Point3d.

Teigha.DatabaseServices.Mline.VertexAt(System.Int32)
Метод позволяет получить вершину данного объекта MLine с указанным индексом.
Метод позволяет получить точку Point3d в вершине данного объекта MLine с указанным индексом index.
index: Индекс искомой вершины. Тип int.
Returns: Возвращает точку Point3d в вершине с индексом index.

Teigha.DatabaseServices.Mline.IsClosed
Свойство предоставляет возможность проверить, является ли данная мультилиния замкнутой.
Свойство предоставляет возможность проверить, является ли данная мультилиния замкнутой.
Returns: Возвращает true, если мультилиния является замкнутой.
В противном случае возвращает false.

Teigha.DatabaseServices.Mline.Justification
Свойство возвращает выравнивание в данной мультилинии.
Свойство возвращает выравнивание в данной мультилинии.
Returns: Возвращает заданное выравнивание как значение из перечисления MlineJustification.

Teigha.DatabaseServices.Mline.Normal
Свойство представляет вектор нормали плоскости, в которой располагается данный объект Mline.
Свойство представляет вектор нормали плоскости, в которой располагается данный объект Mline.
Returns: Возвращает вектор нормали плоскости данной мультилинии.  Тип Vector3d.

Teigha.DatabaseServices.Mline.NumberOfVertices
Свойство представляет текущее количество вершин данной мультилинии.
Свойство представляет текущее количество вершин данной мультилинии.
Returns: Возвращает количество вершин. Тип int.

Teigha.DatabaseServices.Mline.Scale
Свойство представляет масштаб, заданный для данной мультилинии.
Свойство представляет масштаб, заданный для данной мультилинии.
Returns: Возвращает текущее значение масштаба.  Тип double.

Teigha.DatabaseServices.Mline.Style
Свойство представляет идентификатор объекта MLineStyle, который определяет стиль данного объекта MLine.
Свойство представляет идентификатор объекта MLineStyle, который определяет стиль данного объекта MLine.
Returns: Возвращает идентификатор стиля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Mline.SupressEndCaps
Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя на конце данной мультилинии.
Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя на конце данной мультилинии.
Returns: Возвращает true, если торцевой ограничитель на конце мультилинии подавлен.
В противном случае возвращает false.

Teigha.DatabaseServices.Mline.SupressStartCaps
Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя в начале данной мультилинии.
Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя в начале данной мультилинии.
Returns: Возвращает true, если торцевой ограничитель в начале мультилинии подавлен.
В противном случае возвращает false.