Teigha.DatabaseServices.DxfFiler.ReadUInt16
Метод возвращает 16-разрядное целое число без знака (ushort) из текущего элемента этого объекта Filer.
Метод возвращает 16-разрядное целое число без знака (ushort) из текущего элемента этого объекта Filer.
Returns: Возвращает 16-разрядное целое число без знака. Тип ushort.