Teigha.DatabaseServices.DBObject.ModifiedXData
Событие происходит каждый раз, когда данные XData были записаны в объект.
Событие происходит каждый раз, когда данные XData были записаны в объект.
Returns: Тип данных EventHandler, представляющий обработчик события.