Teigha.DatabaseServices.MeshFaceterData
Структура MeshFaceterData предназначена для хранения данных, которые использует метод
Teigha.DatabaseServices.SubDMesh.GetObjectMesh().
Структура MeshFaceterData предназначена для хранения данных, которые использует метод
Teigha.DatabaseServices.SubDMesh.GetObjectMesh().

Teigha.DatabaseServices.MeshFaceterData.#ctor(System.Double,System.Double,System.Double,System.Double,unsigned short,unsigned short,unsigned short,short)
Конструктор структуры MeshFaceterData.
Конструктор структуры MeshFaceterData. Создает новый экземпляр класса, используя указанные значения параметров.
surface: Значение, представляющее отклонение сети от грани. Тип double.
normal: Угол между соседними гранями сети. Тип double.
gRatio: Максимальное соотношение сторон для четырехугольников сети. Тип double.
eLength: Максимальная длина ребра. Тип double.
numGrid: Максимальное количество используемых линий сети. Тип unsigned short.
uGrid: Минимальное значение параметра U для линий сети. Тип unsigned short.
vGrid: Минимальное значение параметра V для линий сети. Тип unsigned short.
mType: Геометрический тип граней сети.  Тип short. Допустимы следующие типы

Teigha.DatabaseServices.MeshFaceterData.FaceterDevNormal
Свойство DevNormal представляет максимальное угловое отклонение нормалей соседних граней (угол между соседними гранями сети).
Свойство DevNormal представляет максимальное угловое отклонение нормалей соседних граней (угол между соседними гранями сети).  Это значение используется в процедурах разбиения ребер и размещения линий сети на гранях.
Returns: Возвращает максимальный угол между соседними гранями сети. Тип double.

Teigha.DatabaseServices.MeshFaceterData.FaceterDevSurface
Свойство FaceterDevSurface представляет максимальное отклонение сети от поверхности.
Свойство FaceterDevSurface представляет максимальное отклонение сети от поверхности.
Это значение используется для управления отклонением сети от грани в процессе разбиения ребер, а также при размещении линий сети на грани.
Returns: Возвращает максимальное отклонение сети от поверхности. Тип double.

Teigha.DatabaseServices.MeshFaceterData.FaceterGridRatio
Свойство представляет максимальное соотношение сторон у четырехугольников сети.
Свойство представляет максимальное соотношение сторон у четырехугольников сети (grid quads).
Returns: Возвращает максимальное соотношение сторон у четырехугольников сети. Тип double.

Teigha.DatabaseServices.MeshFaceterData.FaceterMaxEdgeLength
Свойство представляет максимальную длину ребер сети.
Свойство представляет максимальную длину ребер сети.
Returns: Возвращает максимальную длину ребер сети.  Тип double.

Teigha.DatabaseServices.MeshFaceterData.FaceterMaxGrid
Свойство представляет максимальное количество линий сети, которые допустимо использовать.
Свойство представляет максимальное количество линий сети, которые допустимо использовать.
Returns: Возвращает максимальное количество линий сети. Тип short.

Teigha.DatabaseServices.MeshFaceterData.FaceterMeshType
Свойство представляет геометрический тип граней сети (треугольные, четырехугольные, гибридный (смешанный) тип).
Свойство представляет геометрический тип граней сети:
* 0 - Только четырехугольные грани.
* 1 - Гибридный (смешанный) тип, когда допускаются как треугольные, так и четырехугольные грани.
* 2 - Только треугольные грани.
Returns: Возвращает геометрический тип граней сети. Тип short.

Teigha.DatabaseServices.MeshFaceterData.FaceterMinUGrid
Свойство представляет минимальное значение параметра U для линий сети.
Свойство представляет минимальное значение параметра U для линий сети.
Returns: Возвращает минимальное значение параметра U. Тип short.

Teigha.DatabaseServices.MeshFaceterData.FaceterMinVGrid
Свойство представляет минимальное значение параметра V для линий сети.
Свойство представляет минимальное значение параметра V для линий сети.
Returns: Возвращает минимальное значение параметра V. Тип short.