Teigha.DatabaseServices.Group.SetAnonymous
Этот метод позволяет сделать данную группу анонимной.
При этом текущее имя группы заменяется на автоматически созданное имя анонимной группы.
Этот метод позволяет сделать данную группу анонимной.
При этом текущее имя группы заменяется на автоматически созданное имя анонимной группы.