Teigha.GraphicsInterface.BoundaryType
Перечисление BoundaryType определяет типы границ, используемые для границ обрезки.
Перечисление BoundaryType определяет типы границ, используемые для границ обрезки.