Teigha.DatabaseServices.Filters.SpatialFilterDefinition.GetPoints
Метод позволяет получить коллекцию точек, которые определяют выдавливаемый контур области фильтра (её основание).
Метод позволяет получить коллекцию точек Point2dCollection, которые определяют выдавливаемый контур области фильтра (её основание).
Returns: Возвращает коллекцию 2D-вершин основания области фильтра. Тип Point2dCollection.