Teigha.BoundaryRepresentation.ShellFaceCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции граней оболочки BREP.
Тип ShellFaceEnumerator.