Teigha.DatabaseServices.DynamicDimensionDataCollection.GetEnumerator
Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
Метод GetEnumerator() позволяет получить перечислитель для этой коллекции.
Returns: Возвращает перечислитель. Тип System.Collections.IEnumerator.