Teigha.DatabaseServices.SystemVariableChangingEventArgs
Класс SystemVariableChangingEventArgs представляет свойства, связанные с событиями системных переменных (в процессе изменения системных переменных).
Класс SystemVariableChangingEventArgs представляет свойства, связанные с событиями системных переменных (в процессе изменения системных переменных).

Teigha.DatabaseServices.SystemVariableChangingEventArgs.Name
Свойство Name представляет имя изменяемой системной переменной.
Свойство Name представляет имя изменяемой системной переменной.
Returns: Возвращает имя изменяемой системной переменной.
Тип String.