Teigha.Geometry.PolylineCurve2d
Класс PolylineCurve2d представляет кусочно-линейные сплайны в двумерном пространстве.
Класс PolylineCurve2d представляет кусочно-линейные сплайны в двумерном пространстве.

Teigha.Geometry.PolylineCurve2d.#ctor
Конструктор по умолчанию класса PolylineCurve2d.
Создает новый объект без каких-либо реальных данных.
Конструктор по умолчанию класса PolylineCurve2d.
Создает новый объект без каких-либо реальных данных.

Teigha.Geometry.PolylineCurve2d.#ctor(Teigha.Geometry.Curve2d,System.Double)
Конструктор класса PolylineCurve2d.
Создает полилинию, которая аппроксимирует указанную кривую с заданной точностью.
Конструктор класса PolylineCurve2d. Создает экземпляр класса с указанными параметрами.
Создает полилинию, аппроксимирующую кривую curve в пределах заданной точности epsilon.
curve: Кривая, которую требуется аппроксимировать полилинией. Тип Curve2d.
epsilon: Точность аппроксимации. Тип double.

Teigha.Geometry.PolylineCurve2d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point2dCollection)
Конструктор класса PolylineCurve2d.
Создает полилинию с указанными управляющими вершинами и узловым вектором.
Конструктор класса PolylineCurve2d.
Создает полилинию с указанными управляющими вершинами controlPoints и узловым вектором knots.
knots: Входной узловой вектор. Тип KnotCollection.
controlPoints: Входные управляющие вершины. Тип Point2dCollection.

Teigha.Geometry.PolylineCurve2d.#ctor(Teigha.Geometry.Point2dCollection)
Конструктор класса PolylineCurve2d.
Создает полилинию по заданному массиву определяющих точек.
Конструктор класса PolylineCurve2d.
Создает полилинию по заданному массиву определяющих точек points.
points: Входная коллекция определяющих точек.  Тип Point2dCollection.

Teigha.Geometry.PolylineCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип PolylineCurve2d.

Teigha.Geometry.PolylineCurve2d.FitPointAt(System.Int32)
Метод предоставляет определяющую точку с указанным индексом.
Метод предоставляет определяющую точку данного сплайна с индексом i.
i: Входной индекс определяющей точки. Индексация начинается с нуля. Тип int.
Returns: Возвращает определяющую точку сплайна с индексом i.
Тип Point2d.

Teigha.Geometry.PolylineCurve2d.SetFitPointAt(System.Int32,Teigha.Geometry.Point2d)
Метод переопределяет определяющую точку сплайна с указанным индексом.
Метод переопределяет координаты определяющей точки сплайна с индексом i.
i: Входной индекс определяющей точки. Тип int.
point: Новые координаты определяющей точки с указанным индексом. Тип Point2d.

Teigha.Geometry.PolylineCurve2d.NumberOfFitPoints
Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
Свойство NumberOfFitPoints представляет количество определяющих точек данного сплайна.
Returns: Возвращает количество определяющих точек сплайна. Тип int.