Teigha.DatabaseServices.Xline
Класс Xline представляет в nanoCAD тип объекта XLINE.  Объект Xline — это линия, бесконечная в обоих направлениях.
Класс Xline представляет в nanoCAD тип объекта XLINE.
Объект Xline — это линия, бесконечная в обоих направлениях. Обычно используется для  вспомогательных построений.

Teigha.DatabaseServices.Xline.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.Xline.#ctor(IntPtr,System.Boolean)
Конструктор.
Конструктор.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.Xline.basePoint
Свойство BasePoint обеспечивает доступ к базовой точке данного объекта Xline.
Свойство BasePoint обеспечивает доступ к базовой точке данного объекта Xline.
Returns: Возвращает или задает базовую точку данного объекта Xline. Тип Point3d.

Teigha.DatabaseServices.Xline.SecondPoint
Свойство SecondPoint обеспечивает доступ ко второй опорной точке, через которую проходит объект Xline.
Свойство SecondPoint обеспечивает доступ ко второй опорной точке, через которую проходит объект Xline.
Returns: Возвращает или задает вторую опорную точку данного объекта Xline. Тип Point3d.

Teigha.DatabaseServices.Xline.UnitDir
Свойство UnitDir обеспечивает доступ к направляющему единичному вектору объекта Xline.
Свойство UnitDir обеспечивает доступ к направляющему единичному вектору объекта Xline.
Returns: Возвращает или задает направляющий единичный вектор данного объекта Xline. Тип Vector3d.