Teigha.DatabaseServices.FileOpenMode.OpenTryForReadShare
Значение: 4.
Базе данных предписывается открыть файл в режиме ForReadAndReadShare,  а если эта попытка не удалась, попытаться открыть файл в режиме ForReadAndAllShare.