HostMgd.EditorInput.JigPromptStringOptions
Класс предназначен для хранения набора параметров, необходимых для запроса текстовых данных во время операции .
Класс предназначен для для хранения набора параметров, необходимых для запроса текстовых данных во время операции .
Используется с методом AcquireString() класса  и позволяет установить для запроса приглашающее сообщение, ключевые слова,
значение по умолчанию, внешний вид курсора и изменить пользовательские настройки ввода.

HostMgd.EditorInput.JigPromptStringOptions.#ctor
Конструктор класса без параметров.
Конструктор класса. Присваивает свойству Message пустую строку. Также устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие). Настройки пользовательского ввода из свойства UserInputControls остаются по умолчанию.

HostMgd.EditorInput.JigPromptStringOptions.#ctor(System.String)
Конструктор класса с одним параметром.
Конструктор класса. Присваивает свойству Message значение параметра  Также конструктор устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие).
message: Текстовое сообщение, приглашающее ввести текст во время операции Jig.

HostMgd.EditorInput.JigPromptStringOptions.#ctor(System.String,System.String)
Конструктор класса с двумя параметрами.
Конструктор класса. Присваивает свойству Message значение параметра , выделяет из этого параметра ключевые слова,
записывает их в свойство Keywords как KeywordCollection вместе с глобальными ключевыми словами из параметра .
Первому ключевому слову в сообщении будет соответствовать первое глобальное ключевое слово и т. д. Также конструктор устанавливает значение свойства
Cursor равное CursorType.Crosshair (перекрестие).
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.