Teigha.DatabaseServices.DBObject.Goodbye
Событие, вызываемое непосредственно перед удалением объекта из памяти.
Событие, вызываемое непосредственно перед удалением объекта из памяти.
Returns: Тип данных ObjectEventHandler, представляющий обработчик события.