HostMgd.EditorInput.PromptSelectionOptions.KeywordInput
Событие возникает, когда пользователь вводит ключевое слово
в ответ на приглашение выбора объектов.
Событие инициируется в процессе выполнения операции выбора объектов
— например, при вызове GetSelection() с заданными ключевыми словами.
Оно генерируется в момент, когда пользователь вводит одно из ключевых слов
(например, "Все", "Фильтр", "Отмена") вместо указания объектов мышью.
Это позволяет разработчику плагина немедленно отреагировать на выбор команды,
не дожидаясь завершения операции ввода.
Событие реализуется через делегат SelectionTextInputEventHandler и предоставляет доступ к:
* введённому ключевому слову,
* контексту операции,
* возможности прервать или изменить дальнейшее поведение команды.
Оно особенно полезно при реализации интерактивных команд, где ключевые слова
управляют логикой выборки — например, "Все" для выбора всех объектов, "Группа"
для выбора по группе, "Фильтр" для задания условий.
Example
C#