Teigha.DatabaseServices.BlockTableRecord.BlockInsertionPoints
Событие возникает, когда в чертеж добавляется вставка данного
определения блока.
Событие возникает, когда в чертеж добавляется вставка данного
определения блока.