Teigha.GraphicsInterface.TransientDrawingMode
Перечисление TransientDrawingMode определяет режимы отрисовки временной графики.
Перечисление TransientDrawingMode определяет режимы отрисовки временной графики.
Режимы отрисовки могут использоваться для указания порядка отрисовки.
В 2D-графической системе самому верхнему уровню соответствует режим Contrast, а самому нижнему — режим Main.
В 3D-графической системе члены DirectShortTerm, Highlight и Contrast также указывают порядок отрисовки, причем самому нижнему уровню соответствует режим DirectShortTerm.