Teigha.DatabaseServices.UnderlayHost
Класс UnderlayHost реализуется хост-приложениями для поддержки подложек.
Класс UnderlayHost реализуется хост-приложениями для поддержки подложек.
Этот интерфейс используется объектами UnderlayDefinition и UnderlayReference для корректной работы.

Teigha.DatabaseServices.UnderlayHost.GetFile(String,String)
Метод позволяет получить файл подложки. В случае необходимости запрашивает пароль.
Метод позволяет получить файл подложки. В случае необходимости запрашивает пароль.
path: Полный путь к файлу, который требуется открыть. Тип String.
password: Опциональная строка пароля. Тип String.
Returns: Возвращает файл подложки.
Тип UnderlayFile.

Teigha.DatabaseServices.UnderlayHost.DgnDocHost
Свойство DgnDocHost представляет текущее хост-приложение для подложки DGN, которое использует текущий документ для объектов OLE.
Свойство DgnDocHost представляет текущее хост-приложение для подложки DGN, которое использует текущий документ для объектов OLE.
Returns: Возвращает хост-приложение для подложки DGN.
Тип UnderlayHost.

Teigha.DatabaseServices.UnderlayHost.DgnHost
Свойство DgnHost представляет текущее хост-приложение для подложки DGN.
Свойство DgnHost представляет текущее хост-приложение для подложки DGN.
Returns: Возвращает хост-приложение для подложки DGN.
Тип UnderlayHost.

Teigha.DatabaseServices.UnderlayHost.DwfHost
Свойство DwfHost представляет текущее хост-приложение для подложки DWF.
Свойство DwfHost представляет текущее хост-приложение для подложки DWF.
Returns: Возвращает хост-приложение для подложки DWF.
Тип UnderlayHost.

Teigha.DatabaseServices.UnderlayHost.PdfHost
Свойство PdfHost представляет текущее хост-приложение для подложки PDF.
Свойство PdfHost представляет текущее хост-приложение для подложки PDF.
Returns: Возвращает хост-приложение для подложки PDF.
Тип UnderlayHost.