Teigha.DatabaseServices.RenderSettings
Класс RenderSettings служит контейнером для свойств, общих для всех инструментов высококачественного рендеринга.
Класс RenderSettings служит контейнером для свойств, общих для всех инструментов высококачественного рендеринга.
В базе данных резидентные объекты RenderSettings хранятся в словаре именованных объектов NamedObjectsDictionary в разделе ACAD_RENDER_SETTINGS. Объекты настройки индексируются по именам.  Кроме того, активные параметры RenderSettings хранятся в NamedObjectsDictionary в разделе ACAD_RENDER_ACTIVE_SETTINGS.

Teigha.DatabaseServices.RenderSettings.#ctor
Конструктор по умолчанию класса RenderSettings.
Конструктор по умолчанию класса RenderSettings.

Teigha.DatabaseServices.RenderSettings.BackFacesEnabled
Свойство BackFacesEnabled позволяет определить, включен ли рендеринг задних граней.
Свойство BackFacesEnabled позволяет определить, включен ли рендеринг задних граней.
Returns: Возвращает true, если рендеринг задних граней выполняется.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderSettings.Description
Свойство Description представляет текстовое описание данного объекта.
Свойство Description представляет текстовое описание данного объекта.
Returns: Возвращает текстовое описание объекта. Тип String.

Teigha.DatabaseServices.RenderSettings.DiagnosticBackgroundEnabled
Свойство DiagnosticBackgroundEnabled позволяет определить, используется ли для рендеринга  диагностический (проверочный) фон.
Свойство DiagnosticBackgroundEnabled позволяет определить, используется ли для рендеринга диагностический (проверочный) фон.
Returns: Возвращает true, если диагностический фон используется.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderSettings.DisplayIndex
Свойство DisplayIndex представляет порядок отображения в пользовательском интерфейсе записей словаря ACAD_RENDER_SETTINGS.
Свойство DisplayIndex представляет порядок отображения в пользовательском интерфейсе записей словаря ACAD_RENDER_SETTINGS.
Returns: Возвращает порядок отображения записей. Тип int.

Teigha.DatabaseServices.RenderSettings.MaterialsEnabled
Свойство MaterialsEnabled позволяет определить, включена ли визуализация объектов с использованием индивидуально настроенных материалов.
Свойство MaterialsEnabled позволяет определить, включена ли визуализация объектов с использованием индивидуально настроенных материалов. Если эта опция отключена, все объекты визуализируются с использованием общего для всех глобального материала.
Returns: Возвращает true, если включен режим использования индивидуально настроенных материалов.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderSettings.Name
Свойство Name представляет имя данного объекта.
Свойство Name представляет пользовательское имя данного объекта RenderSettings.
Returns: Возвращает имя данного объекта. Тип String.

Teigha.DatabaseServices.RenderSettings.PreviewImageFileName
Свойство PreviewImageFileName представляет полное имя файла изображения предварительного просмотра для данного  объекта RenderSettings.
Свойство PreviewImageFileName представляет полное имя файла изображения предварительного просмотра для данного  объекта RenderSettings.
Если значение свойства представляет собой пустую строку, значит изображение предварительного просмотра не определено.
По умолчанию PreviewImageFileName не задано.
Returns: Возвращает полное имя файла изображения. Тип String.

Teigha.DatabaseServices.RenderSettings.ShadowsEnabled
Свойство ShadowsEnabled позволяет определить, включено ли отбрасывание теней.
Свойство ShadowsEnabled позволяет определить, включено ли отбрасывание теней.
Returns: Возвращает true, если рендеринг теней включен.
В противном случае возвращает false.

Teigha.DatabaseServices.RenderSettings.TextureSampling
Свойство TextureSampling позволяет определить, включена ли выборка (фильтрация) текстур для изображения.
Свойство TextureSampling позволяет определить, включена ли выборка (фильтрация) текстур для изображения.
Returns: Возвращает true, если фильтрация текстур включена.
В противном случае возвращает false.