Teigha.DatabaseServices.Dimension.GenerateLayout
Метод предназначен для обновления размера в соответствии с текущим размерным стилем.
На данный момент не реализован.
Метод предназначен для обновления размера в соответствии с текущим размерным стилем, аналогично командам Dim, Update.
Не реализован.