Teigha.DatabaseServices.Cell
Данный класс представляет ячейки таблицы.
Данный класс представляет ячейки таблицы.

Teigha.DatabaseServices.Cell.#ctor(Teigha.DatabaseServices.Table,System.Int32,System.Int32)
Конструктор класса Cell. Создает ячейку в указанной таблице в заданных строке и столбце.
Конструктор класса Cell.
Создает ячейку в указанной таблице в заданных строке и столбце.
table: Таблица, в которой создается ячейка. Тип Table.
row: Индекс строки таблицы. Тип int.
column: Индекс столбца таблицы. Тип int.

Teigha.DatabaseServices.Cell.GetBlockAttributeValue(Teigha.DatabaseServices.ObjectId)
Метод позволяет получить значение указанного атрибута блока данной ячейки.
Метод позволяет получить значение указанного атрибута блока данной ячейки.
attDefId: Идентификатор объекта определения атрибута. Тип ObjectId.
Returns: Возвращает значение указанного атрибута блока.  Тип String.

Teigha.DatabaseServices.Cell.GetTextString(Teigha.DatabaseServices.FormatOption)
Метод позволяет получить текстовую строку из данной ячейки, отформатированную согласно указанным опциям.
Метод позволяет получить текстовую строку из данной ячейки, отформатированную согласно указанным опциям.
Допустимы следующие варианты:
Имя            			Значение
--------------------	------
FormatOptionNone       	0
ForEditing             	1
ForExpression          	2
UseMaximumPrecision    	4
IgnoreMtextFormat      	8
formatOption: Опции форматирования строки. Значение из перечисления FormatOption.
Returns: Возвращает отформатированную текстовую строку из данной ячейки. Тип String.

Teigha.DatabaseServices.Cell.GetValue(Teigha.DatabaseServices.FormatOption)
Метод позволяет получить значение, сохраненное в данной ячейке.
Метод позволяет получить значение, сохраненное в данной ячейке.
Аргумент formatOption позволяет настроить формат возвращаемого объекта.
formatOption: Опции форматирования значения из ячейки из перечисления FormatOption.
Returns: Возвращает значение из ячейки в требуемом формате. Тип Object.

Teigha.DatabaseServices.Cell.SetBlockAttributeValue(Teigha.DatabaseServices.ObjectId,String)
Метод задаёт значение указанного атрибута блока данной ячейки.
Метод задаёт значение указанного атрибута блока данной ячейки.
Атрибут задается идентификатором определения атрибута.
attDefId: Идентификатор объекта определения атрибута. Тип ObjectId.
value: Новое значение атрибута. Тип String.

Teigha.DatabaseServices.Cell.SetValue(Object,Teigha.DatabaseServices.ParseOption)
Метод позволяет задать значение указанного атрибута блока данной ячейки.
Метод позволяет задать значение указанного атрибута блока данной ячейки.
Атрибут определяется идентификатором определения атрибута.
value: Новое значение атрибута. Тип Object.
parseOption: Опции представления нового значения из перечисления ParseOption.

Teigha.DatabaseServices.Cell.UpdateDataLink(Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод обновляет в этой ячейке ссылки на внешние данные.
Метод обновляет в этой ячейке ссылки на внешние данные.
Аргументы метода позволяют указать направление и опции обновления ссылок.
dir: Направление обновления ссылок. Значение из перечисления UpdateDirection.
option: Опции обновления ссылок. Значение из перечисления UpdateOption.

Teigha.DatabaseServices.Cell.AttachmentPoint
Свойство возвращает точку присоединения ячейки.
Свойство возвращает точку Point3d присоединения ячейки.
Returns: Возвращает точку присоединения ячейки. Тип Point3d.

Teigha.DatabaseServices.Cell.BlockTableRecordId
Свойство предоставляет доступ к идентификатору записи в таблице блоков для данного объекта.
Свойство предоставляет доступ к идентификатору записи в таблице блоков для данного объекта.
Returns: Возвращает идентификатор записи в таблице блоков. Тип ObjectId.

Teigha.DatabaseServices.Cell.CellType
Свойство возвращает тип данной ячейки.
Свойство возвращает тип данной ячейки.
Returns: Возвращает тип ячейки. Значение из перечисления TableCellType.

Teigha.DatabaseServices.Cell.Column
Свойство возвращает индекс столбца данной ячейки.
Свойство возвращает индекс столбца данной ячейки.
Returns: Возвращает индекс столбца данной ячейки. Тип int.

Teigha.DatabaseServices.Cell.Contents
Свойство возвращает коллекцию элементов содержимого данной ячейки.
Свойство возвращает коллекцию CellContentsCollection элементов содержимого данной ячейки.
Returns: Возвращает коллекцию элементов содержимого данной ячейки. Тип CellContentsCollection.

Teigha.DatabaseServices.Cell.ContentTypes
Свойство возвращает тип содержимого ячейки.
Свойство возвращает тип содержимого ячейки.
Returns: Возвращает тип содержимого ячейки из перечисления Teigha.DatabaseServices.CellContentTypes.

Teigha.DatabaseServices.Cell.DataLink
Свойство обеспечивает доступ к ссылке на внешние данные, которая хранится в данной ячейке.
Свойство обеспечивает доступ к ссылке на внешние данные, которая хранится в данной ячейке.
Returns: Возвращает ссылку на данные. Тип ObjectId.

Teigha.DatabaseServices.Cell.FieldId
Свойство обеспечивает доступ к идентификатору поля в данной ячейке.
Свойство обеспечивает доступ к идентификатору поля в данной ячейке.
Returns: Возвращает идентификатор поля.  Тип ObjectId.

Teigha.DatabaseServices.Cell.Row
Свойство возвращает индекс строки данной ячейки.
Свойство возвращает индекс строки данной ячейки.
Returns: Возвращает индекс строки данной ячейки. Тип int.

Teigha.DatabaseServices.Cell.TextString
Свойство обеспечивает доступ к текстовой строке, которая хранится в данной ячейке.
Свойство обеспечивает доступ к текстовой строке, которая хранится в данной ячейке.
Returns: Возвращает строку. Тип String.

Teigha.DatabaseServices.Cell.ToolTip
Свойство обеспечивает доступ к подсказке, сохраненной в данной ячейке.
Свойство обеспечивает доступ к подсказке, сохраненной в данной ячейке.
Returns: Возвращает текст подсказки в ячейке. Тип String.

Teigha.DatabaseServices.Cell.Value
Свойство обеспечивает доступ к значению, хранимому в данной ячейке.
Свойство обеспечивает доступ к значению, хранимому в данной ячейке.
Returns: Возвращает к значению, хранимому в данной ячейке. Тип Object.