HostMgd.EditorInput.JigPromptAngleOptions.DefaultValue
Значение по умолчанию для запроса угла во время операции Jig.
Свойство предназначено для чтения и определения значения угла по умолчанию для операции Jig с геометрическим объектом.
Значение по умолчанию будет использовано, если пользователь во время запроса нажал клавишу ENTER без какого-либо ввода.
Returns: Возвращает значение угла, заданное по умолчанию.