HostMgd.EditorInput.PromptDoubleOptionsEventArgs
Класс предоставляет данные для события PromptingForDouble,
позволяя настроить параметры ввода вещественного числа перед началом операции.
Класс используется в .NET API nanoCAD для передачи параметров
при начале интерактивного ввода вещественного числа — например,
при вызове метода GetDouble(). Он применяется в обработчике события
PromptingForDouble и предоставляет доступ к объекту PromptDoubleOptions,
содержащему настройки команды ввода.
Через этот класс можно:
* изменить текст приглашения (Message),
* задать значение по умолчанию (DefaultValue),
* управлять режимами ввода (AllowNone, AllowNegative, AllowZero и др.).
Класс позволяет динамически настраивать поведение команды в зависимости от контекста,
что особенно полезно при реализации гибких интерактивных команд — таких как масштабирование,
параметризация или математические операции.
Example
C#

HostMgd.EditorInput.PromptDoubleOptionsEventArgs.Options
Свойство возвращает параметры приглашения,
используемые при интерактивном вводе вещественного числа.
Свойство предоставляет доступ к объекту PromptDoubleOptions,
содержащему настройки команды ввода вещественного числа — такие как
сообщение приглашения, значение по умолчанию, допустимый диапазон и режимы ввода.
Оно используется в обработчике события PromptingForDouble для динамической настройки
поведения команды GetDouble() перед началом взаимодействия с пользователем.
Свойство доступно только для чтения, но позволяет изменять свойства
возвращённого объекта, что даёт возможность модифицировать параметры ввода в реальном времени.
Returns: Возвращает объект типа PromptDoubleOptions, содержащий:
* Message — текст приглашения,
* DefaultValue — значение по умолчанию (вводится при нажатии Enter),
* AllowNone — разрешение на пропуск ввода,
* AllowNegative — разрешение на отрицательные значения,
* AllowZero — разрешение на ввод нуля.
Если объект не был инициализирован, может вернуть null.
Example
C#