Teigha.DatabaseServices.BlockReference.Rotation
Обеспечивает доступ к величине угла поворота (в радианах)
ссылки на блок. Угол поворота отсчитывается относительно оси
X координатной системы, которая параллельна JCS ссылки на
блок, но ее начало находится в точке, указывающей на ссылку
на блок. Ось поворота — это ось Z этой координатной системы с
положительным значением угла, отсчитываемым против часовой
стрелки, если смотреть вниз по оси Z по направлению к центру
координат.
Note
Значение угла поворота — это групповой код 50 в DXF.