Teigha.BoundaryRepresentation.Mesh
Класс Mesh реализует базовый интерфейс сети.
Класс Mesh реализует базовый интерфейс сети.
Сеть представляет собой сеть узлов, аппроксимирующих кривые, поверхности или объемы в объекте или подобъекте BREP и, таким образом, имеет связанную геометрию.  Этот класс определяет функционал, общий для сетей всех размерностей и используемый через дочерние классы.  Сети каждой поддерживаемой размерности соответствует собственный класс.
В узлах и элементах сети сохраняются ссылки как на геометрию, так и на соответствующую исходную топологию BREP.
Фасетирование общего вида представлено подклассом Mesh2d.