Teigha.GraphicsSystem.Device.CreateView
Метод позволяет создать новый вид и связать его с данным устройством.
Метод создает новый вид и связывает его с данным устройством.
Возвращает дескриптор созданного вида.
Returns: Возвращает дескриптор созданного вида.
Тип View.