HostMgd.EditorInput.EditorVisualStyle
Класс для работы с визуальными стилями.

HostMgd.EditorInput.EditorVisualStyle.IsVS2dType
Возвращает true, если визуальный стиль является 2D стилем.

HostMgd.EditorInput.EditorVisualStyle.IsVS3dType
Возвращает true, если визуальный стиль является 3D стилем.