HostMgd.ApplicationServices.DocumentIterator.MoveNext
Метод перемещает текущий указатель на следующую запись. При
перемещении указателя за пределы коллекции метод возвращает
значение false, в противном случае метод возвращает значение
true.