Teigha.DatabaseServices.DBVisualStyle
Данный класс описывает визуальный стиль как объект базы данных.
Данный класс описывает визуальный стиль как объект базы данных. Визуальный стиль содержит набор свойств, которые в совокупности определяют характер визуального отображения модели.

Teigha.DatabaseServices.DBVisualStyle.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DBVisualStyle.#ctor(IntPtr,System.Boolean)
Конструктор класса DBVisualStyle.
Конструктор класса DBVisualStyle.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.DBVisualStyle.CopyFrom(Teigha.GraphicsInterface.VisualStyle)
Метод делает данный объект копией указанного визуального стиля VisualStyle.
Метод делает данный объект копией указанного визуального стиля VisualStyle.
pSrc: Визуальный стиль, являющийся источником данных для операции копирования. Тип VisualStyle.

Teigha.DatabaseServices.DBVisualStyle.CopyTo(Teigha.GraphicsInterface.VisualStyle)
Метод копирует данный визуальный стиль в указанный объект типа VisualStyle.
Метод копирует данный визуальный стиль в указанный объект типа VisualStyle.
pDest: Визуальный стиль, в который копируются данные из этого стиля. Тип VisualStyle.

Teigha.DatabaseServices.DBVisualStyle.GetTrait(Teigha.GraphicsInterface.VisualStyleProperty)
Метод позволяет получить значение указанного свойства данного визуального стиля.
Метод позволяет получить значение указанного свойства данного визуального стиля.
vsProp: Запрашиваемое свойство данного визуального стиля.  Значение из перечисления VisualStyleProperty.
Returns: Возвращает значение свойства. Тип GraphicsInterface.Variant.

Teigha.DatabaseServices.DBVisualStyle.GetTraitFlag(Teigha.GraphicsInterface.VisualStyleProperty,unsigned long)
Метод проверяет, установлен ли указанный флаг для указанного свойства визуального стиля.
Метод позволяет проверить, установлен ли указанный флаг для указанного свойства визуального стиля.
Применяется для свойств, которые являются перечислениями битовых полей.
vsProp: Запрашиваемое свойство визуального стиля. Значение из перечисления VisualStyleProperty.
flagValue: Проверяемый флаг. Тип unsigned long.
Returns: Возвращает true, если указанный флаг в этом свойстве выставлен. В противном случае возвращает false.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,Colors.Color,Teigha.GraphicsInterface.VisualStyleOperation)
Метод задает значение свойству цвета визуального стиля.
Метод задает значение свойству цвета визуального стиля.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
color: Цвет, который следует задать. Тип Colors.Color.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,Teigha.GraphicsInterface.Variant,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать значение типа Variant указанному свойству данного визуального стиля.
Метод позволяет задать значение типа Variant указанному свойству данного визуального стиля.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
val: Значение свойства, которое требуется задать. Тип Variant.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Boolean,VisualStyleOperation )
Метод позволяет задать указанному свойству данного визуального стиля логическое значение.
Метод позволяет задать указанному свойству данного визуального стиля логическое значение.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
bVal: Логическое значение, которое требуется задать свойству. Тип bool.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Double,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать указанному свойству данного визуального стиля значение с плавающей точкой двойной точности.
Метод позволяет задать указанному свойству данного визуального стиля значение с плавающей точкой двойной точности.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
bVal: Числовое значение, которое требуется задать свойству. Тип double.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Double,System.Double,System.Double,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать значения RGB в свойствах визуального стиля.
Метод позволяет задать значения RGB в свойствах визуального стиля.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
red: Красная компонента цвета.Тип double.
green: Зеленая компонента цвета.Тип double.
blue: Синяя компонента цвета.  Тип double.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Int32,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать указанному свойству данного визуального стиля целочисленное значение.
Метод позволяет задать указанному свойству данного визуального стиля целочисленное значение.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
nVal: Целочисленное значение для свойсва. Тип double.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTraitFlag(Teigha.GraphicsInterface.VisualStyleProperty,unsigned long,System.Boolean)
Метод позволяет задать значение флага в указанном свойстве данного стиля.
Метод позволяет задать значение флага в указанном свойстве данного стиля.
Применяется для свойств, которые являются перечислениями битовых полей.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
flagVal: Значение флага для свойства. Тип unsigned long.
bEnable: Тип операции, применяемой к свойству. Тип bool.

Teigha.DatabaseServices.DBVisualStyle.Description
Свойство обеспечивает доступ к описанию визуального стиля.
Свойство обеспечивает доступ к описанию визуального стиля.
Returns: Возвращает описание стиля. Тип String.

Teigha.DatabaseServices.DBVisualStyle.InternalUseOnly
Свойство позволяет определить или указать, что данный объект предназначен только для внутреннего использования.
Свойство позволяет определить или указать, что данный объект предназначен только для внутреннего использования.
Returns: Возвращает true, если объект предназначен только для внутреннего использования.
В противном случае возвращает false.

Teigha.DatabaseServices.DBVisualStyle.Name
Свойство предоставляет доступ к имени визуального стиля.
Свойство предоставляет доступ к имени визуального стиля.
Returns: Возвращает имя стиля. Тип String.

Teigha.DatabaseServices.DBVisualStyle.Type
Свойство предоставляет доступ на изменение к типу визуального стиля.
Свойство предоставляет доступ на изменение к типу визуального стиля.
Returns: Возвращает тип визуального стиля как значение из перечисления VisualStyleType.