Teigha.Geometry.PointOnSurface.GetMixedPartial
Метод вычисляет смешанную частную производную в текущей точке поверхности.
В текущей версии не реализован.
Метод вычисляет смешанную частную производную в текущей точке поверхности.
В текущей версии не реализован.
Returns: Возвращает вектор смешанной частной производной в данной точке поверхности.
Тип Vector3d.