Teigha.DatabaseServices.TableStyleOverride
Перечисление TableStyleOverride определяет поддерживаемые настройки стиля таблицы.
Перечисление TableStyleOverride определяет поддерживаемые переопределения настроек стиля таблицы.