Teigha.Geometry.BoundBlock3d.GetMinimumPoint
Метод предоставляет минимальную точку данной граничной рамки.
Метод предоставляет минимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса Point3d, который представляет минимальную точку граничной рамки.