Teigha.DatabaseServices.CompoundObjectId.NullId
Метод позволяет получить нулевой идентификатор составного объекта CompoundObjectId.
Метод позволяет получить нулевой идентификатор составного объекта CompoundObjectId.
Returns: Возвращает нулевой идентификатор объекта CompoundObjectId.