Teigha.BoundaryRepresentation.Element
Класс Element является интерфейсным базовым классом для элементов сети.
Элемент сети представляет собой минимальное замкнутое, упорядоченное подмножество соединенных узлов сети.
Этот класс определяет функционал, который является общим для элементов сети во всех измерениях.
Пользователь не может создавать экземпляры этого класса непосредственно.
Класс Element является интерфейсным базовым классом для элементов сети.
Элемент сети представляет собой минимальное замкнутое, упорядоченное подмножество соединенных узлов сети.
Этот класс определяет функционал, который является общим для элементов сети во всех измерениях.
Пользователь не может создавать экземпляры этого класса.
Notes
Класс доступен только в среде пространственного моделирования.