HostMgd.ApplicationServices.Application
Класс представляет приложение nanoCAD. Имеет только статические методы.
Данный класс нельзя наследовать, как базовый класс. Он обеспечивает доступ к таким объектам,
как редактор nanoCAD, менеджер документов и главное окно приложения. Он также содержит методы для обновления
экрана nanoCAD, вызываемой и контекстной справки.

HostMgd.ApplicationServices.Application.#ctor
Конструктор класса.
Конструктор класса.

HostMgd.ApplicationServices.Application.AddDefaultContextMenuExtension(HostMgd.Windows.ContextMenuExtension)
Метод предназначен для добавления пункта меню в контекстное меню по умолчанию.
Метод добавляет пункт меню в контекстное меню по умолчанию.
menuExtension: Пункт контекстного меню, который будет добавлен в контекстное меню по умолчанию

HostMgd.ApplicationServices.Application.AddObjectContextMenuExtension(Teigha.Runtime.RXClass,HostMgd.Windows.ContextMenuExtension)
Метод предназначен для добавления пунктов меню в контекстное меню для указанного класса.
Метод добавляет пункты меню в контекстное меню для указанного класса.
runtimeClass: Класс объекта, имеющего контекстное меню, в которое будут вставлены пункты меню
menuExtension: Пункты контекстного меню, которые будут добавлены в контекстное меню класса

HostMgd.ApplicationServices.Application.RemoveDefaultContextMenuExtension(HostMgd.Windows.ContextMenuExtension)
Метод предназначен для удаления пункта контекстного меню из контекстного меню по умолчанию.
Метод удаляет пункт контекстного меню из контекстного меню по умолчанию.
menuExtension: Пункт контекстного меню, который должен быть удален из меню по умолчанию

HostMgd.ApplicationServices.Application.RemoveObjectContextMenuExtension(Teigha.Runtime.RXClass,HostMgd.Windows.ContextMenuExtension)
Метод предназначен для удаления пунктов контекстного меню из контекстного меню класса.
Метод удаляет пункты контекстного меню из контекстного меню класса.
runtimeClass: Класс объекта, имеющего контекстное меню, из которого будут удалены пункты меню
menuExtension: Пункты контекстного меню, которые будут удалены из контекстного меню класса

HostMgd.ApplicationServices.Application.DoDragDrop(System.Windows.Forms.Control,System.Object,System.Windows.Forms.DragDropEffects,HostMgd.Windows.DropTarget)
Метод предназначен для выполнения OLE-операции drag-and-drop (перемещения элемента).
Метод выполняет OLE операцию drag-and-drop (перемещения элемента).
control: Элемент управления, к которому применяется операция drag\-and\-drop (перемещения элемента)
data: Данные элемента управления
allowedEffects: Разрешенные для элемента управления эффекты
target: Расположение элемента после выполнения операции

HostMgd.ApplicationServices.Application.GetSystemVariable(System.String)
Метод предназначен для получения значения системной переменной.
Метод находит в базе данных значение системной переменной, название которой было указано в параметре и возвращает его
в формате object.
name: Имя системной переменной, для которой возвращается значение. Тип String
Returns: Значение системной переменной, тип object.

HostMgd.ApplicationServices.Application.Quit
Метод предназначен для программного завершения работы приложения nanoCAD.
Метод завершает работу приложения.

HostMgd.ApplicationServices.Application.SetSystemVariable(System.String,System.Object)
Метод предназначен для изменения значения системной переменной.
Метод устанавливает новое значение системной переменной.
name: Имя системной переменной, для которой задается значение
value: Задаваемое значение
В примере приведен фрагмент кода, изменяющий размер курсора через системную переменную CURSORSIZE:

HostMgd.ApplicationServices.Application.ShowModalWindow(IntPtr,System.Windows.Window )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме.
Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModalWindow(IntPtr,System.Windows.Window ,System.Boolean)
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме
и признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец и флаг
сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModalWindow(System.IntPtr,System.Windows.Window,bool )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModalWindow(System.IntPtr,System.Windows.Window)
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме.
Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModalWindow(System.Windows.Window )
Метод предназначен для вызова WPF-формы в модальном режиме.
Метод вызывает WPF-форму в модальном режиме.
formToShow: Форма, которая должна быть показана
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModalWindow(System.Windows.Window ,System.Windows.Window )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме.
Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModalWindow(System.Windows.Window ,System.Windows.Window ,System.Boolean)
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModalWindow(System.Windows.Window,System.Windows.Window,bool )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в модальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в модальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна
Returns: Возвращает результат работы диалога, тип bool. Также возможно значение null.

HostMgd.ApplicationServices.Application.ShowModelessWindow(IntPtr,System.Windows.Window )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме.
Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана

HostMgd.ApplicationServices.Application.ShowModelessWindow(IntPtr,System.Windows.Window ,System.Boolean)
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна

HostMgd.ApplicationServices.Application.ShowModelessWindow(System.IntPtr ,System.Windows.Window)
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна

HostMgd.ApplicationServices.Application.ShowModelessWindow(System.IntPtr ,System.Windows.Window,bool )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна

HostMgd.ApplicationServices.Application.ShowModelessWindow(System.Windows.Window )
Метод предназначен для вызова WPF-формы в немодальном режиме.
Метод вызывает WPF-форму в немодальном режиме.
formToShow: Форма, которая должна быть показана

HostMgd.ApplicationServices.Application.ShowModelessWindow(System.Windows.Window ,System.Windows.Window )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме.
Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана

HostMgd.ApplicationServices.Application.ShowModelessWindow(System.Windows.Window ,System.Windows.Window ,System.Boolean)
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна

HostMgd.ApplicationServices.Application.ShowModelessWindow(System.Windows.Window,System.Windows.Window,bool )
Метод предназначен для вызова WPF-формы с указанным окном-владельцем в немодальном режиме и
признаком сохранения позиции и размера окна.
Метод вызывает WPF-форму в немодальном режиме, для которой указано окно-владелец и
признак сохранения позиции и размера окна.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть показана
persistSizeAndPosition: Сохранять или нет позицию и размеры окна

HostMgd.ApplicationServices.Application.ShowAlertDialog(System.String)
Метод предназначен для вызова диалогового окна с предупреждающим сообщением.
Метод вызывает диалоговое окно с предупреждающим сообщением.
message: Выводимое сообщение

HostMgd.ApplicationServices.Application.UpdateScreen
Метод предназначен принудительного обновления экрана.
Метод вызывает принудительное обновление экрана.

HostMgd.ApplicationServices.Application.SetChild(System.IntPtr)
Метод предназначен для назначения одного окна другому дочерним для главного окна nanoCAD.
Метод устанавливает окно handleWindow дочерним для главного окна nanoCAD.
handleWindow: Окно, которое нужно сделать дочерним для главного окна nanoCAD

HostMgd.ApplicationServices.Application.EvaluateDiesel(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВОЗВРАЩАЕТ NULL.
Метод предназначен для интерпретации строки в строковый результат.
Метод использует DIESEL для интерпретации строки, переданной через параметр dieselCmd.
DIESEL - Direct Interpretively Evaluated String Expression Language, язык строковых выражений с прямой интерпретацией.
Метод интерпретирует строку в тип данных PronptStringResult, который потом можно использовать в интерфейсе программы.
Строки, сгенерированные выражениями DIESEL, могут быть использованы для:
* управления надписями и поведением кнопок на ленточных панелях и панелях инструментов;
* отображения текста в строке состояния с помощью системной переменной MODEMACRO;
* манипуляций строковыми значениями с помощью функции LISP menucmd.
dieselCmd: Строка, которую нужно интерпретировать. Тип String
Returns: Возвращает интерпретированную строку. Тип String.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.GetPublicVisualStyles(System.Boolean)
Метод предоставляет доступ к коллекции общедоступных визуальных стилей.
Метод предназначен для доступа к словарю общедоступных визуальных стилей. В словарь могут войти либо только общие стили, доступные и в пространстве модели
и в пространстве листа. Либо с помощью параметра alsoSpecial можно добавить к словарю стили, доступные только в активном пространстве: модели или листа.
alsoSpecial: Добавлять особые стили. Тип bool
Returns: Возвращает словарь с визуальными стилями. Каждый элемент словаря содержит ключ - название стиля и ObjectId стиля в базе данных чертежа.
Тип System.Collections.Generic.Dictionary.

HostMgd.ApplicationServices.Application.GetWhoHasInfo(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВОЗВРАЩАЕТ NULL.
Метод предоставляет доступ к информации о том, у кого открыт файл редактирования в nanoCAD.
Метод предоставляет информацию о том, у кого открыт файл редактирования в nanoCAD.
Информация извлекается из DLL-файлов, которые создаются nanoCAD и управляются им.
pathname: Полный путь и имя файла чертежа. Тип string
Returns: Возвращаемый объект WhoHasInfo содержит ту же информацию, которая отображается командой WHOHAS.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.Invoke(Teigha.DatabaseServices.ResultBuffer)
МЕТОД НЕ РЕАЛИЗОВАН. ВОЗВРАЩАЕТ NULL
Метод предназначен для вызова функций, определенный в других приложениях.
Метод вызывает функцию, определенную в другом приложении.
args: Указатель на функцию, которую нужно вызвать. Тип ResultBuffer
Returns: Вовзращает указатель на результат работы функции. Тип ResultBuffer
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32)
МЕТОД НЕ РЕАЛИЗОВАН. Метод вызывает контекстную справку.
Метод открывает окно с контекстной справкой ждя указанного
контекста.
window: Указатель на окно, для которого вызывается
contextId: Идентификатор контекста, для которого вызывается

HostMgd.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32,System.String)
МЕТОД НЕ РЕАЛИЗОВАН.
Метод вызывает контекстную справку с заданной темой.
Метод открывает окно с контекстной справкой на заданную тему.
window: Указатель на окно, для которого вызывается справка. Тип IntPtr
contextId: Идентификатор контекста, для которого вызывается справка. Тип Integer
helpPrefix: Тема справки, которую нужно открыть. Тип String

HostMgd.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32,System.String,HelpEventArgs)
МЕТОД НЕ РЕАЛИЗОВАН.
Метод вызывает контекстную справку с заданной темой на заданное событие.
Метод открывает окно с контекстной справкой на заданную тему после заданного события.
window: Указатель на окно, для которого вызывается справка. Тип IntPtr
contextId: Идентификатор контекста, для которого вызывается справка. Тип Integer
helpPrefix: Тема справки, которую нужно открыть. Тип String
hlpevent: Событие, после которого нужно открыть справку. Тип HelpEventArgs

HostMgd.ApplicationServices.Application.InvokeHelp(System.String,System.String)
Метод открывает файл со справкой на указанной теме.
Метод открывает файл со справкой на указанной теме.
fileName: Путь к файлу справки с его названием. Тип String
topic: Тема, на которой нужно открыть справку. Тип String

HostMgd.ApplicationServices.Application.InvokeHelpForExternal(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Метод вызывает справку для внешних функций.
Метод открывает окно со справной для внешней функции.
functionName: Название внешней функции. Тип String
Returns: Тип bool: true - функция и справка для нее успешной найдены, flase - справка для функции не найдена.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.IsConnectEnabled
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Метод позволяет проверить, есть ли соединение с интернетом.
Метод проверяет, есть ли соединение с интернетом.
Returns: Тип bool: true - соединение есть, false - соединения нет.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.IsFileLocked(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Метод проверяет, доступен ли указанный файл.
Метод проверяет, доступен ли указанный файл.
pathname: Полный путь к файлу. Тип String
Returns: Тип bool: true - файл доступен, false - файл недоступен.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.LoadMainMenu(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Метод предназначен для изменения основного меню.
Метод изменяет меню в соответствии с указанным файлом cuix, где описаны нужные изменения в основном меню.
Изменения меню в корпоративной версии nanoCAD невозможны. Если файл меню по указанному пути не найден или
в параметре указано название файла без пути, то метод ищет файл по пути поиска вспомогательных файлов.
Функциональность метда идентична использованию команды МЕНЮ. Если в параметре указано ".", то основное меню выгружается.
Returns: Тип bool: true - меню успешно загружено, flase - при загрузке возникли ошибки.
Remarks
Возможные ошибки:файл не найден.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.LoadPartialMenu(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Метод загружает из указанного файла частичное меню к основному.
Метод загружает частичное меню из указанного cuix-файла к основному.
Он не поддерживает добавление частичного меню в корпоративной версии nanoCAD.
Если файл меню не найден по указанному пути или если в имени файла нет пути,
выполняется поиск файла меню по пути поиска вспомогательных файлов.
Метод автоматически сохраняет изменения в главном меню (со списком нового частичного меню).
filename: имя файла меню или полный путь к файлу с именем. Если файл меню по указанному пути не найден или
Returns: Возвращает тип bool: true - файл меню успешно найден, false - при загрузке меню произошла ошибка, либо это частичное меню уже было загружено.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.PostSearchQuery(System.String)
МЕТОД НЕ РЕАЛИЗОВАН.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.ReloadAllMenus
МЕТОД НЕ РЕАЛИЗОВАН.
Метод обновляет загруженные в данный момент меню.
Метод обновляет пользовательский интерфейс nanoCAD, чтобы отразить изменения в загруженных в данный момент
пользоватльских меню.
Метод следует использовать, когда меню было отредактировано программным способом и
эти изменения необходимо отобразить в пользовательском интерфейсе. Функциональность метода
аналогична редактированию меню через диалоговое окно CUI и сохранению измненений нажатием кнопки "ОК"
или "Применить". Текущее рабочее пространство при этом не изменяется. Если свойства текущего рабочего пространства
были отредактированы в главном меню, то после вызова ReloadAllMenus(), возможно, потребуется вызвать SetCurrentWorkspace(),
чтобы увидеть изменения в рабочей области.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.SetCurrentWorkspace(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Метод устанавливает текущее рабочее пространство по его названию.
Метод устанавливает рабочее пространство по его назваию. Поиск по названию не учитывает регистр.
workspacename: Имя рабочего пространства, которое необходимо сделать текущим
Returns: Возвращает тип данных bool: true - рабочее пространство найдено и успешно установлено, false - рабочее пространство не было найдено.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.ShowConnectHomepage
МЕТОД НЕ РЕАЛИЗОВАН.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.ShowModalDialog(System.IntPtr,System.Windows.Forms.Form)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ System.Windows.Forms.DialogResult.None.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.ShowModalDialog(System.IntPtr,System.Windows.Forms.Form,System.Boolean)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ System.Windows.Forms.DialogResult.None.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.Form)
Метод предназначен для вызова модального диалогового окна, построенного с помощью WinForms.
Метод показывает модальный диалог WinForms. Необходимо
пользоваться именно этим методом вместо метода
Form.ShowDialog(), который может привести к непредсказуемому результату.
При исползовании метода, достигается согласованность с редактором приложения: при запросе данных с чертежа (напрмер, точки или объекта)
через диалоговое окно, оно пропадает, потом снова появляется, когда данные получены.
formToShow: Форма, которая должна быть показана
Returns: Возвращает результат работы окна, тип System.Windows.Forms.DialogResult

HostMgd.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form)
Метод предназначен для вызова модального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем.
Метод показывает модальный диалог, построенный на WinForms, у которого указано окно-владелец. Необходимо
пользоваться именно этим методом вместо метода Form.ShowDialog, который может привести к непредсказуемому результату.
owner: Окно владельца диалога. Тип IWin32Window
formToShow: Форма, которая должна быть показана. Тип Form
Returns: Возвращает результат работы окна, тип System.Windows.Forms.DialogResult

HostMgd.ApplicationServices.Application.ShowModalDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form,System.Boolean)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ System.Windows.Forms.DialogResult.None.
Метод предназначен для вызова модального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем и флагом возможности изменять положение и размер окна.
Метод показывает модальный диалог, построенный на WinForms, у которого указано окно-владелец и признак возможности изменения положения и размера окна. Необходимо
пользоваться именно этим методом вместо метода Form.ShowDialog, который может привести к непредсказуемому результату.
owner: Окно владельца диалога. Тип IWin32Window
formToShow: Форма, которая должна быть показана. Тип Form
persistSizeAndPosition: Флаг, указывающий, можно ли изменять размер и положение окна. Тип bool
Returns: Возвращает результат работы окна, тип System.Windows.Forms.DialogResult
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.ShowModelessDialog(System.IntPtr,System.Windows.Forms.Form)
МЕТОД НЕ РЕАЛИЗОВАН.
Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем.
Метод отображает немодальный диалог, построенный на WinForms, у которого указано окно-владелец. Необходимо
пользоваться именно этим методом вместо метода Form.Show,
который может привести к непредсказуемому результату.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть отображена

HostMgd.ApplicationServices.Application.ShowModelessDialog(System.IntPtr,System.Windows.Forms.Form,System.Boolean)
МЕТОД НЕ РЕАЛИЗОВАН.
Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем и признаком сохранения положения и размера окна.
Метод отображает немодальный диалог, построенный на WinForms, у которого указано окно-владелец и признак сохранения положения и размера. Необходимо
пользоваться именно этим методом вместо метода Form.Show,
который может привести к непредсказуемому результату.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть отображена
persistSizeAndPosition: Сохранять или нет позицию и размеры окна

HostMgd.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.Form)
Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms.
Метод отображает немодальный диалог, построенный с помощью WinForms. Необходимо
пользоваться именно этим методом вместо метода Form.Show,
который может привести к непредсказуемому результату.
formToShow: Форма, которая должна быть отображена

HostMgd.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form)
Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем.
Метод отображает немодальный диалог, построенный на WinForms, у которого указано окно-владелец. Необходимо
пользоваться именно этим методом вместо метода Form.Show,
который может привести к непредсказуемому результату.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть отображена

HostMgd.ApplicationServices.Application.ShowModelessDialog(System.Windows.Forms.IWin32Window,System.Windows.Forms.Form,System.Boolean)
МЕТОД НЕ РЕАЛИЗОВАН.
Метод предназначен для вызова немодального диалогового окна, построенного с помощью WinForms, с заданным окном-владельцем и признаком сохранения положения и размера окна.
Метод отображает немодальный диалог, построенный на WinForms, у которого указано окно-владелец и признак сохранения положения и размера. Необходимо
пользоваться именно этим методом вместо метода Form.Show,
который может привести к непредсказуемому результату.
owner: Окно владельца диалога
formToShow: Форма, которая должна быть отображена
persistSizeAndPosition: Сохранять или нет позицию и размеры окна

HostMgd.ApplicationServices.Application.TryGetSystemVariable(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.UnloadPartialMenu(System.String)
МЕТОД НЕ РЕАЛИЗОВАН. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.AcadApplication
Свойство предоставляет доступ к COM-объекту приложения
nanoCAD.
Свойство предназначено для доступа к COM-объекту nanoCAD.
Returns: Возвращает ссылку на COM-объект приложения nanoCAD. Тип
object, который нужно преобразовать в nanoCAD.Application из
COM-библиотеки.

HostMgd.ApplicationServices.Application.DisplayTextScreen
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.HostApplication
Свойство предназначено для доступа к COM-объекту приложения nanoCAD.
Свойство предоставляет доступ к COM-объекту приложения nanoCAD.
Returns: Возвращает ссылку на COM-объект приложения nanoCAD.
Тип object, который нужно преобразовать в nanoCAD.Application из COM-библиотеки.

HostMgd.ApplicationServices.Application.DocumentManager
Свойство предназначено для доступа к коллекции документов, открытых в приложении nanoCAD.
Свойство предоставляет доступ к коллекции документов DocumentCollection, открытых в приложении nanoCAD.
Returns: Возвращает коллекцию документов типа DocumentCollection, в которой расположены документы типа Document.
Количество документов равно количеству документов, открытых в приложении nanoCAD.

HostMgd.ApplicationServices.Application.DocumentWindowCollection
Свойство предназначено для доступа к коллекции
окон-документов, открытых в приложении nanoCAD.
Свойство предоставляет доступ к коллекции окон-документов
DocumentWindowCollection, открытых в приложении nanoCAD. Одно
окно-документ - это один открытый и редактируемый чертеж.
Returns: Возвращает коллекцию документов типа
DocumentWindowCollection, в которой расположены
окна-документы типа DocumentWindow. Количество
окон-документов равно количеству чертежей, открытых в
приложении nanoCAD.

HostMgd.ApplicationServices.Application.InfoCenter
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.IsInBackgroundMode
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.IsInCustomizationMode
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.IsInPlaceServer
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ FALSE.
Exceptions
MGD
NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.IsQuiescent
Свойство предназначено для получения признака работы команды, скрипта в nanoCAD в настоящее время.
Свойство предоставляет информацию о том, выполняется ли в данный момент в nanoCAD команда или скрипт.
Returns: Тип bool:
*true - nanoCAD свободен, возможен вызов команды, скрипта
*false - nanoCAD занят выполнением команды или скрипта

HostMgd.ApplicationServices.Application.LongTransactionManager
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.MainWindow
Свойство предназначено для доступа к основному окну
приложения nanoCAD.
Свойство предоставляет доступ к основному окну приложения
nanoCAD.
Returns: Возвращает ссылку на основное окно nanoCAD. Тип Window.

HostMgd.ApplicationServices.Application.MenuBar
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.MenuGroups
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.NonInPlaceMainWindow
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.Preferences
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.Publisher
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.RecentDocuments
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.StatusBar
СВОЙСТВО НЕ РЕАЛИЗОВАНО. ВСЕГДА ВОЗВРАЩАЕТ NULL.
Exceptions
MGD NOT_IMPLEMENTED

HostMgd.ApplicationServices.Application.UserConfigurationManager
Свойство предназначено для доступа к менеджеру конфигурации
пользователя.
Свойство предоставляет доступ к менеджеру конфигурации
пользователя, с помощью которого можно управлять глобальными
переменными, профилем пользователя, секциями диалога в
реестре Windows для приложения nanoCAD.
Returns: Возвращает ссылку на менеджер конфигурации пользователя. Тип
UserConfigurationManager.

HostMgd.ApplicationServices.Application.Version
Свойство предназначено для получения информации о версии
сборки nanoCAD.
Свойство пердоставляет доступ к информации о версии сборки
nanoCAD.
Returns: Возвращает версию сборки nanoCAD.

HostMgd.ApplicationServices.Application.BeginQuit
Событие, возникающее перед выполнением действий по завершению работы приложения.
Событие возникает перед выполнением действий по завершению работы приложения.

HostMgd.ApplicationServices.Application.QuitAborted
Событие, возникающее в случае отмены завершения работы приложения.
Событие возникает в случае отмены завершения работы приложения (например, при отмене действия при подтверждении сохранения документа).

HostMgd.ApplicationServices.Application.QuitWillStart
Событие, возникающее после выполнения события BeginQuit непосредственно перед завершением работы приложения.
Событие возникает после выполнения события BeginQuit непосредственно перед завершением работы приложения.

HostMgd.ApplicationServices.Application.SystemVariableChanged
Событие, возникающее при попытке изменения системной переменной (даже если реальное значение и не будет изменено).
Событие возникает всегда, когда системная переменная изменяется с помощью команды SETVAR или с помощью указания
имени переменной в командной строке. Для остальных встроенных команд, которые вызывают изменение системных переменных,
возникновение этого события не гарантировано.

HostMgd.ApplicationServices.Application.SystemVariableChanging
Событие, возникающее перед изменением значения системной переменной. Это событие обеспечивает приложению возможность
запомнить исходное значение системной переменной до ее изменения.
Событие возникает всегда, когда системная переменная изменяется с помощью команды SETVAR или с помощью указания
имени переменной в командной строке. Для остальных встроенных команд, которые вызывают изменение системных переменных,
возникновение этого события не гарантировано.

HostMgd.ApplicationServices.Application.BeginDoubleClick
Событие, возникающее при двойном щелчке в окне редактора.
Событие возникает при двойном щелчке в окне редактора и обеспечивает возможность приложению получить координаты
курсора в этот момент.

HostMgd.ApplicationServices.Application.Idle
Событие, возникающее при переходе приложения в режим ожидания.
Событие возникает при переходе приложения nanoCAD в режим ожидания.

HostMgd.ApplicationServices.Application.reactorAddRef(System.Int32)
Метод подписывает на событие.

HostMgd.ApplicationServices.Application.reactorRelease(System.Int32)
Метод отписывает от события.

HostMgd.ApplicationServices.Application.m_appReactor
Поле для хранения реактора

HostMgd.ApplicationServices.Application.m_defaultContextMenuExts
Поле для хранения ссылки на расширения контекстного меню,
добавленные по умолчанию.

HostMgd.ApplicationServices.Application.m_documentManager
Поле для хранения ссылки на менеджер документов.

HostMgd.ApplicationServices.Application.m_editor
Поле для хранения ссылки на редактор.

HostMgd.ApplicationServices.Application.m_objectContextMenuExts
Поле для хранения расширений контекстного меню.

HostMgd.ApplicationServices.Application.m_pBeginDoubleClickEvent
Поле для хранения ссылки на обработчик события двойного щелчка.

HostMgd.ApplicationServices.Application.m_pBeginQuitEvent
Поле для хранения ссылки на обработчик события начала закрытия приложения.

HostMgd.ApplicationServices.Application.m_pIdleEvent
Поле для хранения ссылки на обработчик события перехода приложения в режим ожидания.

HostMgd.ApplicationServices.Application.m_pQuitAbortedEvent
Поле для хранения ссылки на обработчик события прерывания завершения работы приложения.

HostMgd.ApplicationServices.Application.m_pQuitWillStartEvent
Поле для хранения ссылки на обработчик события начала завершения работы приложения.

HostMgd.ApplicationServices.Application.m_pSystemVariableChangedEvent
Поле для хранения ссылки на обработчик события изменения системной переменной.

HostMgd.ApplicationServices.Application.m_pSystemVariableChangingEvent
Поле для хранения ссылки на обработчик события начала изменения системной переменной.

HostMgd.ApplicationServices.Application.m_userConfigMan
Поле для хранения ссылки на менеджер конфигурации пользователя.