Teigha.DatabaseServices.Cell.GetDataLinkRange
Метод позволяет получить диапазон ячеек со ссылками на внешние данные.
Метод позволяет получить диапазон ячеек со ссылками на внешние данные.
Returns: Возвращает диапазон ячеек. Тип CellRange.