Teigha.BoundaryRepresentation.BrepVertexCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции вершин.
Метод позволяет получить перечислитель данной коллекции вершин.
Returns: Возвращает перечислитель коллекции вершин B-Rep.
Тип BrepVertexEnumerator.