HostMgd.PlottingServices.BeginDocumentEventArgs
Класс BeginDocumentEventArgs представляет данные для события PlotReactorManager.BeginDocument, возникающего в процессе вывода на печать.
Класс BeginDocumentEventArgs представляет данные для событий PlotReactorManager.BeginDocument.
Инкапсулируемая информация включает в себя объект PlotInfo, имя документа, количество копий, флаг печати в файл и имя файла. Экземпляры этого класса используются делегатами HostMgd.PlottingServices.BeginDocumentEventHandler.

HostMgd.PlottingServices.BeginDocumentEventArgs.#ctor(HostMgd.PlottingServices.PlotInfo,System.String,System.Int32,System.Boolean,System.String)
Конструктор класса BeginDocumentEventArgs.
Создает экземпляр класса с указанными параметрами.
Конструктор класса BeginDocumentEventArgs.
Создает экземпляр класса с указанными параметрами.
plotInfo: Объект сервисного класса HostMgd.PlottingServices.PlotInfo, представляющий свойства вывода на печать.
documentName: Имя документа. Тип System.String.
copies: Требуемое количество копий. Тип int.
plotToFile: Флаг печати в файл. Тип bool. Значение true означает печать в файл.
fileName: Имя файла. Тип System.String.

HostMgd.PlottingServices.BeginDocumentEventArgs.Copies
Свойство Copies представляет требуемое количество копий.
Свойство Copies представляет заказанное количество копий.
Returns: Возвращает количество копий. Тип int.

HostMgd.PlottingServices.BeginDocumentEventArgs.DocumentName
Свойство DocumentName представляет имя документа.
Свойство DocumentName представляет имя документа.
Returns: Возвращает имя документа. Тип System.String.

HostMgd.PlottingServices.BeginDocumentEventArgs.FileName
Свойство FileName представляет имя файла.
Свойство FileName представляет имя файла.
Returns: Возвращает имя файла. Тип System.String.

HostMgd.PlottingServices.BeginDocumentEventArgs.PlotInfo
Свойство PlotInfo представляет свойства печати.
Свойство PlotInfo представляет свойства печати в виде объекта сервисного класса HostMgd.PlottingServices.PlotInfo.
Returns: Возвращает свойства печати. Тип HostMgd.PlottingServices.PlotInfo.

HostMgd.PlottingServices.BeginDocumentEventArgs.PlotToFile
Свойство PlotToFile представляет флаг печати в файл.
Свойство PlotToFile представляет флаг печати в файл.
Returns: Возвращает true, если требуется печать документа в файл.
В противном случае возвращает false.