Teigha.DatabaseServices.SymbolTableEnumerator.Reset
Метод выполняет реинициализацию перечислителя, сбрасывая его текущий индекс на -1.
Метод выполняет реинициализацию перечислителя, сбрасывая его текущий индекс на -1.