Teigha.Geometry.BoundBlock3d.GetMaximumPoint
Метод предоставляет максимальную точку данной граничной рамки.
Метод предоставляет максимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса Point3d, который представляет максимальную точку граничной рамки.