Teigha.BoundaryRepresentation.VertexLoopCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции циклов.
Метод позволяет получить перечислитель данной коллекции циклов.
Returns: Возвращает перечислитель коллекции циклов.
Тип VertexLoopEnumerator.