Teigha.DatabaseServices.FaceRecord
Класс FaceRecord представляет в базе данных грани многогранной сети PolyFaceMesh.
Класс FaceRecord представляет в базе данных грани многогранной сети PolyFaceMesh.
Каждый экземпляр класса FaceRecord хранит индексы вершин, которые являются угловыми точками конкретной грани сети PolyFaceMesh, и информацию о видимости соединяющих их ребер.

Teigha.DatabaseServices.FaceRecord.#ctor
Конструктор по умолчанию класса FaceRecord.
Конструктор по умолчанию класса FaceRecord.

Teigha.DatabaseServices.FaceRecord.#ctor(short,short,short,short)
Конструктор класса FaceRecord, создающий экземпляр класса с указанными вершинами в угловых точках грани.
Конструктор класса FaceRecord.
Создает запись FaceRecord, используя переданные в аргументах вершины в качестве четырех угловых точек грани.
vertex0: Индекс первой вершины грани. Тип short.
vertex1: Индекс второй вершины грани.  Тип short.
vertex2: Индекс третьей вершины грани.  Тип short.
vertex3: Индекс четвертой вершины грани.  Тип short.

Teigha.DatabaseServices.FaceRecord.GetVertexAt(short)
Метод позволяет определить индекс вершины PolyFaceMesh, используемой в качестве угловой точки грани.
Метод позволяет определить индекс вершины PolyFaceMesh, используемой в качестве угловой точки faceIndex грани.
Индексы углов граней начинаются с 0, поэтому faceIndex должен иметь значение 0, 1, 2 или 3.
Индексы вершин PolyFaceMesh начинаются с 1 и являются отрицательными, если ребро невидимо, или положительными, если ребро  видимо.
faceIndex: Индекс угла грани (0, 1, 2 или 3). Тип short.
Returns: Возвращает индекс вершины PolyFaceMesh. Тип short.

Teigha.DatabaseServices.FaceRecord.IsEdgeVisibleAt(short)
Метод позволяет определить, является ли видимым ребро с началом в заданной угловой точке.
Метод позволяет определить, видимо ли ребро с началом в угловой точке с индексом faceIndex.
faceIndex: Индекс начальной точки ребра. Тип short.
Returns: Возвращает true, если ребро является видимым.
В противном случае возвращает false.

Teigha.DatabaseServices.FaceRecord.MakeEdgeInvisibleAt(short)
Метод позволяет сделать невидимым ребро с началом в указанной угловой точке грани.
Метод позволяет сделать невидимым ребро, которое начинается в угловой точке грани с индексом faceIndex.
faceIndex: Индекс начальной точки ребра (0, 1, 2 или 3). Тип short.

Teigha.DatabaseServices.FaceRecord.MakeEdgeVisibleAt(short)
Метод позволяет сделать видимым ребро с началом в указанной угловой точке грани.
Метод позволяет сделать видимым ребро с началом в угловой точке грани с индексом faceIndex.
faceIndex: Индекс начальной точки ребра (0, 1, 2 или 3). Тип short.

Teigha.DatabaseServices.FaceRecord.SetVertexAt(short,short)
Метод ставит в соответствие указанный угол данного объекта FaceRecord указанному индексу родительской вершины сети PolyFaceMesh.
Метод ставит в соответствие указанный угол данного объекта FaceRecord указанному индексу родительской вершины сети PolyFaceMesh.
Индексы вершин PolyFaceMesh начинаются с 1.
Отрицательное значение индекса означает, что исходящее из этой вершины ребро является невидимым.
Нулевое значение для vertexIndex, когда faceIndex == 3 определяет треугольную грань.
faceIndex: Индекс угловой точки грани (0, 1, 2 или 3). Тип short.
vertexIndex: Индекс вершины. Тип short.