Teigha.DatabaseServices.Dimension.RemoveTextField
Метод предназначен для удаления текстового поля из этого объекта Dimension, если такое поле имеется.
Метод предназначен для удаления текстового поля из этого объекта Dimension, если такое поле имеется.