Teigha.DatabaseServices.SecurityParameters.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает эквивалентное представление данного объекта в виде текстовой строки, в которой хранятся поля и значения параметров безопасности. Тип String.