Teigha.LayerManager.LayerFilterCollection
Класс LayerFilterCollection представляет коллекцию объектов LayerFilter в базе данных.
Класс LayerFilterCollection представляет коллекцию объектов LayerFilter в базе данных.

Teigha.LayerManager.LayerFilterCollection.Add(Teigha.LayerManager.LayerFilter)
Метод предназначен для добавления в коллекцию указанного объекта.
Метод предназначен для добавления в коллекцию объекта, представленного аргументом value.
value: Объект, который добавляется в коллекцию.  Тип LayerFilter.

Teigha.LayerManager.LayerFilterCollection.Contains(Teigha.LayerManager.LayerFilter)
Метод позволяет проверить, содержится ли в коллекции объект, соответствующий аргументу.
Метод позволяет проверить, содержится ли в коллекции объект, соответствующий аргументу value.
value: Искомый объект. Тип LayerFilter.
Returns: Возвращает true, если искомый объект содержится в коллекции.
В противном случае возвращает false.

Teigha.LayerManager.LayerFilterCollection.CopyTo(array,System.Int32)
Метод копирует в данную коллекцию объекты из указанного массива.
Метод копирует в данную коллекцию объекты из указанного массива.
array: Входной массив копируемых объектов.  Тип array.
index: Индекс в массиве, начиная с которого объекты массива будут копироваться в данную коллекцию.  Тип int.  Индексация элементов в массиве начинается с нуля.

Teigha.LayerManager.LayerFilterCollection.Remove(Teigha.LayerManager.LayerFilter)
Метод удаляет указанный объект из данной коллекции.
Метод удаляет указанный объект value из данной коллекции.
value: Удаляемый объект.  Тип LayerFilter.

Teigha.LayerManager.LayerFilterCollection.Count
Свойство Count представляет текущее количество объектов в данной коллекции.
Свойство Count представляет текущее количество объектов в данной коллекции.
Returns: Возвращает количество объектов в коллекции.  Тип int.

Teigha.LayerManager.LayerFilterCollection.Item
Свойство Item возвращает элемент коллекции с указанным индексом.
Свойство Item возвращает элемент коллекции с указанным индексом.
index: Индекс искомого элемента коллекции.  Тип int.
Returns: Возвращает объект, хранящийся в коллекции под индексом index.
Тип LayerFilter.