Teigha.DatabaseServices.Extents2d.ToString
Метод предназначен для получения эквивалентного строкового представления данного объекта.
Метод предназначен для получения эквивалентного строкового представления данного объекта.
Returns: Возвращает строку, в которой представлены минимальная и максимальная точки ограничивающего бокса.
Тип String.