Teigha.Geometry.Ray2d
Класс Ray2d представляет двумерный луч, полубесконечную линию в двумерном пространстве.
Класс Ray2d представляет двумерный луч, полубесконечную линию в двумерном пространстве.
Объект Ray2d имеет начальную точку, но не имеет конечной.

Teigha.Geometry.Ray2d.#ctor
Конструктор по умолчанию класса Ray2d.
Создает луч с началом в точке (0,0) и направляющим вектором (1,0).
Конструктор по умолчанию класса Ray2d.
Создает луч с началом в точке (0,0) и направляющим вектором (1,0), т.е. вдоль положительного направления оси X.

Teigha.Geometry.Ray2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса Ray2d.
Создает луч по двум несовпадающим 2D-точкам, первая из которых становится начальной точкой луча, а вторая задает его направление.
Конструктор класса Ray2d.
Создает луч, который начинается в точке point1 и проходит через точку point2.
Точки point1 и point2 не могут совпадать.
point1: Точка начала луча. Тип Point2d.
point2: Точка, через которую проходит луч. Тип Point2d. Не может совпадать с точкой point1.

Teigha.Geometry.Ray2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Конструктор класса Ray2d.
Создает луч с указанной точкой начала и заданным направляющим вектором.
Конструктор класса Ray2d.
Создает луч с началом в точке point и направляющим вектором vector.
point: Начальная точка луча. Тип Point2d.
vector: Направляющий вектор луча. Тип Vector2d. Должен иметь ненулевую длину.

Teigha.Geometry.Ray2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Ray2d.

Teigha.Geometry.Ray2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод переопределяет точку начала данного луча и точку, задающую его направление.
Метод переопределяет данный луч, используя новую точку начала point1 и новую точку point2, задающую направление луча.
point1: Новая точка начала луча. Тип Point2d.
point2: Новая точка, определяющая направление луча. Тип Point2d. Должна отличаться от точки point1.

Teigha.Geometry.Ray2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Метод переопределяет точку начала и направляющий вектор данного луча.
Метод переопределяет точку начала и направляющий вектор данного луча.
point: Новая начальная точка луча. Тип Point2d.
vector: Направляющий вектор луча.   Тип Vector2d. Должен иметь ненулевую длину.