Teigha.DatabaseServices.BlockConnectionType
Данное перечисление определяет варианты точек присоединения выносной линии к блоку.
Данное перечисление определяет варианты точек присоединения выносной линии к блоку.