Teigha.DatabaseServices.DBObject.GetTransientReactors
Метод предназначен для получения коллекции указателей на
временные реакторы объекта.
Метод предоставляет доступ к временным реакторам данного
объекта.
Returns: Метод возвращает коллекцию указателей на временные реакторы
объекта. Тип Generic.List\