Teigha.DatabaseServices.Trace
Класс Trace представляет в базе данных объект замкнутой двумерной полосы со сплошной заливкой.
Класс Trace представляет в базе данных объект замкнутой двумерной полосы со сплошной заливкой.

Teigha.DatabaseServices.Trace.#ctor
Конструктор по умолчанию класса Trace.
Конструктор по умолчанию класса Trace.

Teigha.DatabaseServices.Trace.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса Trace.
Создает новую полосу с указанными вершинами.
Конструктор класса Trace.
Создает новую полосу с указанными вершинами.
Notes
Координаты вершин задаются в мировой системе координат (WCS).
pointer1: Первая вершина полосы.    Тип Point3d.
pointer2: Вторая вершина полосы.    Тип Point3d.
pointer3: Третья вершина полосы.    Тип Point3d.
pointer4: Четвертая вершина полосы. Тип Point3d.

Teigha.DatabaseServices.Trace.GetPointAt(short)
Метод предоставляет вершину данной полосы с указанным индексом.
Метод предоставляет вершину данной полосы с указанным индексом.
index: Индекс вершины. Тип short.
Returns: Возвращает точку для вершины с индексом index.
Тип Point3d.

Teigha.DatabaseServices.Trace.SetPointAt(short,Teigha.Geometry.Point3d)
Метод переопределяет положение вершины с указанным индексом.
Метод переопределяет положение вершины с указанным индексом index.
index: Индекс переопределяемой вершины полосы. Тип short.
pointValue: Новые координаты вершины. Тип Point3d.

Teigha.DatabaseServices.Trace.Normal
Свойство Normal представляет нормаль плоскости, в которой располагается данная полоса.
Свойство Normal представляет нормаль плоскости, в которой располагается данная полоса.
Returns: Возвращает единичный вектор в координатах WCS, который представляет нормаль плоскости полосы.
Тип Vector3d.

Teigha.DatabaseServices.Trace.Thickness
Свойство Thickness представляет толщину полосы в единицах чертежа.
Свойство Thickness представляет текущую толщину данной полосы (в единицах чертежа).
Notes
Толщина — это величина выдавливания вдоль направления нормали.
Положительная толщина означает выдавливание в направлении нормали, отрицательная толщина определяет выдавливание в противоположном направлении.
Нулевое значение определяет полосу без толщины.
Returns: Возвращает толщину полосы. Тип double.