Teigha.DatabaseServices.AssocArray.ResetItems
Метод удаляет любые переопределения (положение, ориентация или замена объекта) для всех элементов данного ассоциативного массива.
Метод удаляет любые переопределения (положение, ориентация или замена объекта) для всех элементов данного ассоциативного массива.