Teigha.DatabaseServices.TimeZone.Berlin
Значение: 1000.
(GMT+01:00) Центральноевропейское время (CET). Амстердам (Нидерланды), Берлин (ФРГ), Берн (Швейцария), Рим (Италия), Стокгольм (Швеция), Вена (Австрия).