Teigha.GraphicsSystem.View.GetModelList
Метод позволяет получить все модели графической системы, которые связаны с данным видом.
Метод позволяет получить все модели графической системы, которые связаны с данным видом.
Returns: Возвращает массив моделей графической системы. Тип Model[].