Teigha.Geometry.Scale3d.Inverse
Метод инвертирует данный вектор масштабирования.
Метод инвертирует данный вектор масштабирования.
Returns: Возвращает инвертированный вектор масштабирования.
Тип Scale3d.