Teigha.BoundaryRepresentation.BrepFaceCollection
Класс BrepFaceCollection представляет коллекцию граней, соответствующих граничному представлению.
Класс BrepFaceCollection представляет коллекцию граней, соответствующих граничному представлению.