Teigha.Geometry.Scale3d.IsProportional
Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X, Y и Z.
При проверке используется точность по умолчанию.
Метод позволяет проверить, действительно ли данный объект представляет равномерное масштабирование по осям X, Y и Z.
Используется вызов метода Scale3d.IsProportional(Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
Returns: Возвращает true, если компоненты данного вектора масштабирования по модулю равны.
В противном случае возвращает false.