HostMgd.EditorInput.DeviceInputEventArgs
Класс DeviceInputEventArgs предоставляет данные
для реализации пользовательских событий, связанных с изменениями в устройстве ввода (например, мыши).
Не реализован.
Класс DeviceInputEventArgs является наследником класса EventArgs и в .NET API nanoCAD
предоставляет данные для реализации низкоуровневых пользовательских событий, связанных с изменениями в устройстве ввода (например, мыши, клавиатуры или графического планшета). Используется совместно с делегатом HostMgd.EditorInput.DeviceInputEventHandler
В текущей версии не реализован.

HostMgd.EditorInput.DeviceInputEventArgs.GraphicsSystemMarker
Свойство GraphicsSystemMarker возвращает маркер графической системы.
Не реализовано.
Свойство GraphicsSystemMarker возвращает маркер графической системы (GS).
В текущей версии не реализовано.
Returns: Возвращает маркер графической системы.
Тип System.IntPtr.

HostMgd.EditorInput.DeviceInputEventArgs.Handled
Свойство Handled позволяет выяснить или указать, обработано событие или нет.
Не реализовано.
Свойство Handled позволяет управлять состоянием флага, указывающего, обработано событие или ещё нет.
В текущей версии не реализовано.
Returns: Возвращает true, если событие обработано.
В противном случае возвращает false.

HostMgd.EditorInput.DeviceInputEventArgs.LParam
Свойство LParam представляет компонент сообщения в виде указателя на параметр Windows LParam.
Не реализовано.
Свойство LParam представляет компонент в структуре сообщения MSG в виде указателя на параметр Windows LParam (Long Parameter).
В текущей версии не реализовано.
Returns: Возвращает указатель на параметр LParam.
Тип System.IntPtr.

HostMgd.EditorInput.DeviceInputEventArgs.Message
Свойство Message представляет передаваемое сообщение.
Не реализовано.
Свойство Message представляет передаваемое сообщение.
В текущей версии не реализовано.
Returns: Возвращает передаваемое сообщение.
Тип int.

HostMgd.EditorInput.DeviceInputEventArgs.WParam
Свойство WParam представляет компонент сообщения в виде указателя на параметр Windows WParam.
Не реализовано.
Свойство WParam представляет компонент в структуре сообщения MSG в виде указателя на параметр Windows WParam (Word Parameter).
В текущей версии не реализовано.
Returns: Возвращает указатель на параметр WParam.
Тип System.IntPtr.