Teigha.DatabaseServices.AuditInfo.RequestRegen
Метод позволяет исправленным объектам уведомлять систему о необходимости выполнить их регенерацию.
Метод позволяет исправленным объектам уведомлять систему о необходимости выполнить их регенерацию.
В противном случае изменения будут внесены в базу данных лишь при следующем сохранении.