HostMgd.EditorInput.PointInputEventArgs
Класс PointInputEventArgs представляет данные для пользовательских событий, связанных с выбором точки.
В текущей версии не реализован.
Класс PointInputEventArgs представляет данные для пользовательских событий, связанных с интерактивным указанием точки в редакторе nanoCAD.
В текущей версии не реализован.

HostMgd.EditorInput.PointInputEventArgs.#ctor
Конструктор по умолчанию класса PointInputEventArgs.
Конструктор по умолчанию класса PointInputEventArgs.

HostMgd.EditorInput.PointInputEventArgs.Context
Свойство Context возвращает контекст выделения точки как экземпляр класса InputPointContext.
Не реализовано.
Свойство Context возвращает контекст выделения точки как экземпляр класса InputPointContext.
Контекст обеспечивает доступ к  таким свойствам как документ, ответственный за создание события, объектная привязка точки и многим другим.
В текущей версии не реализовано.
Returns: Возвращает контекст выделения точки.
Тип HostMgd.EditorInput.InputPointContext.

HostMgd.EditorInput.PointInputEventArgs.GraphicsSystemMarker
Свойство GraphicsSystemMarker представляет маркер графической системы.
Не реализовано.
Свойство GraphicsSystemMarker представляет маркер графической системы.
В текущей версии не реализовано.
Returns: Возвращает маркер графической системы.
Тип System.IntPtr.

HostMgd.EditorInput.PointInputEventArgs.Handled
Свойство Handled позволяет указать или проверить, обработано ли событие, связанное с выделением точки.
Не реализовано.
Свойство Handled позволяет указать или проверить, обработано ли событие, связанное с выделением точки.
В текущей версии не реализовано.
Returns: Возвращает true, если событие обработано.
В противном случае возвращает false.

HostMgd.EditorInput.PointInputEventArgs.Result
Свойство Result представляет выходные данные события PointFilter, связанного с выделением точки.
Не реализовано.
Свойство Result представляет выходные данные события PointFilter, связанного с выделением точки.
В текущей версии не реализовано.
Returns: Возвращает выходные данные события PointFilter.
Тип HostMgd.EditorInput.PointFilterResult.