Teigha.Geometry.NurbCurve3d.MakePeriodic
Метод позволяет сделать данную кривую периодическим сплайном.
Метод позволяет сделать данную кривую периодическим сплайном.
Если кривая уже является периодической, метод не делает ничего.