Teigha.BoundaryRepresentation.MeshControl
Класс MeshControl является базовым интерфейсным классом для элементов управления 2D-сетью.
Класс MeshControl является базовым интерфейсным классом для элементов управления 2D-сетью.
Он определяет конкретный функционал, используемый при настройке элементов управления для создания 2D-сетей.
Notes
Этот класс реализован только для среды пространственного моделирования.

Teigha.BoundaryRepresentation.MeshControl.Equals(Object)
Метод предназначен для проверки равенства двух объектов.
Метод предназначен для проверки равенства двух объектов.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип Object.
Returns: Возвращает true, если объекты равны.
В противном случае возвращает false.

Teigha.BoundaryRepresentation.MeshControl.AngleTolerance
Свойство AngleTolerance предоставляет доступ к максимальной погрешности в значениях углов.
Свойство AngleTolerance предоставляет доступ к максимальной погрешности в значениях углов.
Returns: Возвращает максимальную погрешность значений углов.  Тип double.

Teigha.BoundaryRepresentation.MeshControl.DistanceTolerance
Свойство DistanceTolerance предоставляет доступ к максимальной погрешности для значений длины.
Свойство DistanceTolerance предоставляет доступ к максимальной погрешности для значений длины.
Returns: Возвращает максимальную погрешность значений длины.  Тип double.

Teigha.BoundaryRepresentation.MeshControl.MaxNodeSpacing
Свойство MaxNodeSpacing представляет максимально допустимое расстояние между узлами сети.
Свойство MaxNodeSpacing представляет максимально допустимое расстояние между узлами сети.
Returns: Возвращает максимально допустимое расстояние между узлами сети.
Тип double.

Teigha.BoundaryRepresentation.MeshControl.MaxSubdivisions
Свойство MaxSubdivisions представляет максимально допустимое количество подразделений сети.
Свойство MaxSubdivisions представляет максимально допустимое количество подразделений сети.
Returns: Возвращает максимально допустимое количество подразделений сети.
Тип unsigned int.