HostMgd.EditorInput.PromptDoubleOptions.GetDefaultValueString
Метод возвращает строковое представление значения по умолчанию,
заданного для ввода вещественного числа.
Метод является вспомогательным и предназначен для преобразования
числового значения свойства DefaultValue в форматированную строку,
отображаемую пользователю. Он используется, например, при формировании подсказок,
динамическом обновлении интерфейса или логировании, где требуется отобразить
значение по умолчанию в читаемом виде.
Метод автоматически учитывает:
* текущие настройки единиц чертежа,
* формат отображения чисел (разделитель, количество знаков после запятой),
* региональные и языковые настройки системы.
Это обеспечивает корректное отображение числа в зависимости от контекста nanoCAD.
Returns: Возвращает значение типа string, представляющее собой отформатированное
значение свойства DefaultValue. Например:
* "1.5" — если DefaultValue = 1.5,
* "0" — если значение по умолчанию не задано,
* может возвращать пустую строку, если DefaultValue не определено.
Example
C#