HostMgd.EditorInput.PromptPointResultEventHandler
Делегат предназначен для обработки событий, возникающих после
завершения интерактивного ввода точки пользователем в
редакторе nanoCAD.
Делегат используется при работе с методами и событиями,
связанными с вводом точек — такими как GetCorner(),
GetPoint() и другими. Он позволяет обрабатывать результат
выбора или ввода координат пользователем, предоставляя доступ
к объекту PromptPointResultEventArgs, который содержит статус
операции и значение точки (Point3d). Данный тип делегата
применяется в таких событиях, как PromptedForCorner,
PromptedForPoint и других, где требуется получение позиции в
мировой системе координат (WCS) после завершения ввода.
sender: Источник события, обычно представляющий экземпляр
e: Объект, содержащий данные о результате ввода точки\