Teigha.DatabaseServices.DxfFiler.ReadInt16
Метод возвращает 16-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Метод возвращает 16-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Returns: Возвращает 16-разрядное целое число со знаком. Тип short.
///
///
virtual int ReadInt32() abstract;