Teigha.Geometry.NurbCurve2dFitData
Структура NurbCurve2dFitData предназначена для хранения данных, которые возвращает свойство NurbCurve2d.FitData.
Структура NurbCurve2dFitData предназначена для хранения данных, которые возвращает свойство NurbCurve2d.FitData.

Teigha.Geometry.NurbCurve2dFitData.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
Метод предназначен для проверки равенства указанного объекта данному объекту.
Notes
Переопределение методов Equals и GetHashCode должно выполняться согласованно с соблюдением общей логики.
Если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать GetHashCode() отсюда, в то время как метод Equals() может быть переопределен в производном классе.
obj: Входной объект, который проверяется на равенство данному объекту.
Returns: Возвращает true, если объект obj равен данному объекту.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dFitData.IsEqualTo(Teigha.Geometry.NurbCurve2dFitData)
Проверяет, равны ли интерполяционные данные данной NURBS кривой и указанной NURBS кривой.
Проверяет, равны ли интерполяционные данные данной NURBS кривой и указанной NURBS кривой.
Notes
Объекты типа NurbCurve2dFitData считаются равными, если одновременно выполняются следующие условия:
* Определяющие точки совпадают;
* Степени кривых равны;
* Данные о касательных присутствуют или отсутствуют одновременно для обеих кривых;
* Начальные векторы касательных равны;
* Конечные векторы касательных равны.
a: Проверяемый на равенство объект. Тип NurbCurve2dFitData.
Returns: Возвращает true, если сравниваемые объекты можно считать равными.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dFitData.!=(Teigha.Geometry.NurbCurve2dFitData,Teigha.Geometry.NurbCurve2dFitData)
Оператор неравенства структуры NurbCurve2dFitData.
Оператор неравенства структуры NurbCurve2dFitData.
Notes
Два объекта типа NurbCurve2dFitData считаются неравными, если нарушается хотя бы одно из следующих условий:
* Определяющие точки совпадают;
* Степени кривых равны;
* Данные о касательных присутствуют или отсутствуют одновременно для обеих кривых;
* Начальные векторы касательных равны;
* Конечные векторы касательных равны.
a: Левый  операнд. Тип NurbCurve2dFitData.
b: Правый операнд. Тип NurbCurve2dFitData.
Returns: Возвращает true, если операнды не равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dFitData.==(Teigha.Geometry.NurbCurve2dFitData,Teigha.Geometry.NurbCurve2dFitData)
Оператор равенства структуры NurbCurve2dFitData.
Оператор равенства структуры NurbCurve2dFitData.
Notes
Два объекта типа NurbCurve2dFitData считаются равными, если одновременно выполняются следующие условия:
* Определяющие точки совпадают;
* Степени кривых равны;
* Данные о касательных присутствуют или отсутствуют одновременно для обеих кривых;
* Начальные векторы касательных равны;
* Конечные векторы касательных равны.
a: Левый  операнд. Тип NurbCurve2dFitData.
b: Правый операнд. Тип NurbCurve2dFitData.
Returns: Возвращает true, если операнды равны друг другу.
В противном случае возвращает false.

Teigha.Geometry.NurbCurve2dFitData.Degree
Свойство Degree представляет степень NURBS кривой.
Свойство Degree представляет степень NURBS кривой.
Returns: Возвращает степень NURBS кривой. Тип int.

Teigha.Geometry.NurbCurve2dFitData.EndTangent
Свойство EndTangent представляет направление касательной в конечной точке кривой.
Свойство EndTangent представляет направление касательной в конечной точке кривой.
Returns: Возвращает касательный вектор в последней точке кривой. Тип Vector2d.

Teigha.Geometry.NurbCurve2dFitData.FitPoints
Свойство FitPoints представляет массив определяющих точек кривой.
Свойство FitPoints представляет массив определяющих точек кривой.
Returns: Возвращает массив определяющих точек кривой. Тип Point2dCollection.

Teigha.Geometry.NurbCurve2dFitData.FitTolerance
Свойство FitTolerance представляет заданную точность интерполяции.
Свойство FitTolerance представляет заданную точность интерполяции.
Returns: Возвращает точность интерполяции. Тип Tolerance.

Teigha.Geometry.NurbCurve2dFitData.KnotParam
Свойство KnotParam представляет метод узловой параметризации кривой.
Свойство KnotParam представляет метод узловой параметризации кривой.
Returns: Возвращает метод узловой параметризации кривой. Тип KnotParameterizationEnum.

Teigha.Geometry.NurbCurve2dFitData.StartTangent
Свойство StartTangent представляет направление касательной в начальной точке кривой.
Свойство StartTangent представляет направление касательной в начальной точке кривой.
Returns: Возвращает касательный вектор в начальной точке кривой.
Тип Vector2d.

Teigha.Geometry.NurbCurve2dFitData.TangentsExist
Свойство TangentsExist позволяет проверить, заданы ли касательные векторы на концах кривой.
Свойство TangentsExist позволяет проверить, заданы ли касательные векторы на концах кривой.
Returns: Возвращает true, если касательные векторы на концах кривой заданы.
В противном случае возвращает false.