Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs
Класс ProxyResurrectionCompletedEventArgs предоставляет данные для события ProxyResurrectionCompleted базы данных.
Класс ProxyResurrectionCompletedEventArgs предоставляет данные для события ProxyResurrectionCompleted базы данных.

Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs.ApplicationName
Свойство ApplicationName представляет имя приложения.
Свойство ApplicationName представляет имя приложения.
Returns: Возвращает имя приложения. Тип String.

Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs.Ids
Свойство Ids представляет идентификаторы восстанавливаемых объектов.
Свойство Ids представляет идентификаторы восстанавливаемых объектов.
Returns: Возвращает коллекцию идентификаторов объектов.
Тип ObjectIdCollection.