Teigha.DatabaseServices.DBText
Класс является представлением геометрического объекта TEXT в
nanoCAD
Класс является представлением геометрического объекта TEXT в
nanoCAD.

Teigha.DatabaseServices.DBText.#ctor(IntPtr,System.Boolean)
Конструктор по умолчанию.

Teigha.DatabaseServices.DBText.AdjustAlignment(DatabaseServices.Database)
Обычно, когда геометрический объект "текст" закрывается,
положение текста и точки выравнивания устанавливаются в
соответствии с настройками выравнивания и стилем текста. Но,
если текстовый геометрический объект встроен в другой
геометрический объект, он никогда не будет закрыт, и в этом
случае он не может быть автоматически выравнен. Также, если
текст добавлен до первого вызова метода close() объекта, и
графика будет удалена с экрана до завершения самых последних
транзакций, текст будет отображен до того, как произойдет
автоматическое выравнивание.
Этот метод предоставляет возможность принудительно выровнять
текст для нерезидентных текстовых объектов или текстовых
объектов с транзакциями.
Когда метод вызывается, используемая база данных должна быть
текущей базой данных (возвращаемой при вызове
HostApplicationServices()-\>workingDatabase()), текстовый
объект должен иметь ненулевую строку данных и корректный ID
стиля текста, который находится в используемой базе данных.
alternateDatabaseToUse: Используемая база данных, если

Teigha.DatabaseServices.DBText.IMPLEMENT_VECTOR3D_PROP_EX(Normal,setNormal,normal)
Этот метод запускает проверку правописания текста, чтобы
исправить грамматические ошибки. Проверка правописания — это
отдельная функция nanoCAD, поэтому данный метод не может
применятся для других пользовательских библиотек.
Возвращает 0 в случае полностью удачной проверки (если ошибки
зафиксированы или не найдены) и 1 в противном случае.

Teigha.DatabaseServices.DBText.Justify
Возвращает или устанавливает точку (-ки) выравнивания текста.

Teigha.DatabaseServices.DBText.TextStyleName
Возвращает имя используемого текстового стиля.

Teigha.DatabaseServices.DBText.AlignmentPoint
Обеспечивает доступ к точке выравнивания текста.

Teigha.DatabaseServices.DBText.Height
Обеспечивает доступ к высоте текста.

Teigha.DatabaseServices.DBText.HorizontalMode
Обеспечивает доступ к горизонтальному режиму текста.

Teigha.DatabaseServices.DBText.IsDefaultAlignment
Возвращает true, если текст выравнен по умолчанию.

Teigha.DatabaseServices.DBText.IsMirroredInX
Обеспечивает доступ к признаку того, что текст отображается
зеркально по направлению оси X (т.е. отображается справа
налево в горизонтальном направлении). False означает, что
текст отображается слева направо.

Teigha.DatabaseServices.DBText.IsMirroredInY
Обеспечивает доступ к признаку того, что текст отображается
зеркально по направлению оси Y (т.е. отображается снизу вверх
в вертикальном направлении). False означает, что текст
отображается сверху вниз.

Teigha.DatabaseServices.DBText.Normal
Обеспечивает доступ к вектору нормали к плоскости, содержащей
текст. Вектор нормали задается в мировых координатах.

Teigha.DatabaseServices.DBText.Oblique
Обеспечивает доступ к углу наклона (в радианах) текста. Этот
угол задает отклонение текста от вертикали так, что верх
символов текста отклоняется относительно их основания. Это то
же самое, как для курсива. Положительный угол отклоняет
вершины символов вперед относительно их основания. К
негативному значению добавляется значение 2*pi, чтобы
привести значения к положительным.

Teigha.DatabaseServices.DBText.Position
Обеспечивает доступ к точке вставки текста в мировых
координатах.

Teigha.DatabaseServices.DBText.Rotation
Обеспечивает доступ к углу поворота текста. Угол поворота
текста это угол относительно оси X OCS координат текста, с
положительным углом, отсчитываемым против часовой стрелки,
если смотреть по оси Z вниз к основанию координат. Ось X OCS
определяется с использованием вектора нормали к тексту, оси Z
мировых координат и алгоритма выбора осей nanoCAD.

Teigha.DatabaseServices.DBText.TextString
Предоставляет доступ к нуль-терминированной строке,
используемой объектом Text. Текстовая строка может быть
увеличена до 256 символов (не включая нуль-символа).
Приложение, вызывающее это свойство, ответственно за
освобождение памяти, используемое возвращаемой строкой.

Teigha.DatabaseServices.DBText.TextStyleId
Предоставляет доступ к имени используемого текстового стиля.

Teigha.DatabaseServices.DBText.Thickness
Обеспечивает доступ к значению толщины текста. Толщина текста
— это размер текста по направлению вдоль вектора нормали
(иногда называемым направлением "вытеснения").

Teigha.DatabaseServices.DBText.VerticalMode
Обеспечивает доступ к вертикальному режиму текста.

Teigha.DatabaseServices.DBText.WidthFactor
Это свойство обеспечивает доступ к фактору ширины (также
называемому относительным фактором X-масштаба) для текста.
widthFactor применяется к ширине текста, чтобы ширина могла
определяться в зависимости от высоты. Например, если
widthFactor имеет значение 0.8, то текст отображается с
шириной, равной 0.8 от нормальной "непривязанной" ширины.