Teigha.Geometry.Matrix3d.IsScaledOrtho
Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы.
Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы.
Реализация метода использует вызов Matrix3d.IsScaledOrtho(Tolerance tolerance) с допуском, равным Tolerance.Global.
Returns: Возвращает true, если трехмерные векторы, которые представлены столбцами линейной части этой матрицы, перпендикулярны друг другу. В противном случае возвращает false.