Teigha.DatabaseServices.RenderGlobal.Destination
Данное перечисление определяет доступные направления вывода для рендеринга.
Данное перечисление определяет доступные направления вывода для рендеринга.