HostMgd.PlottingServices.SheetType
Данное перечисление определяет тип выводимого на печать листа (пакетная многолистовая печать или индивидуальная печать единственного листа, включая варианты вывода в DWF и PDF файлы).
Перечисление SheetType представляет тип выводимого на печать листа (пакетная многолистовая печать или индивидуальная печать единственного листа, включая варианты вывода в DWF и PDF файлы).