Teigha.DatabaseServices.GraphNode.DisconnectAll
Метод предназначен для удаления всех входящих и исходящих ссылок этого объекта GraphNode.
Метод предназначен для удаления всех входящих и исходящих ссылок этого объекта GraphNode.
Этот метод всегда вызывается в деструкторе.
Удаляются все ссылки между этим узлом и любыми узлами In() или Out() или узлами CycleIn() и CycleOut(), т.е. любые указатели на данный объект.