Teigha.DatabaseServices.LinkedTableData
Класс LinkedTableData реализует связывание с данными из внешних таблиц Excel.
Класс LinkedTableData реализует связывание с данными из внешних таблиц Excel.
LinkedTableData похож на класс Table - он так же используется для хранения и управления данными в табличной структуре, однако есть существенное отличие. Здесь все ячейки в столбце не обязаны представлять один и тот же тип данных и могут иметь значение любого поддерживаемого типа данных, поля или блока. По этой причине класс LinkedTableData организует управление своими данными, не имея информации о формате дынных в ячейках.

Teigha.DatabaseServices.LinkedTableData.#ctor
Конструктор по умолчанию класса LinkedTableData.
Конструктор по умолчанию класса LinkedTableData.

Teigha.DatabaseServices.LinkedTableData.AppendColumn(System.Int32)
Метод добавляет в данную таблицу указанное количество столбцов.
Метод добавляет в данную таблицу указанное количество столбцов.
columnsNumber: Количество добавляемых столбцов.  Тип int.
Returns: Возвращает индекс первого добавленного столбца. Тип int.
Notes
Если аргумент columnsNumber меньше или равен нулю, метод выбрасывает исключение eInvalidInput.

Teigha.DatabaseServices.LinkedTableData.AppendRow(System.Int32)
Метод добавляет в данную таблицу указанное количество строк.
Метод добавляет в данную таблицу указанное количество строк.
rowsNumber: Количество добавляемых строк. Тип int.
Returns: Возвращает  индекс первой добавленной строки. Тип int.
Notes
Если аргумент rowsNumber меньше или равен нулю, метод выбрасывает исключение eInvalidInput.

Teigha.DatabaseServices.LinkedTableData.DataType(System.Int32,System.Int32)
Метод позволяет получить тип данных в первом элементе содержимого ячейки, заданной индексами строки и столбца.
Метод позволяет получить тип данных в первом элементе содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает тип данных в ячейке. Перечисление DatabaseServices.DataType.
Notes
При выходе индекса строки и/или индекса столбца за пределы допустимого диапазона метод выбрасывает исключение eInvalidInput.

Teigha.DatabaseServices.LinkedTableData.DeleteColumn(System.Int32,System.Int32)
Метод позволяет удалить из этой таблицы указанное количество столбцов, начиная со столбца с указанным индексом.
Метод позволяет удалить из таблицы указанное количество столбцов, начиная со столбца с указанным индексом.
index: Индекс первого удаляемого столбца. Тип int.
columnsNumberToDelete: Количество удаляемых столбцов. Тип int.

Teigha.DatabaseServices.LinkedTableData.DeleteContent(System.Int32,System.Int32)
Метод позволяет удалить все содержимое из ячейки, заданной индексами строки и столбца.
Метод позволяет удалить все содержимое из ячейки, заданной индексами строки и столбца.
row: Индекс строки,  тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.

Teigha.DatabaseServices.LinkedTableData.DeleteRow(System.Int32,System.Int32)
Метод позволяет удалить из данной таблицы заданное количество строк, начиная со строки с указанным индексом.
Метод позволяет удалить из данной таблицы заданное количество строк, начиная со строки с указанным индексом.
index: Индекс первой удаляемой строки. Тип int.
rowsNumberToDelete: Количество удаляемых строк.     Тип int.

Teigha.DatabaseServices.LinkedTableData.GetBlockAttributeValue(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет получить значение атрибута блока, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
Метод позволяет получить значение атрибута блока, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
row: Индекс строки.  Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
attributeDefinitionId: Идентификатор объекта определения атрибута блока.  Тип DatabaseServices.ObjectId.
Returns: Возвращает значение указанного атрибута блока. Тип String.
Notes
Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца меньше 0 или больше размера таблицы.

Teigha.DatabaseServices.LinkedTableData.GetBlockTableRecordId(System.Int32,System.Int32)
Метод позволяет получить идентификатор записи таблицы блоков, если первым элементом содержимого указанной ячейки является блок.
Метод позволяет получить идентификатор записи таблицы блоков, если первым элементом содержимого указанной ячейки является блок.
row: Индекс строки.  Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор записи таблицы блоков. Тип DatabaseServices.ObjectId.  Возвращает нулевой идентификатор, если первый элемент содержимого ячейки не является блоком.
Notes
Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца меньше 0 или больше размера таблицы.

Teigha.DatabaseServices.LinkedTableData.GetCellState(System.Int32,System.Int32)
Метод позволяет получить состояние первого элемента содержимого указанной ячейки.
Метод позволяет получить состояние первого элемента содержимого указанной ячейки.
row: Индекс строки.  Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает состояние первого элемента содержимого ячейки. Перечисление CellStates.
Notes
Метод выбрасывает исключение eInvalidInput, если индексы строки и/или столбца меньше 0 или больше размера таблицы.

Teigha.DatabaseServices.LinkedTableData.GetColumnName(System.Int32)
Метод позволяет получить имя столбца с указанным индексом.
Метод позволяет получить имя столбца с указанным индексом.
index: Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает имя столбца. Тип String.

Teigha.DatabaseServices.LinkedTableData.GetContentTypes(System.Int32,System.Int32)
Метод позволяет получить тип первого элемента содержимого указанной ячейки.
Метод позволяет получить тип первого элемента содержимого указанной ячейки.
row: Индекс строки.  Тип int. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает тип первого элемента содержимого ячейки. Перечисление CellContentTypes.

Teigha.DatabaseServices.LinkedTableData.GetCustomData(System.Int32,System.Int32,String)
Метод позволяет получить по ключу пользовательские данные ячейки, столбца или строки.
Метод позволяет получить по ключу пользовательские данные ячейки, столбца или строки.
Пользовательские данные хранятся в парах ключ - значение.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int.  Индекс может равняться -1.
column: Индекс столбца. Тип int.  Индекс может равняться -1.
key: Ключ пользовательских данных. Тип String.
Returns: Возвращает пользовательские данные. Тип Object.

Teigha.DatabaseServices.LinkedTableData.GetDataFormat(System.Int32,System.Int32)
Метод позволяет получить формат данных в указанной ячейке.
Метод позволяет получить формат данных в указанной ячейке.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает формат данных. Тип String.

Teigha.DatabaseServices.LinkedTableData.GetDataLink(System.Int32,System.Int32)
Метод позволяет получить идентификатор объекта внешней ссылки из указанной ячейки.
Метод позволяет получить идентификатор объекта внешней ссылки из указанной ячейки.
В случае отсутствия в ячейке внешней ссылки возвращает нулевой идентификатор.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор объекта внешней ссылки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LinkedTableData.GetDataLink(Teigha.DatabaseServices.CellRange)
Метод позволяет получить коллекцию внешних ссылок, заданных в указанном диапазоне ячеек.
Метод позволяет получить коллекцию внешних ссылок, заданных в указанном диапазоне ячеек.
range: Входной диапазон ячеек таблицы. Тип CellRange.
Returns: Возвращает коллекцию внешних ссылок из указанного диапазона ячеек.
Тип DatabaseServices.ObjectIdCollection.

Teigha.DatabaseServices.LinkedTableData.GetEnumerator(Teigha.DatabaseServices.TableEnumeratorOption)
Метод позволяет получить перечислитель для данной таблицы, преднастроенный с учетом указанных опций.
Метод позволяет получить перечислитель для данной таблицы, преднастроенный с учетом указанных опций.
option: Опции перечислителя таблицы. Перечисление TableEnumeratorOption.
Returns: Возвращает перечислитель для таблицы. Тип TableEnumerator.

Teigha.DatabaseServices.LinkedTableData.GetFieldId(System.Int32,System.Int32)
Метод позволяет получить идентификатор поля в указанной ячейке таблицы.
Метод позволяет получить идентификатор поля в указанной ячейке таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор объекта поля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LinkedTableData.GetToolTip(System.Int32,System.Int32)
Метод позволяет получить подсказку для указанной ячейки таблицы.
Метод позволяет получить подсказку для указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает подсказку для указанной ячейки.  Тип String.

Teigha.DatabaseServices.LinkedTableData.GetValue(System.Int32,System.Int32)
Метод позволяет получить значение первого элемента содержимого указанной ячейки таблицы.
Метод позволяет получить значение первого элемента содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает объект элемента содержимого ячейки.  Тип Object.

Teigha.DatabaseServices.LinkedTableData.GetValue(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.FormatOption)
Метод позволяет получить значение указанного элемента содержимого заданной ячейки таблицы.
Метод позволяет получить значение указанного по индексу элемента содержимого заданной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
content: Индекс элемента содержимого ячейки. Тип int.
formatOption: Уточнение формата, в котором требуется получить значение элемента. Тип FormatOption.
Returns: Возвращает значение элемента содержимого ячейки. Тип Object.

Teigha.DatabaseServices.LinkedTableData.InsertColumn(System.Int32,System.Int32)
Метод вставляет в данную таблицу указанное количество столбцов по указанному индексу столбца.
Метод вставляет в данную таблицу указанное количество столбцов по указанному индексу столбца.
index: Индекс столбца, по которому вставляются новые столбцы. Тип int.
columnsNumber: Количество вставляемых столбцов. Тип int.
Returns: Возвращает начальный индекс вставленных столбцов. Тип int.
Notes
Метод выбрасывает исключение eInvalidInput, если значение columnsNumber окажется не положительным.

Teigha.DatabaseServices.LinkedTableData.InsertRow(System.Int32,System.Int32)
Метод вставляет в данную таблицу указанное количество строк по указанному индексу строки.
Метод вставляет в данную таблицу указанное количество строк по указанному индексу строки.
index: Индекс строки, по которому вставляются новые строки. Тип int.
rowsNumber: Количество вставляемых строк. Тип int.
Returns: Возвращает начальный индекс вставленных строк. Тип int.
Notes
Метод выбрасывает исключение eInvalidInput, если значение rowsNumber окажется не положительным.

Teigha.DatabaseServices.LinkedTableData.IsContentEditable(System.Int32,System.Int32)
Метод позволяет проверить, допустимо ли редактирование содержимого указанной ячейки таблицы.
Метод позволяет проверить, допустимо ли редактирование содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает true, если содержимое ячейки можно редактировать.
В противном случае возвращает false.

Teigha.DatabaseServices.LinkedTableData.IsLinked(System.Int32,System.Int32)
Метод позволяет проверить, связана ли указанная ячейка с источником данных.
Метод позволяет проверить, связана ли указанная ячейка с источником данных.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает true, если ячейка связана с источником данных.
В противном случае возвращает false.

Teigha.DatabaseServices.LinkedTableData.SetBlockAttributeValue(System.Int32,System.Int32,DatabaseServices.ObjectId,String)
Метод позволяет задать значение атрибуту блока в ячейке, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
Метод позволяет задать значение атрибуту блока в ячейке, если первый элемент содержимого ячейки представляет собой блок с атрибутами. Атрибут специфицируется идентификатором объекта определения атрибута.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
attributeDefinitionId: Идентификатор объекта определения атрибута.  Тип DatabaseServices.ObjectId.
value: Новое значение атрибута. Тип String.

Teigha.DatabaseServices.LinkedTableData.SetBlockTableRecordId(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать идентификатор записи таблицы блоков в первом элементе содержимого указанной ячейки.
Метод позволяет задать идентификатор записи таблицы блоков в первом элементе содержимого указанной ячейки.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Идентификатор записи таблицы блоков. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LinkedTableData.SetCellState(System.Int32,System.Int32,Teigha.DatabaseServices.CellStates)
Метод позволяет задать состояние указанной ячейки.
Метод позволяет задать состояние указанной ячейки.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Состояние ячейки. Перечисление CellStates.

Teigha.DatabaseServices.LinkedTableData.SetColumnName(System.Int32,String)
Метод позволяет задать имя столбца.
Метод позволяет задать имя столбца.
index: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
name: Новое имя столбца. Тип String. Может быть пустым.

Teigha.DatabaseServices.LinkedTableData.SetCustomData(System.Int32,System.Int32,String,Object)
Метод позволяет задать пользовательские данные в ячейке, столбце или строке.
Метод позволяет задать пользовательские данные в ячейке, столбце или строке.
Пользовательские данные хранятся в парах ключ - значение.
Чтобы указать ячейку, следует задать допустимые индексы строки и столбца.
Чтобы указать строку, следует задать допустимый индекс строки и -1 в качестве индекса столбца.
Чтобы указать столбец, следует задать  допустимый индекс столбца и -1 в качестве индекса строки.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
key: Ключ для пользовательских данных.           Тип String.
value: Новое значение для пользовательских данных. Тип Object.

Teigha.DatabaseServices.LinkedTableData.SetDataFormat(System.Int32,System.Int32,String)
Метод позволяет задать формат данных в первом элементе содержимого указанной ячейки таблицы.
Метод позволяет задать формат данных в первом элементе содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
format: Формат данных. Тип String.

Teigha.DatabaseServices.LinkedTableData.SetDataLink(System.Int32,System.Int32,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать в указанной ячейке идентификатор внешней ссылки.
Метод позволяет задать в указанной ячейке идентификатор внешней ссылки.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
dataLinkId: Идентификатор внешней ссылки.  Тип DatabaseServices.ObjectId.
bUpdate: Флаг, указывающий, следует ли обновить данные по указанной внешней ссылке. Тип bool.

Teigha.DatabaseServices.LinkedTableData.SetDataLink(Teigha.DatabaseServices.CellRange,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать идентификатор внешней ссылки для указанного диапазона ячеек данной таблицы.
Метод позволяет задать идентификатор внешней ссылки для указанного диапазона ячеек данной таблицы.
range: Диапазон ячеек таблицы. Тип CellRange.
dataLinkId: Идентификатор внешней ссылки.  Тип DatabaseServices.ObjectId.
bUpdate: Флаг, указывающий, следует ли обновить данные по указанной внешней ссылке. Тип bool.

Teigha.DatabaseServices.LinkedTableData.SetDataType(System.Int32,System.Int32,DatabaseServices.DataType,DatabaseServices.UnitType)
Метод позволяет задать тип данных для первого элемента содержимого указанной ячейки таблицы.
Метод позволяет задать тип данных для первого элемента содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
dataType: Тип данных. Перечисление DatabaseServices.DataType.
unitType: Тип единиц измерения. Перечисление DatabaseServices.UnitType.

Teigha.DatabaseServices.LinkedTableData.SetFieldId(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать идентификатор поля в первом элементе содержимого указанной ячейки таблицы.
Метод позволяет задать идентификатор поля в первом элементе содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Идентификатор объекта поля. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LinkedTableData.SetSize(System.Int32,System.Int32)
Метод позволяет задать размеры для данной таблицы.
Метод позволяет задать размеры для данной таблицы.
numRows: Количество строк в таблице.    Тип int.
numCols: Количество столбцов в таблице. Тип int.

Teigha.DatabaseServices.LinkedTableData.SetToolTip(System.Int32,System.Int32,String)
Метод позволяет задать подсказку для указанной ячейки таблицы.
Метод позволяет задать подсказку для указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Строка подсказки. Тип String.

Teigha.DatabaseServices.LinkedTableData.SetValue(System.Int32,System.Int32,System.Int32,Object,Teigha.DatabaseServices.ParseOption)
Метод позволяет задать значение указанному элементу содержимого заданной ячейки таблицы.
Метод позволяет задать значение указанному элементу содержимого заданной ячейки таблицы.
Дополнительно метод дает возможность указать опции парсинга значения.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
content: Индекс элемента содержимого ячейки. Тип int.
value: Задаваемое значение. Тип Object.
parseOption: Опции парсинга значения. Перечисление ParseOption.

Teigha.DatabaseServices.LinkedTableData.SetValue(System.Int32,System.Int32,Object)
Метод позволяет задать значение первому элементу содержимого заданной ячейки таблицы.
Метод позволяет задать значение первому элементу содержимого заданной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Задаваемое значение. Тип Object.

Teigha.DatabaseServices.LinkedTableData.UnitType(System.Int32,System.Int32)
Метод позволяет получить тип единиц измерения для данных в первом элементе содержимого указанной ячейки таблицы.
Метод позволяет получить тип единиц измерения для данных в первом элементе содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает тип единиц измерения. Перечисление UnitType.

Teigha.DatabaseServices.LinkedTableData.UpdateDataLink(System.Int32,System.Int32,Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод позволяет обновить внешнюю ссылку в указанной ячейке с учетом заданного направления и опций обновления.
Метод позволяет обновить внешнюю ссылку в указанной ячейке с учетом заданного направления и опций обновления.
row: Индекс строки.  Тип int.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип int.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
dir: Направление обновления данных.  Перечисление UpdateDirection.
option: Опции обновления данных. Перечисление UpdateOption.

Teigha.DatabaseServices.LinkedTableData.UpdateDataLink(Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод позволяет обновить внешние ссылки в данном объекте.
Метод позволяет обновить внешние ссылки в данном объекте.
Дополнительно возможно уточнить направление обновления и задать опции обновления.
dir: Направление обновления данных.  Перечисление UpdateDirection.
option: Опции обновления данных. Перечисление UpdateOption.

Teigha.DatabaseServices.LinkedTableData.NumberOfColumns
Свойство представляет количество столбцов в данной таблице.
Свойство представляет количество столбцов в данной таблице.
Returns: Возвращает количество столбцов. Тип int.

Teigha.DatabaseServices.LinkedTableData.NumberOfRows
Свойство представляет количество строк в данной таблице.
Свойство представляет количество строк в данной таблице.
Returns: Возвращает количество строк. Тип int.