Teigha.Geometry.Matrix2dInfo.ToString
Метод предоставляет эквивалентное строковое представление данного объекта.
Метод предоставляет эквивалентное строковое представление данного объекта.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип String.