Teigha.DatabaseServices.FullDwgVersion.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Метод позволяет получить хеш-код данного объекта.
Хеш-код представляет собой целочисленное значение, уникальное для любого экземпляра данного класса.
Returns: Возвращает хеш-код объекта. Тип int.