Teigha.DatabaseServices.ProxyObject
Класс ProxyObject является базовым классом для прокси-объектов в базе данных.
Класс ProxyObject является базовым классом для прокси-объектов в базе данных.
Он предоставляет интерфейс к данным описания объектов, хранящихся в прокси-объектах чертежа.

Teigha.DatabaseServices.ProxyObject.ResurrectMeNow(DatabaseServices.ObjectId)
Метод ResurrectMeNow предназначен для восстановления объекта, представленного в чертеже своим прокси-объектом.
Метод ResurrectMeNow предназначен для восстановления объекта, представленного в чертеже своим прокси-объектом.
Замена прокси-объекта его исходным "настоящим" объектом возможна при условии, что загружено приложение, определяющее класс объекта, котрый представлен указанным прокси-объектом.
Обычно такое восстановление происходит автоматически во время загрузки чертежа или приложения NRX, однако последовательность автоматического восстановления определяется базой данных.
Данный метод позволяет вмешаться в эту последовательность, чтобы принудительно и параллельно восстановить объекты, связанные с указанным объектом.
id: Входной идентификатор прокси-объекта.

Teigha.DatabaseServices.ProxyObject.ApplicationDescription
Свойство ApplicationDescription обеспечивает доступ к описанию приложения объекта, представленного данным  прокси-объектом.
Свойство ApplicationDescription обеспечивает доступ к описанию приложения объекта, представленного данным  прокси-объектом.
Returns: Возвращает описание приложения.  Тип String.

Teigha.DatabaseServices.ProxyObject.OriginalClassName
Свойство OriginalClassName представляет имя класса объекта, представленного данным прокси-объектом.
Свойство OriginalClassName представляет имя класса объекта, представленного данным прокси-объектом.
Returns: Возвращает имя класса. Тип String.

Teigha.DatabaseServices.ProxyObject.OriginalDxfName
Свойство OriginalDxfName представляет DXF-имя объекта, представленного данным прокси-объектом.
Свойство OriginalDxfName представляет DXF-имя объекта, представленного данным прокси-объектом.
Returns: Возвращает DXF-имя объекта. Тип String.

Teigha.DatabaseServices.ProxyObject.ProxyFlags
Свойство ProxyFlags представляет множество операций, допустимых для данного прокси-объекта, в виде комбинации битовых флагов.
Свойство ProxyFlags представляет битовые флаги редактирования для класса, связанного с данным прокси-объектом.
Флаги определяют множество допустимых для этого прокси-объекта операций.
Это свойство возвращает комбинацию следующих свойств:
Имя                      Значение    Описание
----------------------   ---------   -----------------------------------------
kNoOperation             0x0         Нет разрешенных операций.
kEraseAllowed            0x1         erase()
kCloningAllowed          0x80        subDeepClone(), subWblockClone()
kAllButCloningAllowed    0x1         erase()
kAllAllowedBits          0x81        erase(), subDeepClone(), subWblockClone()
kMergeIgnore             0x00        Сохранять исходные имена.
kMergeReplace            0x100       Использовать клон.
kMergeMangleName         0x200       Создавать анонимные иена.
Returns: Возвращает комбинацию битовых флагов. Тип int.