HostMgd.EditorInput.Editor.UpdateScreen
Метод принудительно обновляет графическое отображение чертежа, перерисовывая его на экране.
Метод вызывает немедленную перерисовку активного окна чертежа nanoCAD.
Он используется для визуального обновления отображения после выполнения операций,
изменяющих геометрию или параметры объектов, чтобы изменения стали видны пользователю.
В отличие от метода Regen(), не пересчитывает данные объектов — только обновляет их отображение.
Example
C#