HostMgd.EditorInput.SelectionRemovedEventHandler
Делегат предназначен для обработки события, возникающего
при удалении одного или нескольких объектов из текущего
набора выделенных объектов.
Делегат используется как сигнатура метода-обработчика
для события SelectionRemoved, которое генерируется в редакторе nanoCAD
каждый раз, когда объекты удаляются из выборки — например, при удерживании
клавиши Shift и щелчке по объекту, использовании режима "Удалить"
или программном изменении выделения.
Он позволяет разработчику отслеживать изменения в наборе выбранных объектов
и реагировать на удаление — например, обновлять интерфейс, корректировать
логику команды или выполнять анализ.
Событие предоставляет доступ к списку удалённых объектов
через объект SelectionRemovedEventArgs, что обеспечивает
точный контроль над динамикой выборки.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий данные о произошедшем удалении