HostMgd.EditorInput.RolloverEventHandler
Делегат предназначен для обработки события,
возникающего при наведении курсора на графический
объект в чертеже.
Делегат используется как сигнатура метода-обработчика для события Rollover,
которое генерируется в nanoCAD при перемещении курсора над геометрическим примитивом,
поддерживающим подсветку. Он позволяет разработчику плагина или надстройки реагировать
на положение курсора в реальном времени — например, отображать подсказки, анализировать
свойства объекта, показывать контекстную информацию или изменять внешний вид интерфейса.
sender: Источник события — обычно экземпляр редактора (Editor),
e: Объект, содержащий данные о текущем состоянии наведения