Teigha.DatabaseServices.DBPoint
Класс представляет геометрический объект "точка", который хранит своё положение
в пространстве, вектор нормали для определения направления вытеснения и плоскости
отображения, а также толщину — длину вытеснения вдоль нормали. Этот класс
поддерживает различные режимы отображения точки в зависимости от системной
переменной PDMODE.
Геометрический объект "точка" содержит значение положения этой точки
в пространстве. Он также содержит вектор нормали, который
используется для определения направления "вытеснения" и
определения плоскости, на которой отображается изображение
точек, если они выглядят иначе чем "." (системная
переменная PDMODE управляет таким отображением).
Геометрический объект "точка" имеет толщину, которая является
его "длиной" в направлении ее вектора нормали (это и есть ее
длина "вытеснения").

Teigha.DatabaseServices.DBPoint.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.DBPoint.#ctor(Teigha.Geometry.Point3d)
Конструктор класса DBPoint. Создаёт геометрический объект "точка" с заданным положением
в трёхмерном пространстве.
Создает точку, которая использует значение параметра position
для получения положения создаваемой точки. Вектор нормали
инициализируется как (0,0,1) (в WCS координатах), угол
поворота в OSC, равный 0, и толщина, равная 0.
position: Позиция точки (в WCS координатах)

Teigha.DatabaseServices.DBPoint.EcsRotation
Свойство предназначено для получения или установки угла поворота оси X
OCS точки относительно оси X WCS, используемого при её отображении в случае,
если значение PDMODE задано не как точка.
Задает или возвращает угол (в радианах) между осью Х OCS
(прежде называемой ECS) для точки (основанной на векторе
нормали) и осью Х, которая будет использоваться при
отображении точки. Эта величина используется, если значение
PDMODE установлено, чтобы отображать точку иначе, чем ".".
Returns: Возвращает значение типа double, представляющее угол поворота оси X OCS
(основанной на векторе нормали точки) относительно оси X WCS.

Teigha.DatabaseServices.DBPoint.Normal
Свойство предназначено для получения или установки вектора нормали точки
в мировых координатах (WCS), который определяет направление вытеснения и плоскость
отображения при ненулевой толщине или изменённом режиме PDMODE.
Задает или возвращает вектор нормали для точки в WCS
координатах. Вектор нормали используется для определения
направления "вытеснения", когда точка имеет ненулевую ширину.
Вектор нормали также определяет плоскость, на которой
отображается изображение точек, если системная переменная
PDMODE установлена так, чтобы отображать точку иначе чем ".".
Returns: Возвращает значение типа Vector3d, представляющее вектор нормали,
заданный в мировой системе координат.

Teigha.DatabaseServices.DBPoint.Position
Свойство предназначено для получения или установки координат точки
в мировой системе координат (WCS).
Устанавливает или возвращает значение положения точки в WCS
координатах.
Returns: Возвращает значение типа Point3d, представляющее текущее положение точки
в трёхмерном пространстве.

Teigha.DatabaseServices.DBPoint.Thickness
Свойство предназначено для получения или установки толщины точки,
которая определяет её размер вдоль направления вектора нормали (направления "вытеснения").
Возвращает или задает значение толщины точки. Толщина
определяет размер точки по вдоль направления вектора нормали
(иногда называется направлением "вытеснения").
Returns: Возвращает значение типа double, представляющее текущую толщину точки.