Teigha.GraphicsSystem.DefaultLightingType
Данное перечисление определяет количество используемых по умолчанию источников освещения.
Данное перечисление определяет количество используемых по умолчанию источников освещения.