HostMgd.EditorInput.PromptForEntityEndingEventArgs.RemoveSelectedObject
Метод удаляет объект, выбранный пользователем в ходе интерактивного приглашения.
Метод предназначен для программного удаления геометрического объекта,
который был выбран пользователем во время операции ввода — например,
после вызова метода GetEntity(), GetPoint() или другой интерактивной команды.
Он позволяет избавиться от выбранного объекта в базе данных чертежа,
сохраняя целостность модели и обновляя состояние редактора.
Notes
Метод работает только с тем объектом, который был выбран
в рамках текущего контекста ввода, например,
через событие PromptForEntityEnding.
Example
C#