Teigha.DatabaseServices.PdfDefinition
Класс представляет функциональность определения подложки PDF.
Класс представляет функциональность определения подложки PDF.

Teigha.DatabaseServices.PdfDefinition.#ctor
Конструктор по умолчанию класса PdfDefinition.
Конструктор по умолчанию класса PdfDefinition.