Teigha.DatabaseServices.FieldUpdateResult.NumEvaluated
Свойство NumEvaluated представляет количество вычисленных полей.
Свойство NumEvaluated представляет количество вычисленных полей.
Returns: Возвращает количество вычисленных полей.
Тип int.