Teigha.DatabaseServices.RenderGlobal.DimensionsParameter
Структура DimensionsParameter представляет параметры высоты и ширины для свойства RenderGlobal.Dimensions.
Структура DimensionsParameter представляет параметры высоты и ширины для свойства RenderGlobal.Dimensions.

Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.#ctor(System.Int32,System.Int32)
Конструктор структуры DimensionsParameter.
Создает экземпляр структуры с указанными значениями высоты и ширины.
Конструктор структуры DimensionsParameter.
Создает экземпляр структуры с указанными значениями высоты и ширины.
w: Ширина. Тип int.
h: Высота. Тип int.

Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.Height
Свойство Height представляет размер по высоте.
Свойство Height представляет размер по высоте.
Returns: Возвращает значение высоты. Тип int.

Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.Width
Свойство Width представляет размер по ширине.
Свойство Width представляет размер по ширине.
Returns: Возвращает значение ширины. Тип int.