Teigha.DatabaseServices.ResultBufferEnumerator.MoveNext
Метод предназначен для перехода перечислителя к следующему типизированному значению в результирующем буфере.
Метод предназначен для перехода перечислителя к следующему типизированному значению в результирующем буфере.
Returns: Возвращает true, если индекс типизированного значения не вышел за пределы результирующего буфера.
В противном случае возвращает false.