Teigha.DatabaseServices.DxfFiler
Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DXF.
Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DXF.

Teigha.DatabaseServices.DxfFiler.#ctor(IntPtr,System.Boolean)
Конструктор класса DxfFiler.
Конструктор класса DxfFiler.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.DxfFiler.ReadBytes(array)
Метод возвращает указанное количество байтов из данного объекта Filer.
Метод возвращает указанное количество байтов из данного объекта Filer.
value: Массив байтов. Тип unsigned char[]. Длина массива определяет количество считываемых байтов.

Teigha.DatabaseServices.DxfFiler.AtSubclassData(String)
Метод проверяет, является ли текущим элементом этого файлера маркер данных подкласса с указанным именем подкласса.
Метод проверяет, является ли текущим элементом этого файлера маркер данных подкласса (DxfCode Subclass) с именем подкласса, которое передано методу в параметре value.
Если это так, то файлер перемещает указатель файла на следующий элемент и возвращает true.
В противном случае указатель файла остается в на прежнем месте и возвращается false.
value: Имя подкласса. Тип String.
Returns: Возвращает true, если текущим элементом файлера является маркер данных подкласса с именем value.
В противном случае возвращает false.

Teigha.DatabaseServices.DxfFiler.HaltAtClassBoundaries(System.Boolean)
Метод определяет, следует ли файлеру прекратить работу в случае выхода за границу класса.
Метод определяет, следует ли файлеру прекратить работу в случае выхода за границу класса.
Если в метод передано значение true, файлер должен в такой ситуации прекратить работу приложения.
В случае значения false файлер должен читать все входные данные без сброса состояния ErrorStatus, если только не произойдет ошибка ввода-вывода.
Реализация этого метода по умолчанию сводится к завершению работы nanoCAD.
value: Входное логическое значение, указывающее, следует ли прекращать работу на определенных ключевых маркерах в файле. Тип bool.

Teigha.DatabaseServices.DxfFiler.SetError(String,array)
Метод печатает сообщение об ошибке, используя предоставленный формат строки и переданные параметры.
Не реализован.
Метод печатает сообщение об ошибке, используя предоставленный формат строки и переданные параметры.
Не реализован.
format: Формат сообщения об ошибке. Тип String.
values: Массив аргументов для форматированной строки с описанием ошибки. Тип String[].

Teigha.DatabaseServices.DxfFiler.SetError(Teigha.BoundaryRepresentation.ErrorStatus,String,array)
Метод печатает сообщение об ошибке с указанным кодом, используя предоставленный формат строки и переданные параметры.
Не реализован.
Метод печатает сообщение об ошибке с указанным кодом, используя предоставленный формат строки и переданные параметры.
Не реализован.
value: Код ошибки. Значение из перечисления ErrorStatus.
format: Формат сообщения об ошибке. Тип String.
values: Массив аргументов для форматированной строки с описанием ошибки. Тип String[].

Teigha.DatabaseServices.DxfFiler.Seek(long long,System.Int32)
Перемещает указатель ввода-вывода данного файлера в указанную позицию.
Перемещает указатель ввода-вывода данного файлера в указанную позицию.
Реализация по умолчанию этого метода не делает ничего.
offset: Смещение указателя в байтах.  Тип long long.
method: Метод поиска новой позиции. Тип int. Допустимы следующие значения

Teigha.DatabaseServices.DxfFiler.WriteBoolean(Teigha.DatabaseServices.DxfCode,System.Boolean)
Метод записывает в данный объект Filer указанное логическое значение.
Метод записывает в данный объект Filer групповой код DXF и указанное логическое значение.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип bool.

Teigha.DatabaseServices.DxfFiler.WriteByte(Teigha.DatabaseServices.DxfCode,unsigned char)
Метод записывает в данный объект Filer указанное байтовое значение.
Метод записывает в данный объект Filer групповой код DXF и указанное байтовое значение.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип unsigned char.

Teigha.DatabaseServices.DxfFiler.WriteBytes(Teigha.DatabaseServices.DxfCode,array)
Метод записывает в данный объект Filer указанный байтовый массив.
Метод записывает в данный объект Filer групповой код DXF и указанный байтовый массив.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип unsigned char[].

Teigha.DatabaseServices.DxfFiler.WriteDouble(Teigha.DatabaseServices.DxfCode,System.Double,System.Int32)
Метод записывает в данный объект Filer указанное действительное значение с заданной точностью.
Метод записывает в данный объект Filer групповой код DXF, указанное действительное значение и желаемую точность представления.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип double.
precision: Количество десятичных знаков после разделителя в диапазоне от 0 до 16. Тип int.

Teigha.DatabaseServices.DxfFiler.WriteHandle(Teigha.DatabaseServices.DxfCode,Teigha.DatabaseServices.Handle)
Метод записывает в данный объект Filer указанный дескриптор Handle.
Метод записывает в данный объект Filer указанные групповой код DXF и дескриптор Handle.
opCode: Групповой код DXF. Тип DxfCode.
value: Дескриптор, который следует записать. Тип Handle.

Teigha.DatabaseServices.DxfFiler.WriteInt16(Teigha.DatabaseServices.DxfCode,short)
Метод записывает в данный объект Filer указанное 16-разрядное целое число со знаком (short).
Метод записывает в данный объект Filer указанные групповой код DXF и 16-разрядное целое число со знаком (short).
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип short.

Teigha.DatabaseServices.DxfFiler.WriteInt32(Teigha.DatabaseServices.DxfCode,System.Int32)
Метод записывает в данный объект Filer указанное 32-разрядное целое число со знаком (int).
Метод записывает в данный объект Filer указанные групповой код DXF и 32-разрядное целое число со знаком (int).
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип int.

Teigha.DatabaseServices.DxfFiler.WriteInt64(Teigha.DatabaseServices.DxfCode,long long)
Метод записывает в данный объект Filer указанное 64-разрядное целое число со знаком (long long).
Метод записывает в данный объект Filer указанные групповой код DXF и 64-разрядное целое число со знаком (long long).
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип long long.

Teigha.DatabaseServices.DxfFiler.WriteObjectId(Teigha.DatabaseServices.DxfCode,Teigha.DatabaseServices.ObjectId)
Метод записывает в данный объект Filer указанный идентификатор объекта ObjectId.
Метод записывает в данный объект Filer указанный идентификатор объекта ObjectId.
opCode: Групповой код DXF. Тип DxfCode.
value: Идентификатор объекта, который следует записать. Тип ObjectId.

Teigha.DatabaseServices.DxfFiler.WritePoint2d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Point2d,System.Int32)
Метод записывает в данный объект Filer указанную двумерную точку.
Метод записывает в данный объект Filer указанные групповой код DXF, двумерную точку и точность представления координат точки.
opCode: Групповой код DXF. Тип DxfCode.
value: 2D-точка, которую следует записать. Тип Point2d.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип int. Параметр используется для представления координат точки.

Teigha.DatabaseServices.DxfFiler.WritePoint3d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Point3d,System.Int32)
Метод записывает в данный объект Filer указанную трехмерную точку.
Метод записывает в данный объект Filer указанные групповой код DXF, трехмерную точку и точность представления координат точки.
opCode: Групповой код DXF. Тип DxfCode.
value: 3D-точка, которую следует записать. Тип Point3d.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип int. Параметр используется для представления координат точки.

Teigha.DatabaseServices.DxfFiler.WriteResultBuffer(Teigha.DatabaseServices.ResultBuffer)
Метод записывает в данный объект Filer указанный буфер результатов.
Метод записывает в данный объект Filer указанный буфер результатов.
buffer: Буфер результатов, который должен быть записан в файлер. Тип ResultBuffer.

Teigha.DatabaseServices.DxfFiler.WriteScale3d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Scale3d,System.Int32)
Метод записывает в данный объект Filer указанный масштаб.
Метод записывает в данный объект Filer указанные групповой код DXF, масштаб и точность представления действительных значений.
opCode: Групповой код DXF. Тип DxfCode.
value: Масштаб, который следует записать. Тип Scale3d.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип int. Используется для действительных значений.

Teigha.DatabaseServices.DxfFiler.WriteString(Teigha.DatabaseServices.DxfCode,String)
Метод записывает в данный объект Filer указанную строку.
Метод записывает в данный объект Filer указанные групповой код DXF и строку.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип String.

Teigha.DatabaseServices.DxfFiler.WriteUInt16(Teigha.DatabaseServices.DxfCode,unsigned short)
Метод записывает в данный объект Filer указанное 16-разрядное целое число без знака (unsigned short).
Метод записывает в данный объект Filer указанные групповой код DXF и 16-разрядное целое число без знака (unsigned short).
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип unsigned short.

Teigha.DatabaseServices.DxfFiler.WriteUInt32(Teigha.DatabaseServices.DxfCode,unsigned int)
Метод записывает в данный объект Filer указанное 32-разрядное целое число без знака (unsigned int).
Метод записывает в данный объект Filer указанные групповой код DXF и 32-разрядное целое число без знака (unsigned int).
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип unsigned int.

Teigha.DatabaseServices.DxfFiler.WriteUInt64(Teigha.DatabaseServices.DxfCode,unsigned long long)
Метод записывает в данный объект Filer указанное 64-разрядное целое число без знака (unsigned long long).
Метод записывает в данный объект Filer указанные групповой код DXF и 64-разрядное целое число без знака (unsigned long long).
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип unsigned long long.

Teigha.DatabaseServices.DxfFiler.WriteVector2d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Vector2d,System.Int32)
Метод записывает в данный объект Filer указанный 2D-вектор и точность представления координат вектора.
Метод записывает в данный объект Filer указанные групповой код DXF, 2D-вектор и точность представления координат вектора.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип Vector2d.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип int.

Teigha.DatabaseServices.DxfFiler.WriteVector3d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Vector3d,System.Int32)
Метод записывает в данный объект Filer указанный 3D-вектор и точность представления координат вектора.
Метод записывает в данный объект Filer указанные групповой код DXF, 3D-вектор и точность представления координат вектора.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип Vector3d.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип int.

Teigha.DatabaseServices.DxfFiler.WriteAngle(Teigha.DatabaseServices.DxfCode,System.Double,System.Int32)
Метод записывает в данный объект Filer указанное значение угла.
Метод записывает в данный объект Filer указанные групповой код DXF, значение угла и точность представления числа с плавающей точкой.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип double.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип int. Определяет точность представления числа с плавающей точкой.

Teigha.DatabaseServices.DxfFiler.WriteName(Teigha.DatabaseServices.DxfCode,String)
Метод записывает в данный объект Filer указанное имя в виде текстовой строки.
Метод записывает в данный объект Filer указанные групповой код DXF и имя в виде текстовой строки.
opCode: Групповой код DXF. Тип DxfCode.
value: Значение, которое следует записать. Тип String.

Teigha.DatabaseServices.DxfFiler.AtEndOfFile
Свойство позволяет определить, находится ли в конце файла указатель этого объекта Filer.
Свойство позволяет определить, находится ли в конце файла указатель этого объекта Filer.
Returns: Возвращает true, если указатель объекта Filer находится в конце файла.
В противном случае возвращает false.

Teigha.DatabaseServices.DxfFiler.AtEndOfObject
Свойство позволяет определить, находится ли этот объект Filer в конце данных объекта.
Свойство позволяет определить, находится ли этот объект Filer в конце данных объекта.
Returns: Возвращает true, если указатель объекта Filer находится в конце данных объекта.
В противном случае возвращает false.

Teigha.DatabaseServices.DxfFiler.AtExtendedData
Свойство позволяет определить, находится ли этот объект Filer в начале расширенных данных xdata объекта.
Свойство позволяет определить, находится ли этот объект Filer в начале расширенных данных xdata объекта.
Returns: Возвращает true, если Filer находится в начале расширенных данных (xdata) объекта.
В противном случае возвращает false.

Teigha.DatabaseServices.DxfFiler.Precision
Свойство задает или возвращает точность представления чисел с плавающей точкой в представлении ASCII DXF.
Точность задается как количество десятичных знаков после разделителя в диапазоне от 0 до 16.
Свойство задает или возвращает точность представления чисел с плавающей точкой в представлении ASCII DXF.
Точность задается как количество десятичных знаков после разделителя в диапазоне от 0 до 16.
Returns: Возвращает количество десятичных знаков после разделителя. Тип int.

Teigha.DatabaseServices.DxfFiler.IsModifyingExistingObject
Свойство позволяет определить, используется ли данный DxfFiler для изменения существующего объекта.
Не реализовано.
Свойство позволяет определить, используется ли данный DxfFiler для изменения существующего объекта.
Не реализовано.
Returns: Возвращает true, если данный DxfFiler используется в операции изменения существующего объекта.
В противном случае возвращает false.

Teigha.DatabaseServices.DxfFiler.AtEmbeddedObjectStart
Свойство позволяет определить, указывает ли этот объект DxfFiler на элемент с кодом DxfCode.EmbeddedObjectStart.
Не реализовано.
Свойство позволяет определить, указывает ли этот объект DxfFiler на элемент с кодом DxfCode.EmbeddedObjectStart.
Не реализовано.
Returns: Возвращает true, если объект DxfFiler указывает на элемент с кодом DxfCode.EmbeddedObjectStart.
В противном случае возвращает false.

Teigha.DatabaseServices.DxfFiler.IncludesDefaultValues
Свойство позволяет определить, используется ли DxfFiler для целей, в которых обычно выводятся значения по умолчанию.
Не реализовано.
Свойство позволяет определить, используется ли DxfFiler для целей, в которых обычно выводятся значения по умолчанию (т.е. цвет BYLAYER, вектор нормали = (0,0,1) и т.д.).  Не реализовано.
Returns: Возвращает true, если DxfFiler используется для целей, в которых обычно выводятся значения по умолчанию.
В противном случае возвращает false.

Teigha.DatabaseServices.DxfFiler.Elevation
Свойство обеспечивает доступ к высоте расположения (возвышению) объекта.
Не реализовано.
Свойство обеспечивает доступ к высоте расположения (возвышению) объекта.
Не реализовано.
Returns: Возвращает высоту (возвышение) расположения объекта. Тип double.

Teigha.DatabaseServices.DxfFiler.Thickness
Свойство возвращает толщину.  Не реализовано.
Свойство возвращает толщину.  Не реализовано.
Returns: Возвращает толщину. Тип double.

Teigha.DatabaseServices.DxfFiler.ErrorMessage
Свойство обеспечивает доступ к сообщению об ошибке, которое в данный момент настроено в объекте DxfFiler для отображения в случае возникновения ошибки. Не реализовано.
Свойство обеспечивает доступ к сообщению об ошибке, которое в данный момент настроено в объекте DxfFiler для отображения в случае возникновения ошибки.
Не реализовано.
Returns: Возвращает строку с сообщением об ошибке. Тип String.

Teigha.DatabaseServices.DxfFiler.DwgVersion
Свойство обеспечивает доступ к текущей версии чертежа.
Свойство обеспечивает доступ к текущей версии чертежа.
Returns: Возвращает версию чертежа. Тип FullDwgVersion.

Teigha.DatabaseServices.DxfFiler.Database
Свойство предоставляет доступ к базе данных, связанной с данным объектом DxfFiler.
Свойство предоставляет доступ к базе данных, связанной с данным объектом DxfFiler.
Returns: Возвращает базу данных. Тип DatabaseServices.Database.

Teigha.DatabaseServices.DxfFiler.FilerStatus
Свойство возвращает текущее состояние данного объекта DxfFiler.
Свойство возвращает текущее состояние данного объекта DxfFiler.
Returns: Возвращает текущее состояние данного объекта DxfFiler.  Тип Runtime.ErrorStatus.

Teigha.DatabaseServices.DxfFiler.FilerType
Свойство возвращает конкретный тип данного объекта Filer.
Свойство возвращает конкретный тип данного объекта Filer.
Returns: Возвращает тип данного файлера как значение из перечисления Teigha.DatabaseServices.FilerType.

Teigha.DatabaseServices.DxfFiler.Position
Свойство обеспечивает доступ к позиции указателя ввода-вывода данного объекта DxfFiler.
Свойство обеспечивает доступ к позиции указателя ввода-вывода данного объекта DxfFiler.
Returns: Возвращает позицию указателя ввода-вывода данного объекта DxfFiler.  Тип long.