Teigha.DatabaseServices.FeatureControlFrame.GetBoundingPoints
Метод предназначен для получения граничных точек в WCS этого символа допусков.
Метод предназначен для получения коллекции Point3dCollection граничных точек Point3d данного символа допусков FeatureControlFrame.
Граничные точки определены с мировой системе координат WCS.
Индексы граничных точек в возвращаемой коллекции имеют следующий смысл:
* 0 - Верхний левый угол рамки.
* 1 - Верхний правый угол рамки.
* 2 - Правый нижний угол рамки.
* 3 - Левый нижний угол рамки.
Returns: Возвращает коллекцию граничных точек прямоугольной рамки символа допусков. Тип Point3dCollection.