Teigha.Runtime.DynamicLinker.GetLoadedModules
Метод предоставляет список загруженных модулей.
Метод предоставляет список загруженных модулей.
Returns: Возвращает коллекцию загруженных модулей.
Тип System.Collections.Specialized.StringCollection.