Teigha.DatabaseServices.SubDMesh.ComputeSurfaceArea
Метод предназначен для вычисления текущей площади сети.
Метод предназначен для вычисления текущей площади сети.
Returns: Возвращает площадь сети, тип double.