Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.GetEnumerator
Метод возвращает перечислитель для данной коллекции.
Метод возвращает перечислитель для данной коллекции.
Returns: Возвращает перечислитель коллекции. Тип IEnumerator.