Teigha.GraphicsInterface.EdgeData.GetColors
Метод предоставляет массив индексов цвета ребер, используемых данным объектом.
Метод предоставляет массив индексов цвета, по одному для каждого ребра сети или оболочки, с которыми используется данный объект.
Returns: Возвращает массив индексов цвета.
Тип short[].
Возвращает пустой массив, если массив индексов цвета не был задан.