Teigha.DatabaseServices.DbDictionaryEnumerator.Reset
Реинициализирует перечислитель, сбрасывая его текущий индекс к значению -1.
Реинициализирует перечислитель, сбрасывая его текущий индекс к значению -1.