Teigha.GraphicsInterface.DiagnosticPhotonMode.Irradiance
Значение: 1.
Режим отображения освещённости фотонами всех поверхностей, при котором более высокие значения освещённости показаны красным цветом, а более низкие — синим.