HostMgd.GraphicsSystem.Manager.CreateAutoCADOffScreenDevice
Метод создаёт новое устройство как объект Teigha.GraphicsSystem.Device для отрисовки объектов чертежа в невидимом режиме
без визуализации в каком-либо отображаемом окне графического интерфейса.
Метод создаёт новое устройство как объект Teigha.GraphicsSystem.Device, предназначенное для отрисовки объектов чертежа в невидимом режиме без отображения в каком-либо окне графического интерфейса.
Returns: Возвращает созданное устройство графической системы.
Тип Teigha.GraphicsSystem.Device.