Teigha.DatabaseServices.LineWeightConverter
Класс предназначен для преобразования весов (толщин) линий.
Класс предназначен для преобразования весов (толщин) линий.

Teigha.DatabaseServices.LineWeightConverter.CanConvertFrom(ITypeDescriptorContext,Type)
Метод позволяет проверить, возможно ли преобразовать предоставленный тип в данный тип.
Метод позволяет проверить, возможно ли преобразовать предоставленный тип sourceType в данный тип.
context: Контекст для преобразования sourceType.  Тип ITypeDescriptorContext.
sourceType: Входной тип для преобразования. Тип Type.
Returns: Возвращает true, если sourceType возможно преобразовать в данный тип.
В противном случае возвращает false.

Teigha.DatabaseServices.LineWeightConverter.ConvertFrom(ITypeDescriptorContext,CultureInfo,Object)
Метод преобразует предоставленный объект и возвращает результат преобразования.
Метод преобразует предоставленный объект и возвращает результат преобразования.
Преобразование учитывает переданный контекст, а также языковые и региональные настройки.
context: Контекст для преобразования объекта value. Тип ITypeDescriptorContext.
culture: Провайдер языковых и региональных настроек. Тип CultureInfo.
value: Исходный объект для преобразования. Тип Object.
Returns: Возвращает результат преобразования. Тип Object.

Teigha.DatabaseServices.LineWeightConverter.ConvertTo(ITypeDescriptorContext,CultureInfo,Object,Type)
Метод предназначен для преобразования указанного объекта в заданный тип.
Метод предназначен для преобразования указанного объекта в заданный тип.
Преобразование учитывает переданный контекст, а также языковые и региональные настройки.
context: Контекст для преобразования входного объекта. Тип ITypeDescriptorContext.
culture: Провайдер языковых и региональных настроек. Тип CultureInfo.
value: Исходный объект. Тип Object.
destinationType: Требуемый тип, к которому следует привести объект value. Тип Type.
Returns: Возвращает результат преобразования. Тип Object.