Teigha.DatabaseServices.DbHomeView
Этот класс представляет исходный вид в системе управления ориентацией модели.
Этот класс представляет исходный вид в системе управления ориентацией модели.

Teigha.DatabaseServices.DbHomeView.#ctor(IntPtr,System.Boolean)
Конструктор класса DbHomeView.
Конструктор класса DbHomeView.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.DbHomeView.Equals(Object)
Метод предназначен для проверки на равенство данного объекта с указанным объектом.
Метод предназначен для проверки на равенство данного объекта с указанным объектом obj.
obj: Объект, с которым выполняет проверка на равенство.  Тип Object.
Returns: Возвращает true, если объекты эквивалентны.
В противном случае возвращает false.

Teigha.DatabaseServices.DbHomeView.!=(Teigha.DatabaseServices.DbHomeView,Teigha.DatabaseServices.DbHomeView)
Оператор неравенства класса DbHomeView.
Оператор неравенства класса DbHomeView.
lhvw: Левый операнд.  Тип DbHomeView.
rhvw: Правый операнд. Тип DbHomeView.
Returns: Возвращает true в случае неравенства операндов.  В противном случае возвращает false.

Teigha.DatabaseServices.DbHomeView.==(Teigha.DatabaseServices.DbHomeView,Teigha.DatabaseServices.DbHomeView)
Оператор равенства класса DbHomeView.
Оператор равенства класса DbHomeView.
lhvw: Левый операнд.  Тип DbHomeView.
rhvw: Правый операнд. Тип DbHomeView.
Returns: Возвращает true в случае равенства операндов.  В противном случае возвращает false.