Teigha.DatabaseServices.LayerTableRecord
Класс предназначен для хранения определений слоёв в базе
данных чертежа.
Класс предназначен для хранения определений слоёв в базе
данных чертежа.
Определение слоя представляет из себя набор данных,
определяющий настройки слоя, которые влияют на внешний вид и
свойства объектов, расположенных на этом слое (цвет — есть
или нет, замороженный/размороженный и т.д.).
Все настройки слоёв, которые есть в пользовательском
интерфейсе, также доступны и через API в виде свойств класса
LayerTableRecord.
Для создания нового слоя необходимо указать его название. Все
остальные свойства имеют значения по умолчанию и их значения
при создании слоя определять не обязательно.
Example
В качестве примера работы с определением слоя приведена
команда AddNewLayer, которая создаёт новый слой и
добавляет его в таблицу слоёв dwg-документа.
C#

Teigha.DatabaseServices.LayerTableRecord.#ctor
Конструктор класса
Конструктор класса.

Teigha.DatabaseServices.LayerTableRecord.#ctor(IntPtr,System.Boolean)
Конструктор класса.
Конструктор по умолчанию. Инициализирует цвета до 7 (белый);
устанавливает IsFrozen, IsLocked, IsOff,
ViewportVisibilityDefault и IsPlottable в false; Id типа
линии в null.

Teigha.DatabaseServices.LayerTableRecord.GetViewportOverrides(DatabaseServices.ObjectId)
Метод предназначен для получения информации о
переопределениях параметров слоя в видовом экране
пространства листа.
В видовых экранах пространства листа можно переопределять
цвет, тип линии, вес линии, прозрачность слоя. После
переопределения параметров слоя в видовом экране будут
применены новые параметры, а в остальных видовых экранах эти
параметры останутся прежними.
С помощью метода можно получить информацию о том, как
переопределены параметры слоя в видовом экране.
viewportId: ObjectId видового экрана
Returns: Возвращает тип данных LayerViewportProperties.

Teigha.DatabaseServices.LayerTableRecord.HasViewportOverrides(DatabaseServices.ObjectId)
Метод показывает, есть ли у слоя переопределения в видовом
экране пространства листа.
В видовых экранах пространства листа можно переопределять
цвет, тип линии, вес линии, прозрачность слоя. После
переопределения параметров слоя в видовом экране будут
применены новые параметры, а в остальных останутся старые.
С помощью метода можно получить информацию о том, есть ли у
слоя переопределения в видовом экране.
viewportId: ObjectId видового экрана
Returns: Возвращает тип данных bool.

Teigha.DatabaseServices.LayerTableRecord.EntityColor
В свойстве хранится информации о настройках цвета слоя.
В свойстве хранится информация о настройке цвета слоя в виде
типа данных .
Returns: Возвращает тип данных .

Teigha.DatabaseServices.LayerTableRecord.HasOverrides
В свойстве хранится информация о переопределениях слоя в видовых экранах пространства листа.
В свойстве хранится информация о том, имеет ли слой переопределения
в видовых экранах пространства листа. Переопределения слоя можно создавать
для разных видовых экранов в пространстве листа, изменяя в одном экране цвет,
тип линии, вес линии или прозрачность слоя. При этом в других видовых экранах
пространства листа эти свойства слоя не изменятся.
Returns: Возвращает тип данных bool:
* true – слой имеет переопределения;
* false – у слоя нет переопределений.

Teigha.DatabaseServices.LayerTableRecord.IsFrozen
Свойство предназначено для управления заморозкой слоя.
С помощью свойства можно получить информацию о том,
заморожен слой или нет в виде типа данных bool и изменить его значение.
Объекты, расположенные на замороженных слоях, не отображаются на экране,
не выводятся на печать и не участвуют в регенерации чертежа.
Неиспользуемые слои следует замораживать, когда необходимо
повысить скорость регенерации чертежа.
Returns: Возвращает тип данных bool:
* true – слой заморожен;
* false – слой не заморожен.

Teigha.DatabaseServices.LayerTableRecord.IsHidden
Свойство предназначено для настройки сокрытия слоя.
С помощью свойства можно получить информацию о том,
скрыт слой или нет в виде типа данных bool и изменить его значение.
Скрытый слой не отображается в диалоговом окне «Слои»,
но информация о нем и его настройках содержится в чертеже.
Returns: Возвращает тип данных bool:
* true – слой скрыт;
* false – слой не скрыт.

Teigha.DatabaseServices.LayerTableRecord.IsLocked
Свойство предназначено для настройки блокировки слоя.
С помощью свойства можно получить информацию о том,
заблокирован слой или нет в виде типа данных bool и изменить его значение.
Объекты заблокированного слоя видны на чертеже,
но недоступны для изменений и перемещений.
Returns: Возвращает тип данных bool:
* true – слой заблокирован;
* false – слой не заблокирован.

Teigha.DatabaseServices.LayerTableRecord.IsOff
Свойство предназначено для настройки видимости слоя.
С помощью свойства можно получить информацию о том,
виден слой на чертеже или нет в виде типа данных bool
и изменить его видимость. Объекты невидимого слоя не видны
ни в пространстве модели, ни в пространстве листа и не выводятся на печать.
Returns: Возвращает тип данных bool:
* true – слой виден;
* false – слой не виден.

Teigha.DatabaseServices.LayerTableRecord.IsPlottable
Свойство предназначено для настройки печатаемости слоя.
С помощью свойства можно получить информацию о том,
доступен слой для печати или нет и изменить значение свойства.
Объекты непечатаемого слоя не выводятся на печать, но видны на экране.
Returns: Возвращает тип данных bool:
* true – слой доступен для печати;
* false – слой не доступен для печати.

Teigha.DatabaseServices.LayerTableRecord.IsReconciled
Свойство не реализовано. Обеспечивает доступ к признаку того,
что слой является
согласованным.
Свойство не реализовано, всегда равно false.
Returns: Возвращает тип данных bool.

Teigha.DatabaseServices.LayerTableRecord.IsUsed
Свойство предназначено для получения информации об
использовании слоя в чертеже.
С помощью свойства можно получить информацию о том,
используется слой в чертеже или нет. Определение
неиспользуемого слоя хранится в таблице слоёв, но к нему не
относится ни один объект чертежа.
Returns: Возвращает тип данных bool:
* true – слой используется;
* false – слой не используется.

Teigha.DatabaseServices.LayerTableRecord.LinetypeObjectId
В свойстве хранится ObjectId типа линии, который
установлен в слое.
С помощью свойства можно получить ObjectId типа линии,
который используется в слое. Установленный тип линии будет у
всех объектов, распложенных на этом слое, если тип линии
каждого объекта установлен в значение quot;По слоюquot;.
Зная ObjectId типа линии можно открыть его из базы
данных чертежа и посмотреть подробную информацию об этом типе
линии. Также можно установить новый тип линии в слое, поменяв
значение свойства на ObjectId нужного типа линии.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.LayerTableRecord.LineWeight
В свойстве хранится информация о весе линии, установленной в
слое.
С помощью свойства можно получить информацию о том, какой вес
линии установлен в слое и изменить его.
Установленный в слое вес линии будет у всех объектов чертежа,
расположенных на этом слое, если вес линии этих объектов
установлен в значение «По слою».
Returns: Возвращает тип данных .

Teigha.DatabaseServices.LayerTableRecord.PlotStyleName
В свойстве хранится название стиля печати, установленного в слое.
С помощью свойства можно получить название стиля печати,
который используется в слое и изменить стиль печати,
сохранив в свойстве название другого стиля печати.
Стиль печати, установленный в слое, будет у всех объектов чертежа,
расположенных на этом слое, если стиль печати этих
объектов установлен в значение «По слою».
Returns: Возвращает тип данных string.

Teigha.DatabaseServices.LayerTableRecord.PlotStyleNameId
В свойстве хранится ObjectId стиля печати, который установлен
в слое.
С помощью свойства можно получить ObjectId стиля печати,
используемого в слое, и изменить его.
Стиль печати, установленный в слое, будет у всех объектов
чертежа, расположенных на этом слое, если стиль печати этих
объектов установлен в значение «По слою».
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.LayerTableRecord.Transparency
В свойстве хранится значение прозрачности слоя.
С помощью свойства можно получить текущее значение
прозрачности слоя и изменить его.
Прозрачность, установленная в слое, будет у всех объектов
чертежа, расположенных на этом слое, если прозрачность этих
объектов имеет значение «По слою».
Returns: Возвращает тип данных .

Teigha.DatabaseServices.LayerTableRecord.ViewportVisibilityDefault
Свойство предназначено для управления заморозкой слоёв в
новых видовых экранах пространства листа.
С помощью свойства можно управлять заморозкой слоя в новых
видовых экранах пространства листа. В пространстве модели
свойство не работает.
Returns: Возвращает тип данных bool:
* true – слой будет заморожен в новых видовых
экранах пространства листа;
* false – слой не будет заморожен в новых видовых
экранах пространства листа.

Teigha.DatabaseServices.LayerTableRecord.MaterialId
В свойстве хранится ObjectId материала, назначенного слою.
С помощью свойства можно получить ObjectId материала,
назначенного свойству и изменить его.
Материал, установленный в слое, будет у всех объектов
чертежа, расположенных на этом слое, если материал этих
объектов имеет значение «По слою».
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.LayerTableRecord.Description
В свойстве хранятся текстовые пояснения к слою.
В свойстве хранятся комментарии к слою в виде строки string.
С помощью свойства можно прочитать существующие комментарии,
либо изменить/добавить их.
Returns: Возвращает тип данных string.

Teigha.DatabaseServices.LayerTableRecord.Color
В свойстве хранится цвет слоя.
В свойстве хранятся цвет слоя в виде типа данных .
С помощью свойства можно получить текущий цвет, установленный
в слое и изменить его.
Цвет, установленный в слое, будет у всех объектов чертежа,
расположенных на этом слое, если цвет этих объектов имеет
значение «По слою».
Returns: \ \
Возвращает тип данных .