Teigha.DatabaseServices.DuplicateRecordCloning.Ignore
Значение: 1. Если обнаружено дублирование, новый клон игнорируется и продолжается использование существующей записи в целевой базе данных. Именно так работают команда INSERT и Database.Insert().