Teigha.DatabaseServices.DBObject.ReleaseExtensionDictionary
Метод предназначен для удаления расширенного словаря объекта.
Удаляет расширенный словарь объекта (это означает, что метод
удаляет объект, как собственник словаря), если он существует
и пустой. Этот метод вызывает метод словаря erase(). Любые
реакторы, присоединенные к расширенному словарю, получают
обычное уведомление при открытии на запись, очистке,
закрытии.