Teigha.DatabaseServices.AttributeDefinition
Класс AttributeDefinition представляет определения атрибутов (ATTDEF) в экземпляре базы данных.
Класс AttributeDefinition представляет определения атрибутов (ATTDEF) в экземпляре базы данных.
Определения атрибутов используются определениями блоков (BlockTableRecord) в качестве шаблонов для новых объектов атрибутов (ATTRIB) при создании вхождения блока (экземпляра BlockReference), ссылающегося на родительское определение блока.

Teigha.DatabaseServices.AttributeDefinition.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

Teigha.DatabaseServices.AttributeDefinition.#ctor(Teigha.Geometry.Point3d,String,String,String,DatabaseServices.ObjectId)
Конструктор класса, предназначенный для создания нового экземпляра класса AttributeDefinition с указанными параметрами.
Конструктор класса, предназначенный для создания нового экземпляра класса AttributeDefinition с указанными параметрами.
position: Позиция объекта AttributeDefinition. Тип Point3d.
value: Значение объекта AttributeDefinition. Тип String.
tag: Тег объекта AttributeDefinition. Тип String.
prompt: Запрос объекта AttributeDefinition. Тип String.
style: Стиль объекта AttributeDefinition. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AttributeDefinition.Constant
Свойство получает или задает значение флага, определяющего, является ли данный объект AttributeDefinition постоянным.
Свойство получает или задает значение флага, определяющего, является ли данный объект AttributeDefinition постоянным для всех вхождений блока (BlockReference).
В таком случае атрибут не создается, а все вхождения блока BlockReferences ссылаются на определение AttributeDefinition в таблице блоков BlockTableRecord.
Returns: Возвращает true, если данный объект AttributeDefinition является постоянным.
В противном случае возвращает false.

Teigha.DatabaseServices.AttributeDefinition.FieldLength
Свойство позволяет получить или задать длину поля в данном объекте AttributeDefinition.
Свойство позволяет получить или задать длину поля в данном объекте AttributeDefinition.
Returns: Возвращает длину поля. Тип int.

Teigha.DatabaseServices.AttributeDefinition.Invisible
Свойство предоставляет доступ на изменение к флагу невидимости объекта AttributeDefinition.
Свойство предоставляет доступ на изменение к флагу невидимости объекта AttributeDefinition.
Если флаг принимает значение true, объект AttributeDefinition становится невидимым.
Returns: Если флаг принимает значение true, объект AttributeDefinition становится невидимым.

Teigha.DatabaseServices.AttributeDefinition.IsMTextAttributeDefinition
Свойство предоставляет доступ на изменение к флагу, который определяет, является ли данный объект AttributeDefinition  определением многострочного атрибута.
Свойство предоставляет доступ на изменение к флагу, который определяет, является ли данный объект AttributeDefinition  определением многострочного атрибута.
Returns: Возвращает true, если определение атрибута является многострочным. В противном случае возвращает false.

Teigha.DatabaseServices.AttributeDefinition.LockPositionInBlock
Свойство позволяет получить или задать флаг фиксации относительного положения объекта AttributeDefinition в блоке.
Свойство позволяет получить или задать флаг фиксации относительного положения объекта AttributeDefinition в блоке.
Если true, то определение атрибута не может смещаться относительно геометрии.
Returns: Возвращает true, если определение атрибута не может смещаться относительно геометрии. В противном случае возвращает false.

Teigha.DatabaseServices.AttributeDefinition.MTextAttributeDefinition
Свойство обеспечивает доступ на изменение к объекту MText, который представляет определение многострочного атрибута.
Свойство обеспечивает доступ на изменение к объекту MText, который представляет определение многострочного атрибута.
Returns: Возвращает объект MText определения многострочного атрибута.

Teigha.DatabaseServices.AttributeDefinition.Preset
Свойство предоставляет доступ на изменение статуса "Установленный" (Preset) данного определения атрибута AttributeDefinition.
Свойство предоставляет доступ на изменение статуса "Установленный" (Preset) данного определения атрибута.
Такое определение предполагает заданное значение по умолчанию.
Returns: Возвращает true, если данному определению атрибута присвоен статус "Установленный" (Preset).
В противном случае возвращает false.

Teigha.DatabaseServices.AttributeDefinition.Prompt
Свойство позволяет получить или задать строку подсказки данного объекта AttributeDefinition.
Свойство позволяет получить или задать строку подсказки данного объекта AttributeDefinition.
Returns: Возвращает строку подсказки. Тип String.

Teigha.DatabaseServices.AttributeDefinition.Tag
Свойство позволяет получить или задать строку тега данного объекта AttributeDefinition.
Свойство позволяет получить или задать строку тега данного объекта AttributeDefinition.
Returns: Возвращает строку тега. Тип String.

Teigha.DatabaseServices.AttributeDefinition.Verifiable
Свойство позволяет получить или задать статус "Контролируемый" данного объекта AttributeDefinition.
Свойство позволяет получить или задать статус "Контролируемый" данного объекта AttributeDefinition.
Returns: Возвращает true, если объекту AttributeDefinition задан статус "Контролируемый".
В противном случае возвращает false.