Teigha.DatabaseServices.Light.ResultingColor
Метод позволяет получить окончательный цвет источника света как результат смешивания цвета лампы и цвета фильтра.
Метод позволяет получить окончательный цвет источника света как результат смешивания цвета лампы и цвета фильтра.
Returns: Возвращает итоговый цвет источника света. Тип Colors.Color.