Teigha.BoundaryRepresentation.Face.GetSurfaceAsTrimmedNurbs
Метод позволяет получить обрезанное представление базовой поверхности данной грани BREP в пространстве модели.
Метод позволяет получить обрезанное представление базовой поверхности данной грани BREP в пространстве модели.
Результат представляется как массив объектов ExternalBoundedSurface со всей цепочкой преобразований из пути подобъекта.
Поверхность преобразуется в NURB (при необходимости) и разделяется по ее швам, если пересекаются границами грани.
В случае ошибки результирующий массив вероятнее всего будет нулевым, при этом количество NURB-элементов будет равно нулю.
Returns: Возвращает обрезанное представление базовой поверхности данной грани.
Тип ExternalBoundedSurface[].