Teigha.DatabaseServices.DataCell.Init
Метод реинициализирует ячейку, устанавливая для нее тип данных CellType.Unknown.
Этот метод реинициализирует ячейку, устанавливая для нее тип данных CellType.Unknown.