Teigha.DatabaseServices.DBDictionary.GetEnumerator
Метод создает новый перечислитель.
Метод создает новый перечислитель типа DbDictionaryEnumerator.
Returns: Метод возвращает новый перечислитель типа DbDictionaryEnumerator.