HostMgd.EditorInput.PointHistoryBits.NotDigitizer
Значение: 2 (0x0002).
Бит указывает, что выбор точки выполнен любым способом (указанием мышью, вводом с клавиатуры, скриптом, макросом), но точно не с использованием графического планшета (дигитайзера).