Teigha.DatabaseServices.BlockReference.ExplodeToOwnerSpace
Разбивает ссылку на блок на отдельные компоненты. Метод
добавляет полученные геометрические объекты в ту
BlockTableRecord, которая является собственником той
BlockReference, в которой вызван метод.
Note
BlockReference должен быть в базе данных и должен быть
однородно масштабирован.