Teigha.GraphicsInterface.ShadowFlags
Перечисление ShadowFlags определяет битовые флаги, используемые при отображении теней.
Перечисление ShadowFlags определяет битовые флаги, используемые при отображении теней.