Teigha.GraphicsInterface.AutoTransform
Данное перечисление определяет режим автоматического преобразования для маппера.
Данное перечисление определяет режим автоматического преобразования для маппера.