Teigha.Runtime.CommandFlags.NoMultiple
Значение: 16.
Команда с таким флагом не допускает своё многократное выполнение после команды MULTIPLE.
В текущей версии nanoCAD использование этого флага не реализовано.