HostMgd.ApplicationServices.Marshaler
Класс Marshaler представляет служебные методы для преобразования между управляемыми наборами выделенных объектов и неуправляемыми структурами данных в формате ads_name.
В текущей версии не реализован.
Класс Marshaler представляет служебные методы для преобразования между управляемыми наборами выделенных объектов и неуправляемыми структурами данных в формате ads_name.
В текущей версии не реализован.

HostMgd.ApplicationServices.Marshaler.AdsNameToSelectionSet(System.IntPtr)
Метод преобразует неуправляемый объект, переданный указателем, в управляемый объект SelectionSet.
В текущей версии не реализован.
Метод преобразует неуправляемый объект, переданный указателем IntPtr, в управляемый объект SelectionSet.
В текущей версии не реализован.
pointerToAdsName: Указатель на неуправляемый объект, представляющий набор выбранных объектов в формате ads_name. Тип System.IntPtr.
Returns: Возвращает набор выбранных объектов в управляемой среде.
Тип HostMgd.EditorInput.SelectionSet.

HostMgd.ApplicationServices.Marshaler.SelectionSetToAdsName(HostMgd.EditorInput.SelectionSet,System.IntPtr)
Метод предназначен для записи данных из управляемого объекта SelectionSet в неуправляемый объект по указанному адресу.
В текущей версии не реализован.
Метод предназначен для записи данных из управляемого объекта SelectionSet в неуправляемую структуру ads_name по указанному адресу.  По сути, это преобразование является обратным по отношению к методу AdsNameToSelectionSet().
В текущей версии не реализован.
selectionSet: Ссылка на управляемый набор выделенных объектов. Тип HostMgd.EditorInput.SelectionSet.
pointerToAdsName: Неуправляемый указатель на область памяти, куда следует записать данные в формате ads_name. Тип System.IntPtr.