Teigha.GraphicsSystem.View
Класс View является абстрактным базовым классом для классов, реализующих объекты видового экрана Viewport в окнах графического пользовательского интерфейса nanoCAD. Каждый объект Viewport включает определяющие вид параметры камеры и коллекцию отображаемых объектов.
Объект View представляет некоторую часть окна графического пользовательского интерфейса и включает определяющие вид параметры камеры и коллекцию отображаемых объектов.  Другими словами, объекты View можно использовать для представления видового экрана nanoCAD.
Объект View добавляется к устройству Device.
В каждый конкретный момент времени объект View может принадлежать только одному объекту Device.
Виду следует указать, что именно он должен отображать.
Клиент добавляет и удаляет пары (отображаемый объект Drawable, модель Model), соответствующие отображаемому фрагменту модели.
Каждому виду задается режим рендеринга RenderMode, который соответствует алгоритму отрисовки геометрии в этом виде.
Объект View имеет два состояния: интерактивное и неинтерактивное.
По умолчанию используется неинтерактивное состояние, в котором все методы выполняются немедленно при вызове с возвратом только после завершения.  Все возвращаемые значения могут рассматриваться как надежные, и вызываться могут все методы.
Вызов метода BeginInteractivity() переводит объект View в интерактивное состояние с указанием минимальной частоты кадров, которую вид будет пытаться поддерживать.
Для этого он ставит в очередь все изменения вида и вызовы обновления, обрабатывая их асинхронно.
Здесь важно отметить, что минимально приемлемая частота кадров часто отличается от темпа поступления пользовательских данных (например, от
частоты получения координат курсора мыши).
Вследствие асинхронной обработки поставленных в очередь изменений вида небезопасно вызывать методы, которые запрашивают или изменяют состояние вида  (например, Add() или Erase()).
К надежным можно отнести только вызовы следующих свойств и методов: SetView(), EnableFrontClip, FrontClip, EnableBackClip, BackClip, Mode, Dolly(), Roll(), Orbit(), Zoom(), Pan(), Update(), Flush() и EndInteractivity().
При возврате из метода EndInteractivity() вид переводится из интерактивного в неинтерактивное состояние.
Объекты View поддерживают переднюю и заднюю плоскости отсечения.
Эти плоскости ориентированы так, чтобы их нормали совпадали с вектором взгляда, и их ориентация сохраняется при изменении вектора взгляда.
Передняя плоскость отсечения, если включена, подавляет отображение любой геометрии, которая располагается между камерой и передней плоскостью отсечения.  Соответственно, задняя плоскость отсечения, если включена, подавляет отображение любой геометрии, которая удалена от камеры в направлении вектора взгляда дальше задней плоскости.
Класс View следует использовать для доступа к полному описанию вида в режиме перспективы.
Он поддерживает весь необходимый функционал для определения вида, плоскостей отсечения и матриц преобразования вида.

Teigha.GraphicsSystem.View.#ctor
Конструктор по умолчанию класса View.
Конструктор по умолчанию класса View.
Создает экземпляр класса, у которого все свойства принимают значения по умолчанию.

Teigha.GraphicsSystem.View.Add(GraphicsInterface.Drawable)
Метод позволяет добавить к данному объекту View корневой узел графа сцены.
Метод позволяет добавить к данному объекту View корневой узел графа сцены.
Правильным способом использования этого метода является построение ориентированного ациклического графа (графа сцены) объектов Drawable, каждый из которых позволяет графической системе отобразить свои дочерние элементы, используя метод Geometry.Draw().
Далее с помощью этого метода Add() корневой узел графа сцены добавляется к объекту View.
Объекты View nanoCAD обычно представляют четыре отображаемых объекта: блок пространства модели, значок ПСК (UCS), сетку и компас.
drawable: Корневой узел графа сцены. Тип GraphicsInterface.Drawable.
Returns: Этот метод всегда возвращает true.

Teigha.GraphicsSystem.View.Add(GraphicsInterface.Drawable,Teigha.GraphicsSystem.Model)
Метод позволяет определить, какие части каких моделей будут отображаться на данном виде, используя корневой узел графа сцены и объект Model.
Метод позволяет определить, какие части каких моделей будут отображаться на данном виде, используя корневой узел графа сцены и объект Model.
Правильным способом использования этого метода является построение ориентированного ациклического графа (графа сцены) объектов Drawable, каждый из которых позволяет графической системе отобразить свои дочерние элементы, используя метод Geometry.Draw().
С помощью данного метода Add() добавьте к виду View корневой узел графа сцены и объект модели Model, которая обеспечит обработку уведомлений для вида.
Объекты View nanoCAD обычно представляют четыре отображаемых объекта: блок пространства модели, значок ПСК (UCS), сетку и компас.
drawable: Корневой узел графа сцены. Тип GraphicsInterface.Drawable.
model: Объект модели, которому направляются все уведомления узлов графа сцены. Тип Model.
Returns: Этот метод всегда возвращает true.

Teigha.GraphicsSystem.View.BeginInteractivity(System.Double)
Метод позволяет перевести данный вид в интерактивное состояние с указанием желательной частоты кадров.
Метод позволяет перевести данный вид в интерактивное состояние с желаемой частотой кадров.
Графическая система (GS) будет делать всё возможное, чтобы поддерживать указанную частоту кадров.
В случае невозможности справиться с этой задачей, будет предпринята попытка использовать более быстрый алгоритм рендеринга.
Если такой алгоритм окажется недоступен, обход графа сцены будет прерван.
Частота кадров 0.0 предписывает графической системе использовать частоту кадров по умолчанию, указанную пользователем в диалоговом окне конфигурации GS.
frameRateInHz: Желательная частота кадров в секунду. Тип double. Значение по умолчанию 0.0.

Teigha.GraphicsSystem.View.CloneView(System.Boolean)
Метод позволяет получить новый объект View, являющийся копией данного вида, с возможностью включить или отключить копирование параметров вида.
Метод позволяет получить новый объект View, являющийся копией данного вида.
Логический аргумент cloneViewParameters дает возможность включить или отключить копирование параметров вида.
cloneViewParameters: Флаг копирования параметров вида. Тип bool. Если флаг установлен, параметры вида копируются.
Returns: Возвращает объект-клон данного вида.
Тип View.

Teigha.GraphicsSystem.View.CloneView(System.Boolean,System.Boolean)
Метод позволяет получить новый объект View, являющийся копией данного вида, с возможностью включить или отключить копирование  геометрии и параметров вида.
Метод позволяет получить новый объект View, являющийся копией данного вида, с возможностью включить или отключить копирование  геометрии и параметров вида.
cloneViewParameters: Флаг копирования параметров вида. Тип bool. Если флаг установлен, параметры вида копируются.
cloneGeometry: Флаг копирования геометрии вида.  Тип bool. Если флаг установлен, геометрия вида копируется.
Returns: Возвращает объект-клон данного вида.
Тип View.

Teigha.GraphicsSystem.View.Dolly(System.Double,System.Double,System.Double)
Метод предназначен для изменения положения камеры и точки цели при перемещении платформы камеры на указанную величину.
Метод предназначен для изменения положения камеры и точки цели при перемещении платформы камеры на указанную величину.
Все остальные параметры камеры остаются без изменения.
Система координат в пространстве камеры определяется следующим образом:
* Ось Y направлена вверх.
* Ось Z направлена из точки положения камеры в точку цели.
* Ось X определяется векторным произведением осей Y и Z.
xDolly: Перемещение платформы камеры в направлении оси X. Тип double.
yDolly: Перемещение платформы камеры в направлении оси Y. Тип double.
zDolly: Перемещение платформы камеры в направлении оси Z. Тип double.

Teigha.GraphicsSystem.View.Dolly(Teigha.Geometry.Vector3d)
Метод предназначен для изменения положения камеры и точки цели при перемещении платформы камеры на указанный вектор.
Метод предназначен для изменения положения камеры и точки цели при перемещении платформы камеры на указанный вектор.
Все остальные параметры камеры остаются без изменения.
Система координат в пространстве камеры определяется следующим образом:
* Ось Y направлена вверх.
* Ось Z направлена из точки положения камеры в точку цели.
* Ось X определяется векторным произведением осей Y и Z.
dollyVector: Вектор перемещения платформы камеры.

Teigha.GraphicsSystem.View.EnableDefaultLighting(System.Boolean)
Метод позволяет включать или отключать освещение по умолчанию для данного объекта View.
Метод позволяет включать или отключать освещение по умолчанию для данного объекта View.
bEnable: Флаг включения освещения по умолчанию. Тип bool.

Teigha.GraphicsSystem.View.EnableDefaultLighting(System.Boolean,Teigha.DatabaseServices.DefaultLightingType)
Метод позволяет для данного объекта View включать или отключать освещение по умолчанию, а также устанавливать его тип.
Метод позволяет для данного объекта View включать или отключать освещение по умолчанию, а также устанавливать его тип.
bEnable: Флаг включения освещения по умолчанию. Тип bool.
type: Новый тип освещения по умолчанию. Перечисление DefaultLightingType.

Teigha.GraphicsSystem.View.Erase(GraphicsInterface.Drawable)
Метод предназначен для удаления указанного графа сцены из данного объекта View.
Метод предназначен для удаления указанного графа сцены из данного объекта View.
sceneGraph: Корневой узел удаляемого графа сцены.
Returns: Возвращает true, если корневой узел был найден и операция завершилась успешно.
Возвращает false, если предоставленный объект Drawable не был добавлен в этот вид.

Teigha.GraphicsSystem.View.ExtentsInView(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет проверить, попадает ли указанный граничный бокс в пирамиду видимости текущего объекта View (хотя бы частично).
Метод позволяет проверить, попадает ли указанный граничный бокс в пирамиду видимости текущего объекта View (хотя бы частично).
Границы определяются в координатах МСК (WCS).
minPoint: Минимальная вершина граничного бокса в координатах МСК (WCS). Тип Point3d.
maxPoint: Максимальная вершина граничного бокса в координатах МСК (WCS). Тип Point3d.
Returns: Возвращает true, если указанный граничный бокс попадает (хотя бы частично) в пирамиду видимости данного вида.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.FreezeLayer(DatabaseServices.ObjectId)
Метод позволяет заморозить указанный слой Layer в данном объекте View.
Метод позволяет заморозить указанный слой Layer в данном объекте View.
По умолчанию все слои разморожены.
layerID: Постоянный идентификатор объекта слоя, который должен быть заморожен. Тип DatabaseServices.ObjectId.

Teigha.GraphicsSystem.View.GetModel(GraphicsInterface.Drawable)
Метод позволяет получить объект Model, связанный с указанным объектом Drawable в данном объекте View.
Метод позволяет получить объект Model, связанный с указанным объектом Drawable в данном объекте View.
drw: Входной отображаемый объект, для которого требуется найти ассоциированную модель графической системы.
Returns: Возвращает модель. Тип Model.

Teigha.GraphicsSystem.View.GetNumPixelsInUnitSquare(Teigha.Geometry.Point3d)
Метод позволяет получить для данного объекта View плотность пикселей дисплея в указанной точке мирового пространства.
Метод позволяет получить для данного объекта View плотность пикселей дисплея в указанной точке мирового пространства.
Плотность измеряется в пикселях на единицу длины WCS.
Этот метод обычно используется для оценки текущих видимых размеров геометрических объектов.
Если этот размер близок к одному пикселю, можно получить выигрыш в скорости и эффективности использования памяти за счет существенного упрощения отображаемой геометрии, которое совершенно незаметно для пользователя.
Notes
В случае перспективной проекции отображаемый на дисплее размер единичного квадрата WCS уменьшается по мере удаления от камеры, тогда как в режиме ортогонального проецирования этот размер от расстояния до камеры не зависит.
В последнем случае координаты точки givenWorldpt на результат не влияют.
givenWorldpt: Центр единичного квадрата в мировой системе координат (МСК, WCS). Тип Point3d. В случае ортогональной проекции координаты этой точки на результат не влияют.
Returns: Возвращает 2D-точку, X и Y координаты которой равны количеству пикселей для горизонтального и вертикального размера единичного квадрата WCS.
Тип Point2d.

Teigha.GraphicsSystem.View.GetNumPixelsInUnitSquare(Teigha.Geometry.Point3d,System.Boolean)
Метод возвращает плотность пикселей дисплея в указанной точке МСК (WCS) для данного объекта View, позволяя учесть использование перспективного проецирования.
Метод позволяет получить для данного объекта View плотность пикселей дисплея в указанной точке МСК (WCS).
Плотность измеряется в пикселях на единицу длины WCS.
Этот метод обычно используется для оценки текущих видимых размеров геометрических объектов.
Если этот размер близок к одному пикселю, можно получить выигрыш в скорости и эффективности использования памяти за счет существенного упрощения отображаемой геометрии, которое совершенно незаметно для пользователя.
Дополнительный аргумент позволяет при расчете учесть использование видом перспективного проецирования.
givenWorldpt: Центр единичного квадрата в мировой системе координат (МСК, WCS). Тип Point3d.
includePerspective: Если принимает значение true, вычисление плотности пикселей учитывает перспективную проекцию.
Returns: Возвращает 2D-точку, X и Y координаты которой равны количеству пикселей для горизонтального и вертикального размера единичного квадрата WCS.
Тип Point2d.

Teigha.GraphicsSystem.View.GetSnapshot(System.Drawing.Rectangle)
Метод позволяет получить снимок текущего состояния графики в указанной области на данном виде.
Метод позволяет получить снимок текущего состояния графики в указанной области на данном виде.
Реализация может выдать исключение eNotImplementedYet, если текущий модуль векторизации не поддерживает получение снимков.
rectangle: Область на виде для получения снимка. Тип System.Drawing.Rectangle.
Returns: Возвращает снимок текущего состояния графики в области rectangle.
Тип System.Drawing.Bitmap.

Teigha.GraphicsSystem.View.InitLights(IEnumerator)
Метод позволяет связать с данным объектом View источники освещения, предоставленные указанным перечислителем.
Метод позволяет связать с данным объектом View источники освещения, предоставленные указанным перечислителем.
pLightsIterator: Входной перечислитель источников освещения.

Teigha.GraphicsSystem.View.Invalidate(System.Drawing.Rectangle)
Метод позволяет отметить указанную область на данном виде как требующую обновления.
Метод позволяет указать, что заданная область на данном виде требует обновления.
screenRect: Область вида, требующая обновления. Тип System.Drawing.Rectangle.

Teigha.GraphicsSystem.View.Orbit(System.Double,System.Double)
Метод выполняет заданное вращение камеры вокруг неподвижной точки цели.
Метод выполняет заданное вращение камеры вокруг неподвижной точки цели.
Движение камеры рассматривается относительно следующих осей.
* Ось Y направлена вертикально вверх.
* Ось Z направлена из точки положения камеры в точку цели.
* Направление оси X определяется векторным произведением направлений осей Y и Z.
Камера движется по поверхности сферы с центром в точке цели камеры и радиусом, равным расстоянию от камеры до точки цели.
Центр и радиус сферы остаются неизменными.
Сначала камера поворачивается вокруг оси, параллельной оси X и проходящей через точку цели.
Затем камера поворачивается вокруг оси, параллельной оси Y и проходящей через точку цели.
Все углы вращения выражаются в радианах.
xOrbit: Угол поворота вокруг оси X (в радианах). Тип double.
yOrbit: Угол поворота вокруг оси Y (в радианах). Тип double.

Teigha.GraphicsSystem.View.Pan(System.Double,System.Double)
Метод предназначен для панорамирования камеры с использованием заданных углов поворота точки цели камеры.
Метод предназначен для панорамирования камеры с использованием заданных углов поворота точки цели камеры.
При панорамировании точка цели камеры движется по поверхности сферы с центром в неподвижной точке положения камеры и фиксированным радиусом, который равен расстоянию от точки цели до точки камеры.
Вращение точки цели рассматривается относительно следующих осей:
* Ось Y направлена из точки положения камеры вертикально вверх.
* Ось Z направлена из точки положения камеры в точку цели (направление взгляда).
* Направление оси X определяется векторным произведением направлений осей Y и Z.
Сначала точка цели поворачивается вокруг оси, параллельной оси X и проходящей через точку положения камеры.
Затем точка цели поворачивается вокруг оси, параллельной оси Y и проходящей через точку положения камеры.
Все углы вращения выражаются в радианах.
xPan: Угол вращения точки цели камеры вокруг оси X (в радианах). Тип double.
yPan: Угол вращения точки цели камеры вокруг оси Y (в радианах). Тип double.

Teigha.GraphicsSystem.View.PointInView(Teigha.Geometry.Point3d)
Метод позволяет проверить, попадает ли указанная точка в текущие границы усеченной пирамиды видимости данного вида.
Метод позволяет проверить, попадает ли указанная точка в текущие границы усеченной пирамиды видимости (frustum) данного вида.
point: Проверяемая точка в мировой системе координат. Тип Point3d.
Returns: Возвращает true, если указанная точка оказывается в текущих границах усеченной пирамиды видимости данного вида.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.PointInViewport(Teigha.Geometry.Point2d)
Метод позволяет проверить, попадает ли 2D-точка, заданная в системе координат устройства, в текущие границы видового экрана.
Метод позволяет проверить, попадает ли 2D-точка, заданная в системе координат устройства, в текущие границы видового экрана.
screenPoint: Проверяемая 2D-точка в системе координат устройства. Тип Point2d.
Returns: Возвращает true, если указанная точка попадает в текущие пределы видового экрана.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.Roll(System.Double)
Метод поворачивает камеру на указанный угол вокруг вектора взгляда.
Метод поворачивает камеру на указанный угол rollAngle вокруг вектора взгляда.
Положительным направлением считается направление вращения камеры против часовой стрелки, если смотреть из точки камеры на точку цели.
Это соответствует повороту вектора вверх камеры (направления ее вертикали) по часовой стрелке.
Координатная система камеры привязана к виду из точки камеры на точку цели:
* Ось Y направлена вертикально вверх.
* Ось Z (вектор взгляда) направлена из точки камеры к точке цели.
* Направление оси X представляет собой векторное произведение направлений осей Y и Z.
rollAngle: Угол вращения камеры (в радианах). Тип double.

Teigha.GraphicsSystem.View.Select(Teigha.Geometry.Point2dCollection,Teigha.GraphicsSystem.SelectionReactor,Teigha.GraphicsSystem.SelectionMode)
Метод позволяет запустить процедуру выделения в пределах данного объекта View.
Метод позволяет запустить процедуру выделения в пределах данного объекта View.
pts: Коллекция 2D-точек, которые образуют границу области выделения.  Тип Point2dCollection.
pReactor: Объект реактора выделения.  Тип SelectionReactor.
mode: Режим выделения.  Перечисление SelectionMode.

Teigha.GraphicsSystem.View.SetLineweights(array)
Метод позволяет задать веса линий для данного объекта View.
Метод позволяет задать веса линий для данного объекта View.
lineweights: Входной массив весов линий. Тип array.

Teigha.GraphicsSystem.View.SetView(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double)
Метод позволяет задать параметры камеры для данного объекта View, необходимые для определения преобразования координат из мировой системы координат (МСК, WCS) в нормализованные координаты устройства.
Метод позволяет задать параметры камеры для данного объекта View, необходимые для определения преобразования координат из мировой системы координат (МСК, WCS) в нормализованные координаты устройства.
Все параметры указываются в координатах WCS.
Notes
Точки положения камеры и цели не должны совпадать.
Вектор вертикали камеры upVector не может быть параллелен направлению из точки камеры к точке цели.
Размеры fieldWidth и fieldHeight помогают определить геометрическое преобразование из пространства вида в нормализованные координаты устройства.
position: Точка положения камеры. Тип Point3d. Должна отличаться от точки target.
target: Точка цели камеры. Тип Point3d. Должна отличаться от точки position.
upVector: Вектор вертикали камеры (вектор вверх). Тип Vector3d. Не может быть параллелен направлению взгляда.
fieldWidth: Входная ширина плоскости (поля) проецирования. Тип double.
fieldHeight: Входная высота плоскости (поля) проецирования. Тип double.

Teigha.GraphicsSystem.View.SetView(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,Teigha.GraphicsInterface.Projection)
Метод позволяет задать преобразования координат из мировой системы координат (МСК, WCS) в нормализованные координаты устройства через параметры камеры данного объекта View с учетом заданного типа проецирования.
Метод позволяет задать преобразования координат из мировой системы координат (МСК, WCS) в нормализованные координаты устройства через параметры камеры данного объекта View с учетом заданного типа проецирования (перспективное или ортогональное).
Все параметры указываются в координатах WCS.
Notes
Точки положения камеры и цели не должны совпадать.
Вектор вертикали камеры upVector не может быть параллелен направлению из точки камеры к точке цели.
Размеры fieldWidth и fieldHeight помогают определить геометрическое преобразование из пространства вида в нормализованные координаты устройства.
position: Точка положения камеры. Тип Point3d. Должна отличаться от точки target.
target: Точка цели камеры. Тип Point3d. Должна отличаться от точки position.
upVector: Вектор вертикали камеры (вектор вверх). Тип Vector3d. Не может быть параллелен направлению взгляда.
fieldWidth: Входная ширина плоскости (поля) проецирования. Тип double.
fieldHeight: Входная высота плоскости (поля) проецирования. Тип double.
projection: Тип проецирования (ортогональное или перспективное). Перечисление Projection.

Teigha.GraphicsSystem.View.ThawLayer(DatabaseServices.ObjectId)
Метод позволяет разморозить указанный слой Layer на данном виде.
Метод позволяет разморозить указанный слой Layer на данном виде.
layerID: Идентификатор объекта размораживаемого слоя. Тип DatabaseServices.ObjectId.

Teigha.GraphicsSystem.View.ViewParameters(Teigha.GraphicsSystem.View)
Получает параметры вида данного объекта View.
Получает параметры вида данного объекта View.
pView: ОБъект типа View, в который передаются параметры вида.

Teigha.GraphicsSystem.View.Zoom(System.Double)
Метод изменяет фокусное расстояние камеры данного объекта View, создавая эффект зума.
Метод позволяет изменить фокусное расстояние камеры вида, чтобы создать эффект зума -  динамического перемещения внутрь сцены или выхода из нее.
Положение камеры и точки цели не изменяются.
zoomFactor: Входной масштабный коэффициент. Тип double. Должен быть положительным.

Teigha.GraphicsSystem.View.ZoomExtents(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод масштабирует камеру вида таким образом, чтобы заданный граничный бокс полностью вписался в пирамиду видимости (frustum) данного объекта View.
Метод масштабирует камеру вида таким образом, чтобы заданный граничный бокс полностью вписался в пирамиду видимости (frustum) данного объекта View.
Аргументы minPoint и maxPoint представляют вершины на главной диагонали граничного бокса, соответственно, с минимальными и максимальными значениями координат.
Все координаты определяются в мировой системе координат (МСК, WCS).
minPoint: Вершина граничного бокса с минимальными значениями координат (WCS).   Тип Point3d.
maxPoint: Вершина граничного бокса с максимальными значениями координат (WCS).  Тип Point3d.

Teigha.GraphicsSystem.View.ZoomWindow(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод масштабирует камеру вида таким образом, чтобы заданная область экрана оказалась полностью вписанной в пирамиду видимости (frustum) данного объекта View.
Метод масштабирует камеру вида таким образом, чтобы заданная область экрана оказалась полностью вписанной в пирамиду видимости (frustum) данного объекта View.
lowerLeft: Левый нижний угол области экрана в нормализованных координатах устройства.   Тип Point2d.
upperRight: Правый верхний угол области экрана в нормализованных координатах устройства. Тип Point2d.

Teigha.GraphicsSystem.View.BackClip
Свойство BackClip представляет удаление задней плоскости отсечения вида от точки цели камеры вдоль направления взгляда камеры.
Свойство BackClip представляет удаление задней плоскости отсечения вида от точки цели камеры вдоль направления взгляда камеры.
Расстояние измеряется в координатах МСК (WCS).
Returns: Возвращает расстояние между точкой цели камеры и задней плоскостью отсечения вида.
Тип double.

Teigha.GraphicsSystem.View.Background
Свойство Background представляет идентификатор объекта, который является производным от класса Background и определяет фон на данном виде.
Свойство Background представляет идентификатор объекта, который является производным от класса Background и определяет фон на данном виде.  Если фон не задан, возвращается значение ObjectId.kNull.
Returns: Возвращает идентификатор объекта, который определяет фон на данном виде, или ObjectId.kNull, если фон не задан.
Тип DatabaseServices.ObjectId.

Teigha.GraphicsSystem.View.Device
Свойство Device представляет устройство, с которым связан данный вид.
Свойство Device представляет устройство, с которым связан данный вид.
Returns: Возвращает устройство, с которым связан вид. Тип GraphicsSystem.Device.

Teigha.GraphicsSystem.View.EnableBackClip
Свойство EnableBackClip управляет включением задней плоскости отсечения.
Свойство EnableBackClip управляет включением задней плоскости отсечения.
Returns: Возвращает true, если задняя плоскость отсечения активна.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.EnableFrontClip
Свойство EnableFrontClip управляет включением передней плоскости отсечения.
Свойство EnableFrontClip управляет включением передней плоскости отсечения.
Returns: Возвращает true, если передняя плоскость отсечения активна.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.EnableStereo
Свойство EnableStereo управляет режимом стереографического отображения на данном виде.
Свойство EnableStereo управляет режимом стереографического отображения на данном виде.
Returns: Возвращает true, если режим стереографического отображения включен.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.ExceededBounds
Свойство ExceededBounds позволяет определить, не превысили ли свои границы какие-либо параметры данного вида
(положение камеры, цель камеры, поле зрения камеры, расстояние до передней/задней плоскости отсечения и дальность видимости)
в процессе выполнения любого из следующих методов и свойств управления видом: SetView(), FrontClip, BackClip, Dolly(), Roll(), Orbit(), Zoom() и Pan()
с момента предыдущего обращения к свойству ExceededBounds
Свойство ExceededBounds позволяет зафиксировать факт выхода за свои границы тех или иных параметров данного вида
(положение камеры, цель камеры, поле зрения камеры, расстояние до передней/задней плоскости отсечения и дальность видимости)
в процессе выполнения любого из следующих методов и свойств управления видом: SetView(), FrontClip, BackClip, Dolly(), Roll(), Orbit(), Zoom() и Pan()
с момента предыдущего обращения к свойству ExceededBounds.
Returns: Возвращает true, если выход параметров вида за свои границы имел место.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.FieldHeight
Свойство FieldHeight представляет высоту поля камеры данного вида.
Свойство FieldHeight представляет высоту поля камеры данного вида.
Notes
Это свойство не следует использовать, когда вид находится в интерактивном состоянии.
Returns: Возвращает высоту поля камеры.
Тип double.

Teigha.GraphicsSystem.View.FieldWidth
Свойство FieldWidth представляет ширину поля камеры данного вида.
Свойство FieldWidth представляет ширину поля камеры данного вида.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает ширину поля камеры. Тип double.

Teigha.GraphicsSystem.View.FrontClip
Свойство FrontClip представляет удаление плоскости отсечения от точки цели камеры в направлении к точке положения камеры.
Свойство FrontClip представляет удаление плоскости отсечения от точки цели камеры в направлении к точке положения камеры.
Returns: Возвращает расстояние от передней плоскости отсечения до точки цели камеры.
Тип double.

Teigha.GraphicsSystem.View.IsPerspective
Свойство IsPerspective позволяет определить, находится ли данный вид в режиме перспективного проецирования.
Свойство IsPerspective позволяет определить, находится ли данный вид в режиме перспективного проецирования.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает true, если данный вид находится в режиме перспективного проецирования.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.IsValid
Свойство IsValid позволяет определить, является ли действительной отображаемая на виде графика.
Свойство IsValid позволяет определить, является ли действительной отображаемая на виде графика.
Returns: Возвращает true, если изображение на виде действительно.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.IsVisible
Свойство IsVisible позволяет определить, является ли данный вид видимым или скрытым.
Свойство IsVisible позволяет определить, является ли данный вид видимым или скрытым.
Returns: Возвращает true, если вид является видимым.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.LensLength
Свойство LensLength представляет фокусное расстояние камеры вида.
Свойство LensLength представляет фокусное расстояние камеры вида.
Returns: Возвращает фокусное расстояние камеры вида.
Тип double.

Teigha.GraphicsSystem.View.LinetypeScaleMultiplier
Свойство LinetypeScaleMultiplier представляет масштабный множитель типа линий.
Свойство LinetypeScaleMultiplier представляет масштабный множитель типа линий.
Returns: Возвращает масштабный множитель.
Тип double.

Teigha.GraphicsSystem.View.LineweightToDcScale
Свойство LineweightToDcScale представляет коэффициент масштабирования при отображении толщины линий в данном объекте View.
Свойство LineweightToDcScale представляет коэффициент масштабирования при отображении толщины линий в данном объекте View.
Returns: Возвращает коэффициент масштаба толщины линий.
Тип double.

Teigha.GraphicsSystem.View.Mode
Свойство Mode представляет текущий режим рендеринга, установленный для данного вида.
Свойство Mode представляет текущий режим рендеринга, установленный для данного вида.
Returns: Возвращает режим рендеринга.
Перечисление GraphicsSystem.RenderMode.

Teigha.GraphicsSystem.View.ObjectToDeviceMatrix
Свойство ObjectToDeviceMatrix представляет геометрическое преобразование из пространства модели в пространство устройства отображения.
Свойство ObjectToDeviceMatrix представляет геометрическое преобразование из пространства модели в пространство устройства отображения.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix3d.

Teigha.GraphicsSystem.View.Position
Свойство Position представляет текущую точку положения камеры.
Свойство Position представляет текущую точку положения камеры.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает точку положения камеры.
Тип Point3d.

Teigha.GraphicsSystem.View.ProjectionMatrix
Свойство ProjectionMatrix представляет проекционную матрицу преобразования из пространства вида в нормализованное пространство устройства.
Свойство ProjectionMatrix представляет проекционную матрицу преобразования из пространства вида в нормализованное пространство устройства.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix3d.

Teigha.GraphicsSystem.View.ScreenMatrix
Свойство ScreenMatrix представляет матрицу преобразования координат из нормализованного пространства устройства в пространство экрана.
Свойство ScreenMatrix представляет матрицу преобразования координат из нормализованного пространства устройства в пространство экрана.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix3d.

Teigha.GraphicsSystem.View.StereoParameters
Свойство StereoParameters представляет текущее сочетание значений магнитуды разделения видов и параллакса.
Свойство StereoParameters представляет текущее сочетание значений магнитуды разделения видов и параллакса.
Returns: Возвращает параметры стереоскопического вида как экземпляр класса GraphicsSystem.StereoParameters.

Teigha.GraphicsSystem.View.Target
Свойство Target представляет точку цели камеры данного вида.
Свойство Target представляет точку цели камеры данного вида.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает точку цели камеры.
Тип Point3d.

Teigha.GraphicsSystem.View.UpVector
Свойство UpVector представляет текущее направление вертикали камеры данного вида.
Свойство UpVector представляет текущее направление вертикали камеры данного вида.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает направление вертикали камеры (направление вверх).
Тип Vector3d.

Teigha.GraphicsSystem.View.UserGiContext
Свойство UserGiContext представляет контекст пользовательского графического интерфейса.
Свойство UserGiContext представляет контекст пользовательского графического интерфейса.
Returns: Возвращает контекст пользовательского графического интерфейса.
Тип GraphicsInterface.Context.

Teigha.GraphicsSystem.View.ViewingMatrix
Свойство ViewingMatrix представляет  матрицу преобразования из мировой системы координат в пространство вида.
Свойство ViewingMatrix представляет  матрицу преобразования из мировой системы координат в пространство вида.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix3d.

Teigha.GraphicsSystem.View.Viewport
Свойство Viewport представляет 2D-границы видового экрана в координатах устройства.
Свойство Viewport представляет 2D-границы видового экрана в координатах устройства.
Returns: Возвращает двумерную граничную рамку.
Тип DatabaseServices.Extents2d.

Teigha.GraphicsSystem.View.ViewportBorderProperties
Свойство ViewportBorderProperties предоставляет доступ к свойствам границ видового экрана.
Свойство ViewportBorderProperties предоставляет доступ к свойствам границ видового экрана.
Returns: Возвращает свойства границ видового экрана.
Тип GraphicsSystem.ViewportBorderProperties.

Teigha.GraphicsSystem.View.ViewportBorderVisibility
Свойство ViewportBorderVisibility позволяет определить состояние видимости границ видового экрана.
Свойство ViewportBorderVisibility позволяет определить состояние видимости границ видового экрана.
Returns: Возвращает true, если границы отображаются.
В противном случае возвращает false.

Teigha.GraphicsSystem.View.ViewportClipRegion
Свойство ViewportClipRegion представляет текущую область обрезки данного вида.
Свойство ViewportClipRegion возвращает коллекцию двумерных точек, которые представляют текущую границу области обрезки данного вида.
Returns: Возвращает границу области обрезки вида.
Тип Point2dCollection[].

Teigha.GraphicsSystem.View.VisualStyle
Свойство VisualStyle представляет текущий визуальный стиль данного вида.
Свойство VisualStyle представляет текущий визуальный стиль данного вида.
Returns: Возвращает текущий визуальный стиль.
Тип GraphicsInterface.VisualStyle.

Teigha.GraphicsSystem.View.VisualStyleId
Свойство VisualStyleId представляет идентификатор объекта визуального стиля данного вида.
Свойство VisualStyleId представляет идентификатор объекта визуального стиля данного вида.
Returns: Возвращает идентификатор объекта визуального стиля.
Тип DatabaseServices.ObjectId.

Teigha.GraphicsSystem.View.WorldToDeviceMatrix
Свойство WorldToDeviceMatrix представляет преобразование координат из мирового пространства в пространство устройства (экрана).
Свойство WorldToDeviceMatrix представляет преобразование координат из мирового пространства в пространство устройства (экрана).
Является результатом конкатенации преобразований ViewingMatrix, ProjectionMatrix и ScreenMatrix.
Notes
Это свойство не следует использовать, если вид находится в интерактивном состоянии.
Returns: Возвращает матрицу преобразования координат.
Тип Matrix3d.

Teigha.GraphicsSystem.View.ClearColor
Свойство ClearColor позволяет задать режим удаления цветов на данном виде как значение из перечисления Teigha.GraphicsSystem.ClearColor.
Свойство ClearColor позволяет задать данному виду режим удаления цветов как значение из перечисления Teigha.GraphicsSystem.ClearColor.
Returns: Возвращает режим удаления цветов на виде.
Тип Teigha.GraphicsSystem.ClearColor.

Teigha.GraphicsSystem.View.ClientViewInfo
Свойство ClientViewInfo представляет экземпляр структуры Teigha.GraphicsSystem.ClientViewInfo, связанный с данным объектом View.
Свойство ClientViewInfo представляет идентификатор видового экрана, идентификатор окна nanoCAD, идентификатор объекта видового экрана и объект контекстных цветов для видового экрана в виде экземпляра структуры Teigha.GraphicsSystem.ClientViewInfo.
Returns: Возвращает экземпляр структуры Teigha.GraphicsSystem.ClientViewInfo для данного объекта View.