Teigha.DatabaseServices.DimAssoc.IsAllGeomErased
Метод позволяет проверить, удалена ли вся геометрия в опорных точках данного объекта.
Метод позволяет проверить, удалена ли вся геометрия в опорных точках данного объекта.
Returns: Возвращает true, если вся геометрия в опорных точках удалена.
В противном случае возвращает false.