Teigha.DatabaseServices.AttributeCollection
Коллекция, которая служит контейнером для атрибутов вхождения блока.
Класс представляет коллекцию, которая служит контейнером для атрибутов вхождения блока.
Example
В примере приведена команда, которая создает в пространстве
модели блок с атрибутами и выводит содержимое коллекции
атрибутов блока в командную строку nanoCAD.
C#:

Teigha.DatabaseServices.AttributeCollection.AppendAttribute(Teigha.DatabaseServices.AttributeReference)
Метод добавляет к вхождению блока новый атрибут.
Метод добавляет к вхождению блока новый атрибут attributeToAddToBlockReference.
attributeToAddToBlockReference: Атрибут, который следует добавить. Тип AttributeReference.
Returns: Возвращает ObjectId вхождения блока с новым атрибутом.

Teigha.DatabaseServices.AttributeCollection.CopyTo(array,System.Int32)
Копирует объекты коллекции в массив.
Копирует объекты коллекции в массив.
array: Массив, в который предстоит копировать объекты коллекции.
index: Индекс массива, с которого начинается добавление объектов.

Teigha.DatabaseServices.AttributeCollection.Count
Свойство предоставляет доступ к количеству элементов в коллекции.
Свойство Count предоставляет доступ к количеству элементов в коллекции.

Teigha.DatabaseServices.AttributeCollection.Item
Свойство реализует быстрый поиск элемента коллекции по его индексу.
Предоставляет доступ к элементу коллекции по его индексу.
index: Индекс искомого элемента массива, тип int.
Returns: Возвращает ObjectId элемента коллекции с индексом, равным параметру index.