HostMgd.ApplicationServices.LongTransactionManager.Aborted
Событие Aborted возникает после прерывания длительной транзакции.
В текущей версии не реализовано.
Событие Aborted возникает после прерывания длительной транзакции.
В текущей версии не реализовано.