HostMgd.ApplicationServices.DocumentWindowIterator.Current
Указатель на текущее окно документа.
При нахождении указателя внутри коллекции свойство возвращает HostMgd::Windows::Window^
При выходе указателя за пределы коллекции свойство возвращает nullptr