Teigha.DatabaseServices.MergeCellStyleOption.CopyDuplicates
Значение: 1.
В случае конфликтов в именах стилей ячеек конфликтующие стили ячеек копируются из исходной таблицы в целевую как новые стили ячеек.