Teigha.DatabaseServices.HatchPatternType.CustomDefined
Значение: 2. Пользовательские образцы штриховки.
Пользовательские файлы с расширением *.pat размещаются в той же папке, в которой находятся образцы штриховки из комплекта поставки: C:\\ProgramData\\Nanosoft\\nanoCAD X.X\\SHX.