Teigha.DatabaseServices.Entity
Это базовый класс для всех объектов базы данных, имеющих
графическое представление.
Это базовый класс для всех объектов базы данных, имеющих
графическое представление.

Teigha.DatabaseServices.Entity.AddSubentityPaths(array)
Метод предназначен для добавления подобъектов к
геометрическому объекту.
Добавляет один или несколько геометрических подобъектов к
геометрическому объекту.
subPaths: Массив, идентифицирующий

Teigha.DatabaseServices.Entity.BoundingBoxIntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Plane,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод предназначен для расчета проекции края ограничивающего бокса
исходного объекта чертежа и объекта, пересечения с которым необходимо
найти, на указанную плоскость проекции. После вычисления проекции метод
определяет ограничивающий бокс для объекта, находит точки пересечения
и проецирует их обратно на край ограничивающего прямоугольника исходного
объекта.
Метод расчитывает проекцию края ограничивающего бокса
исходного объекта чертежа и объекта, пересечения с которым
необходимо найти, на указанную плоскость проекции, вычисляет
ограничивающий бокс для этого объекта, а затем находит точки
пересечения и проецирует пересечения обратно на край
ограничивающего прямоугольника исходного объекта.
entityPointer: Указатель на объект, с которым
intersectType: Вид пересечения. Тип Intersect
projectionPlane: Плоскость проекции. Тип Plane
points: Выходная коллекция координат точек
thisGraphicSystemMarker: GS маркер подобъекта исходного
otherGraphicSystemMarker: GS маркер подобъекта объекта

Teigha.DatabaseServices.Entity.BoundingBoxIntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Plane,Teigha.Geometry.Point3dCollection,System.Int32,System.Int32)
Метод предназначен для проецирования ребер ограничивающего параллелепипеда
данного геометрического объекта и другого геометрического объекта на
указанную плоскость проекции, поиска точек пересечений и последующего
проецирования этих точек обратно на ребра ограничивающего параллелепипеда
данного объекта. Все найденные точки добавляются в выходной массив и
представляют собой точки ребер ограничивающего параллелепипеда данного
геометрического объекта.
Этот метод проецирует ребра ограничивающего параллелепипеда
данного геометрического объекта и геометрического объекта на
плоскость projectionPlane, находит точки пересечений и затем
проецирует точки пересечения назад на соответствующие ребра
ограничивающего параллелепипеда данного объекта. Таким
образом, все точки, добавляемые к массиву points, являются
точками ребер ограничивающего параллелепипеда геометрического
объекта.
Проецирование осуществляется параллельно вектору нормали к
плоскости projectionPlane.
Параметр intersectType используется для определения того, как
поступать с пересечением продолжения ребер ограничивающего
параллелепипеда данного объекта и геометрического объекта,
заданного entityPointer, при расчете пересечений. Возможные
значения intersectType:
Intersect.OnBothOperands   Не продолжать ни ребра ограничивающего
параллелепипеда геометрического объекта, ни
геометрического объекта, заданного
entityPointer. В этом случае результат
вычисляется только по точкам реального
пересечения линий границ объекта с
геометрическим объектом, заданным
entityPointer
Intersect.ExtendThis       Продлевать ребра линий ограничивающего
параллелепипеда (если необходимо) при
расчете пересечений, но не продлевать
геометрический объект, заданный
entityPointer
Intersect.ExtendArg        Продлевать геометрический объект, заданный
entityPointer (если необходимо) при расчете
пересечений, но не продлевать ребра
ограничивающего параллелепипеда данного
геометрического объекта
Intersect.ExtendBoth       Продлевать и ребра ограничивающего
параллелепипеда данного геометрического
объекта, и геометрический объект, заданный
entityPointer (если необходимо) при расчете
пересечений
entityPointer: Геометрический объект, с которым
intersectType: Тип пересечения. Тип Intersect
projectionPlane: Плоскость проекции, на которой
points: Выходной массив точек пересечения
thisGraphicSystemMarker: GS маркер геометрических
otherGraphicSystemMarker: GS маркер геометрических

Teigha.DatabaseServices.Entity.BoundingBoxIntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод предназначен для расчета ограничивающего параллелепипеда данного
геометрического объекта в мировой системе координат (WCS) и поиска
всех пересечений указанного геометрического объекта (entityPointer) с
ребрами этого параллелепипеда. Найденные точки пересечений добавляются
в выходной массив и задаются в координатах WCS.
Этот метод сначала рассчитывает ограничивающий параллелепипед для
данного геометрического объекта (в WCS координатах — мировой
системе координат). Затем он ищет все пересечения объекта,
заданного entityPointer, со всеми ребрами ограничивающего
параллелепипеда данного геометрического объекта.
Параметр intersectType используется для определения того, как
поступать с пересечением продолжения ребер ограничивающего
параллелепипеда данного объекта и геометрического объекта,
заданного entityPointer, при расчете пересечений.
Возможные значения intersectType:
Intersect.OnBothOperands   Не продолжать ни ребра ограничивающего
параллелепипеда геометрического объекта,
ни геометрического объекта, заданного
entityPointer. В этом случае результат
вычисляется только по точкам реального
пересечения ограничивающего
параллелепипеда объекта с
геометрическим объектом, заданным
entityPointer
Intersect.ExtendThis       Продлевать ребра ограничивающего
параллелепипеда (если необходимо) при
расчете пересечений,
но не продлевать геометрический объект,
заданный entityPointer
Intersect.ExtendArg        Продлевать геометрический объект, заданный
entityPointer (если необходимо) при расчете
пересечений, но не продлевать ребра
ограничивающего параллелепипеда данного
геометрического объекта
Intersect.ExtendBoth       Продлевать и ребра ограничивающего
параллелепипеда данного геометрического
объекта, и геометрический объект, заданный
entityPointer (если необходимо) при расчете
пересечений
Все найденные точки пересечений добавляются в массив точек.
Все точки задаются в мировых координатах (WCS).
Note
В процессе определений пересечений геометрического объекта
entityPointer с ребрами ограничивающего параллелепипеда
данного объекта, может быть вызвана не созданная версия
метода intersectWith() объекта entityPointer
(если геометрический объект entityPointer является
пользовательским объектом, то метод
intersectWith() будет вызван явно). Если метод
intersectWith() не разработан для объектов геометрического
класса entityPointer, то при вызове этого метода возникнет
ошибка функции.
Агрументы thisGraphicSystemMarker и otherGraphicSystemMarker
используются только, если вызывается метод intersectWith() класса
entityPointer и эти параметры просто передаются в этот метод,
хотя и там они могут не использоваться.
entityPointer: Геометрический объект, с которым
intersectType: Тип пересечения. Тип Intersect
points: Выходной массив точек пересечения
thisGraphicSystemMarker: GS маркер геометрических
otherGraphicSystemMarker: GS маркер геометрических

Teigha.DatabaseServices.Entity.BoundingBoxIntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Point3dCollection,System.Int32,System.Int32)
Метод предназначен для расчета ограничивающего параллелепипеда данного геометрического
объекта в мировой системе координат (WCS) и определения всех пересечений указанного
геометрического объекта (entityPointer) с ребрами этого параллелепипеда.
Найденные точки пересечений добавляются в выходной массив и задаются в координатах WCS.
Этот метод сначала рассчитывает ограничивающий параллелепипед для
данного геометрического объекта (в WCS координатах — мировой
системе координат). Затем он ищет все пересечения объекта,
заданного entityPointer, со всеми ребрами ограничивающего
параллелепипеда данного геометрического объекта.
Параметр intersectType используется для определения того, как
поступать с пересечением продолжения ребер ограничивающего
параллелепипеда данного объекта и геометрического объекта,
заданного entityPointer, при расчете пересечений.
Возможные значения intersectType:
Intersect.OnBothOperands   Не продолжать ни ребра ограничивающего
параллелепипеда геометрического объекта,
ни геометрического объекта, заданного
entityPointer. В этом случае результат
вычисляется только по точкам реального
пересечения ограничивающего
параллелепипеда объекта с
геометрическим объектом, заданным
entityPointer
Intersect.ExtendThis       Продлевать ребра ограничивающего
параллелепипеда (если необходимо) при
расчете пересечений,
но не продлевать геометрический объект,
заданный entityPointer
Intersect.ExtendArg        Продлевать геометрический объект, заданный
entityPointer (если необходимо) при расчете
пересечений, но не продлевать ребра
ограничивающего параллелепипеда данного
геометрического объекта
Intersect.ExtendBoth       Продлевать и ребра ограничивающего
параллелепипеда данного геометрического
объекта, и геометрический объект, заданный
entityPointer (если необходимо) при расчете
пересечений
Все найденные точки пересечений добавляются в массив точек.
Все точки задаются в мировых координатах (WCS).
Note
В процессе определений пересечений геометрического объекта
entityPointer с ребрами ограничивающего параллелепипеда
данного объекта, может быть вызвана не созданная версия
метода intersectWith() объекта entityPointer
(если геометрический объект entityPointer является
пользовательским объектом, то метод
intersectWith() будет вызван явно). Если метод
intersectWith() не разработан для объектов геометрического
класса entityPointer, то при вызове этого метода возникнет
ошибка функции.
Агрументы thisGraphicSystemMarker и otherGraphicSystemMarker
используются только, если вызывается метод intersectWith() класса
entityPointer и эти параметры просто передаются в этот метод,
хотя и там они могут не использоваться.
entityPointer: Геометрический объект, с которым
intersectType: Тип пересечения. Тип Intersection
points: Выходной массив точек пересечения
thisGraphicSystemMarker: GS маркер геометрических
otherGraphicSystemMarker: GS маркер геометрических

Teigha.DatabaseServices.Entity.DeleteSubentityPaths(array)
Метод предназначен для удаления одного или нескольких подобъектов из геометрического объекта.
Метод удаляет один или несколько подобъектов из геометрического
объекта.
Пользовательские объекты, которые представляют поведение
геометрических подобъектов, могут переопределить этот метод
для поддержки очистки геометрического подобъекта из главного
объекта.
subPaths: Массив, определяющий удаляемые

Teigha.DatabaseServices.Entity.Explode(Teigha.DatabaseServices.DBObjectCollection)
Метод предназначен для получения коллекции указателей на нерезидентные
геометрические объекты, представляющие части исходного объекта при его
разбиении, с возможностью добавления новых элементов в существующую
коллекцию без изменения базы данных.
Этот метод может использоваться в приложениях
для получения коллекции указателей на не
резидентные в базе данных геометрические объекты, которые
представляют части геометрического объекта при его разбиении.
При вызове метода, коллекция entitySet не обязана быть
пустой. Метод добавит элементы в коллекцию, и указатели на
объекты, которые метод добавляет, могут быть использованы на
своих местах как результаты "разбиения".
Разработка метода в производных классах
Этот метод должен динамически создавать (используя оператор
new) те примитивы, которые подходят для графической замены
исходного геометрического объекта
после выполнения операции разбиения. Указатели на эти
геометрические объекты добавляются в коллекцию entitySet.
Note
Данная функция не должна добавлять новые геометрические
объекты в базу данных и не должна очищать геометрические объекты из
базы.
Пользовательские геометрические объекты
При использовании пользовательских геометрических объектов,
вы должны определить метод разбиения для того, чтобы команды
nanoCAD BHATCH и EXPLODE могли работать. Ваш метод разбиения
должен разбить ваш геометрический объект на менее сложные
геометрические объекты.
entitySet: Коллекция указателей на новые геометрические

Teigha.DatabaseServices.Entity.ExplodeGeometry(Teigha.DatabaseServices.DBObjectCollection)
Метод предназначен для разбиения данного объекта на набор более простых геометрических объектов.
Метод разбивает данный объект на набор более простых объектов.
Объекты, полученные в результате разбиения, добавляются в коллекцию entitySet.
Вновь созданные сущности не являются резидентами базы данных.
Стандартная реализация этой функции вызывает subWorldDraw() и создает
сущности из геометрии, сгенерированной subWorldDraw().
Этот метод может быть переопределен в пользовательских классах.
entitySet: Параметр для записи новых объектов, получившихся после разбиения данного.

Teigha.DatabaseServices.Entity.ExplodeGeometryToBlock(Teigha.DatabaseServices.BlockTableRecord)
Метод разбивает этот объект на набор более простых объектов и добавляет их в указанный блок.
Метод разбивает объект на подобъекты и добавляет их в указанных блок.
Созданные объекты являются или не являются резидентами базы данных,
в зависимости от владельца BlockTableRecord.
Если BlockTableRecord является резидентом базы данных, то созданные объекты также будут резидентами базы данных.
Если BlockTableRecord не является резидентом базы данных, то созданные объекты также не будут резидентами базы данных.
Стандартная реализация этой функции вызывает subWorldDraw() и создает
сущности из геометрии, сгенерированной subWorldDraw().
Этот метод может быть переопределен в пользовательских классах.
btr: Блок, в который будет добавлен набор объектов, полученных в результате разбиения данного. Тип BlockTableRecord

Teigha.DatabaseServices.Entity.ExplodeGeometryToBlock(Teigha.DatabaseServices.BlockTableRecord,Teigha.DatabaseServices.ObjectIdCollection)
Метод разбивает этот объект на набор более простых объектов, добавляет их в указанный
блок и записывает идентификаторы созданных объектов в коллекцию objIdCollection.
Метод раздивает этот объект на более простые объекты, добавляет их в указанный блок и записывает в коллекцию
идентификаторы созданных объектов.
Cозданные объекты могут являться или не являться резидентами базы данных в зависимости от владельца блока (BlockTableRecord).
Если BlockTableRecord является резидентом базы данных, то созданные объекты также будут резидентами базы данных.
Если BlockTableRecord не является резидентом базы данных, то созданные объекты также не будут резидентами базы данных.
Идентификаторы объектов, которые получились в результате разбиения, добавляются в указанную коллекцию.
Стандартная реализация этой функции вызывает subWorldDraw() и создает
сущности из геометрии, сгенерированной subWorldDraw().
Этот метод может быть переопределен в пользовательских классах.
btr: Блок, в который будет добавлен набор объектов, полученных в результате разбиения данного. Тип BlockTableRecord
objIdCollection: Коллекция, в которую записываются идентификаторы созданных объектов.

Teigha.DatabaseServices.Entity.GetGraphicsMarkersAtSubentityPathIntPtr(Teigha.DatabaseServices.FullSubentityPath)
Метод предназначен для возврата всех маркеров графической системы (GS-маркеров)
по путям подобъектов для сложных сущностей, которые поддерживают связывание
целочисленного идентификатора с каждым графическим примитивом или группами
примитивов во время отрисовки.
Объекты чертежа используют механизм маркеров графической системы для отрисовки самих себя,
при этом каждый графический примитив или группа примитивов связываются с уникальным
целочисленным идентификатором, называемым GS-маркером.
С помощью специальных механизмов выбора GS-маркер выбранного на экране подобъекта
может быть получен и использован для различных целей, таких как выделение/снятие
выделения, скрытие/отображение подобъекта и других операций.
Геометрические объекты используют различные геометрические
примитивы при своем графическом отображении. Частью этого
механизма является способность установки соответствия целого
идентификатора, называемого графически системным маркером
(или GS маркером) с каждым примитивом или группой примитивов.
Посредством использования определенных механизмов отбора, GS
маркер для реального геометрического подобъекта, выбранного
на экране, может быть получен и, вместе с некоторой другой
информацией, передан в данный метод, и использоваться этим и
некоторыми другими методами для различных целей, таких как
подсветка и отмена подсветки геометрических подобъектов на
экране.
Использование метода
Этот метод использует свойство SubentId с объектом subPath
для определения, какой GS маркер является подходящим для
геометрического объекта. Любой соответствующий GS маркер
добавляется к возвращаемой коллекции.
Id объекта subPath не используется, и нет необходимости
заполнять этот Id.
Необходимо, чтобы в объекте SubentId внутри subPath были
заполнены требуемый SubentityType и корректное значение
индекса (которое может быть или не быть в действительности
значением GS маркера).
Обычно, этот метод вызывается с объектом FullSubentityPath,
который заполняется методом
Entity.GetSubentityPathsAtGraphicsMarker().
Разработка метода в производных классах
Этот метод должен быть в состоянии правильно интерпретировать
значения SubentityType и индекса в свойстве SubentId в
subPath, для того чтобы определить GS маркеры для
соответствующего геометрического подобъекта (или
подобъектов). Таким образом, GS маркеры определяются и затем
добавляются к возвращаемой коллекции.
Значение индекса объекта SubentId может иметь те значения,
которые вы захотите (часто это просто GS маркеры), но, если
он реализован, метод GetSubentityPathsAtGraphicsMarker()
должен быть в состоянии вычислить их, базируясь на
предоставленном GS маркере и, если он реализован, метод
GetSubentity() должен быть в состоянии интерпретировать их
для определения соответствующего геометрического подобъекта
(или подобъектов).
Возвращает коллекцию указателя(-ей) на GS маркера(-ов) для
геометрического подобъекта (подобъектов).
Note
Методы Entity.Highlight() и Entity.Unhighlight() оба вызывают
данный метод для получения GS маркеров, связанных с
FullSubentityPath. Если данный метод не переопределен, то и
указанные методы не работают.
subPath: Объект, который содержит свойство

Teigha.DatabaseServices.Entity.GetGripPoints(Teigha.DatabaseServices.GripDataCollection,System.Double,System.Int32,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.GetGripPointsFlags)
Метод предназначен для добавления координат ручек (точек управления) геометрического объекта в
существующий массив gripPoints.
Метод добавляет точки управления (ручки) для геометрического объекта с учётом текущего вида и параметров отображения.
Используется при работе с интерактивным редактированием объектов через пользовательский интерфейс.
grips: Заранее существующий массив, куда добавляются
curViewUnitSize: Размер единичного пикселя в мировых координатах для текущего представления.
gripSize: Размер ручки в пикселях, используемый для определения области, в которой
curViewDir: Направление взгляда камеры (вектор направления текущего вида).
bitFlags: Флаги, задающие дополнительные параметры извлечения точек управления. Тип GetGripPointsFlags
Returns: Возвращает тип данных bool: true, если ручки были успешно добавлены, и false — в случае ошибки или отсутствия доступных ручек.

Teigha.DatabaseServices.Entity.GetGripPoints(Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection,Teigha.Geometry.IntegerCollection)
Метод GetGripPoints реализует поддержку "старого стиля" работы с ручками (точками управления)
и предназначен для добавления координат ручек текущего геометрического объекта
в уже существующий массив gripPoints.
Использование метода
Этот метод поддерживает "старый стиль" ручек, в приложениях,
созданных до улучшения функциональности работы с ручками.
Разработка метода в производных классах
Этот метод должен добавить к массиву gripPoints те точки,
которые рассматриваются как координаты ручек для
геометрического объекта.
Массив gripPoints должен быть передан для всех
геометрических объектов, включенных в операцию с ручками, так
что массив может уже содержать координаты ручек для других
геометрических объектов. Поэтому, является очень важным
добавление новых точек в массив вместо назначения им уже
существующих элементов массива.
Параметры snapModes и geometryIds в настоящее время не
используются.
gripPoints: Заранее существующий массив, куда добавляются
snapModes: Не используется
geometryIds: Не используется
Returns: Возвращает тип данных bool: true, если ручки были успешно добавлены, и false — в случае ошибки или отсутствия доступных ручек.

Teigha.DatabaseServices.Entity.GetGripPointsAtSubentityPath(Teigha.DatabaseServices.FullSubentityPath,Teigha.DatabaseServices.GripDataCollection,System.Double,System.Int32,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.GetGripPointsFlags)
Метод предназначен для создания или получения точек захвата (ручек) дочернего объекта текущего геометрического объекта.
Метод предоставляет информацию о точках управления (захваты/ручки) конкретного дочернего элемента (субобъекта) геометрического объекта, учитывая параметры отображения и настройки взаимодействия с пользователем.
subPath: Полный путь к дочернему объекту, для которого необходимо получить точки захвата. Тип FullSubentityPath
grips: Входной/выходной параметр. Коллекция, в которую добавляются точки захвата (ручки) указанного дочернего объекта. Коллекция может быть не пустой, поэтому новые ручки необходимо добавлять в конец коллекции. Тип GripDataCollection
curViewUnitSize: Размер одного единичного элемента чертежа в мировых координатах для текущего окна просмотра. Используется для корректного масштабирования ручек. Тип double
gripSize: Размер точки захвата в пикселях, используемый для определения области клика пользователя. Тип int
curViewDir: Направление обзора (вектор камеры), необходимое для правильной ориентации ручек относительно текущего вида. Тип Vector3d
bitFlags: Битовые флаги, задающие дополнительные параметры извлечения точек захвата. Тип GetGripPointsFlags
Returns: Возвращает тип данных bool:
true, если метод успешно выполнен, и false, если реализация отсутствует или произошла ошибка.

Teigha.DatabaseServices.Entity.GetObjectSnapPoints(Teigha.DatabaseServices.ObjectSnapModes,System.Int32,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection)
Метод вычисляет точки объектной привязки (например, конечные, средние, центральные и другие характерные точки)
геометрического объекта в соответствии с заданным режимом привязки и параметрами текущего вида.
Полученные точки добавляются в существующий массив snapPoints, чтобы обеспечить корректное
взаимодействие с пользователем при черчении или редактировании объектов.
Этот метод использует сведения из параметров snapMode,
gsSelectionMark, pickPoint, lastPoint и viewTransform для
определения точек объектной привязки геометрического объекта.
Метод должен затем добавить эти точки к массиву snapPoints.
Массив snapPoints передается для всех геометрических
объектов, вовлеченных в операцию объектной привязки, поэтому
возможно, что массив уже содержит данные о геометрических
объектах. По этой причине, очень важно, чтобы точки
добавлялись в массив, а не связывались с у же существующими в
массиве элементами.
Параметр snapMode указывает, какой режим объектной привязки
используется в операции. Не все режимы применимы ко всем
типам геометрических объектов (например, режим
ObjectSnapModes.ModeIns не применим к линиям). Возможные
значения этого параметра:
ObjectSnapModes.ModeEnd             Нахождение конечной точки
геометрического объекта,
ближайшей к точке указания
ObjectSnapModes.ModeM               Нахождение средней точки (любой
линии, дуги или иного
подобъекта) геометрического
объекта, ближайшей к точке
указания
ObjectSnapModes.ModeCenter          Нахождение средней точки (любой
окружности или дуги)
геометрического объекта,
ближайшей к точке указания
ObjectSnapModes.ModeNode            Нахождение точки узла
(характерной точки объекта,
например, точки указания
размера), ближайшей к точке
указания
ObjectSnapModes.ModeQuad            Нахождение точки квадранта
(традиционно, одна из четырех
точек лежащих на пересечении
окружности или дуги с
горизонталью или вертикалью,
проходящей через центр),
ближайшей к точке указания
ObjectSnapModes.ModeIns             Нахождение точки пересечения
геометрического объекта и
прямой, перпендикулярной
геометрическому объекту и
проходящей через lastPoint
ObjectSnapModes.ModePerpindicular   Нахождение точки пересечения
геометрического объекта и
прямой, перпендикулярной
геометрическому объекту и
проходящей через lastPoint
ObjectSnapModes.ModeTangent         Нахождение точки пересечения
геометрического объекта и
касательной к нему, проведенной
из точки lastPoint
ObjectSnapModes.ModeNear            Нахождение точки
геометрического объекта,
ближайшей к точке указания. Вы
решаете, что значит "ближайшая"
точка
Аргумент gsSelectionMark содержит GS маркер геометрического
подобъекта, который вовлечен в операцию объектной привязки.
Если у геометрического объекта не установлен никакой GS
маркер, то должно быть задано значение GS маркера по
умолчанию, равное 0. GS маркер позволяет при желании
обеспечить сужение поиска точек объектной привязки.
Параметр pickPoint предоставляет точку (в мировых WCS
координатах), с которой начинается операция объектной
привязки.
Параметр lastPoint предоставляет точку, выбранную как
предшествующую точке pickPoint. Эта точка используется при
определении значений для объектной привязки по перпендикуляру
или касательной.
Параметр viewTransform предоставляет матрицу преобразования
из мировой системы координат (WCS) в отображаемую систему
координат (DCS).
Отображаемая система координат ориентирована так, что
положительное направление оси Z направлено из монитора по
направлению к пользователю, положительное направление оси X
направлено по горизонтали слева направо в экране, и
положительное направление оси Y направлено вертикально вверх
экрана.
Так, если текущий видовой экран в точке (1,0,0) (просмотр
всегда от точки (0,0,0)), то матрица преобразования
viewTransform должна быть
0 1 0 0
0 0 1 0
1 0 0 0
0 0 0 1
В этой матрице последняя строка и последний столбец не
используются. Заметим также, что третья строка задает ось Z
DCS в WCS координатах (который представляет WCS версию
системной переменной nanoCAD VIEWPOINT).
Эта матрица трансформации позволяет вам определить позицию
различных точек в текущем просмотре. Она наиболее полезна в
режиме ObjectSnapModes.ModeNear, где "ближайшая" (точка)
может зависеть от видового экрана.
Параметр snapPoints представляет массив, куда добавляются
результирующие точки объектной привязки. Вы можете добавить 0
или некоторое количество точек в массив.
Один и тот же массив передается во все геометрические
объекты, участвующие в операции. Когда все объекты будут
обойдены, nanoCAD определяет, какая точка массива наиболее
соответствует желаемому режиму объектной привязки. Поэтому,
этот метод не нуждается до сужения поиска до одной точки.
snapMode: Требуемый режим объектной привязки. Тип ObjectSnapModes
gsSelectionMark: GS маркер геометрического подобъекта,
pickPoint: Точка указания (в WCS координатах) во время
lastPoint: Точка (в WCS координатах), выбранная перед
viewTransform: Матрица преобразования из WCS в DCS. Тип Matrix3d
snapPoints: Заранее созданный массив для добавления
geometryIds: Не используется

Teigha.DatabaseServices.Entity.GetObjectSnapPoints(Teigha.DatabaseServices.ObjectSnapModes,System.Int32,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection,Teigha.Geometry.Matrix3d)
Метод вычисляет точки объектной привязки для геометрического объекта с учетом заданного режима привязки
и матрицы преобразования блока insertionMat, которая определяет положение объекта внутри блока.
Все найденные точки добавляются в существующий массив snapPoints для последующего выбора наиболее
подходящей точки привязки.
Этот метод ведет себя точно так же, как его вариант без
параметра insertionMat. Геометрические объекты, содержащиеся
в блоке, получают данные о преобразовании блока в параметре
insertionMat.
snapMode: Требуемый режим объектной привязки. Тип ObjectSnapModes
gsSelectionMark: GS маркер геометрического подобъекта,
pickPoint: Точка указания (в WCS координатах) во время
lastPoint: Точка (в WCS координатах), выбранная перед
viewTransform: Матрица преобразования из WCS в DCS. Тип Matrix3d
snapPoints: Заранее созданный массив для добавления
geometryIds: Не используется
insertionMat: Матрица преобразования блока. Тип Matrix3d

Teigha.DatabaseServices.Entity.GetStretchPoints(Teigha.Geometry.Point3dCollection)
Метод предназначен для добавления в указанный массив stretchPoints координат точек растягивания геометрического объекта,
используемых при выполнении команды растяжения в nanoCAD.
Метод учитывает, что массив может содержать точки других объектов,
поэтому новые точки должны добавляться, а не заменять существующие.
Использование метода
Разработка метода в производных классах
Этот метод должен добавить к массиву stretchPoints любые
точки, которые определены как точки растягивания для
геометрического объекта.
Точки растягивания используются командой растягивания
nanoCAD. Любые точки растягивания, которые находятся в
пределах выбранного пересечения с окном, будут передвинуты на
ту величину, на которую пользователь решил "растянуть"
выбранные геометрические объекты. Любые точки растягивания,
которые не попадают в выбранное пересечение с окном,
останутся, как они есть. Эта комбинация из нескольких
двигающихся точек растягивания, пока остальные остаются на
месте и есть то, что "растягивает" геометрический объект.
Если все точки растягивания находятся внутри (с учетом
пересечений) окна, то геометрический объект передвигается
вместо того, чтобы быть растянутым.
Массив stretchPoints последовательно передается во все
геометрические объекты, участвующие в операции растягивания,
и массив уже может содержать точки растягивания от других
объектов. Поэтом очень важным является, чтобы новые точки
добавлялись, а не связывались с уже существующими в массиве
элементами.
Выполнение по умолчанию
Вызывается метод Entity.GetGripPoints(). Поэтому, до тех пока
геометрическому объекту не требуются точки растягивания,
отличные от точек переноса, переопределять метод не нужно.
stretchPoints: Заранее созданный массив для добавления точек

Teigha.DatabaseServices.Entity.GetSubentity(Teigha.DatabaseServices.FullSubentityPath)
Метод предназначен для получения геометрического подобъекта по указанному пути FullSubentityPath.
Метод предоставляет доступ к геометрическому подобъекту по указанному пути FullSubentityPath.
Используется для получения конкретной части сложного объекта, например, ребра в полиголинии или поверхности в 3D-модели.
id: Путь к геометрическому подобъекту. Тип FullSubentityPath
Returns: Метод возвращает геометрический подобъект. Тип Entity

Teigha.DatabaseServices.Entity.GetSubentityGeometricExtents(Teigha.DatabaseServices.FullSubentityPath)
Метод предназначен для получения трёхмерных пределов (границ) указанного геометрического подобъекта в виде параллелепипеда, ориентированного по осям WCS.
Метод предоставляет информацию о геометрических пределах для геометрического
подобъекта. Используется для определения области пространства, занимаемой подобъектом.
На уровне класса Entity этот объект не применяется и
предназначен для переопределения в производных классах.
Производные классы должны вычислять и возвращать угловые
точки (в WCS координатах) параллелепипеда границ (с ребрами,
параллельными WCS осям X, Y и Z), который включает 3D
пространство геометрического объекта и возвращает эти точки
как экземпляр класса Extents в параметре " extents".
subPath: Путь к геометрическому подобъекту. Тип Extents3d
Returns: Метод возвращает трёхмерные пределы (границы) указанного геометрического подобъекта в виде параллелепипеда, ориентированного по осям WCS. Тип Extents3d
Notes
В базовом классе Entity метод не реализован и должен быть переопределён в производных классах для корректного вычисления границ.

Teigha.DatabaseServices.Entity.GetSubentityPathsAtGraphicsMarker(Teigha.DatabaseServices.SubentityType,IntPtr,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,array)
Метод предназначен для получения путей к геометрическим подобъектам по связанному с ними графическому маркеру (GS-маркеру),
что позволяет определить, какой именно элемент сложного объекта был выбран пользователем.
Он учитывает тип подобъекта, точку выбора, преобразование вида и стек вложенных объектов.
Метод предоставляет доступ к массиву путей к геометрическим подобъектам (FullSubentityPath), связанным с указанным графическим маркером (gsMark).
Используется для сложных объектов, которые во время отрисовки могут ассоциировать целочисленные идентификаторы (GS-маркеры)
с отдельными графическими примитивами или их группами.
Метод учитывает тип подобъекта, точку выбора в мировых координатах (pickPoint), матрицу преобразования из WCS в DCS (viewTransform),
а также стек вложенных контейнеров (entityAndInsertStack), позволяя точно определить, какой именно подобъект был выбран пользователем.
type: Тип запрашиваемого подобъекта (например, ребро, грань и т.д.). Тип SubentityType
gsMark: Графический маркер (GS-маркер) — целочисленный идентификатор,
pickPoint: Точка выбора в мировых координатах (WCS), указывающая место, где пользователь выбрал
viewTransform: Матрица преобразования из системы координат мира (WCS) в систему координат устройства (DCS),
numInserts: Количество идентификаторов объектов в массиве entityAndInsertStack, относящихся к вставкам блоков.
entityAndInsertStack: Массив идентификаторов объектов, представляющих вложенные контейнеры подобъекта
Returns: Метод возвращает массив объектов типа FullSubentityPath, представляющих полные пути к подобъектам,
связанным с указанным графическим маркером (gsMark). Каждый путь однозначно идентифицирует подобъект
внутри сложной структуры геометрического объекта, учитывая вложенные контейнеры и иерархию блоков.
Если подходящих подобъектов не найдено, возвращается пустой массив.

Teigha.DatabaseServices.Entity.GetSubentityPathsAtGraphicsMarker(Teigha.DatabaseServices.SubentityType,System.Int32,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,System.Int32,array)
Метод предназначен для получения массива путей к геометрическим подобъектам (FullSubentityPath) на основе графического маркера (GS-маркера)
и дополнительных параметров выбора, таких как тип подобъекта, точка выбора и матрица преобразования. Он используется для определения конкретного
подобъекта сложного геометрического объекта, выбранного пользователем на экране, с учетом вложенных блоков и контекста отображения.
Этот метод особенно важен при работе с интерактивным редактированием, подсветкой или выбором отдельных элементов составных объектов.
Геометрические объекты используют различные геометрические
примитивы при своем графическом отображении. Частью этого
механизма является способность установки соответствия целого
идентификатора, называемого графически системным маркером
(или GS маркером) с каждым примитивом или группой примитивов.
Посредством использования определенных механизмов отбора,
может быть получен GS маркер для реального геометрического
подобъекта, выбранного на экране, и, вместе с некоторой другой
информацией, передан в данный метод, и может быть использован
для создания одного или нескольких объектов
FullSubentityPath, каждый из которых представляет
геометрический подобъект и обеспечивает более полное описание
геометрического подобъекта и его окружения. Такие объекты
FullSubentityPath могут использоваться этим и некоторыми
другими методами для различных целей, таких как подсветка и
отмена подсветки геометрических подобъектов на экране.
Использование метода
Если собственником геометрического объекта (частью которого
является геометрический подобъект) является прямо
пространство модели или пространство листа BlockTableRecord,
то numInserts и entityAndInsertStack не учитываются и
используются их значения по умолчанию.
viewTransform может быть вычислен с использованием функции
ads_trans() на векторах (1,0,0), (0,1,0) и (0,0,1) для
преобразования их из DCS в WCS. Эти три вектора преобразования
(с дополнительным 0, добавленным в конец каждого из них),
могут быть использованы как первые три строки матрицы.
Последняя строка не используется, и остается, как она
есть. Этот параметр не используется для любых встроенных в
nanoCAD геометрических объектов.
Если геометрический блок вложен в одно из определений блока,
то параметры numInserts и entityAndInsertStack должны быть
заполнены не нулевыми значениями и не значением null. Если
эти параметры не заполнены, то данный метод выдает ошибку и
возвращает ошибочный статус. Один из способов получения
необходимых Id объекта, заключается в использовании
ads_nentselp() для получения списка ads_names контейнеров
объектов. Этот список должен быть затем преобразован в список
Id объектов и наоборот.
Разработка метода в производных классах
Классы геометрических объектов, которые не устанавливают GS
маркеры, вероятно, не должны использовать этот метод, т.к. GS
маркер является первичным (и, часто, единственным) средством
различия геометрических подобъектов.
Если он реализован, этот метод должен использовать данные
типов gsMark, pickPoint, viewTransform, numInserts и
entityAndInsertStack для определения того, какой
геометрический объект или подобъект соответствует критериям
по этим параметрам. Далее метод должен создать динамический
массив FullSubentityPaths (созданный с помощью оператора new)
с одним элементом на каждый геометрический подобъект,
определенный на первом шаге. В завершении, метод должен
заполнить в каждом объекте FullSubentityPaths массива
информацию, соответствующую тому геометрическому подобъекту,
который этот элемент представляет.
Если numInserts == 0 и entityAndInsertStack == NULL, важно
проверить, что владелец геометрического
объекта в самом деле пространство модели или пространство
листа BlockTableRecord. Это может быть сделано с
использованием метода геометрического объекта ownerId() для
получения Id объекта владельца, и затем открытия этого
объекта и использования метода name() для получения имени в
виде строки. Если собственник объекта — не пространство
модели или пространство листа BlockTableRecord, и numInserts
== 0 и/или entityAndInsertStack == NULL, то входные данные
являются не корректными и метод должен установить numPaths в
0 и вернуть NULL.
Если объект FullSubentityPath имеет две части, и массив из Id
объектов содержит все входящие объекты, то встроенное свойство
SubentId, в свою очередь, содержит два элемента: значение
индекса и SubentityType.
Если "главный" геометрический объект (геометрический объект,
от имени которого метод вызывается) не расположен внутри
BlockReferences (это означает, что numInserts == 0 и
entityAndInsertStack == NULL), то массив Id объектов должен
содержать Id "главного" геометрического объекта. Если
"главный" объект включен в один или несколько
BlockReferences, то ObjectIdArray тот же самый, что и
entityAndInsertStack, поэтому все, что требуется в этом
случае — это копирование элементов entityAndInsertStack в
ObjectIdArray.
Элементы данных SubentType во встроенном SubentityId должны
быть установлены, также как и тип.
Элемент данных индекса во встроенном SubentityId может иметь
любое значение, которое вы установите (часто это просто
значение GS маркера), но, если оно применяется, следующие
методы должны быть в состоянии интерпретировать его для
определения соответствующего GS маркера(ов) геометрического
подобъекта (подобъектов):
* GetGraphicsMarkersAtSubentPath()
* GetSubentity()
Параметры pickPoint и viewTransform обеспечивают
дополнительную помощь (если необходимо) в определении того,
какие геометрические подобъекты участвуют. Например,
некоторые типы геометрических объектов могут отображаться
по-разному в зависимости от видового экрана. В таких случаях
может использоваться матрица преобразования viewTransform.
Параметр viewTransform представляет матрицу преобразования из
WCS (мировых координат) в DCS.
Отображаемая система координат ориентирована так, что
положительное направление оси Z направлено из монитора по
направлению к пользователю, положительное направление оси X
направлено по горизонтали слева направо в экране, и
положительное направление оси Y направлено вертикально вверх
экрана.
Так, если текущий видовой экран в точке (1,0,0)
(просмотр всегда производится от точки (0,0,0)),
то матрица преобразования viewTransform должна быть
0 1 0 0
0 0 1 0
1 0 0 0
0 0 0 1
В этой матрице последняя строка и последний столбец не
используются. Заметим также, что третья строка задает ось Z
DCS в WCS координатах (который представляет WCS версию
системной переменной nanoCAD VIEWPOINT).
Возвращает динамически созданный массив из одного или более
FullSubentityPath созданных из GS маркера и другой переданной
в метод информации.
type: Требуемый тип геометрического
gsMark: GS маркер, представляющий конкретный
pickPoint: Выбранная при выборе объекта точка (в
viewTransform: Матрица преобразования из WCS в DCS. Тип Matrix3d
numInserts: Количество Id объектов BlockReferences
entityAndInsertStack: Массив Id объектов, которые составляют
Returns: Метод возвращает массив объектов типа FullSubentityPath, каждый из которых представляет собой полный путь к конкретному геометрическому подобъекту
внутри иерархии объектов чертежа. Каждый путь включает информацию о типе подобъекта, его идентификаторе и контексте вложенности (включая блоки и вставки),
что позволяет однозначно определить, какой именно элемент был выбран пользователем.
Если подходящих подобъектов не найдено, метод может вернуть пустой массив.
В случае ошибки (например, при некорректных входных данных) также может возвращаться значение null.

Teigha.DatabaseServices.Entity.GetTransformedCopy(Teigha.Geometry.Matrix3d)
Метод создает копию геометрического объекта и применяет к ней заданное преобразование с помощью матрицы transform, после чего возвращает преобразованный клон.
Внимание: для сложных объектов, таких как полилинии, метод может привести к некорректному состоянию чертежа из-за разделяемого владения вложенными объектами.
Использование метода
Этот метод создает клон геометрического объекта, применяет
матрицу преобразования transform и затем возвращает этот
преобразованный клон.
Предупреждение:
Для встроенных в nanoCAD комплексных
объектов, таких как полилиния, этот метод создает неполный
клон только с заголовком геометрического объекта, который
также является владельцем множества объектов, которыми
владеет исходный объект (такими, как вершины полилинии),
которые затем преобразуются с помощью матрицы transform. Это
приводит к разрушению чертежа (два заголовка геометрического
объекта владеют одни и тем же набором объектов), так же как и
преобразование исходного множества геометрических объектов, у
которых данный объект является владельцем, вместо копирования
набора объектов.
Разработка метода в производных классах
Реализация этого метода в классе Entity по умолчанию должна
быть достаточной для большинства наследуемых типов
геометрических объектов. Однако, наследуемые классы
геометрических объектов, которые хотят поддерживать
нестандартный масштаб или неортогональные преобразования,
требуют переопределения этого метода со своей собственной
реализацией.
Этот метод должен создать копию геометрического объекта
(используя динамически распределяемую память), применить
матрицу преобразования transform к копии и затем вернуть
результат преобразования этой копии.
Определение того, что составляет корректную матрицу
преобразования и какой тип клонирования объекта должен
делаться — ограниченное (с помощь метода clone()), полное
копирование (если геометрический объект владеет другими
объектами) или без клонирования (это делает метод не
операционным) возлагается на разработчика.
Реализация по умолчанию
Если геометрический объект представлен в универсальном масштабе
и в ортогональных координатах, метод Entity.GetTransformedCopy
может вызвать метод clone() для создания клона
геометрического объекта, затем вызвать Entity.TransformBy() с
этим клоном и вернуть результат этого преобразования клона.
transform: Матрица для преобразования копии геометрического
Returns: Метод возвращает новый экземпляр геометрического объекта типа Entity,
представляющий собой копию исходного объекта, к которой применена
указанная матрица преобразования (transform).
Если преобразование выполнить не удалось
(например, из-за некорректной матрицы или особенностей
внутренней структуры объекта), метод может вернуть null.

Teigha.DatabaseServices.Entity.Highlight(Teigha.DatabaseServices.FullSubentityPath,System.Boolean)
Метод подсвечивает указанный геометрический подобъект, определённый с помощью параметра subId.
Если subId не задан, подсвечивается весь объект, а параметр highlightAll определяет,
будет ли подсветка отображена во всех видовых экранах.
Использование метода
Этот метод использует параметр FullSubentityPath для
определения того, какой подобъект геометрического объекта
является требуемым. Затем он подсвечивает его на экране. Если
аргумент FullSubentityPath не задан, то подсвечивается весь
геометрический объект.
Обычно, FullSubentityPath, переданный в subId, получается из
метода Entity.GetSubentPathsAtGraphicsMarker(). Это
гарантирует, что он правильно и полностью заполнен.
Этот метод использует метод GetGraphicsMarkersAtSubentPath()
геометрического объекта для получения GS маркера, связанного
с subId.
Не является необходимым соответствие каждого вызова метода
Highlight() с вызовом метода Unhighlight(). Вызов метода
Unhighlight() снимает выделение геометрического объекта
независимо от того, сколько раз до этого вызывался метод
Highlight().
Разработка метода в производных классах
Реализация метода Entity.Highlight() делает всю необходимую
работу для подсветки геометрических подобъектов, относящихся
к subId. Поэтому, нет необходимости переопределять этот
метод, за исключением случая, когда вы хотите выполнить
некоторые до- или после- операционные действия, или вы хотите
отменить подсветку геометрических подобъектов.
Если метод переопределен, и он подсвечивает геометрические
подобъекты, то метод Entity.Highlight() должен быть вызван в
некоторой точке переопределенного метода, чтобы выполнить
реальное подсвечивание.
Для большей информации о параметре subId, смотри документацию
на методы Entity.GetGraphicsMarkersAtSubentPath() или
GetSubentPathsAtGraphicsMarker().
subId: Полный путь к подобъекту, который необходимо подсветить.
highlightAll: Признак подсветки во всех видовых экранах. Тип bool

Teigha.DatabaseServices.Entity.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Plane,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод вычисляет точки пересечения между текущим геометрическим объектом и указанным в параметре entityPointer,
учитывая тип пересечения intersectType и проекционную плоскость projectionPlane.
Найденные точки пересечения добавляются в коллекцию points в координатах WCS.
Метод IntersectWith вычисляет точки пересечения между текущим геометрическим объектом и другим объектом,
указанным в параметре entityPointer. При этом учитываются рёбра ограничивающего прямоугольника (bounding box)
текущего объекта. Тип пересечения задаётся параметром intersectType, который определяет, требуется ли продление
объектов для поиска "видимых" пересечений.
Найденные точки пересечения добавляются в коллекцию points в мировой системе координат (WCS).
Для более точного определения участвующих подобъектов используются параметры thisGraphicSystemMarker
и otherGraphicSystemMarker — это графические маркеры, указывающие на конкретные подобъекты текущего
и целевого объектов соответственно. Если какой-либо из этих параметров равен 0, соответствующий маркер игнорируется.
При реализации метода в производных классах рекомендуется использовать возможности графических библиотек
(например, методы IsOn() или IntersectWith() из классов Curve3d и CircularArc3d) для вычисления пересечений
с графическими примитивами. Также, если тип объекта не поддерживается напрямую, можно вызвать его метод IntersectWith,
передав туда текущий объект как аргумент.
entityPointer: Входной объект, с которым проверяется пересечение текущего объекта.
intersectType: Тип пересечения, определяющий, как обрабатывать продление объектов
projectionPlane: Плоскость проекции, используемая при вычислении пересечений.
points: Коллекция, в которую добавляются найденные точки пересечения (в WCS).
thisGraphicSystemMarker: Маркер графической системы, указывающий на подобъект текущего объекта.
otherGraphicSystemMarker: Маркер графической системы, указывающий на подобъект объекта entityPointer.

Teigha.DatabaseServices.Entity.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Plane,Teigha.Geometry.Point3dCollection,System.Int32,System.Int32)
Метод IntersectWith находит точки пересечения между текущим геометрическим объектом и указанным объектом entityPointer,
учитывая тип пересечения intersectType и проекционную плоскость.
Найденные точки добавляются в коллекцию points в мировых координатах (WCS), а параметры thisGraphicSystemMarker
и otherGraphicSystemMarker позволяют ограничить поиск пересечений конкретными подобъектами
(или игнорируются, если установлены в 0).
Использование метода
Этот метод ищет пересечение точек геометрического объекта
entityPointer и всех ребер ограничивающего параллелепипеда
данного геометрического объекта.
Параметр intersectType предназначен для того, чтобы
определить, использовать ли продолжение геометрических
объектов для расчета пересечений.
Любые найденные точки пересечений добавляются в массив точек.
Все точки записываются в WCS координатах.
Параметры thisGraphicSystemMarker и otherGraphicSystemMarker
предназначены для обеспечения метода информацией, позволяющей
ограничить поиск пересечений определенными графическими
подобъектами.
Этот метод не требует использования всех этих параметров
(большинство, если не все, классов для встроенных
геометрический объектов nanoCAD этого не делают). При вызове
данного метода, один или оба параметра могут быть установлены
в 0 для указания того, что они не должны использоваться.
Выполнение метода в производных классах
Этот метод должен сделать все, что нужно для нахождения точек
пересечения геометрического объекта, из которого он вызван и
геометрическим объектом entityPointer. Все найденные точки
пересечений добавляются в массив точек. Все точки
записываются в WCS координатах.
При разработке порядка вычисления пересечений в методе вы
должны внимательно посмотреть графические классы, чтобы найти
полезную функциональность, помогающую в поиске пересечений на
основе геометрических примитивов, составляющих геометрический
объект, для которого вызывается метод и/или составляющих
entityPointer.
Например, класс Curve3d содержит метод IsOn(), который
показывает, находится ли точка на кривой, а класс
CircularArc3d содержит несколько методов IntersectWith() для
нахождения пересечений с другими графическими типами.
Если геометрический объект entityPointer имеет тип, не
определяемый этим методом, является довольно разумным
вызывать метод IntersectWith() геометрического объекта
entityPointer, передав ему в качестве параметра указатель на
данный объект как "entityPointer" и передав ему все остальные
параметры данного вызова (не забудьте, если это необходимо,
конвертировать тип параметра intType), чтобы попробовать
найти точки пересечения. Это именно то, что делают встроенные
в nanoCAD классы.
Также, не забывайте принимать во внимание значение параметра
intersectType. Этот параметр определяет, какой, никакой или
оба из геометрических объектов могут быть расширены для
нахождения "допустимых" пересечений. Не является обязательным
поддержка таких пересечений.
Параметры thisGraphicSystemMarker и otherGraphicSystemMarker
позволяют методу точно определить, какие геометрические
подобъекты участвуют в операции пересечения (например, если
этот метод вызван nanoCAD как часть для операции объектной
привязки пересечением, эти параметры показывают, какие
геометрические подобъекты есть внутри границ объектной
привязки). Для этих параметров значения, меньшие или равные 0
указывают, что они не используются.
entityPointer: Геометрический объект, пересечения
intersectType: Тип пересечения. Тип Intersect
projectionPlane: Плоскость проекции, используемая при вычислении пересечений.
points: Массив, в который добавляются
thisGraphicSystemMarker: GS маркер геометрических
otherGraphicSystemMarker: GS маркер геометрических

Teigha.DatabaseServices.Entity.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод вычисляет точки пересечения между текущим геометрическим объектом и указанным в параметре entityPointer,
включая пересечения с ребрами ограничивающего прямоугольника. Найденные точки добавляются в коллекцию points
в мировых координатах (WCS), а тип пересечения задаётся через параметр intersectType.
Параметры thisGraphicSystemMarker и otherGraphicSystemMarker позволяют ограничить поиск пересечений
конкретными подобъектами, но могут быть проигнорированы, если установлены в 0.
Метод IntersectWith вычисляет точки пересечения между текущим геометрическим объектом и другим объектом,
указанным через параметр entityPointer, включая пересечение с ребрами ограничивающего прямоугольника (bounding box)
текущего объекта. Тип пересечения задается параметром intersectType, который определяет, требуется ли продление
одного или обоих объектов для поиска точек пересечения.
Все найденные точки пересечения добавляются в коллекцию points в мировой системе координат (WCS).
Для локализации поиска пересечений между конкретными подобъектами используются параметры
thisGraphicSystemMarker и otherGraphicSystemMarker. Эти параметры содержат графические маркеры,
указывающие на подобъекты текущего и целевого объектов соответственно.
Если значение какого-либо из них меньше или равно 0 — соответствующий параметр игнорируется.
При реализации метода в производных классах рекомендуется использовать встроенные графические
библиотеки и их функционал (например, методы IsOn() или IntersectWith() из классов Curve3d и CircularArc3d)
для поиска пересечений на уровне примитивов. Если тип объекта entityPointer не поддерживается напрямую,
можно вызвать его собственный метод IntersectWith(), передав ему текущий объект в качестве аргумента.
entityPointer: Входной объект, с которым проверяется пересечение текущего объекта. Тип Entity
intersectType: Тип пересечения, определяющий поведение при поиске точек пересечения (с продлением или без).
points: Коллекция, в которую добавляются все найденные точки пересечения (в WCS). Тип Point3dCollection
thisGraphicSystemMarker: Графический маркер подобъекта текущего объекта. Указывает на конкретный подобъект,
otherGraphicSystemMarker: Графический маркер подобъекта целевого объекта entityPointer. Если ≤ 0 — параметр игнорируется.

Teigha.DatabaseServices.Entity.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Point3dCollection,System.Int32,System.Int32)
Метод вычисляет точки пересечения между текущим геометрическим объектом и указанным объектом entityPointer,
учитывая тип пересечения intersectType. Найденные точки добавляются в коллекцию points в мировых координатах (WCS),
а параметры thisGraphicSystemMarker и otherGraphicSystemMarker позволяют ограничить
поиск пересечений конкретными подобъектами (или игнорируются, если равны 0).
Использование метода
Этот метод ищет пересечение точек геометрического объекта
entityPointer и всех ребер ограничивающего параллелепипеда
данного геометрического объекта.
Параметр intersectType предназначен для того, чтобы
определить, использовать ли продолжение геометрических
объектов для расчета пересечений.
Любые найденные точки пересечений добавляются в массив точек.
Все точки записываются в WCS координатах.
Параметры thisGraphicSystemMarker и otherGraphicSystemMarker
предназначены для обеспечения метода информацией, позволяющей
ограничить поиск пересечений определенными графическими
подобъектами.
Выполнение метода в производных классах
Этот метод должен сделать все, что нужно для нахождения точек
пересечения геометрического объекта, из которого он вызван и
геометрического объекта entityPointer. Все найденные точки
пересечений добавляются в массив точек. Все точки записываются
в WCS координатах.
При разработке порядка вычисления пересечений в методе вы
должны внимательно посмотреть графические классы, чтобы найти
полезную функциональность, помогающую в поиске пересечений на
основе геометрических примитивов, составляющих геометрический
объект, для которого вызывается метод и/или составляющих
entityPointer.
Например, класс Curve3d содержит метод IsOn(), который
показывает, находится ли точка на кривой, а класс
CircularArc3d содержит несколько методов IntersectWith() для
нахождения пересечений с другими графическими типами.
Если геометрический объект entityPointer имеет тип, не
определяемый этим методом, является довольно разумным
вызывать метод IntersectWith() геометрического объекта
entityPointer, передав ему в качестве параметра указатель на
данный объект как "entityPointer" и передав ему все остальные
параметры данного вызова (не забудьте, если это необходимо,
конвертировать тип параметра intType), чтобы попробовать
найти точки пересечения. Это именно то, что делают встроенные
в nanoCAD классы.
Также, не забывайте принимать во внимание значение параметра
intersectType. Этот параметр определяет, какой, никакой или
оба из геометрических объектов могут быть расширены для
нахождения "допустимых" пересечений. Не является обязательным
поддержка таких пересечений.
Параметры thisGraphicSystemMarker и otherGraphicSystemMarker
позволяют методу точно определить, какие геометрические
подобъекты участвуют в операции пересечения (например, если
этот метод вызван nanoCAD как часть для операции объектной
привязки пересечением, эти параметры показывают, какие
геометрические подобъекты есть внутри границ объектной
привязки). Для этих параметров, значения, меньшие или равные
0 указывают, что они не используются.
entityPointer: Геометрический объект, пересечения
intersectType: Тип пересечения. Тип Intersect
points: Массив, в который добавляются
thisGraphicSystemMarker: GS маркер геометрических
otherGraphicSystemMarker: GS маркер геометрических

Teigha.DatabaseServices.Entity.MoveGripPointsAt(Teigha.Geometry.IntegerCollection,Teigha.Geometry.Vector3d)
Метод изменяет геометрический объект таким образом, чтобы координаты ручек,
указанных в массиве indices, переместились на заданный вектор offset в мировой
системе координат. Порядок и значения индексов определяются методом GetGripPoints(),
который должен быть согласован при переопределении этого метода.
Использование метода
Этот метод предназначен для вызова из nanoCAD во время
редактирования ручкой геометрического объекта. Тем не менее,
он может быть вызван из приложений, если это
требуется.
Вызову этого метода должен предшествовать вызов метода
GetGripPoints(), чтобы получить корректные координаты ручек и
порядок, в котором они приходят, чтобы определить значения
индекса, которые передаются в массив indices.
Вектор offset определяет направление и величину
преобразования, которое применяется к координатам ручек,
определенным в indices.
Конечный результат заключается в том, что метод изменяет
геометрический объект любым способом, при котором координаты
ручек, определенные индексными значениями в indices,
будут передвинуты в направлении и на величину, определяемую
вектором offset.
Выполнение метода в производных классах
Этот метод должен изменить геометрический объект так, что
координаты ручек, определенные в массиве indices, преобразуются
по направлению и величине, определенными вектором offset
(заданном в WCS координатах). Как это воздействует на
остальные точки геометрического объекта, зависит от вида
объекта, но и другие обстоятельства также должны быть учтены
методом, т.к. ожидается, что метод произведет изменение всего
геометрического объекта в результате редактирования
координат ручек.
Если метод разрабатывается в производных классах, то также
должен быть разработан метод GetGripPoints(), поскольку
значения индекса в массиве indices представляют начинающиеся
с 0 индексы координат ручек, добавляемые в массив методом
GetGripPoints(). Так, значение индекса в массиве indices,
равное 0, соответствует первой точке, которую метод
GetGripPoints() добавил в массив, переданный из этого метода,
значение 1 индекса соответствует второй точке и т.д.
Например, если пользователь переносил бы объект по 1-ой и
3-ем точкам, добавленным методом GetGripPoints(), то массив
indices имел бы 2 элемента. Первый был бы 0, а второй — 2.
Из-за зависимости данного метода от метода GetGripPoints(),
является абсолютно необходимым, чтобы метод точно знал, какие
точки задаются методом GetGripPoints() и в каком порядке (это
порядок, в каком точки добавляются в массив, передаваемый из
метода GetGripPoints()).
Выполнение по умолчанию
Вызов метода Entity.TransformBy() с матрицей преобразования,
которая преобразовывает весь геометрический объект на
основании offset.
indices: Массив содержит индексные значения (которые
offset: Вектор (в WCS координатах), определяющий

Teigha.DatabaseServices.Entity.MoveGripPointsAt(array,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.MoveGripPointsFlags)
Метод применяет смещение, заданное вектором offset, к одной или нескольким ручкам объекта, выбранным из коллекции appData.
Метод предназначен для применения векторного смещения к одной или нескольким ручкам (grip points) геометрического объекта.
Ручки представляют собой характерные точки объекта, используемые при его интерактивном редактировании — например,
перемещении, растяжении или повороте.
Метод применяет указанное смещение только к тем ручкам, которые переданы в коллекции appData.
Это позволяет гибко управлять поведением объекта при редактировании — например, перемещать только
определённые части сложного объекта, оставляя остальные без изменений.
Работа метода тесно связана с реализацией метода GetGripPoints(), поскольку именно он определяет,
какие точки объекта доступны для редактирования как ручки, и какая информация приложения ассоциирована с каждой из них.
Этот метод может быть вызван как часть процесса интерактивного редактирования объекта в среде nanoCAD
(например, при использовании команд MOVE, STRETCH и др.), а также из пользовательских приложений,
если требуется программно модифицировать положение ручек объекта.
appData: Коллекция ручек, к которым применяется смещение.
offset: Вектор смещения в мировых координатах (WCS), определяющий направление и величину перемещения.
bitFlags: Битовая маска флагов из перечисления MoveGripPointsFlags, управляющая поведением перемещения ручек.

Teigha.DatabaseServices.Entity.MoveGripPointsAtSubentityPaths(array,array,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.MoveGripPointsFlags)
Метод применяет смещение, заданное вектором offset, к выбранным точкам растяжения геометрического объекта,
определённым в массиве appData, и позволяет точно указать, какие подобъекты участвуют в операции с
помощью массива subPaths. Порядок и значения индексов определяются согласованной реализацией
метода GetStretchPoints() в производных классах.
Использование метода
Этот метод предназначен для вызова из nanoCAD во время
выполнения команды растяжения геометрического объекта. Тем не
менее, он может быть вызван из приложений, если
это требуется.
Вызову этого метода должен предшествовать вызов метода
GetStretchPoints() геометрического объекта, чтобы получить
действительные точки растяжения и порядок, в котором они
приходят, чтобы определить значения индекса, которые
передаются в массив indices.
Вектор offset определяет направление и величину
преобразования, которое применяется к точкам растяжения,
определенным в indices.
Конечный результат заключается в том, что метод изменяет
геометрический объект любым способом, при котором точки
растяжения, определенные индексными значениями в indices,
будут передвинуты в направлении и на величину, определяемую
вектором offset.
Выполнение метода в производных классах
Этот метод должен изменить геометрический объект так, что
точки растяжения, определенные в массиве indices,
преобразуются по направлению и величине, определенными вектором
offset (заданном в WCS координатах). Как это воздействует на
остальные точки геометрического объекта, зависит от вида
объекта, но и другие обстоятельства также должны быть учтены
методом, т.к. ожидается, что метод произведет изменение всего
геометрического объекта в результате выполнения операции
переноса.
Если метод разрабатывается в производных классах, то также
должен быть разработан метод GetStretchPoints(), поскольку
значения индекса в массиве indices представляют начинающиеся
с 0 индексы точек растяжения, добавляемые в массив методом
GetGripPoints(). Так, значение индекса в массиве indices,
равное 0, соответствует первой точке, которую метод
GetStretchPoints() добавил в массив, переданный из этого
метода, значение 1 индекса соответствует второй точке и т.д.
Например, если пользователь "растягивал" бы объект по 1-ой и
3-им точкам, добавленным методом GetStretchPoints(), то
массив indices имел бы 2 элемента. Первый был бы 0, а второй
— 2.
Из-за зависимости данного метода от метода
GetStretchPoints(), является абсолютно необходимым, чтобы
метод точно знал, какие точки задаются методом
GetStretchPoints() и в каком порядке (это порядок, в каком
точки добавляются в массив, передаваемый из метода
GetStretchPoints()).
Выполнение по умолчанию
Заключается в вызове метода Entity.TransformBy() с матрицей
преобразования, которая преобразовывает весь геометрический
объект на основании offset. Он затем возвращает тот статус,
который возвращает метод TransformBy().
subPaths: Массив путей к подобъектам, указывающий, какие именно подобъекты текущего
appData: Массив указателей на объекты, представляющие собой данные о ручках, связанных с подобъектами.
offset: Вектор смещения в мировой системе координат (WCS), задающий направление и величину перемещения выбранных ручек.
bitFlags: Битовая маска флагов из перечисления, которая управляет дополнительным поведением во время перемещения ручек.

Teigha.DatabaseServices.Entity.MoveStretchPointsAt(Teigha.Geometry.IntegerCollection,Teigha.Geometry.Vector3d)
Метод применяет заданное смещение к выбранным точкам растяжения геометрического объекта,
определяемым индексами из массива indices. Он вызывается при выполнении команды растяжения в
nanoCAD или может быть использован в приложениях для программного изменения формы объекта.
Метод предназначен для изменения геометрии объекта путём перемещения его точек растяжения (stretch points)
на заданный вектор offset. Обычно он вызывается платформой nanoCAD при выполнении пользователем операции
растяжения объекта. Однако, он также доступен для использования в сторонних приложениях через API nanoCAD.
Перед вызовом этого метода необходимо вызвать метод GetStretchPoints(), чтобы получить список всех доступных
точек растяжения и их порядок. Индексы из массива indices соответствуют позициям этих точек в массиве,
возвращённом методом GetStretchPoints(). Например, индекс 0 указывает на первую добавленную точку, 1 — на вторую и т. д.
Вектор offset задаёт направление и величину перемещения выбранных точек в мировой системе координат (WCS).
Как изменяются остальные части объекта — зависит от его типа. Метод должен обеспечить корректное обновление
всей геометрии объекта, учитывая перемещение указанных точек.
При переопределении метода в производных классах важно согласовать его работу с реализацией метода GetStretchPoints(),
так как поведение зависит от того, какие именно точки и в каком порядке они возвращаются этим методом.
Реализация по умолчанию:
По умолчанию метод вызывает Entity.TransformBy() с матрицей преобразования, которая перемещает весь объект целиком
на заданный вектор offset. Результат работы метода совпадает с результатом вызова TransformBy().
indices: Коллекция целочисленных индексов, указывающих, какие именно точки растяжения должны быть изменены.
offset: Вектор смещения в мировых координатах (WCS), определяющий направление и расстояние перемещения выбранных точек.

Teigha.DatabaseServices.Entity.RecordGraphicsModified(System.Boolean)
Метод устанавливает, должно ли графическое представление геометрического объекта
обновляться при его закрытии.
Этот метод устанавливает состояние геометрического объекта,
определяющее, должен или нет геометрический объект
обновляться на экране, когда он закрывается. Если установлен
признак, что геометрический объект не обновляется, то любые
сделанные изменения появятся в следующий раз, когда
геометрический объект регенерирует.
Если setModified имеет значение false, и у геометрического
объекта в данный момент установлен признак обновления его
графики при закрытии (это значение используется по
умолчанию), то этот метод установит состояние отсутствие
обновления на экране при закрытии объекта и уведомление
objectModified будет послано всем типам реакторов, связанным
с геометрическим объектом.
Если setModified имеет значение true, то у геометрического
объекта будет установлен признак обновления на экране при
закрытии.
setModified: Булево значение, определяющее, будет ли графика

Teigha.DatabaseServices.Entity.SaveAs(GraphicsInterface.WorldDraw,Teigha.DatabaseServices.SaveType)
Метод используется для генерации графических примитивов при сохранении геометрического объекта
в виде прокси-объекта с помощью nanoCAD, обеспечивая его корректное отображение при последующей загрузке.
Он вызывается автоматически при сохранении и позволяет переопределять логику сохранения графики
через производные классы WorldDraw, WorldGeometry и SubEntityTraits.
Использование метода
Этот метод использует nanoCAD для генерации графических
примитивов всякий раз, когда при сохранении требуется
сохранение прокси-объектов для геометрического объекта.
Переопределение этого метода позволяет контролировать
сохраняемую графику.
Для приложений допустимо вызывать этот метод, но
приложение должно обеспечить полную
функциональность объекта WorldDraw, а также объектов
WorldGeometry и SubEntityTraits, для которых оно обеспечивает
ссылки. Единственный способ обеспечить это — создать
производные пользовательские классы для этих трех графических
классов.
Разработка метода в производных классах
Объект типа WorldDraw, заданный в параметре mode, так же как
объекты WorldGeometry и SubEntityTraits, доступные из объекта
WorldDraw, должны обеспечивать для данного метода создание
любых графических примитивов, требуемых для представления
геометрического объекта, когда он отображается как
прокси-объект.
В том контексте, в котором этот метод вызывается, нет
необходимости работать с назначениями GS маркера. Однако, все
видимые свойства, такие как цвета, слои, типы линий,
видимость являются важными.
Параметр st обеспечивает контекст для вызова метода.
Графические примитивы, созданные этим методом, будут
сохранены вместе с геометрическим объектом в файле чертежа,
так что чертеж всегда загружается с контролем приложением не
загруженного геометрического объекта (это и значит, что
объект становится прокси) и он может быть отображен на
экране.
Выполнение по умолчанию
По умолчанию, этот метод вызывает метод WorldDraw()
геометрического объекта с использованием указателя mode.
mode: Указатель на полностью инициализированный объект
st: Параметр, указывающий, почему вызван метод saveAs

Teigha.DatabaseServices.Entity.SetDatabaseDefaults(DatabaseServices.Database)
Метод устанавливает значения цвета, слоя, типа линии, масштаба линии, видимости,
стиля печати и ширины линий геометрического объекта на основе значений
по умолчанию указанной базы данных; если база данных не задана,
используются значения текущей базы данных nanoCAD.
Этот метод устанавливает для геометрического объекта:
* Color (цвет);
* Layer (слой);
* Linetype (тип линий);
* Linetype scale (масштаб типа линий);
* Visibility (видимость);
* Plot style name (имя стиля печати);
* Line weight (ширина линий).
по значениям по умолчанию базы данных, заданной в параметре
sourceDatabase. Если sourceDatabase == null, то используется
редактор текущей базы данных nanoCAD.
sourceDatabase: База данных, чьи значения по умолчанию

Teigha.DatabaseServices.Entity.SetDragStatus(Teigha.DatabaseServices.DragStatus)
Метод вызывается при изменении состояния операции перетаскивания геометрического объекта,
например, при её начале, завершении или отмене, и использует параметр status
для получения информации о текущем состоянии операции.
Эта функция вызывается, если операция перетаскивания, в
которой участвует данный геометрический объект, начинается,
заканчивается или снимается. Параметр status обеспечивает
метод информацией о том, что произошло с операцией
перетаскивания.
status: Параметр передает состояние операции перетаскивания, в которой участвует

Teigha.DatabaseServices.Entity.SetGripStatus(Teigha.DatabaseServices.GripStatus)
Метод вызывается перед удалением объекта ручки (GripStatus) и связанных с ним точек,
чтобы геометрический объект мог выполнить необходимые действия по управлению ресурсами.
Это уведомление позволяет геометрическому объекту выполнить
любые требуемые задания по управлению ресурсами, перед тем
как объект ручки GripStatus и любые альтернативные базовые
точки объекта, на которые указывает объект GripStatus, будут
удалены.
status: Значение, описывающее статус операции переноса.

Teigha.DatabaseServices.Entity.SetLayerId(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод устанавливает идентификатор слоя, к которому должен принадлежать объект по имени слоя.
Также мтеод поддерживает установку на скрытый слой, если параметр allowHidden имеет значение true.
Данный метод применим только к определённым встроенным типам объектов, таким как 2dPolyline, 3dPolyline, PolyFaceMesh и PolygonMesh.
Этот метод задает в геометрическом объекте ссылку на
LayerTableRecord, определенную именем, указанным в newValue.
Для геометрического объекта BlockReference, этот метод также
обновит любой связанный подобъект SequenceEnd.
Note
Только встроенные объекты, для которых kTrue имеет результат,
могут использоваться:
2dPolyline, 3dPolyline, PolyFaceMesh, и PolygonMesh.
В базе данных, содержащей геометрический объект, ищется
объект LayerTableRecord с именем, указанным в newValue. Если
геометрический объект в данный момент не в базе данных, поиск
производится в базе данных, с которой в данный момент
работает редактор nanoCAD.
Значение true для allowHidden позволяет параметру newValue
указывать на скрытый слой. Если этот параметр равен false (по
умолчанию) и newValue указывает на скрытый слой, требуемые
изменения будут игнорированы (без выдачи каких-либо сообщений
и уведомлений).
newValue: Идентификатор записи LayerTableRecord, на который ссылается
allowHidden: Признак, указывающий, может ли newValue

Teigha.DatabaseServices.Entity.SetPropertiesFrom(Teigha.DatabaseServices.Entity)
Метод копирует значения таких свойств, как цвет, слой, тип линии, масштаб линии и видимость,
из указанного геометрического объекта entityPointer в текущий объект.
Этот метод позволяет быстро передать графические параметры от одного объекта к другому.
Этот метод копирует
* Color (цвет);
* Layer (слой);
* Linetype (тип линий);
* Linetype scale (масштаб типа линий);
* Visibility (видимость).
значения из геометрического объекта entityPointer в данный
объект.
entityPointer: Геометрический объект, из которого копируются

Teigha.DatabaseServices.Entity.SetSubentityGripStatus(Teigha.DatabaseServices.GripStatus,Teigha.DatabaseServices.FullSubentityPath)
Метод вызывается перед удалением ручек подобъектов, чтобы геометрический объект мог выполнить
необходимые действия по управлению ресурсами, или после их удаления для уведомления об окончании
сессии редактирования.
Этот метод вызывается со значением статуса GripsToBeDeleted,
когда ручки для подобъектов подготовлены к удалению в
приложении. Это уведомление позволяет геометрическому объекту
выполнить любые требуемые задания по управлению ресурсами
перед тем, как объекты ручки GripStatus и любые
альтернативные базовые точки объекта, на которые указывает
объект GripStatus, будут удалены. Это уведомление может быть
послано более чем один раз для данной сессии редактирования
ручкой. Если сессия редактирования ручкой не закончена, когда
послано это уведомление, геометрический объект впоследствии
получит вызов его метода GetGripPoints() для получения новой
координаты ручки, которая будет использоваться в сессии
редактирования ручкой.
Этот метод вызывается со значением статуса GripsDone, когда
ручки для геометрического объекта были удалены в приложении и
геометрический объект больше не участвует в любой операции
редактирования ручкой.
status: Статус операции ручкой. Тип GripStatus
subentity: Геометрический подобъект, чей статус ручки

Teigha.DatabaseServices.Entity.TransformBy(Teigha.Geometry.Matrix3d)
Метод применяет указанную матрицу преобразования к геометрическому объекту,
изменяя его положение, ориентацию или размер в соответствии с заданным преобразованием.
Реализация метода в производных классах позволяет определять поддерживаемые
типы преобразований и обеспечивает корректное отображение объекта после их применения.
Этот метод обеспечивает инструмент, с помощью которого
nanoCAD и приложения могут предложить
геометрическому объекту применить матрицу
преобразования(xform) к самому себе.
Каждый класс геометрических объектов должен разработать этот
метод, поэтому ограничения на то, какие типы преобразований
поддерживаются, должны быть устранены разработчиком классов
геометрического объекта. Встроенные nanoCAD классы
геометрических объектов для типов геометрических объектов,
которые существуют до R13 (такие как Circle, Line, Arc,
2dPolyline, и т.д.) требуют, чтобы матрица преобразования
представляла однородно масштабируемое ортогональное
преобразование. Остальные nanoCAD встроенные классы не имеют
ограничений.
Разработка метода в производных классах
Этот метод должен приложить матрицу преобразования xform к
геометрическому объекту и изменить состояние геометрического
объекта для отражения преобразования. Полностью на усмотрение
разработчика отдается то, как применить преобразование. Также
на усмотрение разработчика остается решение, что, или какие,
ограничения будут у данного типа поддерживаемого
преобразования. Если какие-либо ограничения требуются, то
разработчик этого метода должен удовлетворить им.
Если в вашем производном классе разработанный TransformBy()
метод не вызывает этот же метод базового класса, вы должны
вызвать DBObject.XDataTransformBy() или ваши Xdata не будут
преобразованы.
Note
Если метод не переопределен, то такие команды nanoCAD, как
MOVE, ROTATE, SCALE и т.д. не будут вызывать никакого
результата для геометрических объектов данного класса.
transform: Матрица преобразования, которая должна быть

Teigha.DatabaseServices.Entity.TransformSubentityPathsBy(array,Teigha.Geometry.Matrix3d)
Метод применяет указанную матрицу преобразования к одному или нескольким геометрическим
подобъектам текущего объекта, изменяя их положение, ориентацию или размер.
Реализация метода позволяет разработчику определять поддерживаемые типы
преобразований и способ их применения к подобъектам.
Применение геометрического преобразования к одному или
нескольким геометрическим подобъектам объекта.
Этот метод обеспечивает инструмент, с помощью которого
nanoCAD и приложения могут предложить
геометрическому объекту применить матрицу
преобразования(xform) к одному или нескольким геометрическим
подобъектам объекта.
Разработка этого метода не является обязательной. Ограничения
на то, какие из типов преобразований поддерживаются,
возлагаются на разработчика класса геометрических объектов.
Этот метод должен приложить матрицу преобразования xform к
подобъектам геометрического объекта и изменить состояние
геометрического объекта для отражения преобразования.
Полностью на усмотрение разработчика отдается то, как
применить преобразование. Также на усмотрение разработчика
остается решение, что, или какие, ограничения будут у данного
типа поддерживаемого преобразования. Если какие-либо
ограничения требуются, то разработчик этого метода должен
удовлетворить им.
Note
Если метод не переопределен, то такие команды nanoCAD, как
MOVE, ROTATE, SCALE и т.д. не будут вызывать никакого
результата для подобъектов геометрических объектов данного
класса.
subPaths: Массив одного или нескольких подобъектов,
transform: WCS преобразование, применимое к каждому из

Teigha.DatabaseServices.Entity.Unhighlight(Teigha.DatabaseServices.FullSubentityPath,System.Boolean)
Метод снимает подсветку указанного геометрического подобъекта или всего объекта,
если путь subId не задан, и использует метод GetGraphicsMarkersAtSubentPath()
для определения связанных графических маркеров.
Этот метод позволяет управлять отображением подсветки в одном или всех
видовых экранах с помощью параметра highlightAll.
Использование метода
Этот метод использует параметр FullSubentityPath для
определения того, какой подобъект геометрического объекта
является требуемым. Затем он снимает его подсветку на экране.
Если аргумент FullSubentityPath не задан, то снимается
подсветка всего геометрического объекта.
Обычно, FullSubentityPath переданный в subId, получается из
метода Entity.GetSubentPathsAtGraphicsMarker(). Это
гарантирует, что он правильно и полностью заполнен.
Этот метод использует метод GetGraphicsMarkersAtSubentPath()
геометрического объекта для получения GS маркера, связанного
с subId.
Не является необходимым соответствие каждого вызова метода
Highlight() с вызовом метода Unhighlight(). Вызов метода
Unhighlight() снимает выделение геометрического объекта
независимо от того, сколько раз до этого вызывался метод
Highlight().
Разработка метода в производных классах
Разработанный метод Entity.Unhighlight() выполняет все
действия, необходимые для отмены подсветки любых подобъектов.
Поэтому, нет необходимости переопределять этот метод, за
исключением случая, когда вы хотите выполнить некоторые до-
или после- операционные действия, или вы хотите отменить
возможность снять подсветку геометрических подобъектов.
Если метод переопределен и он снимает подсветку
геометрических подобъектов, то метод Entity.Unhighlight()
должен быть вызван в некоторой точке переопределенного
метода, чтобы выполнить реальное снятие подсветки.
Внутри метода Entity.Unhighlight() вызывается метод
GetGraphicsMarkersAtSubentPath() данного геометрического
объекта для преобразования FullSubentityPath в
соответствующие GS маркеры. Поэтому, чтобы метод был
успешным, метод GetGraphicsMarkersAtSubentPath() должен быть
также разработан.
Для большей информации о параметре subId, смотри документацию
на методы Entity.GetGraphicsMarkersAtSubentPath() или
GetSubentPathsAtGraphicsMarker().
subId: Указывает, для какого геометрического
highlightAll: Признак снятия подсветки во всех видовых

Teigha.DatabaseServices.Entity.BlockId
Свойство предназначено для получения идентификатора владельца геометрического объекта,
которым должен быть объект типа BlockTableRecord.
Свойство предназначено для получения идентификатора владельца геометрического объекта,
которым должен быть объект типа BlockTableRecord.
Returns: Возвращает значение типа ObjectId,
представляющее собой ссылку на блок (запись таблицы блоков),
которому принадлежит данный геометрический объект.

Teigha.DatabaseServices.Entity.BlockName
Свойство предназначено для получения названия владельца геометрического объекта,
которым должен быть объект типа BlockTableRecord.
Свойство предоставляет доступ к названию владельца геометрического объекта,
которым должен быть объект типа BlockTableRecord.
Returns: Возвращает наименование владельца геометрического объекта. Тип String

Teigha.DatabaseServices.Entity.CastShadows
Свойство предназначено для получения или установки флага, определяющего,
будет ли геометрический объект участвовать в отбрасывании тени при визуализации сцены.
Свойство обеспечивает доступ к признаку отбрасывания тени
геометрическим объектом.
Returns: Возвращает значение типа bool, где true указывает, что объект отбрасывает тень,
а false — что не отбрасывает.

Teigha.DatabaseServices.Entity.CloneMeForDragging
Свойство предназначено для определения, разрешено ли создание клона геометрического объекта
для использования его в операции перетаскивания.
Свойство определяет признак того, может ли клон быть создан для
использования в операции перетаскивания. nanoCAD создает клон
для этой операции, за исключением геометрических объектов с
большим количеством данных (например, полилинии). Для таких
типов объектов операция перетаскивания производится над
исходными объектами.
Returns: Возвращает значение типа bool, где true означает, что для объекта может быть
создан клон при операции перетаскивания, а false — что такая операция будет
выполняться непосредственно над исходным объектом (например, в случае сложных
объектов с большим объемом данных, таких как полилинии).

Teigha.DatabaseServices.Entity.CollisionType
Свойство предназначено для получения типа взаимодействия геометрического объекта
при обнаружении коллизий, что определяет его поведение в операциях,
учитывающих пространственные пересечения.
Свойство определяет трактовку того, как объект участвует в процессе обнаружения коллизий
для данного геометрического объекта. Подклассы могут
переопределять этот метод для определения того, как объекты
взаимодействует в знающих о коллизиях функциях.
Returns: Возвращает значение перечисления CollisionType, которое указывает, как объект участвует
в обнаружении и обработке коллизий. Это значение может быть использовано в функциях,
поддерживающих детектирование столкновений между объектами.

Teigha.DatabaseServices.Entity.Color
Свойство предназначено для установки или получения полной информации о цвете
геометрического объекта с использованием экземпляра класса Teigha.Colors.Color.
Устанавливает или возвращает полную информацию о цвете для
геометрического объекта в экземпляре Color.
Returns: Возвращает экземпляр класса Teigha.Colors.Color, представляющий полную информацию о цвете геометрического объекта,
включая его тип, индекс и другие параметры, определяющие визуальное отображение цвета в чертеже.

Teigha.DatabaseServices.Entity.ColorIndex
Свойство предназначено для получения или установки номера цвета,
назначенного геометрическому объекту в соответствии с текущей палитрой цветов чертежа.
Свойство обеспечивает доступ к номеру цвета геометрического объекта.
Returns: Возвращает целочисленное значение (int), представляющее номер цвета объекта.
Значение 0 обычно соответствует цвету по умолчанию (BYBLOCK),
а значения от 1 до 255 соответствуют стандартным цветам nanoCAD.

Teigha.DatabaseServices.Entity.CompoundObjectTransform
Свойство предназначено для получения матрицы преобразования,
применяемой к внутренним объектам составного геометрического объекта.
Свойство предназначено для получения матрицы преобразования,
применяемой к внутренним объектам составного геометрического объекта.
Returns: Возвращает значение типа Matrix3d, представляющее собой трехмерную матрицу преобразования
(включая смещение, поворот и масштабирование), используемую для корректного позиционирования и
ориентации внутренних объектов внутри составного объекта.

Teigha.DatabaseServices.Entity.Ecs
Свойство предназначено для получения матрицы преобразования, которая позволяет
перевести точки или векторы из локальной системы координат объекта (OCS)
в мировую систему координат (WCS).
Свойство предоставляет матрицу преобразования, которая может
использоваться для преобразования вектора или точки из
системы координат объекта (OCS) в мировую систему координат
(WCS).
Returns: Возвращает значение типа Matrix3d, представляющее собой трехмерную матрицу преобразования.
Эта матрица содержит информацию о положении, ориентации и масштабировании объекта,
необходимую для корректного перевода координат из OCS в WCS.

Teigha.DatabaseServices.Entity.EntityColor
Свойство предназначено для установки или получения цветовых настроек геометрического объекта
в виде экземпляра класса EntityColor, который может содержать информацию о цвете по индексу,
true-цвете или цвете слоя.
Устанавливает или возвращает установки цвета геометрического
объекта в виде EntityColor.
Returns: Возвращает экземпляр класса Teigha.Colors.EntityColor,
представляющий текущее значение цвета объекта.
Это значение может быть использовано для определения
или изменения способа отображения цвета объекта в чертеже.

Teigha.DatabaseServices.Entity.ForceAnnoAllVisible
Свойство предназначено для получения или установки значения системной переменной
ANNOALLVISIBLE, которая определяет, будут ли все аннотативные объекты видны
при различных масштабах представления.
Свойство предоставляет доступ к значению или устанавливает текущее значение системной переменной
ANNOALLVISIBLE.
Returns: Возвращает значение типа bool, где true указывает, что все аннотативные объекты
отображаются независимо от текущего масштаба, а false — что их видимость зависит
от установленных параметров масштабирования.

Teigha.DatabaseServices.Entity.GeometricExtents
Свойство предназначено для получения ограничивающего параллелепипеда,
содержащего трехмерное представление геометрического объекта,
с угловыми точками, выраженными в мировой системе координат (WCS).
Свойство предоставляет инофрмацию о угловых точках (в WCS координатах) параллелепипеда
(с ребрами, параллельными WCS осям X, Y и Z), который
заключает внутри себя 3D расширение геометрического объекта.
Returns: Возвращает экземпляр класса Extents3d, представляющий собой минимальный и максимальный
трехмерные углы (Point3d) ограничивающего объема, который полностью содержит геометрию объекта.

Teigha.DatabaseServices.Entity.Hyperlinks
Свойство предоставляет доступ к коллекции гиперссылок, связанных с текущим геометрическим объектом.
Свойство предоставляет доступ к коллекции гиперссылок, связанных с текущим геометрическим объектом.
Returns: Возвращает объект типа HyperLinkCollection, содержащий одну или несколько гиперссылок,
привязанных к данному объекту. Эта коллекция позволяет просматривать и управлять ссылками,
например, открывать веб-страницы или файлы при взаимодействии с объектом.

Teigha.DatabaseServices.Entity.IsPlanar
Свойство предназначено для определения, лежит ли геометрический объект
полностью в одной плоскости.
Свойство предназначено для определения, лежит ли геометрический объект
полностью в одной плоскости.
Returns: Возвращает значение типа bool, где true указывает, что объект является плоским
(все его точки находятся в одной плоскости), а false — что объект не является плоским.

Teigha.DatabaseServices.Entity.Layer
Свойство предназначено для получения или установки имени слоя
(записи таблицы слоёв LayerTableRecord), с которым связан данный геометрический объект.
Свойство предназначено для получения или установки имени слоя
(записи таблицы слоёв LayerTableRecord), с которым связан данный геометрический объект.
Returns: Возвращает строковое значение (String), представляющее имя слоя, на котором находится объект.
Это значение может быть изменено для перемещения объекта на другой слой.

Teigha.DatabaseServices.Entity.LayerId
Свойство предназначено для получения или установки идентификатора записи таблицы слоёв (LayerTableRecord),
которая связана с текущим геометрическим объектом.
Свойство предназначено для получения или установки идентификатора записи таблицы слоёв (LayerTableRecord),
которая связана с текущим геометрическим объектом.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на запись таблицы слоёв,
определяющую параметры слоя (цвет, тип линии, статус видимости и др.), к которому принадлежит объект.

Teigha.DatabaseServices.Entity.LineWeight
Свойство предназначено для получения или установки толщины линии (ширины) геометрического объекта,
которая определяет её отображение на экране и при печати.
Свойство обеспечивает доступ к значению ширины линии геометрического объекта.
Returns: Возвращает значение перечисления LineWeight, представляющее текущую установленную ширину линии объекта.
Доступные значения соответствуют стандартным размерам толщины линий в системе nanoCAD.

Teigha.DatabaseServices.Entity.Linetype
Свойство предназначено для получения или установки имени типа линии (записи таблицы типов линий LinetypeTableRecord),
которая связана с данным геометрическим объектом.
Свойство предназначено для получения или установки имени типа линии (записи таблицы типов линий LinetypeTableRecord),
которая связана с данным геометрическим объектом.
Returns: Возвращает строковое значение (String), представляющее имя текущего типа линии объекта.
Это значение может быть изменено для назначения объекту другого стиля линии.

Teigha.DatabaseServices.Entity.LinetypeId
Свойство предназначено для получения или установки идентификатора записи таблицы типов линий (LinetypeTableRecord),
которая связана с текущим геометрическим объектом.
Свойство обеспечивает доступ к идентификатору записи таблицы типов линий,
относящейся к объекту.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на запись таблицы типов линий,
определяющую стиль отображения линии объекта.

Teigha.DatabaseServices.Entity.LinetypeScale
Свойство предназначено для получения или установки масштаба типа линии геометрического объекта,
который определяет, как будет отображаться повторяющийся узор линии (например, пунктир) на чертеже.
Свойство устанавливает или возвращает масштаб типа линий
геометрического объекта.
Returns: Возвращает значение типа double, представляющее текущий масштаб типа линии.
Чем больше значение, тем крупнее отображается узор линии.

Teigha.DatabaseServices.Entity.Material
Свойство предназначено для получения или установки имени материала,
назначенного геометрическому объекту, что влияет на его внешний вид при визуализации.
Свойство предназначено для получения или установки имени материала,
назначенного геометрическому объекту, что влияет на его внешний вид при визуализации.
Returns: Возвращает строковое значение (String), представляющее имя текущего материала,
применённого к объекту. Это значение может быть изменено для назначения другого материала.

Teigha.DatabaseServices.Entity.MaterialId
Свойство предназначено для получения или установки идентификатора материала,
связанного с геометрическим объектом, что определяет его визуальные свойства
при трёхмерной визуализации.
Свойство обеспечивает доступ к Id материала, ассоциированного с объектом.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на объект материала в базе данных чертежа.

Teigha.DatabaseServices.Entity.MaterialMapper
Свойство предназначено для получения или установки объекта-маппера,
который определяет, как текстура материала отображается на поверхности
геометрического объекта.
Свойство предназначено для получения или установки объекта-маппера,
который определяет, как текстура материала отображается на поверхности
геометрического объекта.
Returns: Возвращает экземпляр класса Mapper, задающий параметры проекции текстуры материала
на объект — такие как масштаб, смещение и ориентация.

Teigha.DatabaseServices.Entity.PlotStyleName
Свойство предназначено для получения или установки имени стиля печати,
применяемого к геометрическому объекту при выводе чертежа на печать.
Устанавливает или возвращает строку имени стиля печати
геометрического объекта.
Returns: Возвращает строковое значение (String), представляющее имя текущего стиля печати объекта.
Это значение может быть изменено для назначения другого стиля печати.

Teigha.DatabaseServices.Entity.PlotStyleNameId
Свойство предназначено для получения или установки идентификатора стиля печати (PlotStyleDescriptor),
связанного с геометрическим объектом, что определяет его параметры вывода на печать.
Свойство предназначено для получения или установки идентификатора стиля печати (PlotStyleDescriptor),
связанного с геометрическим объектом, что определяет его параметры вывода на печать.
Returns: Возвращает экземпляр класса PlotStyleDescriptor, представляющий дескриптор стиля печати,
используемого для данного объекта.

Teigha.DatabaseServices.Entity.ReceiveShadows
Свойство предназначено для получения или установки флага, определяющего,
может ли данный геометрический объект принимать тени от других объектов при трёхмерной визуализации.
Свойство обеспечивает доступ к признаку, может ли на объект падать
тень.
Returns: Возвращает значение типа bool, где true указывает, что на объект могут падать тени,
а false — что он игнорирует тени.

Teigha.DatabaseServices.Entity.Transparency
Свойство предназначено для получения или установки уровня прозрачности геометрического объекта,
что влияет на его визуальное отображение при трёхмерной визуализации.
Свойство обеспечивает доступ к величине прозрачности геометрического
объекта.
Returns: Возвращает экземпляр класса Teigha.Colors.Transparency, представляющий текущий уровень прозрачности объекта —
от полностью непрозрачного (0) до полностью прозрачного (100).

Teigha.DatabaseServices.Entity.Visible
Свойство предназначено для получения или установки состояния видимости геометрического объекта в чертеже.
Свойство устанавливает или возвращает видимость геометрического объекта в чертеже.
Returns: Возвращает значение типа bool, где true означает, что объект отображается на чертеже, а false — что он скрыт.

Teigha.DatabaseServices.Entity.VisualStyleId
Свойство предназначено для получения или установки идентификатора полного визуального стиля,
применяемого к геометрическому объекту, что определяет его внешний вид при трёхмерной визуализации.
Свойство обеспечивает доступ к идентификатору визуального стиля объекта.
Returns: Возвращает значение типа ObjectId, представляющее собой ссылку на объект визуального стиля (VisualStyle),
который задаёт параметры отображения объекта, такие как освещение, затенение, контуры и текстуры.