Teigha.DatabaseServices.BeginWblockBlockEventArgs
Класс представляет данные для события BeginWblockBlock базы данных.
Класс представляет данные для события BeginWblockBlock базы данных.

Teigha.DatabaseServices.BeginWblockBlockEventArgs.BlockId
Свойство предоставляет идентификатор блока, для которого выполняется операция Wblock.
Свойство предоставляет идентификатор блока, для которого выполняется операция Wblock.
Returns: Возвращает идентификатор блока. Тип ObjectId.

Teigha.DatabaseServices.BeginWblockBlockEventArgs.From
Свойство возвращает базу данных, для которой выполняется операция Wblock.
Свойство возвращает базу данных, для которой выполняется операция Wblock.
Returns: Возвращает базу данных. Тип Database.