Teigha.DatabaseServices.RowsCollection
Класс RowsCollection представляет коллекцию строк таблицы.
Класс RowsCollection представляет коллекцию строк таблицы.

Teigha.DatabaseServices.RowsCollection.Count
Свойство Count представляет текущее количество элементов в этой коллекции.
Свойство Count представляет текущее количество элементов в этой коллекции.
Returns: Возвращает количество элементов в коллекции.
Тип int.

Teigha.DatabaseServices.RowsCollection.Item
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
index: Входной индекс элемента коллекции. Тип int.
Returns: Возвращает строку таблицы, которая является элементом коллекции с индексом index.
Тип Row.