Teigha.DatabaseServices.SweepOptionsBuilder
Класс SweepOptionsBuilder предназначен для настройки параметров, используемых методами SweptSurface.CreateSweptSurface() и Solid3d.CreateSweptSolid().
Класс SweepOptionsBuilder предназначен для настройки параметров, используемых методами SweptSurface.CreateSweptSurface() и Solid3d.CreateSweptSolid(). Опции влияют на геометрическую форму создаваемой поверхности или твердого тела.

Teigha.DatabaseServices.SweepOptionsBuilder.#ctor
Конструктор по умолчанию класса SweepOptionsBuilder.
Конструктор по умолчанию класса SweepOptionsBuilder.

Teigha.DatabaseServices.SweepOptionsBuilder.#ctor(Teigha.DatabaseServices.SweepOptions)
Конструктор класса SweepOptionsBuilder. Создает экземпляр класса с указанными параметрами.
Конструктор класса SweepOptionsBuilder. Создает экземпляр класса с указанными параметрами.
value: Параметры операции вытягивания по траектории. Тип SweepOptions.

Teigha.DatabaseServices.SweepOptionsBuilder.SetPathEntityTransform(Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет задать систему координат в начале/конце траектории вытягивания.
Метод позволяет задать систему координат в начале/конце траектории вытягивания.
pathEnt: Объект траектории, который используется для вычисления геометрического преобразования траектории.
displayErrorMessages: Флаг, определяющий, следует ли выводить сообщения об ошибках. Тип bool.

Teigha.DatabaseServices.SweepOptionsBuilder.SetSweepEntityTransform(array,System.Boolean)
Метод позволяет задать систему координат для вытягиваемого объекта в начале/конце траектории.
Метод позволяет задать систему координат для вытягиваемого объекта в начале/конце траектории.
sweepEntities: Массив объектов, которые используются операцией вытягивания по траектории. Тип Entity[].
displayErrorMessages: Флаг, определяющий, следует ли выводить сообщения об ошибках. Тип bool.

Teigha.DatabaseServices.SweepOptionsBuilder.Align
Свойство Align представляет настройку выравнивания вытягиваемого объекта относительно траектории.
Свойство Align представляет настройку выравнивания вытягиваемого объекта относительно траектории.
Returns: Возвращает предписанный вариант выравнивания относительно траектории. Тип SweepOptionsAlignOption.

Teigha.DatabaseServices.SweepOptionsBuilder.AlignAngle
Свойство AlignAngle представляет величину угла выравнивания в радианах.
Свойство AlignAngle представляет величину угла выравнивания в радианах.
Returns: Возвращает угол выравнивания в радианах. Тип double.

Teigha.DatabaseServices.SweepOptionsBuilder.AlignStart
Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
Свойство AlignStart представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
Returns: Возвращает true, если применяется выравнивание относительно начала траектории.
В случае false используется выравнивание относительно конца траектории.

Teigha.DatabaseServices.SweepOptionsBuilder.Bank
Свойство Bank позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
Свойство Bank позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
Returns: Возвращает true, если вытягиваемая грань или кривая располагается вдоль траектории.
В противном случае возвращает false.

Teigha.DatabaseServices.SweepOptionsBuilder.BasePoint
Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
Свойство BasePoint представляет базовую точку для выравнивания вытягиваемого объекта.
Returns: Возвращает базовую точку. Тип Point3d.

Teigha.DatabaseServices.SweepOptionsBuilder.CheckIntersections
Свойство CheckIntersections позволяет определить состояние опции проверки на самопересечения для получаемого тела или поверхности.
Свойство CheckIntersections позволяет определить состояние опции проверки на самопересечения для получаемого тела или поверхности.
Returns: Возвращает true, если проверка на самопересечения включена.
В противном случае возвращает false.

Teigha.DatabaseServices.SweepOptionsBuilder.DraftAngle
Свойство DraftAngle представляет угол сужения (или расширения), под которым профиль будет сужаться по мере вытягивания вдоль траектории.
Свойство DraftAngle представляет угол сужения (или расширения), под которым профиль будет сужаться по мере вытягивания вдоль траектории.
Returns: Возвращает угол сужения (в радианах). Тип double.

Teigha.DatabaseServices.SweepOptionsBuilder.EndDraftDist
Свойство EndDraftDist представляет расстояние вдоль траектории, на котором сужение/расширение вытягиваемого объекта прекращается.
Свойство EndDraftDist представляет расстояние вдоль траектории, на котором сужение/расширение вытягиваемого объекта прекращается.
Returns: Возвращает расстояние, на котором сужение/расширение прекращается. Тип double.

Teigha.DatabaseServices.SweepOptionsBuilder.PathEntityTransform
Свойство PathEntityTransform представляет матрицу преобразования для траектории вытягивания.
Свойство PathEntityTransform представляет матрицу преобразования для траектории вытягивания.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.DatabaseServices.SweepOptionsBuilder.ScaleFactor
Свойство ScaleFactor представляет масштабный коэффициент операции вытягивания по траектории.
Свойство ScaleFactor представляет масштабный коэффициент операции вытягивания по траектории.
Returns: Возвращает масштабный коэффициент. Тип double.

Teigha.DatabaseServices.SweepOptionsBuilder.StartDraftDist
Свойство StartDraftDist представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
Свойство StartDraftDist представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
Returns: Возвращает расстояние, на котором начинается сужение/расширение вытягиваемого объекта. Тип double.

Teigha.DatabaseServices.SweepOptionsBuilder.SweepEntityTransform
Свойство SweepEntityTransform представляет матрицу преобразования системы координат вытягиваемого объекта.
Свойство SweepEntityTransform представляет матрицу преобразования системы координат вытягиваемого объекта.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.DatabaseServices.SweepOptionsBuilder.TwistAngle
Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
Свойство TwistAngle представляет угол кручения профиля по мере его вытягивания по траектории.
Returns: Возвращает угол кручения профиля. Тип double.