Teigha.Runtime.DynamicLinker
Класс DynamicLinker представляет объект динамического компоновщика.
Класс DynamicLinker представляет объект динамического компоновщика.
Существует один и только один объект класса DynamicLinker.
Для платформы nanoCAD он является глобальным, а для приложений .NET API nanoCAD - неинстанцируемым.
Notes
Объект этого класса решает следующие задачи:
- Получает адрес службы, зарегистрированной по имени.
- Загружает и инициализирует список приложений типа .NET API nanoCAD.
- Загружает и инициализирует один модуль типа .NET API nanoCAD.
- Регистрирует именованную службу в реестре служб.
- Добавляет реактор уведомлений в цепочку реакторов динамического компоновщика.
- Удаляет реактор уведомлений из цепочки реакторов динамического компоновщика.

Teigha.Runtime.DynamicLinker.IsAppBusy(String)
Метод позволяет определить, занято ли указанное по имени приложение.
Метод позволяет определить, занято ли указанное по имени приложение.
moduleName: Входное имя приложения.  Тип String.
Returns: Возвращает true, если указанное приложение занято.
В противном случае возвращает false.

Teigha.Runtime.DynamicLinker.IsApplicationLocked(String)
Метод позволяет выяснить, что заданное приложение заблокировано и не может быть выгружено, либо что это приложение не заблокировано и может быть успешно выгружено.
Метод позволяет выяснить, что приложение moduleName заблокировано и не может быть выгружено, или что это приложение не заблокировано и может быть успешно выгружено.
moduleName: Входное имя приложения. Тип String.
Returns: Возвращает true, если приложение moduleName заблокировано и не может быть выгружено.
В противном случае возвращает false.

Teigha.Runtime.DynamicLinker.IsAppMdiAware(String)
Метод позволяет проверить, поддерживает ли указанное загруженное приложение интерфейс MDI.
Метод позволяет проверить, поддерживается ли интерфейс MDI указанным загруженным приложением.
moduleName: Входное имя приложения. Тип String.
Returns: Возвращает true, если приложение moduleName поддерживает интерфейс MDI.
В противном случае возвращает false.

Teigha.Runtime.DynamicLinker.IsModuleLoaded(String)
Метод позволяет проверить, загружен ли указанный модуль или еще нет.
Метод позволяет проверить, загружен ли указанный модуль или еще нет.
fileName: Имя файла модуля. Тип String.
Returns: Возвращает true, если указанный модуль является успешно загруженным.
В противном случае возвращает false.

Teigha.Runtime.DynamicLinker.LoadApp(String,System.Boolean,System.Boolean)
Метод загружает указанное приложение, зарегистрированное в реестре операционной системы.
Метод предназначен для загрузки приложения с именем appName.
Имя приложения appName должно быть зарегистрировано в реестре операционной системы.
Метод не сможет загрузить приложение,
* если приложение не имеет записи в реестре,
* если в записи реестра загрузка приложения отключена, или
* если текущие условия загрузки приложения не соответствуют допустимым условиям загрузки в данных записи реестра.
Notes
Если аргумент printIt имеет значение true, то сообщение о статусе загрузки отображается в командной строке nanoCAD.
Если аргумент asCmd имеет значение true, загрузка может быть выполнена только один раз.
Повторные попытки загрузить приложение игнорируются, а счетчик ссылок для приложения остается без изменений.
В случае, когда asCmd имеет значение false, повторные загрузки приложения допускаются.
Если приложение уже было ранее загружено, этот метод просто увеличит счетчик ссылок для приложения.
appName: Входное имя загружаемого приложения (как установлено в системном реестре). Нуль-терминированная текстовая строка. Тип String.
printIt: Входной флаг, который указывает, требуется ли вывод сообщения о состоянии загрузки. Тип bool.
asCmd: Входной флаг, который указывает, следует ли загружать приложение так, как если бы это делалось в рамках команды пользователя. Тип bool.
Returns: Возвращает объект загруженного приложения.
Тип Module.

Teigha.Runtime.DynamicLinker.LoadModule(String,System.Boolean,System.Boolean)
Метод загружает файл с приложением, которое зарегистрировано в реестре операционной системы.
Метод предназначен для загрузки приложения с именем файла fileName.
Приложение должно быть зарегистрировано в реестре операционной системы.
Метод не сможет загрузить приложение,
* если приложение не имеет записи в реестре,
* если в записи реестра загрузка приложения отключена, или
* если текущие условия загрузки приложения не соответствуют допустимым условиям загрузки в данных записи реестра.
Notes
Если аргумент printIt имеет значение true, то сообщение о статусе загрузки отображается в командной строке nanoCAD.
Если аргумент asCmd имеет значение true, загрузка может быть выполнена только один раз.
Повторные попытки загрузить приложение игнорируются, а счетчик ссылок для приложения остается без изменений.
В случае, когда asCmd имеет значение false, повторные загрузки приложения допускаются.
Если приложение уже было ранее загружено, этот метод просто увеличит счетчик ссылок для приложения.
fileName: Входное имя загружаемого файла. Тип String.
printIt: Входной флаг, который указывает, требуется ли вывод сообщения о состоянии загрузки. Тип bool.
asCmd: Входной флаг, который указывает, следует ли загружать приложение, как если бы это делалось в рамках команды пользователя. Тип bool.
Returns: Возвращает объект загруженного приложения.
Тип Module.

Teigha.Runtime.DynamicLinker.SetAppBusy(String,System.Boolean)
Метод позволяет переопределить состояние флага занятости приложения.
Метод позволяет переопределить состояние флага занятости приложения.
moduleName: Имя приложения. Тип String.
busyFlag: Значение флага занятости приложения. Тип bool.  В случае значения true, приложение является занятым.

Teigha.Runtime.DynamicLinker.UnloadApp(String,System.Boolean)
Метод выгружает указанное приложение, зарегистрированное в реестре операционной системы
Метод предназначен для выгрузки приложения с указанным именем.
Имя приложения appName должно быть зарегистрировано в реестре операционной системы.
Notes
Этот метод сможет выгрузить приложение только в том случае, если приложение было загружено с помощью метода DynamicLinker.LoadApp() или с помощью механизма загрузки по требованию (все они используют запись приложения в системном реестре).
Если аргумент asCmd имеет значение false, можно вызвать этот метод более одного раза и все равно получить успешное возвращаемое значение. Этот метод просто уменьшит счетчик ссылок для приложения.
Значение флага asCmd, используемое для UnloadApp(), должно быть таким же, как и значение, используемое для LoadApp().
appName: Входное имя выгружаемого приложения (как установлено в системном реестре). Нуль-терминированная текстовая строка. Тип String.
asCmd: Входной флаг, который указывает, следует ли выгружать приложение так, как если бы это делалось в рамках команды пользователя. Тип bool.

Teigha.Runtime.DynamicLinker.UnloadModule(String,System.Boolean)
Метод выгружает приложение, заданное по имени файла.
Метод выгружает приложение, заданное по имени файла fileName.
Имя приложения fileName должно быть определено в реестре операционной системы.
Notes
Этот метод сможет выгрузить приложение только в том случае, если приложение было загружено с помощью метода DynamicLinker.LoadModule() или с помощью механизма загрузки по требованию (все они используют запись приложения в системном реестре).
Если аргумент asCmd имеет значение false, можно вызвать этот метод более одного раза и все равно получить успешное завершение. Этот метод просто уменьшит счетчик ссылок для приложения.
Значение флага asCmd, используемое для UnloadModule(), должно быть таким же, как и значение, используемое для LoadModule().
fileName: Входное имя файла выгружаемого приложения. Нуль-терминированная строка. Тип String.
asCmd: Входной флаг, который указывает, следует ли выгружать приложение так, как если бы это делалось в рамках команды пользователя. Тип bool.

Teigha.Runtime.DynamicLinker.ProductKey
Свойство ProductKey возвращает строку с ключом продукта.
Свойство ProductKey возвращает строку с ключом продукта.
Returns: Возвращает ключ продукта. Тип String.

Teigha.Runtime.DynamicLinker.ProductLcid
Свойство ProductLcid предоставляет код языка (LCID) приложения.
Свойство ProductLcid предоставляет код языка (LCID) приложения.
Returns: Возвращает код языка приложения.  Тип int.