Teigha.Geometry.Matrix2d.IsSingular
Метод позволяет проверить, является ли данная матрица сингулярной.
Метод позволяет проверить, является ли данная матрица сингулярной.
Используется вызов метода Matrix2d.IsSingular(Tolerance tolerance) с точностью по умолчанию, равной Tolerance.Global.
Notes
Матрица является сингулярной, если для направляющих векторов координатных осей, возвращаемых свойством Matrix2d.CoordinateSystem2d, в пределах используемой точности выполняется хотя бы одно из следующих условий:
* по крайней мере один из векторов имеет нулевую длину;
* векторы являются параллельными друг другу.
Returns: Возвращает true, если в пределах используемой точности хотя бы один из направляющих векторов координатных осей, возвращаемых свойством Matrix2d.CoordinateSystem2d, является нулевым, или эти векторы параллельны друг другу.
В противном случае возвращает false.