Teigha.DatabaseServices.Solid
Класс Solid представляет в базе данных двумерный (плоский) твердотельный объект.
Класс Solid представляет в базе данных двумерный (плоский) твердотельный объект.
Наследует базовую функциональность объектов чертежа.
Не путать с классами 3dSolid и Body, которые представляют 3D-тела.

Teigha.DatabaseServices.Solid.#ctor
Конструктор по умолчанию класса Solid.
Конструктор по умолчанию класса Solid.

Teigha.DatabaseServices.Solid.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса Solid. Создает 2D-тело по трем заданным точкам.
Конструктор класса Solid. Создает 2D-тело нулевой толщины по трем заданным точкам.
Координаты точек должны быть заданы в мировой системе координат (WCS).
Вектор нормали принимает значение (0,0,1).
point1: Первая точка. Тип Point3d.
point2: Вторая точка. Тип Point3d.
point3: Третья точка. Тип Point3d.

Teigha.DatabaseServices.Solid.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса Solid. Создает 2D-тело нулевой толщины по четырем заданным точкам.
Конструктор класса Solid. Создает 2D-тело нулевой толщины по четырем заданным точкам.
Координаты точек должны быть заданы в мировой системе координат (WCS).
Вектор нормали принимает значение (0,0,1).
point1: Первая точка.    Тип Point3d.
point2: Вторая точка.    Тип Point3d.
point3: Третья точка.    Тип Point3d.
point4: Четвертая точка. Тип Point3d.

Teigha.DatabaseServices.Solid.GetPointAt(short)
Метод предоставляет точку данного тела с указанным индексом.
Метод предоставляет точку данного тела с указанным индексом.
Индексация углов тела начинается с нуля.
Индекс может принимать значения 0, 1, 2 или 3.
В случае треугольного тела точки с индексами 2 и 3 будут совпадать.
Координаты точки возвращаются в мировой системе координат (WCS).
index: Индекс точки данного объекта. Тип short. Может принимать значения 0, 1, 2 или 3.
Returns: Возвращает координаты точки с индексом index (в мировой системе координат, WCS). Тип Point3d.

Teigha.DatabaseServices.Solid.SetPointAt(short,Teigha.Geometry.Point3d)
Метод позволяет задать новые координаты для точки с указанным индексом.
Метод позволяет задать новые координаты для точки с указанным индексом.
Индекс может принимать значения 0, 1, 2 или 3.
Координаты точки pointValue задаются в мировой системе координат (WCS).
index: Индекс точки, у которой изменяется положение в пространстве. Тип short. Допустимые значения 0, 1, 2 или 3.
pointValue: Новые координаты точки (в мировой системе координат, WCS). Тип Point3d.

Teigha.DatabaseServices.Solid.Normal
Свойство Normal представляет вектор нормали плоскости данного плоского твердого объекта.
Свойство Normal представляет вектор нормали плоскости данного плоского твердого объекта.
Компоненты вектора определены в мировой системе координат (WCS).
Returns: Возвращает вектор нормали плоскости данного плоского твердого объекта.
Тип Vector3d.

Teigha.DatabaseServices.Solid.Thickness
Свойство Thickness представляет толщину данного 2D твердого тела (в единицах чертежа).
Свойство Thickness возвращает толщину этого 2D твердого тела (в единицах чертежа).
Толщина представляет собой размер тела в направлении вектора нормали Normal.
Для толщины используется группа DXF с кодом 39.
Returns: Возвращает толщину данного объекта в направлении вектора нормали. Тип double.