HostMgd.ApplicationServices.XrefFileLock.ReleaseFile
Освобождение, сохранение и перезагрузка файла внешней ссылки,
содержащего новые (внесенные при редактировании) изменения.
Все другие ссылки блоков, которые ссылаются на тот же самый
файл, также будут обновлены.
Данные внутреннего массива объекта, определенные для записи
таблицы блоков (в соответствии с ID), используются для
определения того, какие внешние ссылки на файл
рассинхронизированы с тем, чтобы перезагрузить файл. Данные
внутреннего массива заполняются методом ConsistencyCheck().
Если эти данные пустые, то перезагрузка не выполняется. В
любом случае, после перезагрузки, эти данные очищаются
(устанавливаются в null).