Teigha.Geometry.SplineEntity3d
Класс SplineEntity3d представляет различные сплайновые объекты в трехмерном пространстве.
В текущей версии не реализован.
Класс SplineEntity3d представляет различные сплайновые объекты в трехмерном пространстве.
В текущей версии не реализован.

Teigha.Geometry.SplineEntity3d.ControlPointAt(System.Int32)
Метод находит в массиве управляющих вершин конкретную вершину с указанным индексом.
В текущей версии не реализован.
Метод находит в массиве управляющих вершин конкретную вершину с указанным индексом.
Notes
В текущей версии этот метод не реализован.
i: Индекс управляющей вершины сплайна.  Тип int.
Returns: Возвращает положение управляющей вершины с индексом i.
Тип Point3d.

Teigha.Geometry.SplineEntity3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип SplineEntity3d.

Teigha.Geometry.SplineEntity3d.GetContinuityAtKnot(System.Int32)
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование точности по умолчанию.
В текущей версии не реализован.
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование точности по умолчанию.
Notes
В текущей версии этот метод не реализован.
i: Индекс узла. Тип int.
Returns: Возвращает степень наивысшей производной в указанном узле.
Тип int. Если первая производная в этом узле не определена, метод возвращает 0.

Teigha.Geometry.SplineEntity3d.GetContinuityAtKnot(System.Int32,Teigha.Geometry.Tolerance)
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование заданной точности.
В текущей версии не реализован.
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование заданной точности.
Notes
В текущей версии этот метод не реализован.
i: Индекс узла. Тип int.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает степень наивысшей производной в указанном узле.
Тип int. Если первая производная в этом узле не определена, метод возвращает 0.

Teigha.Geometry.SplineEntity3d.KnotAt(System.Int32)
Метод находит значение узла с указанным индексом.
В текущей версии не реализован.
Метод находит значение узла с заданным индексом index.
Notes
В текущей версии этот метод не реализован.
i: Входной индекс узла. Тип int.
Returns: Возвращает значение узла с индексом index.
Тип double.

Teigha.Geometry.SplineEntity3d.SetControlPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод переопределяет положение управляющей вершины с указанным индексом в массиве управляющих вершин.
Метод переопределяет положение управляющей вершины с указанным индексом в массиве управляющих вершин.
Notes
В текущей версии этот метод не реализован.
i: Входной индекс управляющей вершины.  Тип int.
point: Новое положение управляющей вершины. Тип Point3d.

Teigha.Geometry.SplineEntity3d.SetKnotAt(System.Int32,System.Double)
Метод переопределяет значение узла с указанным индексом.
В текущей версии не реализован.
Метод переопределяет значение узла с указанным индексом.
Notes
В текущей версии этот метод не реализован.
i: Входной индекс узла. Тип int.
value: Новое значение узла. Тип double.

Teigha.Geometry.SplineEntity3d.Degree
Свойство Degree представляет степень данного сплайна.
Не реализовано.
Свойство Degree представляет степень данного сплайна.
Не реализовано.
Returns: Возвращает степень данного сплайна.
Тип int.

Teigha.Geometry.SplineEntity3d.EndParameter
Свойство EndParameter представляет максимальное значение параметра у данного сплайна.
Не реализовано.
Свойство EndParameter представляет максимальное значение параметра у данного сплайна.
Не реализовано.
Returns: Возвращает максимальное значение параметра у данного сплайна.
Тип double.

Teigha.Geometry.SplineEntity3d.EndPoint
Свойство EndPoint представляет точку сплайна с максимальным значением параметра.
Не реализовано.
Свойство EndPoint представляет точку сплайна с максимальным значением параметра.
Не реализовано.
Returns: Возвращает точку сплайна с максимальным значением параметра.
Тип Point3d.

Teigha.Geometry.SplineEntity3d.HasFitData
Свойство HasFitData позволяет проверить, имеются ли у данного объекта данные аппроксимации.
Не реализовано.
Свойство HasFitData позволяет проверить, имеются ли у данного объекта данные аппроксимации.
Не реализовано.
Returns: Возвращает true, если данный сплайн построен по определяющим точкам.
В противном случае возвращает false.

Teigha.Geometry.SplineEntity3d.IsRational
Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
Не реализовано.
Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
Не реализовано.
Returns: Возвращает true, если сплайн является рациональным.
В противном случае возвращает false.

Teigha.Geometry.SplineEntity3d.Knots
Свойство Knots представляет узловой вектор данного сплайна.
Не реализовано.
Свойство Knots представляет узловой вектор данного сплайна.
Не реализовано.
Notes
Интервалы между двумя последовательными узлами разбивают сплайн на полиномиальные или рациональные участки.
Returns: Возвращает узловой вектор сплайна.
Тип KnotCollection.

Teigha.Geometry.SplineEntity3d.NumberOfControlPoints
Свойство NumberOfControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна.
Не реализовано.
Свойство NumberOfControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна.
Не реализовано.
Returns: Возвращает количество вершин в массиве управляющих вершин данного сплайна.
Тип int.

Teigha.Geometry.SplineEntity3d.NumberOfKnots
Свойство NumberOfKnots представляет количество узлов в узловом векторе данного сплайна.
Не реализовано.
Свойство NumberOfKnots представляет количество узлов в узловом векторе данного сплайна.
Не реализовано.
Returns: Возвращает количество узлов в узловом векторе данного сплайна.
Тип int.

Teigha.Geometry.SplineEntity3d.Order
Свойство Order представляет порядок данного сплайна.
Не реализовано.
Свойство Order представляет порядок данного сплайна.
Не реализовано.
Returns: Возвращает порядок данного сплайна.
Тип int.

Teigha.Geometry.SplineEntity3d.StartParameter
Свойство StartParameter представляет минимальное значение параметра у данного сплайна.
Не реализовано.
Свойство StartParameter представляет минимальное значение параметра у данного сплайна.
Не реализовано.
Returns: Возвращает минимальное значение параметра у данного сплайна.
Тип double.

Teigha.Geometry.SplineEntity3d.StartPoint
Свойство StartPoint представляет точку сплайна с минимальным значением параметра.
Не реализовано.
Свойство StartPoint представляет точку сплайна с минимальным значением параметра.
Не реализовано.
Returns: Возвращает точку сплайна с минимальным значением параметра.
Тип Point3d.