Teigha.DatabaseServices.XrefStatus.Unreferenced
Значение: 3.
Xref не имеет ссылки. Анонимные блоки, на которые нет ссылок, удаляются из таблицы блоков каждый раз, когда nanoCAD открывает новый чертеж.