Teigha.Geometry.Entity3d
Класс Entity3d служит базовым классом для всех трехмерных геометрических объектов.
Класс Entity3d служит базовым классом для всех трехмерных геометрических объектов.

Teigha.Geometry.Entity3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект.
Тип Entity3d.

Teigha.Geometry.Entity3d.IsEqualTo(Teigha.Geometry.Entity3d)
Метод позволяет проверить равен ли данный объект указанному объекту.
Используется геометрическая точность по умолчанию.
Метод позволяет проверить равен ли данный объект указанному объекту.
Вызывается метод Entity3d.IsEqualTo(Entity3d entity, Tolerance tolerance) с использованием точности по умолчанию, которая равна  Tolerance.Global.
entity: Входной объект, с которым выполняется сравнение. Тип Entity3d.
Returns: Возвращает true в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает false.

Teigha.Geometry.Entity3d.IsEqualTo(Teigha.Geometry.Entity3d,Teigha.Geometry.Tolerance)
Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
entity: Входной объект, с которым выполняется сравнение. Тип Entity3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает false.

Teigha.Geometry.Entity3d.IsOn(Teigha.Geometry.Point3d)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется геометрическая точность по умолчанию.
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Вызывается метод Entity3d.IsOn(Point3d point, Tolerance tolerance) с использованием геометрической точности по умолчанию, равная Tolerance.Global.
point: Проверяемая точка. Тип Point3d.
Returns: Возвращает true, если в рамках используемой точности точка point лежит на данном объекте.
В противном случае возвращает false.

Teigha.Geometry.Entity3d.IsOn(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется заданная геометрическая точность.
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется заданная геометрическая точность.
point: Проверяемая точка. Тип Point3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в рамках используемой точности точка point лежит на данном объекте.
В противном случае возвращает false.

Teigha.Geometry.Entity3d.Mirror(Teigha.Geometry.Plane)
Метод выполняет зеркальное отображение данного объекта относительно указанной плоскости.
Метод выполняет зеркальное отображение данного объекта относительно указанной плоскости.
plane: Плоскость зеркального отображения. Тип Plane.

Teigha.Geometry.Entity3d.RotateBy(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d)
Метод поворачивает данный объект на указанный угол вокруг заданной оси, определяемой точкой и вектором.
Метод поворачивает данный объект на указанный угол вокруг заданной оси, определяемой точкой и вектором.
angle: Угол поворота. Тип double.
vector: Направление оси вращения. Тип Vector3d.
point: Точка на оси вращения. Тип Point3d.

Teigha.Geometry.Entity3d.ScaleBy(System.Double,Teigha.Geometry.Point3d)
Метод масштабирует данный объект на заданную величину относительно указанной точки.
Метод масштабирует данный объект на заданную величину относительно указанной точки.
scaleFactor: Коэффициент изменения масштаба объекта.  Тип double.
point: Точка, относительно которой выполняется масштабирование объекта.  Тип Point3d.

Teigha.Geometry.Entity3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод применяет к данному объекту указанное трехмерное геометрическое преобразование.
Метод применяет к данному объекту указанное трехмерное геометрическое преобразование.
transform: Матрица геометрического преобразования. Тип Matrix3d.

Teigha.Geometry.Entity3d.TranslateBy(Teigha.Geometry.Vector3d)
Метод выполняет трансляцию данного объекта на заданный вектор.
Метод выполняет трансляцию (параллельный перенос) данного объекта на заданный вектор.
translateVector: Вектор, определяющий операцию трансляции.  Тип Vector3d.