Teigha.DatabaseServices.Body
Класс представляет объекты трехмерных тел в экземпляре базы данных.
Класс представляет объекты трехмерных тел в экземпляре базы данных.
Класс Body является оберткой модели ACIS и используется для представления многосвязных (non-manifold) тел, которые не могут быть описаны классами 3dSolid или Region.

Teigha.DatabaseServices.Body.#ctor
Конструктор по умолчанию класса Body.
Конструктор по умолчанию класса Body.

Teigha.DatabaseServices.Body.#ctor(IntPtr,System.Boolean)
Конструктор класса Body.
Конструктор класса Body.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.Body.AcisIn(String)
Метод позволяет считать из указанного файла данные ACIS для данного объекта и возвращает коллекцию полученных тел ACIS.
Метод позволяет прочитать все объекты ACIS из файла fileName формата ASCII ACIS SAT. Затем он создает объекты Line, Circle, Arc, Ellipse, Spline, Region, Solid3d или Body для каждого из них в зависимости от ситуации и добавляет их в возвращаемую коллекцию.
fileName: Имя файла с геометрией. Тип String.
Returns: Возвращает коллекцию полученных из файла твердых тел ACIS. Тип DBObjectCollection.
Notes
Вновь созданные объекты не добавляются в базу данных, поэтому вызывающее приложение обязано либо добавить их в базу данных, либо удалить из памяти, когда потребность в них отпадёт.

Teigha.DatabaseServices.Body.AcisOut(String,Teigha.DatabaseServices.DBObjectCollection)
Метод записывает указанную коллекцию тел ACIS в заданный файл.
Метод записывает указанную коллекцию объектов в файл с именем fileName. Коллекция может содержать объекты любого типа, но в файл записываются только объекты классов Region, Solid3d, Body или классов, производных от них.
Создаваемый файл имеет формат ASCII ACIS SAT.
fileName: Имя файла для сохранения тел ACIS. Тип String.
entitiesOutToFile: Коллекция тел ACIS, которые предполагается сохранить в файле. Тип DBObjectCollection.

Teigha.DatabaseServices.Body.BodyPtr
Свойство предоставляет указатель на геометрию, непосредственно связанную с данным объектом.
Свойство предоставляет указатель на геометрию, непосредственно связанную с данным объектом.
Returns: Возвращает указатель на геометрию данного объекта. Тип IntPtr.

Teigha.DatabaseServices.Body.IsNull
Свойство позволяет установить, имеется ли в данном теле объект ShapeManager.
Свойство позволяет установить, имеется ли в данном теле объект ShapeManager.
Returns: Возвращает true, если в данном теле нет объекта ShapeManager.

Teigha.DatabaseServices.Body.NumChanges
Свойство возвращает количество изменений, произошедших с этим телом с момента его создания.
Свойство возвращает количество изменений, произошедших с этим телом с момента его создания.
Returns: Возвращает количество изменений в данном теле. Тип int.