Teigha.DatabaseServices.TimeZone
Перечисление TimeZone определяет часовые пояса и их смещения относительно UTC (всемирное координированное время).
Перечисление TimeZone определяет часовые пояса и их смещения относительно UTC (всемирное координированное время, Coordinated Universal Time).