Teigha.DatabaseServices.Handle
Класс Handle предназначен для инкапсуляции 64-битных целочисленных идентификаторов дескрипторов, которые использовались в ряде ранних релизов.
Класс Handle предназначен для инкапсуляции 64-битных целочисленных идентификаторов дескрипторов, которые использовались в ряде ранних релизов.
Дескриптор однозначно идентифицирует DBObject в пределах одной базы данных и сохраняется в базе данных вместе с этим объектом, оставаясь неизменным от сеанса к сеансу.
Однако в случае разных баз данных дескрипторы уже не уникальны.
На самом деле их дублирование в различных базах данных практически неизбежно, поскольку нумерация во всех базах данных начинается с одного и того же начального значения, равного 1, и далее идет по возрастающей.

Teigha.DatabaseServices.Handle.#ctor
Конструктор создает экземпляр дескриптора Handle, используя на входе значение 64-битного дескриптора.
Конструктор создает экземпляр дескриптора Handle, используя на входе значение 64-битного дескриптора.
value: Входное значение 64-битного дескриптора, тип long.

Teigha.DatabaseServices.Handle.Equals(Object)
Возвращает true, если данный объект идентичен укзазанному в аргументе.
Возвращает true, если данный объект идентичен укзазанному в аргументе.
obj: Объект для сравнения, тип Object.
Returns: Возвращает true, если данный объект идентичен укзазанному в аргументе, и false в противном случае.

Teigha.DatabaseServices.Handle.ToString(IFormatProvider)
Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает заданные поставщиком языковые и региональные параметры.
Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает заданные поставщиком языковые и региональные параметры.  Подробнее см. в документации Microsoft по .NET API.
provider: Поставщик настраиваемого формата, реализующий интерфейс IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта, тип String.

Teigha.DatabaseServices.Handle.==(Teigha.DatabaseServices.Handle,Teigha.DatabaseServices.Handle)
Возвращает true, если a равно b.
Возвращает true, если a равно b.
a: Левый операнд, тип Handle,
b: Правый операнд, тип Handle.
Returns: Возвращает true, если a равно b, и false в противном случае.

Teigha.DatabaseServices.Handle.!=(Teigha.DatabaseServices.Handle,Teigha.DatabaseServices.Handle)
Возвращает true, если a не равно b.
Возвращает true, если a не равно b.
a: Левый операнд, тип Handle,
b: Правый операнд, тип Handle.
Returns: Возвращает true, если a не равно b, и false в противном случае.

Teigha.DatabaseServices.Handle.IsOne
Возвращает true, если значение дескриптора у этого объекте равно 1.
Возвращает true, если значение дескриптора у этого объекте равно 1.
Returns: Возвращает true, если значение дескриптора у этого объекте равно 1, и false в противном случае.

Teigha.DatabaseServices.Handle.Value
Свойство предоставляет доступ к значению данного дескриптора.
Свойство предоставляет доступ к значению данного дескриптора.
Returns: Свойство возвращает значение данного дескриптора, тип Int64.