Teigha.DatabaseServices.Region
Класс Region представляет объекты 2D-области (региона) в базе данных.
Класс Region представляет объекты 2D-области (региона) в базе данных.
2D-область имеет замкнутую границу, которая может состоять из отрезков, полилиний, окружностей, дуг, эллипсов, эллиптических дуг и сплайнов. Любые пересечения или самопересечения этих примитивов не допускаются.

Teigha.DatabaseServices.Region.#ctor
Конструктор по умолчанию класса Region.
Конструктор по умолчанию класса Region.

Teigha.DatabaseServices.Region.BooleanOperation(Teigha.DatabaseServices.BooleanOperationType,Teigha.DatabaseServices.Region)
Метод реализует логические операции между данной и указанной областями.
Метод реализует логические операции между данной и указанной областями.
Возможные типы логических операций включают объединение, пересечение и вычитание областей.
Этот метод реализован только в среде пространственного моделирования и выдает исключение eNotImplementedYet для других моделлеров.
operation: Тип логической операции из перечисления BooleanOperationType.
otherRegion: Другая область, участвующая вторым аргументом в логической операции. Тип Region.

Teigha.DatabaseServices.Region.CreateFromCurves(Teigha.DatabaseServices.DBObjectCollection)
Метод предназначен для создания новых областей из замкнутых контуров, образованных указанными сегментами кривой.
Метод предназначен для создания новых областей из замкнутых контуров, образованных указанными сегментами кривой.
Каждый сегмент кривой должен быть представлен одним из следующих типов графических примитивов:
3dPolyline, Arc, Circle, Ellipse, Line, Polyline или Spline.
curveSegments: Массив сегментов кривой. Тип DBObjectCollection.
Returns: Возвращает коллекцию созданных областей. Тип DBObjectCollection.
Notes
Вновь созданные области не являются резидентными объектами базы данных.
Вызывающее приложение может либо добавить их в базу данных, либо их удалить.

Teigha.DatabaseServices.Region.Area
Свойство Area представляет площадь данной области.
Свойство Area представляет площадь данной области.
Величина площади возвращается в текущих единицах чертежа, возведенных в квадрат.
Returns: Возвращает площадь данной области. Тип double.

Teigha.DatabaseServices.Region.Body
Свойство Body представляет указатель на текущую геометрию моделлера для данной области.
Свойство Body представляет указатель на текущую геометрию моделлера для данной области.
Returns: Возвращает указатель на текущую геометрию моделлера для области.
Тип IntPtr.

Teigha.DatabaseServices.Region.IsNull
Свойство IsNull позволяет проверить факт отсутствия модели ACIS, связанной с этой областью.
Свойство IsNull позволяет проверить факт отсутствия модели ACIS, связанной с этой областью.
Returns: Возвращает true, если модель ACIS отсутствует.
В противном случае возвращает false.

Teigha.DatabaseServices.Region.Normal
Свойство Normal представляет нормаль плоскости, в которой располагается данная область.
Свойство Normal представляет нормаль плоскости, в которой располагается данная область.
Вектор нормали возвращается в мировой системе координат (WCS).
Returns: Возвращает вектор нормали плоскости данного объекта.
Тип Vector3d.

Teigha.DatabaseServices.Region.NumChanges
Свойство NumChanges представляет количество изменений в геометрии области с момента ее создания.
Свойство NumChanges представляет количество изменений в геометрии области с момента ее создания.
Returns: Возвращает количество изменений в геометрии области.
Тип int.

Teigha.DatabaseServices.Region.Perimeter
Свойство Perimeter представляет текущий периметр данной области.
Свойство Perimeter представляет текущий периметр данной области.
Значение периметра возвращается в единицах чертежа.
Returns: Возвращает периметр области. Тип double.