HostMgd.ApplicationServices.DocumentLockMode
Данное перечисление определяет поддерживаемые уровни блокировки документа.
Данное перечисление определяет поддерживаемые уровни блокировки документа.
Документ должен быть заблокирован исполняемым контекстом, прежде чем он сам или связанная с ним база данных и менеджер транзакций смогут быть изменены.  Документ также может быть заблокирован, чтобы временно предотвратить его просмотр и/или изменение другими исполняемыми контекстами.
Блокировка документов осуществляется централизованно на уровне приложения, чтобы предотвратить угрозу возникновения взаимоблокировок.
Notes