Teigha.DatabaseServices.DxfFiler.ReadInt64
Метод возвращает 64-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Метод возвращает 64-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Returns: Возвращает 64-разрядное целое число со знаком. Тип long.