HostMgd.PlottingServices.CustomSizeResults
Данное перечисление определяет флаги возврата из метода PlotInfoValidator.IsCustomPossible().
Перечисление CustomSizeResults определяет флаги возврата из метода PlotInfoValidator.IsCustomPossible().