Teigha.DatabaseServices.FileDependencyInfo
Класс FileDependencyInfo представляет записи в разделе .dwg списка зависимостей файлов.
Класс FileDependencyInfo представляет записи в разделе .dwg списка зависимостей файлов.

Teigha.DatabaseServices.FileDependencyInfo.ToString(IFormatProvider)
Метод формирует эквивалентное строковое представление данного объекта, формат которого учитывает предоставленные языковые и региональные настройки.
Метод формирует эквивалентное строковое представление данного объекта, формат которого учитывает предоставленные языковые и региональные настройки.
Notes
Возвращаемая строка содержит информацию о зависимостях файлов в следующем порядке (используется разделение запятыми):
* Полное имя файла;
* Собственное имя файла;
* Путь, по которому был найден файл;
* Идентификатор GUID файла;
* GUID версии файла;
* Имя приложения или функции, создавшей эту запись;
* Флаг, указывающий, была ли изменена база данных с момента последнего сохранения;
* Флаг, указывающий, влияет ли запись на вид экрана;
* Уникальный индекс списка зависимостей файлов;
* Количество секунд с момента 01.01.1980;
* Текущий размер файла;
* Текущее количество ссылок на файл в базе данных.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта, которое учитывает требуемые языковые и региональные настройки.
Тип String.

Teigha.DatabaseServices.FileDependencyInfo.Feature
Свойство Feature предоставляет имя приложения или компонента, создавшего эту запись.
Свойство Feature предоставляет имя приложения или компонента, создавшего эту запись.
Returns: Возвращает имя приложения или компонента, создавшего эту запись.
Тип String.

Teigha.DatabaseServices.FileDependencyInfo.FileName
Свойство FileName представляет собственное имя файла.
Свойство FileName представляет собственное имя файла.
Returns: Возвращает собственное имя файла.
Тип String.

Teigha.DatabaseServices.FileDependencyInfo.FileSize
Свойство FileSize представляет текущий размер файла.
Свойство FileSize представляет текущий размер файла.
Returns: Возвращает текущий размер файла.
Тип int.

Teigha.DatabaseServices.FileDependencyInfo.FingerprintGuid
Свойство FingerprintGuid представляет уникальный GUID файла.
Свойство FingerprintGuid представляет уникальный GUID файла.
Returns: Возвращает GUID файла.
Тип String.

Teigha.DatabaseServices.FileDependencyInfo.FoundPath
Свойство FoundPath представляет путь, по которому был найден файл.
Свойство FoundPath представляет путь, по которому был найден файл.
Returns: Возвращает путь, по которому был найден файл.
Тип String.

Teigha.DatabaseServices.FileDependencyInfo.FullFileName
Свойство FullFileName представляет полное имя файла.
Свойство FullFileName представляет полное имя файла.
Returns: Возвращает полное имя файла.
Тип String.

Teigha.DatabaseServices.FileDependencyInfo.Index
Свойство Index представляет уникальный индекс данного объекта в списке зависимостей файлов.
Свойство Index представляет уникальный индекс данного объекта в списке зависимостей файлов.
Returns: Возвращает уникальный индекс в списке зависимостей файлов.
Тип int.

Teigha.DatabaseServices.FileDependencyInfo.IsAffectsGraphics
Свойство IsAffectsGraphics позволяет проверить, влияет ли эта запись на вид экрана.
Свойство IsAffectsGraphics позволяет проверить, влияет ли эта запись на вид экрана.
Returns: Возвращает true, если данный объект влияет на вид экрана.
В противном случае возвращает false.

Teigha.DatabaseServices.FileDependencyInfo.IsModified
Свойство IsModified позволяет проверить, была ли изменена база данных с момента последнего сохранения файла.
Свойство IsModified позволяет проверить, была ли изменена база данных с момента последнего сохранения файла.
Returns: Возвращает true, если база данных была изменена с момента последнего сохранения файла.
В противном случае возвращает false.

Teigha.DatabaseServices.FileDependencyInfo.ReferenceCount
Свойство ReferenceCount представляет текущее количество ссылок в базе данных.
Свойство ReferenceCount представляет текущее количество ссылок в базе данных.
Returns: Возвращает текущее количество ссылок в базе данных.
Тип int.

Teigha.DatabaseServices.FileDependencyInfo.TimeStamp
Свойство TimeStamp представляет временную метку (в секундах с даты 01.01.1980).
Свойство TimeStamp представляет временную метку файла как количество секунд, прошедших с даты 01.01.1980.
Returns: Возвращает временную метку файла в секундах.
Тип int.

Teigha.DatabaseServices.FileDependencyInfo.VersionGuid
Свойство VersionGuid представляет GUID версии файла.
Свойство VersionGuid представляет GUID версии файла.
Returns: Возвращает GUID версии файла.
Тип String.