HostMgd.EditorInput.JigPrompts
Класс предназначен для взаимодействия с пользователем во время использования технологии .
Класс предназначен для взаимодействия с пользователем во время использования технологии
и предоставляет возможность запрашивать у пользователя данные разного типа для построения или изменения графических объектов.

HostMgd.EditorInput.JigPrompts.AcquireAngle(HostMgd.EditorInput.JigPromptAngleOptions)
Метод запрашивает у пользователя угол в °(градусах), используя при запросе свойства класса .
Метод предназначен для запроса у пользователя угла в °(градусах). В основном применяется для интерактивного поворота
объекта или группы объектов.
options: Набор данных типа , которые используются при запросе угла.
Returns: Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла определяется либо исходя из текущего положения курсора
мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).

HostMgd.EditorInput.JigPrompts.AcquireAngle(System.String)
Метод запрашивает у пользователя угол в °(градусах), используя при запросе приглашающее сообщение.
Метод предназначен для запроса у пользователя угла в °(градусах). В основном применяется для интерактивного поворота
объекта или группы объектов. После вызова создает экземпляр класса JigPromptAngleOptions, присваивает его свойству
Message значение параметра  и вызывает свою перегрузку JigPrompts.AcquireAngle(JigPromptAngleOptions options).
Returns: Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла определяется либо исходя из текущего положения курсора
мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).

HostMgd.EditorInput.JigPrompts.AcquireAngle(System.String,System.String)
Метод запрашивает у пользователя угол в °(градусах), используя при запросе приглашающее сообщение с ключевыми словами.
Метод предназначен для запроса у пользователя угла в °(градусах). В основном применяется для интерактивного поворота
объекта или группы объектов. После вызова создает экземпляр класса JigPromptAngleOptions, присваивает его свойству
Message значение параметра , выделяет из этого параметра ключевые слова, записывает их в свойство Keywords
как KeywordCollection вместе с глобальными ключевыми словами из параметра . Первому ключевому слову в сообщении будет
соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquireAngle(JigPromptAngleOptions options),
передавая в нее созданный экземпляр класса JigPromptAngleOptions.
Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов,
то возникает событие System.ArgumentException.
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.
Returns: Возвращает результат типа double, который является углом, выраженным в радианах. Значение угла может быть получено исходя из текущего положения курсора
мыши, либо посредством ввода с клавиатуры. При вводе с клавиатуры необходимо указывать угол в °(градусах).

HostMgd.EditorInput.JigPrompts.AcquireDistance(HostMgd.EditorInput.JigPromptDistanceOptions)
Метод запрашивает у пользователя расстояние, используя при запросе свойства класса .
Метод предназначен для запроса у пользователя расстояния. В основном применяется для интерактивного увеличения или уменьшения объекта или группы объектов, либо их перемещения.
options: Набор данных типа , которые используются при запросе расстояния.
Returns: Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши и значений настроек,
выбранных пользователем, либо посредством ввода с клавиатуры.

HostMgd.EditorInput.JigPrompts.AcquireDistance(System.String)
Метод запрашивает у пользователя расстояние, используя при запросе приглашающее сообщение.
Метод предназначен для запроса у пользователя расстояния с приглашающим сообщением. В основном применяется для интерактивного увеличения или уменьшения
объекта или группы объектов, либо их перемещения. После вызова создает экземпляр класса JigPromptDistanceOptions, присваивает его свойству
Message значение параметра  и вызывает свою перегрузку JigPrompts.AcquireDistance(JigPromptDistanceOptions options).
Returns: Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши
и значений настроек, выбранных пользователем, либо посредством ввода с клавиатуры.

HostMgd.EditorInput.JigPrompts.AcquireDistance(System.String,System.String)
Метод запрашивает у пользователя расстояние, используя в запросе приглашающее сообщение с ключевыми словами.
Метод предназначен для запроса у пользователя расстояния. В основном применяется для интерактивного увеличения или уменьшения
объекта или группы объектов, либо их перемещения. После вызова создает экземпляр класса JigPromptDistanceOptions, присваивает его свойству
Message значение параметра , выделяет из этого параметра ключевые слова, записывает их в свойство Keywords
как KeywordCollection вместе с глобальными ключевыми словами из параметра . Первому ключевому слову в сообщении будет
соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquireDistance(JigPromptDistanceOptions options),
передавая в нее созданный экземпляр класса JigPromptDistanceOptions с присвоенными значениями свойств.
Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов,
то возникает событие System.ArgumentException.
messageAndKeywords: Строка, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе расстояния.
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.
Returns: Возвращает результат типа double, который является расстоянием, полученным либо из текущего положения курсора мыши
и значений настроек, выбранных пользователем, либо посредством ввода с клавиатуры.

HostMgd.EditorInput.JigPrompts.AcquirePoint(HostMgd.EditorInput.JigPromptPointOptions)
Метод запрашивает у пользователя точку, используя при запросе свойства класса .
Метод предназначен для запроса у пользователя точки. В основном применяется для интерактивного перемещения объекта или группы объектов из одной точки в другую.
options: Набор данных типа , которые используются при запросе точки.
Returns: Возвращает результат типа , полученный либо из текущего
положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.

HostMgd.EditorInput.JigPrompts.AcquirePoint(System.String)
Метод запрашивает у пользователя точку, используя в запросе приглашающее сообщение.
Метод предназначен для запроса у пользователя точки с приглашающим сообщением. В основном применяется для интерактивного перемещения объекта или группы объектов из одной точки в другую.
После вызова создает экземпляр класса JigPromptPointOptions, присваивает его свойству
Message значение параметра  и вызывает свою перегрузку JigPrompts.AcquirePoint(JigPromptPointOptions options).
Returns: Возвращает результат типа , полученный либо из текущего
положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.

HostMgd.EditorInput.JigPrompts.AcquirePoint(System.String,System.String)
Метод запрашивает у пользователя точку, используя при запросе приглашающее сообщение с ключевыми словами.
Метод предназначен для запроса у пользователя точки. В основном применяется для интерактивного перемещения
объекта или группы объектов из одной точки в другую. После вызова создает экземпляр класса JigPromptPointOptions, присваивает его свойству
Message значение параметра , выделяет из этого параметра ключевые слова, записывает их в свойство Keywords
как KeywordCollection вместе с глобальными ключевыми словами из параметра . Первому ключевому слову в сообщении будет
соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquirePoint(JigPromptPointOptions options),
передавая в нее созданный экземпляр класса JigPromptPointOptions с присвоенными значениями свойств.
Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов,
то возникает событие System.ArgumentException.
messageAndKeywords: Строка, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе точки.
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.
Returns: Возвращает результат типа , полученный либо из текущего
положения курсора мыши и значений настроек, выбранных пользователем, либо посредством ввода координат точки с клавиатуры.

HostMgd.EditorInput.JigPrompts.AcquireString(HostMgd.EditorInput.JigPromptStringOptions)
Метод запрашивает у пользователя строку/текстовые данные, используя при запросе свойства класса
Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры.
options: Набор данных типа , которые используются при запросе.
Returns: Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.

HostMgd.EditorInput.JigPrompts.AcquireString(System.String)
Метод запрашивает у пользователя строку/текстовые данные, используя при запросе приглашающее сообщение.
Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры.
После вызова создает экземпляр класса JigPromptStringOptions, присваивает его свойству
Message значение параметра  и вызывает свою перегрузку JigPrompts.AcquireString(JigPromptStringOptions options).
Returns: Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.

HostMgd.EditorInput.JigPrompts.AcquireString(System.String,System.String)
Метод запрашивает у пользователя строку/текстовые данные, используя при запросе приглашающее сообщение с ключевыми словами.
Метод предназначен для запроса у пользователя текстовых данных, которые необходимо ввести с клавиатуры.
После вызова создает экземпляр класса JigPromptStringOptions, присваивает его свойству
Message значение параметра , выделяет из этого параметра ключевые слова, записывает их в свойство Keywords
как KeywordCollection вместе с глобальными ключевыми словами из параметра . Первому ключевому слову в сообщении будет
соответствовать первое глобальное ключевое слово и т. д. Далее метод вызывает свою перегрузку JigPrompts.AcquireString(JigPromptStringOptions options),
передавая в нее созданный экземпляр класса JigPromptStringOptions с присвоенными значениями свойств.
Если список ключевых слов ошибочный или пустой, либо количество глобальных ключевых слов не совпадает с количеством отображаемых ключевых слов,
то возникает событие System.ArgumentException.
messageAndKeywords: Строка, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе текстовых данных.
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.
Returns: Возвращает результат типа string, который является строкой, введенной пользователем с клавиатуры в ответ на запрос.

HostMgd.EditorInput.JigPrompts.#ctor(HostMgd.EditorInput.Jig)
Конструктор класса
Конструктор класса
jig: Ссылка на экземпляр объекта, создаваемого или изменяемого по технологии

HostMgd.EditorInput.JigPrompts.SetInput(HostEdJig*,HostMgd.EditorInput.JigPromptOptions)
Вспомогательный метод, который инициирует процесс изменения объекта или группы объектов
с помощью технологии Jig.
Вспомогательный метод, вызывается в методах
JigPrompts.AcquireAngle(JigPromptAngleOptions options),
JigPrompts.AcquireDistance(JigPromptDistanceOptions options),
JigPrompts.AcquirePoint(JigPromptPointOptions options),
JigPrompts.AcquireString(JigPromptStringOptions options).
Инициирует процесс изменения объекта или группы объектов с помощью технологии Jig с использованием параметров,
определенных с помощью классов JigPromptAngleOptions, JigPromptDistanceOptions, JigPromptPointOptions или JigPromptStringOptions соответственно.
edJig: Ссылка на изменяемый объект или группу объектов
options: Набор параметров, с которыми будет происходить изменение объекта или группы объектов