Teigha.DatabaseServices.DimStyleTable
Класс предназначен для хранения определений размерных стилей в базе данных чертежа.
Класс предназначен для хранения определений размерных стилей в базе данных чертежа.
Каждый размерный стиль определен записью DimStyleTableRecord,
которая является вхождением коллекции DimStyleTable (таблицы размерных стилей).
Размерные стили создаются для упрощения работы с различными видами размеров:
угловыми, линейными, радиальными и т.д. Все размерные стили чертежа хранятся в таблице размерных стилей.
На рисунке приведено окно размерных стилей, которое можно вызвать либо через меню nanoCAD,
либо командой DIMSTYLE (она же в локализованном варианте ДИАЛРАЗМ).
В окне слева перечислены все стили, которые есть в таблице размерных стилей.
Example
В качестве примера работы с таблицей размерных стилей приведена команда DimStyleTableReading, которая открывает таблицу размерных стилей и перебирает её содержимое, выводя в командную строку название каждого стиля.
C#

Teigha.DatabaseServices.DimStyleTable.#ctor(IntPtr,System.Boolean)
Констурктор класса.
Констурктор класса.