Teigha.DatabaseServices.Background
Класс Background является базовым классом для всех объектов, представляющих фон видового экрана.
Класс Background является базовым классом для всех фоновых объектов, представляющих фон видового экрана.
Существуют три конкретных типа фона, которые реализуются производными классами SolidBackground, GradientBackground и ImageBackground.  Видовые экраны с настроенным фоном должны ссылаться на один из этих классов.  Каждый резидентный фоновый объект должен находиться в словаре ACAD_BACKGROUND.
Приложение, задающее фон видового экрана, ответственно за то, чтобы создать новый фон, присвоить ему уникальное имя, задать соответствующие свойства и добавить фон в словарь ACAD_BACKGROUND, а также удалить из словаря предыдущий фоновый объект (если приложению он больше не требуется).

Teigha.DatabaseServices.Background.#ctor(IntPtr,System.Boolean)
Конструктор класса Background.
Конструктор класса Background.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.Background.GetBackgroundDictionaryId(DatabaseServices.Database,System.Boolean)
Метод позволяет получить идентификатор словаря фонов в указанной базе данных.
Метод предоставляет возможность получить идентификатор словаря фонов в указанной базе данных.
Параметр createIfNotPresent позволяет создать словарь, если в базе данных его пока нет.
database: База данных, в которой следует получить доступ к словарю фонов. Тип DatabaseServices.Database.
createIfNotPresent: Предать true, если словарь должен быть создан в случае его отсутствия.  В противном случае передать false. Тип bool.
Returns: Возвращает идентификатор словаря фонов. Тип DatabaseServices.ObjectId.