Teigha.DatabaseServices.DxfFiler.RewindFiler
Метод предназначен для переключения файлера в состояние по умолчанию без изменения положения указателя на данные.
Метод предназначен для переключения файлера в состояние по умолчанию без изменения положения указателя на данные, которые он считывает или записывает.
Returns: Метод в реализации по умолчанию возвращает 0. Тип int.
Notes
Реализация по умолчанию этого метода не делает ничего.