Teigha.Geometry.EllipticalCone.IsClosed
Метод позволяет проверить, является ли основание этого эллиптического конуса полным эллипсом.
Метод позволяет проверить, является ли основание этого эллиптического конуса полным эллипсом.
Используется вызов метода EllipticalCone.IsClosed(Tolerance) с точностью, равной Tolerance.Global.
Returns: Возвращает true, если основание данного эллиптического конуса является полным эллипсом.
В противном случае возвращает false.