Teigha.DatabaseServices.LineAngularDimension2
Класс LineAngularDimension2 представляет угловой размер между двумя линиями.
Класс LineAngularDimension2 представляет угловой размер между двумя линиями.

Teigha.DatabaseServices.LineAngularDimension2.#ctor
Конструктор по умолчанию класса LineAngularDimension2.
Конструктор по умолчанию класса LineAngularDimension2.
Создает объект углового размера с центром дуги и начальными точками обеих выносных линий в координатах (0,0,0).

Teigha.DatabaseServices.LineAngularDimension2.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Конструктор класса LineAngularDimension2. Создает новый объект LineAngularDimension2 с указанными параметрами.
Конструктор класса LineAngularDimension2. Создает новый объект LineAngularDimension2 с указанными параметрами.
line1Start: Начальная точка первой опорной линии углового размера. Тип Point3d.
line1End: Конечная точка первой опорной линии углового размера, она же является начальной точкой первой выносной линии. Тип Point3d.
line2Start: Начальная точка второй опорной линии углового размера. Тип Point3d.
line2End: Конечная точка второй опорной линии углового размера, она же является начальной точкой второй выносной линии. Тип Point3d.
arcPoint: Точка, гарантированно принадлежащая размерной дуге. Тип Point3d.
dimensionText: Размерный текст для замены текста реального измеренного значения. Тип String.
dimensionStyle: Идентификатор объекта размерного стиля, который используется для отрисовки размера. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LineAngularDimension2.arcPoint
Свойство представляет 3D-точку, определяющую положение размерной дуги данного размера.
Свойство представляет 3D-точку, определяющую положение размерной дуги данного размера.
Returns: Возвращает точку на размерной дуге (в мировой системе координат, WCS). Тип Point3d.

Teigha.DatabaseServices.LineAngularDimension2.xLine1End
Свойство представляет конечную точку первой опорной линии данного размера.
Свойство представляет конечную точку первой опорной линии данного размера.
Эта же точка служит начальной точкой первой выносной линии.
Returns: Возвращает конечную точку первой опорной линии размера. Тип Point3d.

Teigha.DatabaseServices.LineAngularDimension2.xLine1Start
Свойство представляет начальную точку первой опорной линии данного размера.
Свойство представляет начальную точку первой опорной линии данного размера.
Returns: Возвращает начальную точку первой опорной линии размера. Тип Point3d.

Teigha.DatabaseServices.LineAngularDimension2.xLine2End
Свойство представляет конечную точку второй опорной линии данного размера.
Свойство представляет конечную точку второй опорной линии данного размера.
Эта же точка служит начальной точкой второй выносной линии.
Returns: Возвращает конечную точку второй опорной линии размера. Тип Point3d.

Teigha.DatabaseServices.LineAngularDimension2.xLine2Start
Свойство представляет начальную точку второй опорной линии данного размера.
Свойство представляет начальную точку второй опорной линии данного размера.
Returns: Возвращает начальную точку второй опорной линии размера. Тип Point3d.