Teigha.DatabaseServices.DwgFiler.ReadHardOwnershipId
Метод предназначен для получения идентификатора жесткой ссылки владения объектом HardOwnershipId из текущего элемента данного объекта Filer.
Метод предназначен для получения идентификатора жесткой ссылки владения объектом HardOwnershipId из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатор жесткой ссылки владения объектом HardOwnershipId. Тип ObjectId.