Teigha.DatabaseServices.OsnapPointRef.MainEntity
Метод предоставляет полный путь XrefFullSubentityPath для подобъекта внешней ссылки, который является основным для данной точки привязки.
Метод предоставляет полный путь XrefFullSubentityPath для подобъекта внешней ссылки, который является основным для данной точки привязки.
Returns: Возвращает полный путь для подобъекта внешней ссылки.
Тип XrefFullSubentityPath.