Teigha.DatabaseServices.FieldCodeFlags.EscapeBackslash
Значение: 32.
Если этот флаг установлен, в вычисляемом тексте все одинарные символы \ преобразуются в двойные \\.
При получении кода поля этот флаг можно комбинировать с EvaluatedText или EvaluatedChildren.