HostMgd.Utilities.Utility.GetAngle(Nullable,[Out] double%,String,String)
Указание угла с параметрами ввода текста и точки по умолчанию

HostMgd.Utilities.Utility.GetAngle(Nullable,[Out] double%,String,String,TextInputOptions,PointInputOptions,[Out] String%)
ptStart: Стартовая (опорная точка)
ptResult: Возвращаемое значение в радианах
sPrompt: Строка запроса при вводе
sKeyWords: ?
eTextInputOptions: Параметры ввода текста
ePointInputOptions: Параметры ввода точки
sInput: Возвращаемая строка
Returns: Возвращает целое значение: InpCancel, InpOk ...

HostMgd.Utilities.Utility.GetKword(String,String,TextInputOptions,[Out] String%)
sPrompt: Строка запроса при вводе
sKeyWords: ?
eTextInputOptions: Параметры ввода текста
sInput: Возвращаемая строка

HostMgd.Utilities.Utility.GetPoint(Nullable,[Out] Point3d%,String,String)
Указание точки с параметрами ввода текста и точки по умолчанию

HostMgd.Utilities.Utility.GetPoint(Nullable,[Out] Point3d%,String,String,TextInputOptions,PointInputOptions,[Out] String%)
ptStart: Стартовая (опорная точка)
ptResult: Возвращаемая точка
sPrompt: Строка запроса при вводе
sKeyWords: ?
eTextInputOptions: Параметры ввода текста
ePointInputOptions: Параметры ввода точки
sInput: Возвращаемая строка
Returns: Возвращает целое значение: InpCancel, InpOk ...

HostMgd.Utilities.Utility.SendString(String)
sCommand: Командная строка