Teigha.Geometry.SplineEntity2d
Класс SplineEntity2d представляет различные двумерные сплайновые объекты.
В текущей версии не реализован.
Класс SplineEntity2d представляет различные двумерные сплайновые объекты.
Notes
В текущей версии этот класс не реализован.

Teigha.Geometry.SplineEntity2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип SplineEntity2d.

Teigha.Geometry.SplineEntity2d.GetContinuityAtKnot(System.Int32)
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование точности по умолчанию.
В текущей версии не реализован.
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование точности по умолчанию.
Notes
В текущей версии этот метод не реализован.
index: Индекс узла. Тип int.
Returns: Возвращает степень наивысшей производной в указанном узле.
Тип int. Если первая производная в этом узле не определена, метод возвращает 0.

Teigha.Geometry.SplineEntity2d.GetContinuityAtKnot(System.Int32,Teigha.Geometry.Tolerance)
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование заданной точности.
В текущей версии не реализован.
Метод предоставляет степень наивысшей производной, которая определена в указанном узле.
Предполагается использование заданной точности.
Notes
В текущей версии этот метод не реализован.
index: Индекс узла. Тип int.
tolerance: Предписанная геометрическая точность. Тип Tolerance.
Returns: Возвращает степень наивысшей производной в указанном узле.
Тип int. Если первая производная в этом узле не определена, метод возвращает 0.

Teigha.Geometry.SplineEntity2d.GetControlPointAt(System.Int32)
Метод находит в массиве управляющих вершин конкретную вершину с указанным индексом.
В текущей версии не реализован.
Метод находит в массиве управляющих вершин конкретную вершину с индексом index.
Notes
В текущей версии этот метод не реализован.
index: Индекс управляющей вершины сплайна.  Тип int.
Returns: Возвращает положение управляющей вершины с индексом index.
Тип Point2d.

Teigha.Geometry.SplineEntity2d.GetKnotAt(System.Int32)
Метод находит значение узла с указанным индексом. В текущей версии не реализован.
Метод находит значение узла с заданным индексом index.
Notes
В текущей версии этот метод не реализован.
index: Входной индекс узла. Тип int.
Returns: Возвращает значение узла с индексом index.
Тип double.

Teigha.Geometry.SplineEntity2d.SetControlPointAt(System.Int32,Teigha.Geometry.Point2d)
Метод переопределяет положение управляющей вершины с указанным индексом.
Метод переопределяет положение управляющей вершины с указанным индексом.
Notes
В текущей версии этот метод не реализован.
index: Входной индекс управляющей вершины.  Тип int.
point: Новое положение управляющей вершины. Тип Point2d.

Teigha.Geometry.SplineEntity2d.SetKnotAt(System.Int32,System.Double)
Метод переопределяет значение узла с указанным индексом.
В текущей версии не реализован.
Метод переопределяет значение узла с указанным индексом.
Notes
В текущей версии этот метод не реализован.
index: Входной индекс узла. Тип int.
value: Новое значение узла. Тип double.

Teigha.Geometry.SplineEntity2d.Degree
Свойство Degree представляет степень данного сплайна.
Не реализовано.
Свойство Degree представляет степень данного сплайна.
Не реализовано.
Returns: Возвращает степень сплайна.
Тип int.

Teigha.Geometry.SplineEntity2d.EndParameter
Свойство EndParameter представляет максимальное значение параметра у данного сплайна.
Не реализовано.
Свойство EndParameter представляет максимальное значение параметра у данного сплайна.
Не реализовано.
Returns: Возвращает максимальное значение параметра сплайна.
Тип double.

Teigha.Geometry.SplineEntity2d.EndPoint
Свойство EndPoint представляет точку сплайна с максимальным значением параметра.
Не реализовано.
Свойство EndPoint представляет точку сплайна с максимальным значением параметра.
Не реализовано.
Returns: Возвращает положение точки сплайна с максимальным значением параметра.
Тип Point2d.

Teigha.Geometry.SplineEntity2d.HasFitData
Свойство HasFitData позволяет проверить, имеются ли у данного объекта данные аппроксимации.
Не реализовано.
Свойство HasFitData позволяет проверить, имеются ли у данного объекта данные аппроксимации.
Не реализовано.
Returns: Возвращает true, если данный сплайн построен по определяющим точкам.
В противном случае возвращает false.

Teigha.Geometry.SplineEntity2d.IsRational
Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
Не реализовано.
Свойство IsRational позволяет проверить, является ли данный сплайн рациональным.
Не реализовано.
Returns: Возвращает true, если сплайн является рациональным.
В противном случае возвращает false.

Teigha.Geometry.SplineEntity2d.Knots
Свойство Knots представляет узловой вектор данного сплайна.
Не реализовано.
Свойство Knots представляет узловой вектор данного сплайна.
Не реализовано.
Notes
Интервалы между двумя последовательными узлами разбивают сплайн на полиномиальные или рациональные участки.
Returns: Возвращает узловой вектор сплайна.
Тип KnotCollection.

Teigha.Geometry.SplineEntity2d.NumControlPoints
Свойство NumControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна.
Не реализовано.
Свойство NumControlPoints представляет количество вершин в массиве управляющих вершин данного сплайна.
Не реализовано.
Returns: Возвращает количество вершин в массиве управляющих вершин данного сплайна.
Тип int.

Teigha.Geometry.SplineEntity2d.NumKnots
Свойство NumKnots представляет количество узлов в узловом векторе данного сплайна.
Не реализовано.
Свойство NumKnots представляет количество узлов в узловом векторе данного сплайна.
Не реализовано.
Returns: Возвращает количество узлов в узловом вектора данного сплайна.
Тип int.

Teigha.Geometry.SplineEntity2d.Order
Свойство Order представляет порядок данного сплайна.
Не реализовано.
Свойство Order представляет порядок данного сплайна.
Не реализовано.
Notes
Кривая определена на интервале между значениями узлов с индексами (order - 1)  и (numberOfKnots - order).
В случае B-сплайна порядок на единицу превышает степень сплайна.
В случае полилинии порядок равен 1.
Returns: Возвращает порядок данного сплайна.
Тип int.

Teigha.Geometry.SplineEntity2d.StartParameter
Свойство StartParameter представляет минимальное значение параметра у данного сплайна.
Не реализовано.
Свойство StartParameter представляет минимальное значение параметра у данного сплайна.
Не реализовано.
Returns: Возвращает минимальное значение параметра у данного сплайна.
Тип double.

Teigha.Geometry.SplineEntity2d.StartPoint
Свойство StartPoint представляет точку сплайна с минимальным значением параметра.
Не реализовано.
Свойство StartPoint представляет точку сплайна с минимальным значением параметра.
Не реализовано.
Returns: Возвращает точку сплайна с минимальным значением параметра.
Тип Point2d.