Teigha.GraphicsInterface.FaceStyle
Класс FaceStyle определяет визуальный стиль как набор свойств, применяемых к отображаемым граням графических объектов.
Класс FaceStyle определяет визуальный стиль как набор свойств, применяемых к отображаемым граням графических объектов.

Teigha.GraphicsInterface.FaceStyle.#ctor
Конструктор по умолчанию класса FaceStyle.
Конструктор по умолчанию класса FaceStyle.

Teigha.GraphicsInterface.FaceStyle.Set(Teigha.GraphicsInterface.FaceStyle)
Метод позволяет переопределить данный стиль, используя в качестве источника данных указанный объект FaceStyle.
Метод позволяет переопределить данный стиль, используя в качестве источника данных указанный объект FaceStyle.
value: Входной стиль грани. Тип FaceStyle.

Teigha.GraphicsInterface.FaceStyle.FaceColorMode
Свойство FaceColorMode определяет цветовой режим отображения граней.
Свойство FaceColorMode определяет цветовой режим отображения граней.
Returns: Возвращает цветовой режим отображения граней.
Значение из перечисления GraphicsInterface.FaceColorMode.

Teigha.GraphicsInterface.FaceStyle.FaceModifiers
Свойство FaceModifiers определяет модификаторы режимов отображения граней.
Свойство FaceModifiers определяет модификаторы режимов отображения граней.
Изменения, привносимые модификаторами, применяются к граням до выполнения любых расчетов, связанных с освещением и тонированием.
Returns: Возвращает назначенные для граней модификаторы режимов отображения.
Перечисление GraphicsInterface.FaceModifiers.

Teigha.GraphicsInterface.FaceStyle.LightingModel
Свойство LightingModel определяет назначенную для граней модель освещения.
Свойство LightingModel определяет назначенную для граней модель освещения.
Returns: Возвращает модель освещения из перечисления GraphicsInterface.LightingModel.

Teigha.GraphicsInterface.FaceStyle.LightingQuality
Свойство LightingQuality определяет текущий метод расчёта эффектов освещения для граней.
Свойство LightingQuality определяет текущий метод расчёта эффектов освещения для граней.
Returns: Возвращает метод расчёта эффектов освещения для граней.
Перечисление GraphicsInterface.LightingQuality.

Teigha.GraphicsInterface.FaceStyle.MonoColor
Свойство MonoColor определяет монохромный цвет, используемый в цветовом режиме FaceColorMode.Mono.
Свойство MonoColor определяет монохромный цвет, используемый в цветовом режиме FaceColorMode.Mono.
Returns: Возвращает цвет, используемый в монохромном режиме отрисовки граней.
Тип Colors.Color.

Teigha.GraphicsInterface.FaceStyle.Opacity
Свойство Opacity определяет степень непрозрачности граней.
Свойство Opacity определяет степень непрозрачности граней.
Returns: Возвращает непрозрачность граней.
Тип double.

Teigha.GraphicsInterface.FaceStyle.SpecularHighlight
Свойство SpecularHighlight определяет степень зеркальности граней.
Свойство SpecularHighlight определяет степень зеркальности граней.
Чем выше значение, тем сильнее эффект зеркального отражения.
Returns: Возвращает степень зеркальности граней.
Тип double.