Teigha.DatabaseServices.Database.BeginDeepCloneTranslation
Операция глубокого клонирования содержит две фазы. Сначала,
каждый объект и все объекты, у которых есть владелец,
клонируются. Далее, все Id объектов преобразуются в Id
клонов.
Событие возникает между этими двумя фазами.