HostMgd.EditorInput.PromptAngleOptions
Класс предоставляет параметры, используемые при интерактивном вводе угла в nanoCAD,
такие как начальное значение, допустимый диапазон и сообщение для пользователя.
Класс наследуется от PromptEditorOptions и применяется для настройки поведения команды ввода угла
— например, при вызове метода GetAngle().
Он позволяет задать:
* текст приглашения (Message),
* начальное значение угла (DefaultValue),
* начальную точку (BasePoint),
* дополнительные флаги для управления поведением ввода.
Эти параметры обеспечивают гибкость при работе с интерактивным вводом угла,
позволяя ограничивать значения, устанавливать подсказки и управлять контекстом ввода.
Example
C#

HostMgd.EditorInput.PromptAngleOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса с указанным приглашающим сообщением.
Конструктор создаёт объект PromptAngleOptions, который используется для настройки параметров
интерактивного ввода угла в nanoCAD. Он устанавливает текст приглашения,
отображаемый пользователю в командной строке, и инициализирует остальные параметры по умолчанию.
После создания объекта можно дополнительно задать такие параметры,
как начальное значение, допустимый диапазон, тип курсора и другие,
чтобы управлять поведением команды ввода угла.
message: Текст приглашения, выводимый в командной строке перед началом ввода угла.
Например: "Введите угол поворота

HostMgd.EditorInput.PromptAngleOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением
и списком глобальных ключевых слов, отображаемых пользователю.
Конструктор создаёт объект PromptAngleOptions, используемый при настройке интерактивного ввода
угла в nanoCAD. Он позволяет указать:
* текст приглашения , включая локальные ключевые слова, заключённые в квадратные скобки (например: "Введите угол [0/90/180]:"),
* глобальные ключевые слова , которые будут доступны во время ввода и не зависят от контекста команды.
Этот конструктор особенно полезен, когда требуется предоставить пользователю список
предопределённых вариантов для выбора, например, стандартные углы
или параметры, доступные в любой момент ввода.
messageAndKeywords: Сообщение, отображаемое пользователю, может содержать приглашение и локальные ключевые слова в формате [Ключ1/Ключ2/Ключ3].
Пример: "Введите угол поворота [по Часовой/Против часовой]"
globalKeywords: Строка, содержащая глобальные ключевые слова, которые доступны на протяжении всей команды.
Пример: "Сlockwise Сounterclockwise"

HostMgd.EditorInput.PromptAngleOptions.AllowArbitraryInput
Свойство определяет, разрешён ли пользователю произвольный ввод угла,
не ограниченный заданными параметрами.
Свойство используется для управления тем, может ли пользователь ввести любое значение угла,
игнорируя заданные с помощью LowerLimit и UpperLimit границы.
Если свойство установлено в true, пользователь может ввести значение вне указанного диапазона.
Если в false — ввод угла ограничен указанными минимальным и максимальным значениями.
Это свойство особенно полезно при реализации гибких команд,
где требуется ограничить или разрешить свободный ввод угла, например,
при повороте объектов, построении или параметрических операциях.
Returns: Возвращает значение типа bool:
* true — произвольный ввод угла разрешён.
* false — ввод угла ограничен заданным диапазоном.
Notes
По умолчанию значение свойства равно true.

HostMgd.EditorInput.PromptAngleOptions.AllowNone
Свойство определяет, разрешено ли завершение ввода угла нажатием Enter без указания значения.
Свойство используется для указания, может ли пользователь завершить операцию ввода угла
простым нажатием клавиши Enter , без ввода конкретного значения.
Если свойство установлено в true, это действие считается допустимым,
и операция ввода завершается со статусом PromptStatus.None.
Если false — пользователь обязан ввести значение угла или выбрать ключевое слово.
Это свойство полезно при реализации команд, где требуется разрешить пропуск параметра угла,
например, при использовании значения по умолчанию, заданного ранее.
Returns: Возвращает значение типа bool:
* true — пользователь может завершить ввод нажатием Enter.
* false — ввод угла обязателен.
Notes
Свойство AllowNone часто применяется вместе с DefaultValue,
чтобы обеспечить ввод угла по умолчанию при нажатии Enter.
Это упрощает взаимодействие пользователя с командами,
где угол не обязателен, но может быть изменён.

HostMgd.EditorInput.PromptAngleOptions.AllowZero
Свойство определяет, разрешён ли ввод нулевого значения угла в интерактивной команде.
Свойство используется для указания, допускается ли ввод нулевого угла (0 радиан)
при выполнении команды ввода угла. Если свойство установлено в true, пользователь
может ввести значение 0 как допустимый угол.
Если в false — ввод нулевого угла блокируется, и система считает его недопустимым,
даже если он попадает в диапазон LowerLimit и UpperLimit.
Это свойство применяется для дополнительного контроля над значениями,
которые может ввести пользователь, особенно в тех случаях,
когда нулевой угол имеет особое значение или должен быть исключён из допустимых.
Returns: Возвращает значение типа bool:
* true — ввод нулевого угла разрешён.
* false — ввод нулевого угла запрещён.
Example
C#

HostMgd.EditorInput.PromptAngleOptions.BasePoint
Свойство возвращает или устанавливает базовую точку,
относительно которой отсчитывается угол при интерактивном вводе.
Свойство используется для задания точки, от которой будет отсчитываться угол при вводе
— например, при работе с командой GetAngle(). Если базовая точка указана,
пользователь может задавать угол относительно этой точки, что особенно полезно
при построении объектов, повороте или других операциях, где угол отсчитывается
от определённого положения на чертеже.
Returns: Возвращает объект типа Point3d, представляющий собой координаты базовой точки
в мировой системе координат (WCS).
Если точка не задана, возвращается значение Point3d.Null.
Example
C#

HostMgd.EditorInput.PromptAngleOptions.DefaultValue
Свойство возвращает или устанавливает значение угла по умолчанию,
которое будет использовано, если пользователь нажал Enter , не введя другое значение.
Свойство используется для задания угла (в радианах), который автоматически применяется,
если пользователь завершил ввод нажатием Enter , не указав другое значение.
Это позволяет реализовать удобный интерфейс команд, где пользователь может либо
ввести собственное значение угла, либо принять предустановленное значение.
Returns: Возвращает значение типа double, представляющее угол по умолчанию в радианах .
Если значение не было задано, возвращается 0.0.
Example
C#

HostMgd.EditorInput.PromptAngleOptions.UseAngleBase
Свойство определяет, будет ли использоваться базовый угол
при интерактивном вводе угла пользователем.
Свойство используется для указания, следует ли учитывать текущий базовый угол чертежа
при вводе угла пользователем. Если свойство установлено в true, вводимый пользователем угол
будет отсчитываться относительно базового направления, заданного в системе
(например, относительно угла 0°, заданного в настройках чертежа).
Если свойство равно false, угол отсчитывается от стандартного направления (например, оси X).
Это свойство особенно полезно при реализации команд, где требуется учитывать настройки чертежа
или пользовательский контекст, например, при повороте объектов или построении элементов
под определённым углом.
Returns: Возвращает значение типа bool:
* true — базовый угол будет использоваться при вводе.
* false — ввод угла производится без учёта базового направления.
Example
C#

HostMgd.EditorInput.PromptAngleOptions.UseBasePoint
Свойство определяет, будет ли учитываться базовая точка
при интерактивном вводе угла пользователем.
Свойство используется для указания, должно ли вводимое пользователем значение угла
отсчитываться относительно заданной базовой точки (BasePoint).
Если свойство установлено в true, ввод угла становится привязанным к указанной точке,
и пользователь указывает направление относительно неё — например,
при построении угла от конкретного объекта или точки на чертеже.
Если свойство равно false, точка не учитывается, и угол вводится
относительно текущей системы координат.
Returns: Возвращает значение типа bool:
* true — базовая точка будет использоваться при вводе угла.
* false — базовая точка не учитывается при вводе.
Example
C#

HostMgd.EditorInput.PromptAngleOptions.UseDashedLine
Свойство определяет, будет ли отображаться штриховая (резиновая) линия
между базовой точкой и текущим положением курсора при интерактивном вводе угла.
Свойство используется для включения или отключения визуальной подсказки
в виде штриховой линии, которая динамически отображается между точкой,
заданной через BasePoint, и текущим положением указателя при вводе угла.
Если свойство установлено в true, пользователь видит линию,
что улучшает наглядность ввода — например, при задании направления
или повороте объекта. Если значение false, линия не отображается,
и пользователь работает без визуального отслеживания направления.
Returns: Возвращает значение типа bool:
* true — штриховая линия отображается.
* false — штриховая линия скрыта.
Example
C#

HostMgd.EditorInput.PromptAngleOptions.UseDefaultValue
Свойство определяет, будет ли использоваться значение по умолчанию
при нажатии пользователем Enter без ввода другого значения угла.
Свойство используется для указания, следует ли применять значение,
заданное в свойстве DefaultValue, если пользователь просто нажал Enter ,
не вводя собственного значения угла. Если свойство установлено в true,
значение угла по умолчанию будет использоваться в команде (например, при вызове GetAngle()).
Если false — пользователь обязан ввести угол вручную или выбрать его графически.
Returns: Возвращает значение типа bool:
* true — значение по умолчанию будет использовано, если пользователь нажал Enter без ввода.
* false — значение по умолчанию не применяется, пользователь должен ввести угол вручную.
Example
C#