Teigha.Geometry.Plane
Класс Plane представляет параметризованную бесконечную плоскость в трехмерном пространстве.
Класс Plane представляет параметризованную бесконечную плоскость в трехмерном пространстве.

Teigha.Geometry.Plane.#ctor
Конструктор по умолчанию класса Plane. Создает новую плоскость, совпадающую с плоскостью XY.
Конструктор по умолчанию класса Plane.
Создает плоскость с началом в точке (0, 0, 0) и ортами uAxis = (1, 0, 0),  vAxis = (0, 1, 0).

Teigha.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Конструктор класса Plane.
Создает экземпляр класса с указанными коэффициентами в общем уравнении плоскости.
Конструктор класса Plane.
Создает экземпляр класса с указанными коэффициентами в общем уравнении плоскости.
Notes
Общее уравнение плоскости имеет вид:
a * X + b * Y + c * Z + d = 0
где a, b, c, d - некоторые действительные константы, удовлетворяющие условию невырожденности плоскости a^2 + b^2 + c^2 != 0 (т.е., a, b и c не могут равняться нулю одновременно).
Величины a, b, c служат компонентами вектора нормали этой плоскости.
a: Коэффициент a в общем уравнении плоскости. Тип double.
b: Коэффициент b в общем уравнении плоскости. Тип double.
c: Коэффициент c в общем уравнении плоскости. Тип double.
d: Коэффициент d в общем уравнении плоскости. Тип double.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса Plane.
Создает плоскость по трем точкам, которые определяют оси и начало координат плоскости.
Конструктор класса Plane.
Создает плоскость по трем точкам, которые определяют оси и начало координат плоскости.
Notes
Направляющие векторы осей, определяемых точками u и v, обязаны быть неколлинеарными.
u: Точка, определяющая направление оси uAxis. Тип Point3d.
origin: Точка, определяющая начало координат плоскости.   Тип Point3d.
v: Точка, определяющая направление оси vAxis. Тип Point3d.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса Plane.
Создает плоскость, используя заданные начало координат и нормальный вектор плоскости.
Конструктор класса Plane.
Создает плоскость, используя заданные начало координат origin и нормальный вектор плоскости normal.
origin: Начало координат плоскости.  Тип Point3d.
normal: Нормаль плоскости. Тип Vector3d. Не может иметь ненулевую длину.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса Plane.
Создает плоскость, используя заданные начало координат и направляющие векторы осей.
Конструктор класса Plane.
Создает плоскость, используя заданные начало координат origin и направляющие векторы осей u и v.
Notes
Векторы u и v не должны быть коллинеарными.
origin: Начало координат. Тип Point3d.
u: Направляющий вектор оси uAxis. Тип Vector3d.
v: Направляющий вектор оси vAxis. Тип Vector3d.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Plane)
Конструктор класса Plane.
Создает экземпляр класса как копию указанной плоскости.
Конструктор класса Plane.
Создает экземпляр класса как копию указанной плоскости source.
source: Входная плоскость. Тип Plane.

Teigha.Geometry.Plane.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Plane.

Teigha.Geometry.Plane.GetSignedDistanceTo(Teigha.Geometry.Point3d)
Метод вычисляет расстояние со знаком от данной плоскости до указанной точки.
Метод вычисляет расстояние со знаком от данной плоскости до точки pointValue.
Знак результата определяется знаком скалярного произведения вектора нормали плоскости на вектор, построенный из начала координат плоскости в точку pointValue.
pointValue: Входная точка, расстояние до которой от плоскости требуется определить. Тип Point3d.
Returns: Возвращает расстояние со знаком от данной плоскости до точки pointValue.
Тип double.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.BoundedPlane)
Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью.
Используется точность по умолчанию.
Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью.
Используется вызов метода Plane.IntersectWith(BoundedPlane boundPlane, Tolerance tolerance)
с точностью, равной Tolerance.Global.
boundPlane: Входная ограниченная плоскость.
Returns: Возвращает линейный сегмент, который представляет линию пересечения.
Тип LineSegment3d.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.BoundedPlane,Teigha.Geometry.Tolerance)
Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью.
Используется предписанная точность.
Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью.
Используется точность tolerance.
boundPlane: Входная ограниченная плоскость.   Тип BoundedPlane.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает линейный сегмент, который представляет линию пересечения.
Тип LineSegment3d.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.Plane)
Метод вычисляет линию пересечения данной плоскости и указанной плоскости.
Используется точность по умолчанию.
Метод вычисляет линию пересечения данной плоскости и плоскости otherPlane.
Используется вызов метода Plane.IntersectWith(Plane otherPlane, Tolerance tolerance)
с точностью, равной Tolerance.Global
otherPlane: Входная плоскость, линию пересечения с которой требуется вычислить. Тип Plane.
Returns: Возвращает линию пересечения данной плоскости и плоскости otherPlane.
Тип Line3d.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод вычисляет линию пересечения данной плоскости и указанной плоскости.
Используется предписанная точность.
Метод вычисляет линию пересечения данной плоскости и плоскости otherPlane.
Используется точность tolerance.
otherPlane: Входная плоскость, линию пересечения с которой требуется вычислить. Тип Plane.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает линию пересечения данной плоскости и плоскости otherPlane.
Тип Line3d.

Teigha.Geometry.Plane.Set(System.Double,System.Double,System.Double,System.Double)
Метод переопределяет коэффициенты в общем уравнении данной плоскости.
Метод переопределяет коэффициенты a, b, c и d в общем уравнении данной плоскости.
a: Коэффициент a в общем уравнении плоскости. Тип double.
b: Коэффициент b в общем уравнении плоскости. Тип double.
c: Коэффициент c в общем уравнении плоскости. Тип double.
d: Коэффициент d в общем уравнении плоскости. Тип double.

Teigha.Geometry.Plane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод переопределяет точки, которые задают оси и начало координат плоскости.
Метод переопределяет точки, которые задают оси и начало координат плоскости.
Notes
Направляющие векторы осей, определяемых точками u и v, обязаны быть неколлинеарными.
u: Точка, определяющая направление оси uAxis. Тип Point3d.
origin: Точка, определяющая начало координат плоскости.   Тип Point3d.
v: Точка, определяющая направление оси vAxis. Тип Point3d.

Teigha.Geometry.Plane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод переопределяет плоскость, задавая новые начало координат и нормальный вектор плоскости.
Метод переопределяет плоскость, задавая новые начало координат pointValue и нормальный вектор плоскости normal.
pointValue: Новое начало координат плоскости.  Тип Point3d.
normal: Новая нормаль плоскости. Тип Vector3d. Не может иметь ненулевую длину.

Teigha.Geometry.Plane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод переопределяет плоскость, используя новые начало координат и направляющие векторы осей.
Конструктор класса Plane.
Создает плоскость, используя заданные начало координат origin и направляющие векторы осей u и v.
Notes
Векторы u и v не должны быть коллинеарными.
origin: Начало координат. Тип Point3d.
u: Направляющий вектор оси uAxis. Тип Vector3d.
v: Направляющий вектор оси vAxis. Тип Vector3d.