HostMgd.EditorInput.Jig
Класс Jig предназначен для создания пользовательских примитивов или группы пользовательских примитивов в интерактивном режиме.
Технология Jig позволяет создавать пользовательские примитивы/группы примитивов в динамике, посредством наблюдения за их изменением во время перетаскивания курсора мыши на экране.
Абстрактный класс. Является базовым классом для классов  и .
Класс позволет создавать пользовательские примитивы или группы
пользовательских примитивов в интерактивном режиме (далее технология Jig).
Во время создания примитива/группы примитивов с помощью технологии Jig происходит цикличный процесс, во время которого:
берутся данные о положении курсора мыши на экране;
данные преобразуются в параметры, необходимые для построения создаваемого объекта/группы объектов;
вывод на экран графического представления создаваемого объекта/группы объектов.
Таким образом, технология Jig позволяет создавать пользовательские примитивы/группы примитивов в динамике,
посредством наблюдения за их изменением во время перетаскивания курсора мыши на экране.

HostMgd.EditorInput.Jig.GetDynamicDimensionData(System.Double)
Метод обрабатывает данные об изменениях размера объекта при перемещении курсора мыши.
Переопределяемый метод. Обрабатывает данные об изменениях размеров объекта при изменении положения курсора мыши.
dimScale: Масштаб объекта
Returns:

HostMgd.EditorInput.Jig.OnDimensionValueChanged(Teigha.DatabaseServices.DynamicDimensionChangedEventArgs)
Обработчик события перемещения курсора мыши
Переопределяемый метод. Вызывается на каждое перемещение мыши для обработки этого события.
e: Аргумент события перемещения курсора мыши

HostMgd.EditorInput.Jig.Sampler(HostMgd.EditorInput.JigPrompts)
параметры положения курсора мыши на экране или данные, введенные с клавиатуры.
Переопределяемый метод. Вызывается на каждое перемещение мыши и получает
параметры положения курсора мыши на экране или данные, введенные с клавиатуры.
prompts: Параметры положения курсора мыши, либо данные, введенные с клавиатуры
Returns: положения курсора мыши или ввода с клавиатуры.