HostMgd.EditorInput.SelectionFlags
Это перечисление содержит битовые признаки для процесса
выбора геометрических объектов. Эти данные используются
методами, которые добавляют или удаляют геометрические
объекты из поднабора выбора.
Члены            Описание
---------------  --------------------------------------------------
Duplicates       Разрешен повторяющийся выбор
= 2
FailedPickAuto   Выбор завершен в результате отсутствия базовой
= 0x200          точки в режиме PICKAUTO, после чего nanoCAD
выполняет следующее действие по выбору по
пересечению или включении в окно в соответствии со
следующей базовой точкой
NestedEntities   Разрешен выбор вложенных геометрических объектов
= 4
Normal = 0       Обычный режим выбора геометрических объектов
PickfirstSet     Используется набор Pickfirst
= 0x20
PickPoints       Требуются настоящие базовые точки
= 1
PreviousSet      Предыдущий выбранный набор
= 0x40
SinglePick       Требует одиночной базовой точки
= 0x10
SubEntities      Требуется выбор набора геометричесих подобъектов
= 8
SubSelection     Когда этот признак установлен, указывает, что
= 0x80           параметр ":U" был использован при вызове
HostSSGet() и что полученный набор выбранных
объектов может содержать информацию о
геометрических подобъектах
Undo =           nanoCAD выполняет операцию отката выбора
0x100