Teigha.GraphicsSystem.ViewportBorderProperties
Структура ViewportBorderProperties представляет параметры границы видового экрана.
Структура ViewportBorderProperties представляет параметры границы видового экрана.

Teigha.GraphicsSystem.ViewportBorderProperties.#ctor(System.Drawing.Color,System.Int32)
Конструктор структуры ViewportBorderProperties. Создает экземпляр структуры с указанными цветом и толщиной линий.
Конструктор структуры ViewportBorderProperties. Создает экземпляр структуры с указанными цветом и толщиной линий.
color: Цвет границы. Тип System.Drawing.Color.
weight: Толщина границы в пикселях. Тип int.

Teigha.GraphicsSystem.ViewportBorderProperties.Color
Свойство Color представляет цвет линий границы видового экрана.
Свойство Color представляет цвет линий границы видового экрана.
Returns: Возвращает цвет границы.  Тип System.Drawing.Color.

Teigha.GraphicsSystem.ViewportBorderProperties.Weight
Свойство Weight представляет толщину (в пикселях) линий границы видового экрана.
Свойство Weight представляет толщину (в пикселях) линий границы видового экрана.
Returns: Возвращает толщину линий границы (в пикселях).
Тип int.