Teigha.DatabaseServices.Filters.FilteredBlockIterator
Данный класс реализует итераторы, выполняющие проход по запросам, которые определены объектами Filter в записях таблицы блоков.
Данный класс реализует итераторы, выполняющие проход по запросам, которые определены объектами Filter в записях таблицы блоков.  Используется перечислителем FilteredBlockIterator.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Accepts(Teigha.DatabaseServices.ObjectId)
Метод предоставляет возможность проверить, проходит ли указанный объект запрос объекта Filter.
Метод предоставляет возможность проверить, проходит ли указанный объект запрос объекта Filter.
id: Входной идентификатор проверяемого объекта. Тип ObjectId.
Returns: Возвращает true тогда и только тогда, когда указанный объект удовлетворяет запросу.
В противном случае возвращает false.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.AddToBuffer(Teigha.DatabaseServices.ObjectId)
Метод позволяет добавить указанный идентификатор объекта чертежа в буфер, поддерживаемый итератором индекса.
Метод позволяет добавить указанный идентификатор объекта чертежа в буфер, поддерживаемый итератором индекса.
id: Идентификатор добавляемого объекта чертежа. Тип ObjectId.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Seek(Teigha.DatabaseServices.ObjectId)
Метод Seek() реализует устаревший метод обобщенного обхода индекса, используемый для поддержки эмуляции устаревшей базы данных.
Метод Seek() реализует устаревший метод обобщенного обхода индекса, используемый для поддержки эмуляции устаревшей базы данных.
id: Идентификатор искомого объекта. Тип ObjectId.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.BuffersForComposition
Свойство позволяет проверить, должен ли итератор индекса, если он не является основным итератором, буферизовать свои выходные данные.
Свойство BuffersForComposition позволяет проверить, должен ли итератор индекса, если он не является основным итератором, буферизовать свои выходные данные. Если должен, свойство возвращает true.
В случае значения false «настоящий» обход индекса выполняется только в первой паре индекс/фильтр, а последующие пары запрашиваются через вызовы метода Accepts().
В случае значения true после того, как все идентификаторы из предыдущего итератора были добавлены в буфер, для перебора данных должны использоваться метод Start() и свойства Next и Id этого итератора.
Returns: Возвращает true тогда и только тогда, когда итератор индекса, если он не является основным итератором, должен буферизовать свои выходные данные. В противном случае возвращает false.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.EstimatedHitFraction
Свойство EstimatedHitFraction используется для определения приоритета, согласно которому объекты FilteredBlockIterator будут использоваться в процессе обхода блоков.
Свойство EstimatedHitFraction используется для определения приоритета, согласно которому объекты FilteredBlockIterator будут использоваться в процессе обхода блоков.  Свойство возвращает предполагаемую долю в интервале [0.0 .. 1.0] объема содержимого индекса, который будет обработан на основе запроса фильтра.
* 0.0 означает, что итератор должен быть первым, используемым для обхода.
* 1.0 означает, что итератор должен быть последним использованным итератором.
Returns: Возвращает предполагаемую долю в интервале [0.0 .. 1.0] объема содержимого индекса, который будет обработан на основе запроса фильтра. Тип double.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Id
Свойство Id возвращает идентификатор объекта в текущей позиции итератора.
Свойство Id возвращает идентификатор объекта в текущей позиции итератора.
Returns: Возвращает идентификатор объекта в текущей позиции итератора. Тип ObjectId.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Next
Свойство Next получает доступ к текущей позиции итератора и возвращает следующий идентификатор объекта ObjectId.
Свойство Next получает доступ к текущей позиции итератора и возвращает следующий идентификатор объекта ObjectId.
Returns: Возвращает следующий идентификатор объекта ObjectId.