HostMgd.EditorInput.PromptSelectionOptionsEventArgs.GetPoints
Метод возвращает коллекцию точек, связанных с операцией выбора объектов
— например, точек указания, использованных при выборе.
Метод предназначен для получения массива точек (Point3dCollection),
которые были указаны пользователем в ходе операции выбора объектов.
Эти точки могут соответствовать:
* начальной и конечной точкам рамки выбора,
* точкам нажатия при выборе мышью,
* промежуточным точкам при построении полигональной области выбора.
Этот метод особенно полезен при реализации команд, где требуется анализ
не только выбранных объектов, но и геометрии выборки — например, для фильтрации
по области, построения границ или реализации пользовательских алгоритмов привязки.
Returns: Возвращает объект типа Point3dCollection — коллекцию трёхмерных точек (Point3d),
заданных в мировой системе координат (WCS).
* Если точки были указаны (например, при построении рамки или полигона), они включаются в коллекцию.
* Если выбор выполнен без указания точек (например, через команду "Все"), коллекция может быть пустой или содержать одну точку.
* Если операция не была запущена или точки не зафиксированы, возвращается пустая коллекция (не null).
Example
C#