Teigha.DatabaseServices.ObjectContextCollectionEnumerator.IEnumerator_get_Current
Метод позволяет получить текущий элемент коллекции.
Метод позволяет получить текущий элемент коллекции.
Returns: Возвращает элемент коллекции. Тип Object.