Teigha.DatabaseServices.HighlightOverrule
Этот класс переопределяет подмножество операций подсвечивания, определенных для объекта чертежа.
Он является базовым классом для настройки поведения классов, производных от класса Entity.
Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.
Этот класс переопределяет подмножество операций подсвечивания, определенных для объекта чертежа.
Он является базовым классом для настройки поведения классов, производных от класса Entity.
Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.

Teigha.DatabaseServices.HighlightOverrule.Highlight(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath,System.Boolean)
Метод реализует подсвечивание указанного пути к подобъекту в данном объекте чертежа.
Метод реализует подсвечивание указанного пути к подобъекту в данном объекте чертежа.
entity: Объект, тип Entity,
subId: Полный путь к подсвечиваемому подобъекту, тип FullSubentityPath,
highlightAll: Если флаг имеет значение true, то подсвечивание выполняется во всех видовых экранах. Тип bool.

Teigha.DatabaseServices.HighlightOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает режим поиска по словарю расширений для фильтрации объектов, к которым будут применены переопределения.
Метод включает режим поиска по словарю расширений для фильтрации объектов, к которым будут применены переопределения.
Используйте этот метод, если требуется, чтобы nanoCAD искал в словаре расширений запись с именем entryName для переопределяемого объекта прежде чем вызвать любое из ваших переопределений.
Переопределения не будут вызываться, если entryName отсутствует в словаре расширений.
entryName: Имя записи, тип String.

Teigha.DatabaseServices.HighlightOverrule.SetIdFilter(array)
Метод включает  режим фильтрации по ObjectId при поиске объектов, к которым будут применены переопределения.
Переопределение будет вызвано только для объектов, чьи id присутствуют в заданном списке идентификаторов.
Метод включает режим фильтрации по ObjectId при поиске объектов, к которым будут применены переопределения.
Используйте этот метод, если требуется, чтобы nanoCAD вызывал ваше переопределение только для объектов, чьи ObjectId присутствуют в заданном списке идентификаторов.
ids: Массив идентификаторов ObjectId.

Teigha.DatabaseServices.HighlightOverrule.SetXDataFilter(String)
Метод включает предварительную фильтрацию объектов по расширенным данным (xdata) прежде чем применить переопределения.
Метод включает предварительную фильтрацию объектов по расширенным данным (xdata) прежде чем применить переопределения.
Используйте этот метод, когда требуется, чтобы nanoCAD выполнял поиск xdata с registeredApplicationName в переопределяемом объекте перед вызовом любого из ваших переопределений.
registeredApplicationName: Имя зарегистрированного приложения, тип String.

Teigha.DatabaseServices.HighlightOverrule.Unhighlight(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath,System.Boolean)
Отменяет в данном объекте подсвечивание указанного пути к подобъекту.
Отменяет в данном объекте подсвечивание указанного пути к подобъекту.
entity: Объект, тип Entity.
subId: Полный путь к подобъекту для отмены подсвечивания, тип FullSubentityPath.
highlightAll: Если данный флаг имеет значение true, то отмена подсвечивания выполняется во всех видовых экранах. Тип bool.