Teigha.DatabaseServices.TableStyleOverride.HeaderHorizontalInsideVisibility
Значение: 107 = 0x6b.
Переопределение видимости внутренних горизонтальных линий сетки в строках заголовков столбцов таблицы.