Teigha.DatabaseServices.NurbSurface
Класс NurbSurface представляет в базе данных поверхности, для математического описания которых используются неоднородные рациональные B-сплайны (NURBS).
Класс NurbSurface представляет в базе данных поверхности, для математического описания которых используются неоднородные рациональные B-сплайны (NURBS).

Teigha.DatabaseServices.NurbSurface.#ctor
Конструктор по умолчанию класса NurbSurface.
Конструктор по умолчанию класса NurbSurface.

Teigha.DatabaseServices.NurbSurface.#ctor(System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Конструктор класса NurbSurface. Создает NURBS поверхность, используя предоставленные параметры.
Конструктор класса NurbSurface. Создает NURBS поверхность, используя предоставленные параметры.
uDegree: Степень сплайна в направлении u. Тип int.
vDegree: Степень сплайна в направлении v. Тип int.
rational: Если сплайн является рациональным, следует передать значение true, в противном случае передать false. Тип bool.
uNumControlPoints: Количество управляющих вершин в направлении u. Тип int.
vNumControlPoints: Количество управляющих вершин в направлении v. Тип int.
ctrlPts: Массив управляющих вершин сплайна. Тип Point3dCollection.
weights: Массив весов. Тип DoubleCollection.
uKnots: Узловой вектор в направлении u. Тип KnotCollection.
vKnots: Узловой вектор в направлении v. Тип KnotCollection.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
dU: Параметр в направлении U. Тип double.
dV: Параметр в направлении V. Тип double.
Returns: Возвращает 3D-точку на NURBS поверхности. Тип Point3d.
Notes
Если поверхность не содержит никакой NURBS информации, выбрасывается исключение eFail.
Если любое из значений dU или dV выходит за пределы допустимого диапазона, генерируется исключение eOutOfRange. Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,System.Int32,Point3d%,Vector3dCollection%)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
Дополнительно метод вычисляет массив производных по указанному параметру u или v.
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
Дополнительно метод вычисляет массив первых производных по u или по v в зависимости от значения входного параметра derivDegree - 0 или 1, соответственно.
dU: Входной параметр в направлении U. Тип double.
dV: Входной параметр в направлении V. Тип double.
derivDegree: Входной аргумент, определяющий выбор параметра u или v для вычисления массива derivatives.  Тип int. Параметру u соответствует значение 0, параметру v - значение 1.
point: Вычисленная 3D-точка на NURBS поверхности. Тип Point3d.
derivatives: Вычисленный массив первых производных по указанному параметру. Тип Vector3dCollection.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Point3d%,Vector3d%,Vector3d%)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
Дополнительно метод вычисляет в этой точке первые производные по u и v.
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
Дополнительно метод вычисляет в этой точке первые производные по u и v.
dU: Входной параметр в направлении U. Тип double.
dV: Входной параметр в направлении V. Тип double.
pos: Вычисленная 3D-точка на NURBS поверхности. Тип Point3d.
uDeriv: Вычисленная первая производная по u в заданной точке. Тип Vector3d.
vDeriv: Вычисленная первая производная по v в заданной точке. Тип Vector3d.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Point3d%,Vector3d%,Vector3d%,Vector3d%,Vector3d%,Vector3d%)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
Дополнительно метод вычисляет в этой точке первые и вторые производные по параметрам u и v.
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров (dU, dV).
Дополнительно метод вычисляет в этой точке первые и вторые производные по параметрам u и v.
dU: Входной параметр в направлении U. Тип double.
dV: Входной параметр в направлении V. Тип double.
pos: Вычисленная 3D-точка на NURBS поверхности. Тип Point3d.
uDeriv: Вычисленная первая производная по u в заданной точке. Тип Vector3d.
vDeriv: Вычисленная первая производная по v в заданной точке. Тип Vector3d.
uuDeriv: Вычисленная вторая производная по u в заданной точке. Тип Vector3d.
uvDeriv: Вычисленная вторая производная по u и по v в заданной точке. Тип Vector3d.
vvDeriv: Вычисленная вторая производная по v в заданной точке. Тип Vector3d.

Teigha.DatabaseServices.NurbSurface.GetControlPointAt(System.Int32,System.Int32)
Метод позволяет вычислить управляющую вершину для заданной позиции в массиве управляющих вершин.
Метод позволяет вычислить управляющую вершину (в мировой системе координат WCS) для заданной позиции в массиве управляющих вершин.
Если поверхность не содержит информации о управляющих вершин, метод выбрасывает исключение eFail.
Метод выбрасывает исключение eOutOfRange, если входные аргументы uIndex или vIndex оказываются недействительными.
uIndex: Индекс управляющей вершины в направлении u. Тип int. Начальное значение индекса равно 0.
vIndex: Индекс управляющей вершины в направлении v. Тип int. Начальное значение индекса равно 0.
Returns: Возвращает положение управляющей вершины. Тип Point3d.

Teigha.DatabaseServices.NurbSurface.GetIsolineAtU(System.Double)
Метод предназначен для вычисления изопараметрической линии с заданным значением u.
Изолинии создаются в направлении v.
Метод предназначен для вычисления изопараметрической линии с заданным значением u.
Изолинии создаются в направлении v.
Если у поверхности есть отверстия, то изопараметрическая линия может состоять из нескольких сегментов.
Если поверхность не содержит никакой информации NURBS, метод генерирует исключение eFail.
dU: Входное значение параметра U. Тип double.
Returns: Возвращает изолинию как массив кривых. Тип Curve[].

Teigha.DatabaseServices.NurbSurface.GetIsolineAtV(System.Double)
Метод предназначен для вычисления изопараметрической линии с заданным значением v.
Изолинии создаются в направлении u.
Метод предназначен для вычисления изопараметрической линии с заданным значением v.
Изолинии создаются в направлении u.
Если у поверхности есть отверстия, то изопараметрическая линия может состоять из нескольких сегментов.
Если поверхность не содержит никакой информации NURBS, метод генерирует исключение eFail.
dV: Входное значение параметра V. Тип double.
Returns: Возвращает изопараметрическую линию как массив кривых. Тип Curve[].

Teigha.DatabaseServices.NurbSurface.GetNormal(System.Double,System.Double)
Метод вычисляет вектор нормали к поверхности в точке, заданной параметрическими координатами ([u, v]).
Метод вычисляет вектор нормали к поверхности в точке, заданной параметрическими координатами ([u, v]).
Если поверхность не содержит информации об управляющих вершинах, метод выбрасывает исключение eFail.
Метод выбрасывает исключение eOutOfRange, если входные аргументы dU  или dV оказываются недействительными.
dU: Входное значение параметра U. Тип double.
dV: Входное значение параметра V. Тип double.
Returns: Возвращает вектор нормали к поверхности. Тип Vector3d.

Teigha.DatabaseServices.NurbSurface.GetParameterOfPoint(Teigha.Geometry.Point3d,[Out]double%,[Out]double%)
Метод позволяет определить параметры u и v для заданной точки на поверхности.
Метод позволяет определить параметры u и v для заданной точки на поверхности.
Если поверхность не содержит информации об управляющих вершинах, метод генерирует исключение eFail.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
point: Точка, лежащая на данной поверхности. Тип Point3d.
dU: Выходное значение параметра u. Тип double.
dV: Выходное значение параметра v. Тип double.

Teigha.DatabaseServices.NurbSurface.GetWeight(System.Int32,System.Int32)
Метод позволяет определить значение веса в указанной позиции массива весов, заданной параметрами iUIndex и iVIndex.
Метод позволяет определить значение веса в указанной позиции массива весов, заданной параметрами iUIndex и iVIndex.
Возвращает действительное значение веса только в том случае, если поверхность является рациональной.
Если поверхность не содержит информации о весах, метод генерирует исключение eFail.
Если значения iUIndex или iVIndex недопустимы, выдается исключение eOutOfRange.
iUIndex: Индекс веса в направлении u. Тип int. Начальное значение индекса равно нулю.
iVIndex: Индекс веса в направлении v. Тип int. Начальное значение индекса равно нулю.
Returns: Возвращает значение веса. Тип double.

Teigha.DatabaseServices.NurbSurface.InsertControlPointsAtU(System.Double,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection)
Метод позволяет вставить строку управляющих вершин для заданного значения параметра u узла.
Метод позволяет вставить строку управляющих вершин для заданного значения параметра u узла.
Если поверхность не содержит никакой информации NURBS, метод выбрасывает исключение eFail.
Если входное значение параметра dU выходит за пределы допустимого диапазона, выбрасывается исключение eOutOfRange.
dU: Входное значение параметра U. Тип double.
vCtrlPts: Входной массив добавляемых управляющих вершин. Тип Point3dCollection.
vWeights: Входной массив добавляемых весов, если поверхность является рациональной. Тип DoubleCollection.

Teigha.DatabaseServices.NurbSurface.InsertControlPointsAtV(System.Double,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection)
Метод позволяет вставить строку управляющих вершин для заданного значения параметра v узла.
Метод позволяет вставить строку управляющих вершин для заданного значения параметра v узла.
Если поверхность не содержит никакой информации NURBS, метод выбрасывает исключение eFail.
Если входное значение параметра dU выходит за пределы допустимого диапазона, выбрасывается исключение eOutOfRange.
dV: Входное значение параметра V.  Тип double.
vCtrlPts: Входной массив добавляемых управляющих вершин. Тип Point3dCollection.
vWeights: Входной массив добавляемых весов, если поверхность является рациональной. Тип DoubleCollection.

Teigha.DatabaseServices.NurbSurface.InsertKnotAtU(System.Double)
Метод вставляет узел с указанным значением параметра u без изменения формы поверхности.
Метод вставляет узел с указанным значением параметра u.
Добавление нового узла не меняет форму поверхности.
Метод добавляет новый ряд управляющих вершин в направлении v и корректирует положение локальной управляющей вершины.
Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail.
Если кратность узлов поверхности для параметра u превышает степень сплайна в направлении u, выбрасывается исключение eInvalidInput.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
dU: Входное значение параметра U. Тип double.

Teigha.DatabaseServices.NurbSurface.InsertKnotAtV(System.Double)
Метод вставляет узел с указанным значением параметра v без изменения формы поверхности.
Метод вставляет узел с указанным значением параметра v.
Добавление нового узла не меняет форму поверхности.
Метод добавляет новый ряд управляющих вершин в направлении u и корректирует положение локальной управляющей вершины.
Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail.
Если кратность узлов поверхности для параметра v превышает степень сплайна в направлении v, выбрасывается исключение eInvalidInput.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
dV: Входное значение параметра V. Тип double.

Teigha.DatabaseServices.NurbSurface.IsPlanar([Out]Point3d%,[Out]Vector3d%)
Метод позволяет проверить, является ли данная поверхность плоской.
Если поверхность представляет собой плоскость, метод дополнительно возвращает информацию о плоскости и ее нормали.
Метод позволяет проверить, является ли данная поверхность плоской.
Если поверхность плоская, метод дополнительно возвращает информацию о плоскости и ее нормали.
Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail.
ptOnSurface: Если поверхность является плоской, возвращает точку на этой плоскости. Тип Point3d.
normal: Если поверхность является плоской, возвращает нормаль этой плоскости. Тип Point3d.
Returns: Возвращает true, если поверхность представляет собой плоскость.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbSurface.IsPointOnSurface(Teigha.Geometry.Point3d)
Метод позволяет проверить, располагается ли указанная точка на данной поверхности.
Метод позволяет проверить, располагается ли указанная точка на данной поверхности.
Если поверхность не содержит никакой NURBS информации, метод выбрасывает исключение eFail.
point: Входная проверяемая точка. Тип Point3d.
Returns: Возвращает true, если точка принадлежит поверхности.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbSurface.ModifyPosition(System.Double,System.Double,Teigha.Geometry.Point3d)
Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]).
В текущей версии не реализован.
Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]).
Соответствующим образом корректируются также и локальные управляющее вершины.
В текущей версии не реализован.
dU: Входной параметр U. Тип double.
dV: Входной параметр V. Тип double.
point: Новые координаты точки на поверхности. Тип Point3d.

Teigha.DatabaseServices.NurbSurface.ModifyPositionAndTangent(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]) и касательные вектора в этой точке. В текущей версии не реализован.
Метод позволяет изменить положение точки на поверхности с указанным параметром ([u, v]) и касательные вектора по u и v в этой точке.
Соответствующим образом корректируются и локальные управляющие вершины.
Если параметры uDeriv и vDeriv имеют значение NULL, изменится только положение точки.
В текущей версии не реализован.
dU: Входной параметр U. Тип double.
dV: Входной параметр V. Тип double.
point: Новые координаты точки на поверхности. Тип Point3d.
uDeriv: Касательный вектор в направлении u. Тип Vector3d.
vDeriv: Касательный вектор в направлении v. Тип Vector3d.

Teigha.DatabaseServices.NurbSurface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32)
Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях u и v.  В текущей версии не реализован.
Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях u и v. Эта операция изменяет форму поверхности.
В текущей версии не реализован.
iUDegree: Новая степень сплайна в направлении u. Тип int.
iVDegree: Новая степень сплайна в направлении v.  Тип int.
iNumUCtrlPts: Новое количество управляющих вершин в направлении u. Тип int.
iNumVCtrlPts: Новое количество управляющих вершин в направлении v.  Тип int.

Teigha.DatabaseServices.NurbSurface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean)
Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях u и v. Поддерживается режим восстановления поверхности.
В текущей версии не реализован.
Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях u и v. Эта операция изменяет форму поверхности.  Дополнительный логический аргумент позволяет включить режим восстановления формы поверхности.
В текущей версии не реализован.
iUDegree: Новая степень сплайна в направлении u. Тип int.
iVDegree: Новая степень сплайна в направлении v.  Тип int.
iNumUCtrlPts: Новое количество управляющих вершин в направлении u. Тип int.
iNumVCtrlPts: Новое количество управляющих вершин в направлении v.  Тип int.
bRestore: Флаг восстановления формы поверхности. Тип bool.

Teigha.DatabaseServices.NurbSurface.RemoveControlPointsAtU(System.Int32)
Метод удаляет из массива управляющих вершин ряд точек с указанным индексом в направлении u.
Метод удаляет из массива управляющих вершин ряд точек с указанным индексом в направлении u.
Эта операция влияет на форму поверхности.
Если поверхность не содержит никакой NURBS информации, метод генерирует исключение eFail.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
iUIndex: Исходный индекс в направлении u удаляемого ряда управляющих вершин. Тип int.

Teigha.DatabaseServices.NurbSurface.RemoveControlPointsAtV(System.Int32)
Метод удаляет из массива управляющих вершин ряд с указанным индексом в направлении v.
Метод удаляет из массива управляющих вершин ряд с указанным индексом в направлении v.
Эта операция влияет на форму поверхности.
Если поверхность не содержит никакой NURBS информации, метод генерирует исключение eFail.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
iVIndex: Исходный индекс в направлении V удаляемого ряда управляющих вершин. Тип int.

Teigha.DatabaseServices.NurbSurface.Set(System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Метод предоставляет возможность задать новые данные для существующей NURBS поверхности.
Метод предоставляет возможность задать новые данные для существующей NURBS поверхности.
Индексы столбцов относятся к направлению v, а индексы рядов — к направлению u.
Например, если поверхность имеет m управляющих вершин в направлении u и n управляющих вершин в направлении v, массив выглядит как [0,0], [0,1], ...[0,n-1], ..., [m-1,0], [m-1,1], ... [m-1,n-1].
Если поверхность является рациональной, массив весов должен состоять из такого же количества элементов, что и массив управляющих вершин.
Все значения веса должны быть положительными.
Значения в массивах весов и управляющих вершин должны иметь тот же порядок следования, что и массив управляющих вершин.
Если поверхность нерациональная, массив весов должен быть пустым.
Если поверхность не является периодической в направлении u, размерность узлового вектора uKnots должна быть равной uNumControlPoints + uDegree + 1. Если поверхность периодична в направлении u, размерность узлового вектора uKnots должна равняться uNumControlPoints + 1.
Аналогично, если поверхность не является периодической в направлении v, размерность узлового вектора vKnots должна быть равной vNumControlPoints + vDegree + 1. Если поверхность периодична в направлении v, размерность узлового вектора vKnots должна равняться vNumControlPoints + 1.
Последовательность значений в узловом векторе должна быть неубывающей.
Если какой-либо из переданных параметров недействителен, поверхность создана не будет.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
iUDegree: Новая степень сплайна в направлении u. Тип int.
iVDegree: Новая степень сплайна в направлении v. Тип int.
bRational: Входной флаг, который определяет, что поверхность является рациональной (новое значение). Тип bool.
iUNumControlPoints: Новое количество управляющих вершин в направлении u. Тип int.
iVNumControlPoints: Новое количество управляющих вершин в направлении v. Тип int.
ctrlPts: Новый массив управляющих вершин (в мировой системе координат WCS). Тип Point3dCollection.
weights: Новый массив весов в каждой управляющей вершине. Тип DoubleCollection.
knotsInU: Новый узловой вектор в направлении u. Тип KnotCollection.
knotsInV: Новый узловой вектор в направлении v. Тип KnotCollection.

Teigha.DatabaseServices.NurbSurface.SetControlPointAt(System.Int32,System.Int32,Teigha.Geometry.Point3d)
Метод позволяет задать новую управляющую вершину в указанной позиции массива управляющих вершин.
Метод позволяет задать новую управляющую вершину (в мировой системе координат WCS) в указанной позиции массива управляющих вершин.
Если поверхность не содержит информации об управляющих вершинах, метод генерирует исключение eFail.
Если параметры iUDegree или iVDegree выходят за пределы допустимого диапазона, выбрасывается исключение eOutOfRange.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
iUDegree: Индекс управляющей вершины в направлении u. Тип int. Начальное значение 0.
iVDegree: Индекс управляющей вершины в направлении v. Тип int. Начальное значение 0.
point: Новая управляющая вершина, которая создается в указанной позиции [(u,v)]. Тип Point3d. Координаты определяются в мировой системе координат WCS.

Teigha.DatabaseServices.NurbSurface.SetControlPoints(System.Int32,System.Int32,Teigha.Geometry.Point3dCollection)
Метод позволяет задать для поверхности новый массив управляющих вершин.
Метод позволяет задать для поверхности новый массив управляющих вершин.
Если поверхность не содержит информации об управляющих вершинах, метод генерирует исключение eFail.
Параметры iUDegree или iVDegree должны быть равны количествам управляющих вершин, которые в данный момент используются для данной поверхности для направлений u и v, соответственно. В противном случае будет выброшено  исключение eInvalidInput.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
Индексы столбцов относятся к направлению v, а индексы строк — к направлению u.
Точки массива в коллекции points следует располагать построчно следующим образом: [0,0], [0,1], ...[0,vCount-1], ..., [uCount-1,0], [uCount- 1,1], ...[uCount-1,vCount-1].
iUDegree: Новое количество управляющих вершин в направлении u. Тип int.
iVDegree: Новое количество управляющих вершин в направлении v. Тип int.
points: Новый массив управляющих вершин, заданных в координатах WCS. Тип Point3dCollection.

Teigha.DatabaseServices.NurbSurface.SetWeight(System.Int32,System.Int32,System.Double)
Метод позволяет задать новое значение веса в указанной позиции массива весов.
Если поверхность не является рациональной, метод ничего не делает.
Метод позволяет задать новое значение веса в указанной позиции массива весов.
Если поверхность не является рациональной, метод ничего не делает.
Если поверхность не содержит информации о весах, метод генерирует исключение eFail.
Если значения параметров iUDegree или iVDegree выходят за пределы допустимого диапазона, выбрасывается исключение eOutOfRange.
Если этот метод в конкретном моделере не реализован, выбрасывается исключение eNotImplementedYet.
iUDegree: Индекс значения веса в направлении u. Тип int.
iVDegree: Индекс значения веса в направлении v. Тип int.
dWeight: Новое значение веса, которое устанавливается в указанной позиции. Тип double.

Teigha.DatabaseServices.NurbSurface.ControlPoints
Свойство возвращает коллекцию, в которой представлены управляющее вершины данной поверхности для обоих направлений u и v.
Свойство возвращает коллекцию, в которой содержатся управляющее вершины данной поверхности (в координатах WCS) для обоих направлений u и v.
Точки в коллекции представлены по строкам.
Например, если поверхность имеет uCount управляющих вершин в направлении u и vCount управляющих вершин в направлении v, то последовательность управляющих вершин в коллекции имеет вид [0,0], [0,1], ...[0,vCount-1] , ..., [uCount-1,0], [uCount-1,1], ...[uCount-1,vCount-1].
Returns: Возвращает коллекцию управляющих вершин. Тип Point3dCollection.

Teigha.DatabaseServices.NurbSurface.DegreeInU
Свойство представляет степень NURBS поверхности в направлении u.
Свойство представляет степень NURBS поверхности в направлении u.
Returns: Возвращает степень NURBS поверхности. Тип int.

Teigha.DatabaseServices.NurbSurface.DegreeInV
Свойство представляет степень NURBS поверхности в направлении v.
Свойство представляет степень NURBS поверхности в направлении v.
Returns: Возвращает степень NURBS поверхности. Тип int.

Teigha.DatabaseServices.NurbSurface.IsClosedInU
Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении u.
Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении u.
Returns: Возвращает true, если поверхность в указанном направлении является замкнутой.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbSurface.IsClosedInV
Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении v.
Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении v.
Returns: Возвращает true, если поверхность в указанном направлении является замкнутой.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbSurface.IsPeriodicInU
Свойство позволяет проверить, является ли данная поверхность периодической в направлении u.
Свойство позволяет проверить, является ли данная поверхность периодической в направлении u.
Returns: Возвращает true, если поверхность в указанном направлении является периодической.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbSurface.IsPeriodicInV
Свойство позволяет проверить, является ли данная поверхность периодической в направлении v.
Свойство позволяет проверить, является ли данная поверхность периодической в направлении v.
Returns: Возвращает true, если поверхность в указанном направлении является периодической.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbSurface.IsRational
Свойство позволяет проверить, является ли данная поверхность рациональной.
Свойство позволяет проверить, является ли данная поверхность рациональной.
В случае рациональной поверхности управляющим вершинам поставлены в соответствие конкретные значения весов.
Returns: Возвращает true, если поверхность является рациональной.
В противном случае возвращает false.

Teigha.DatabaseServices.NurbSurface.NumberOfControlPointsInU
Свойство представляет количество управляющих вершин данной поверхности в направлении u.
Свойство представляет количество управляющих вершин данной поверхности в направлении u.
Returns: Возвращает количество управляющих вершин поверхности. Тип int.

Teigha.DatabaseServices.NurbSurface.NumberOfControlPointsInV
Свойство представляет количество управляющих вершин данной поверхности в направлении v.
Свойство представляет количество управляющих вершин данной поверхности в направлении v.
Returns: Возвращает количество управляющих вершин поверхности. Тип int.

Teigha.DatabaseServices.NurbSurface.NumberOfKnotsInU
Свойство представляет количество узлов данной поверхности в направлении u.
Свойство представляет количество узлов данной поверхности в направлении u.
Returns: Возвращает количество узлов поверхности в заданном направлении. Тип int.

Teigha.DatabaseServices.NurbSurface.NumberOfKnotsInV
Свойство представляет количество узлов данной поверхности в направлении v.
Свойство представляет количество узлов данной поверхности в направлении v.
Returns: Возвращает количество узлов поверхности в заданном направлении. Тип int.

Teigha.DatabaseServices.NurbSurface.NumberOfSpansInU
Свойство представляет количество простых поверхностных фрагментов, "сшитых" в направлении u.
Свойство представляет количество простых поверхностных фрагментов (патчей, лоскутов), "сшитых" в направлении u.
Returns: Возвращает количество простых поверхностных фрагментов в указанном направлении. Тип int.

Teigha.DatabaseServices.NurbSurface.NumberOfSpansInV
Свойство представляет количество простых поверхностных фрагментов, "сшитых" в направлении v.
Свойство представляет количество простых поверхностных фрагментов (патчей, лоскутов), "сшитых" в направлении v.
Returns: Возвращает количество простых поверхностных фрагментов в указанном направлении. Тип int.

Teigha.DatabaseServices.NurbSurface.PeriodInU
Свойство представляет значение периода в направлении u, если данная поверхность является периодической в направлении u.
Свойство представляет значение периода в направлении u для данной поверхности.
Это свойство действительно только тогда, когда поверхность периодична в направлении u.
Returns: Возвращает значение периода в указанном направлении. Тип double.

Teigha.DatabaseServices.NurbSurface.PeriodInV
Свойство представляет значение периода в направлении v, если данная поверхность является периодической в направлении v.
Свойство представляет значение периода в направлении v для данной поверхности.
Это свойство действительно только тогда, когда поверхность периодична в направлении v.
Returns: Возвращает значение периода в указанном направлении. Тип double.

Teigha.DatabaseServices.NurbSurface.UKnots
Свойство представляет узловой вектор данной поверхности в направлении u.
Свойство представляет узловой вектор данной поверхности в направлении u.
Returns: Возвращает узловой вектор поверхности. Тип KnotCollection.

Teigha.DatabaseServices.NurbSurface.VKnots
Свойство представляет узловой вектор данной поверхности в направлении v.
Свойство представляет узловой вектор данной поверхности в направлении v.
Returns: Возвращает узловой вектор поверхности. Тип KnotCollection.