HostMgd.ApplicationServices.LongTransactionEventHandler
Делегат предназначен для обработки событий, возникающих в процессе длительных транзакций.
Делегат LongTransactionEventHandler используется как тип обработчика таких событий как CheckedIn, CheckedOut, Aborted и др. в менеджере длительных транзакций LongTransactionManager.
Типичным применением этого делегата являются плагины, где реализуется редактирование внешних ссылок и блоков.
sender: Объект, инициировавший событие. Тип Object.
e: Аргументы события. Тип LongTransactionEventArgs.