Teigha.GraphicsInterface.AbstractClipBoundary
Класс AbstractClipBoundary является базовым для классов, используемых для передачи дополнительной информации о границах обрезки из объектов Drawable в графическую систему платформы.
Класс AbstractClipBoundary является базовым для классов, используемых для передачи дополнительной информации о границах обрезки из объектов Drawable в графическую систему платформы.

Teigha.GraphicsInterface.AbstractClipBoundary.#ctor
Конструктор по умолчанию класса AbstractClipBoundary.
Конструктор по умолчанию класса AbstractClipBoundary.
Создает пустую границу обрезки.

Teigha.GraphicsInterface.AbstractClipBoundary.BoundaryType
Свойство BoundaryType представляет тип границы обрезки.
Свойство BoundaryType представляет тип границы обрезки.
Returns: Возвращает тип границы обрезки.
Тип GraphicsInterface.BoundaryType.