HostMgd.Windows.ToolPalette.CustomToolBase.CreateTool
Метод создаёт объект инструмента.
Не реализован.
Метод создаёт объект инструмента.
В текущей версии не реализован.
Returns: Возвращает созданный объект инструмента.
Тип System.Object.