Teigha.GraphicsSystem.View.Update
Метод предназначен для обновления данного вида.
Метод позволяет обновить данный вид (обновляет свойства вида, обновляет область видового экрана, отрабатывает изменения в слоях, настраивает состояния флагов проверки в зависимости от вызова метода отмены регенерации вида и т.п.).
При вызове в неинтерактивном режиме этот метод сбрасывает на устройство всю графику из очереди.
Это может потребовать полного цикла преобразования и растеризации (что бывает довольно затратным).
При интерактивном вызове метод запрашивает обновление (однако оно не гарантируется); управление немедленно возвращается вызывающей программе, а любые преобразования и растеризация происходят асинхронно.