Teigha.BoundaryRepresentation.PointContainment
Данное перечисление определяет варианты расположения точки относительно границы топологического объекта (внутри / снаружи / на границе).
Данное перечисление определяет варианты расположения точки относительно границы топологического объекта (внутри / снаружи / на границе).