Teigha.Geometry.Ray3d
Класс Ray3d представляет трехмерный луч, полубесконечную линию в трехмерном пространстве.
Класс Ray3d представляет трехмерный луч, полубесконечную линию в трехмерном пространстве.
Объект Ray3d имеет начальную точку, но не имеет конечной.

Teigha.Geometry.Ray3d.#ctor
Конструктор по умолчанию класса Ray3d.
Создает луч с началом в точке (0,0,0) и направляющим вектором (1,0,0).
Конструктор по умолчанию класса Ray3d.
Создает луч с началом в точке (0,0,0) и направляющим вектором (1,0,0) (т.е. вдоль положительного направления оси X).

Teigha.Geometry.Ray3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса Ray3d.
Создает луч по двум несовпадающим 3D-точкам, первая из которых становится начальной точкой луча, а вторая задает его направление.
Конструктор класса Ray3d.
Создает луч, который начинается в точке point1 и проходит через точку point2.
Точки point1 и point2 не могут совпадать.
point1: Точка начала луча. Тип Point3d.
point2: Точка, через которую проходит луч. Тип Point3d. Не может совпадать с точкой point1.

Teigha.Geometry.Ray3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса Ray3d.
Создает луч с указанной точкой начала и заданным направляющим вектором.
Конструктор класса Ray3d.
Создает луч с началом в точке point и направляющим вектором vec.
point: Начальная точка луча.     Тип Point3d.
vec: Направляющий вектор луча. Тип Vector3d.

Teigha.Geometry.Ray3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип Ray3d.

Teigha.Geometry.Ray3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод переопределяет точку начала данного луча и точку, задающую его направление.
Метод переопределяет данный луч, используя точку начала point1 и точку point2, задающую направление луча.
point1: Новая точка начала луча. Тип Point3d.
point2: Новая точка, определяющая направление луча. Тип Point3d. Должна отличаться от точки point1.

Teigha.Geometry.Ray3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод переопределяет точку начала и направляющий вектор данного луча.
Метод переопределяет точку начала и направляющий вектор данного луча.
point: Новая начальная точка луча. Тип Point3d.
vector: Направляющий вектор луча.   Тип Vector3d. Должен иметь ненулевую длину.