HostMgd.EditorInput.Editor.PromptingForNestedEntity
Событие возникает при начале операции выбора вложенного геометрического объекта,
например, внутри блока или внешней ссылки.
Событие не реализовано.
Событие инициируется перед началом интерактивного выбора объекта, находящегося
внутри составного элемента чертежа — такого как блок или внешняя ссылка.
Оно предоставляет доступ к параметрам ввода через объект PromptNestedEntityOptionsEventArgs,
что позволяет разработчику настроить поведение команды выбора до её запуска.
Это событие используется в связке с методом GetNestedEntity(), который позволяет выбрать объект,
вложенный в контейнер, с учётом его трансформации (масштаб, поворот, смещение).
Через событие можно изменить:
* текст приглашения (Message),
* режимы выбора ,
* дополнительные флаги поведения .
Событие реализуется через делегат PromptNestedEntityOptionsEventHandler и вызывается
до отображения запроса пользователю, что даёт возможность адаптировать параметры ввода
в зависимости от контекста — например, изменить сообщение или ограничить типы выбираемых объектов.
Example
C#