Teigha.DatabaseServices.FullSubentityPath
Этот класс реализует однозначную идентификацию подобъектов в базе данных.
Этот класс реализует однозначную идентификацию подобъектов в базе данных.
Каждый экземпляр этого класса включает объект SubentId и упорядоченный массив идентификаторов объектов.
SubentId включает индекс и тип подобъекта subentType.
Массив идентификаторов объектов определяет путь к объекту, содержащему указанный подобъект, начиная с самого внешнего объекта (в пространствах PaperSpace или ModelSpace).

Teigha.DatabaseServices.FullSubentityPath.#ctor(array,Teigha.DatabaseServices.SubentityId)
Конструктор класса FullSubentityPath.
Инициализирует встроенную коллекцию идентификаторов ObjectIdCollection и индекс встроенного подобъекта SubentityId.
Конструктор класса FullSubentityPath.
Инициализирует встроенную коллекцию идентификаторов ObjectIdCollection и индекс встроенного подобъекта SubentityId.
ids: Входной массив идентификаторов объектов. Тип array.
index: Входной идентификатор подобъекта. Тип SubentityId.

Teigha.DatabaseServices.FullSubentityPath.Equals(Object)
Метод предназначен для проверки идентичности данного объекта  указанному объекту.
Метод предназначен для проверки идентичности данного объекта FullSubentityPath указанному объекту obj.
obj: Объект, по отношению к которому выполняется проверка на идентичность. Тип Object.
Returns: Возвращает true, если данный объект идентичен объекту obj.
В противном случае возвращает false.

Teigha.DatabaseServices.FullSubentityPath.!=(Teigha.DatabaseServices.FullSubentityPath,Teigha.DatabaseServices.FullSubentityPath)
Оператор неравенства класса FullSubentityPath.
Оператор неравенства класса FullSubentityPath.
a: Левый операнд.  Тип FullSubentityPath.
b: Правый операнд. Тип FullSubentityPath.
Returns: Возвращает true при несовпадении операндов. В противном случае возвращает false.

Teigha.DatabaseServices.FullSubentityPath.==(Teigha.DatabaseServices.FullSubentityPath,Teigha.DatabaseServices.FullSubentityPath)
Оператор равенства класса FullSubentityPath.
Оператор равенства класса FullSubentityPath.
a: Левый операнд.  Тип FullSubentityPath.
b: Правый операнд. Тип FullSubentityPath.
Returns: Возвращает true при идентичности сравниваемых объектов a и b.
В противном случае возвращает false.

Teigha.DatabaseServices.FullSubentityPath.Null
Свойство возвращает нулевой путь к подобъекту.
Свойство возвращает нулевой путь к подобъекту.
Returns: Возвращает нулевой путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.FullSubentityPath.SubentId
Свойство возвращает копию идентификатора встроенного подобъекта SubentityId.
Свойство возвращает копию идентификатора встроенного подобъекта SubentityId.
Returns: Возвращает идентификатор подобъекта. Тип SubentityId.