Teigha.DatabaseServices.OsnapOverrule
Этот класс переопределяет подмножество операций объектной привязки, которые специфичны для объекта чертежа.
Этот класс переопределяет подмножество операций, связанных с объектной привязкой, которые специфичны для данного объекта чертежа.
Класс используется в качестве базового для настройки поведения производных классов этого объекта чертежа.  Всякая реализация по умолчанию вызывает соответствующий метод целевого класса.

Teigha.DatabaseServices.OsnapOverrule.GetObjectSnapPoints(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.ObjectSnapModes,IntPtr,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection)
Метод предназначен для получения точек объектной привязки.
Метод предназначен для получения точек объектной привязки.
entity: Объект чертежа, тип Entity.
snapMode: Требуемый режим объектной привязки, тип ObjectSnapModes.
gsSelectionMark: Маркер GS подсущности, участвующей в операции объектной привязки, тип  IntPtr.
pickPoint: Координаты в мировой системе координат (WCS) точки, указанной в ходе операции объектной привязки, тип Point3d.
lastPoint: Координаты WCS точки, выбранной непосредственно перед pickPoint, тип Point3d.
viewTransform: Матрица преобразования из WCS в систему координат видового экрана, тип Matrix3d.
snapPoints: Существующий массив для добавления точек привязки, тип Point3dCollection.
geometryIds: Аргумент зарезервирован для будущего использования.

Teigha.DatabaseServices.OsnapOverrule.GetObjectSnapPoints(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.ObjectSnapModes,IntPtr,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection,Teigha.Geometry.Matrix3d)
Метод предназначен для получения точек объектной привязки.
Метод предназначен для получения точек объектной привязки.
entity: Объект чертежа, тип Entity.
snapMode: Требуемый режим объектной привязки, тип ObjectSnapModes.
gsSelectionMark: Маркер GS подсущности, участвующей в операции объектной привязки, тип  IntPtr.
pickPoint: Координаты в мировой системе координат (WCS) точки, указанной в ходе операции объектной привязки, тип Point3d.
lastPoint: Координаты WCS точки, выбранной непосредственно перед pickPoint, тип Point3d.
viewTransform: Матрица преобразования из WCS в систему координат видового экрана, тип Matrix3d.
snapPoints: Существующий массив для добавления точек привязки, тип Point3dCollection.
geometryIds: Аргумент зарезервирован для будущего использования.
insertionMat: Матрица преобразования для блока, тип Matrix3d.

Teigha.DatabaseServices.OsnapOverrule.IsContentSnappable(Teigha.DatabaseServices.Entity)
Метод позволяет выяснить, определена ли объектная привязка для объекта чертежа.
Метод позволяет выяснить, определена ли объектная привязка для объекта чертежа.
entity: Объект чертежа, тип Entity.
Returns: Возвращает true, если объектная привязка возможна, и false в противном случае.

Teigha.DatabaseServices.OsnapOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD искал в словаре расширений запись с именем entryName.  Переопределения не будут вызываться, если запись с entryName не будет найдена в словаре расширений.
entryName: Имя записи в словаре расширений, тип String.

Teigha.DatabaseServices.OsnapOverrule.SetIdFilter(array)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Используйте этот метод, если требуется, чтобы nanoCAD вызывал переопределения только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
ids: Массив идентификаторов ObjectId. Тип ObjectId[].

Teigha.DatabaseServices.OsnapOverrule.SetXDataFilter(String)
Метод позволяет использовать расширенные данные в условии применимости объектного переопределения.
Метод позволяет использовать расширенные данные в условии применимости объектного переопределения.
Используйте этот метод, если требуется, чтобы перед вызовом любого из ваших переопределений nanoCAD выполнял фильтрацию переопределяемых объектов по имени RegisteredApplicationName в расширенных данных.
registeredApplicationName: Имя зарегистрированного приложения, тип String.