HostMgd.EditorInput.PromptDistanceOptions
Класс предоставляет параметры для настройки интерактивного ввода расстояния в nanoCAD,
такие как сообщение, диапазон значений и начальное значение.
Класс используется при вызове методов ввода расстояния — например,
GetDistance() — для задания поведения команды.
С помощью класса можно:
* установить текст приглашения (Message),
* задать значение по умолчанию (DefaultValue),
* разрешить или запретить отрицательные значения (AllowNegative),
* разрешить пропуск ввода с помощью Enter (AllowNone),
* включить режим ввода угла (AllowAngle), если расстояние связано с направлением.
Этот класс позволяет гибко управлять пользовательским интерфейсом при вводе расстояния,
обеспечивая точность и удобство взаимодействия.
Example
C#

HostMgd.EditorInput.PromptDistanceOptions.#ctor(String)
Конструктор инициализирует новый экземпляр класса с
заданным приглашающим сообщением для ввода расстояния.
Конструктор создаёт объект класса PromptDistanceOptions,
используемый при настройке интерактивного ввода расстояния —
например, через метод GetDistance().
Он устанавливает текст приглашения, отображаемый пользователю в командной строке,
а все остальные параметры (такие как DefaultValue, LowerLimit, AllowNone)
инициализируются значениями по умолчанию. После создания объекта эти параметры
можно дополнительно настроить в зависимости от требований команды.
Этот конструктор является основным способом задания начального сообщения,
которое подсказывает пользователю, что нужно сделать — например,
"Введите длину:" или "Укажите расстояние смещения:".
message: Текст приглашения, выводимый в командной строке перед началом ввода расстояния.

HostMgd.EditorInput.PromptDistanceOptions.#ctor(String,String)
Конструктор инициализирует новый экземпляр класса с заданным сообщением,
включающим локальные ключевые слова, и списком глобальных ключевых слов.
Конструктор создаёт объект класса PromptDistanceOptions,
предназначенный для настройки интерактивного ввода расстояния
с поддержкой выбора из ключевых слов.
Он позволяет указать:
* сообщение приглашения , в которое можно включить локальные ключевые слова в квадратных скобках (например: "Введите расстояние [короткое/длинное]:"),
* глобальные ключевые слова , доступные в любой момент операции (например: "Cancel Exit"), независимо от контекста ввода.
Этот конструктор особенно полезен при разработке команд,
где требуется предоставить пользователю выбор между
предопределёнными режимами или действиями во время ввода расстояния.
messageAndKeywords: Строка, содержащая текст приглашения и, опционально,
globalKeywords: Строка, содержащая глобальные ключевые слова, разделённые пробелом.

HostMgd.EditorInput.PromptDistanceOptions.BasePoint
Свойство возвращает или устанавливает базовую точку,
относительно которой происходит интерактивный ввод расстояния.
Свойство используется для задания опорной точки, от которой
может отсчитываться расстояние при интерактивном вводе — например,
при построении направления, смещении объектов или полярном вводе.
Оно позволяет установить начальную позицию, от которой пользователь
указывает вторую точку или вводит значение расстояния.
Свойство доступно как для чтения, так и для записи, что даёт возможность
программно задавать координаты базовой точки в мировой системе координат (WCS).
Часто используется совместно с другими параметрами, такими как UseBasePoint,
чтобы включить привязку к этой точке.
Returns: Возвращает объект типа Point3d, представляющий координаты базовой точки
в мировой системе координат (X, Y, Z). Если точка не задана, возвращается Point3d.Null.
Example
C#

HostMgd.EditorInput.PromptDistanceOptions.DefaultValue
Свойство возвращает или устанавливает значение расстояния,
которое будет использовано, если пользователь нажмёт Enter ,
не вводя другого значения.
Свойство используется для задания расстояния по умолчанию при интерактивном вводе
— например, через метод GetDistance(). Если пользователь просто нажимает Enter ,
не указывая числовое значение или точку, то применяется это предустановленное значение.
Это позволяет ускорить выполнение команд и упростить взаимодействие с пользователем,
особенно когда есть типовое расстояние, используемое чаще других.
Notes
Чтобы значение по умолчанию применялось, необходимо также установить AllowNone = true,
чтобы разрешить завершение ввода без указания точки.
Returns: Возвращает значение типа double, представляющее расстояние по умолчанию в текущих единицах чертежа.
Если значение не задано, возвращается 0.0.
Example
C#

HostMgd.EditorInput.PromptDistanceOptions.Only2d
Свойство предназначено для указания, должно ли возвращаемое значение расстояния
рассматриваться как проекция в плоскости местной системы координат (ПСК),
но в текущей реализации не используется.
Свойство изначально задумано как флаг, определяющий, следует ли интерпретировать
вводимое расстояние только в двухмерной плоскости текущей пользовательской системы координат (ПСК).
Если бы оно поддерживалось, при значении true расстояние вычислялось бы как проекция на
XY-плоскость ПСК, игнорируя Z-компоненту.
Это свойство не используется в текущей версии API nanoCAD.
Оно присутствует в интерфейсе, но не влияет на поведение команды ввода расстояния.
Returns: Возвращает или устанавливает значение типа bool, но изменение этого значения не оказывает эффекта на работу программы.
* true — (теоретически) расстояние ограничивается 2D-проекцией.
* false — расстояние обрабатывается в трёхмерном пространстве.

HostMgd.EditorInput.PromptDistanceOptions.UseBasePoint
Свойство определяет, будет ли использоваться базовая точка
при интерактивном вводе расстояния.
Свойство используется для указания, следует ли учитывать базовую точку (BasePoint)
при вводе расстояния. Если свойство установлено в true, вводимое расстояние
отсчитывается относительно заданной базовой точки, и может отображаться визуальная подсказка
— например, штриховая линия между базовой точкой и текущим положением курсора.
Это особенно полезно при построении объектов, смещении, копировании или других операциях,
где требуется привязка к определённой позиции на чертеже.
Returns: Возвращает значение типа bool:
* true — базовая точка будет использоваться при вводе.
* false — базовая точка не учитывается.
Example
C#

HostMgd.EditorInput.PromptDistanceOptions.UseDashedLine
Свойство включает или отключает отображение штриховой «резиновой» линии
между базовой точкой и текущим положением курсора при вводе расстояния.
Свойство используется для управления визуальной подсказкой при интерактивном
вводе расстояния. Если свойство установлено в true, в редакторе отображается
штриховая линия, соединяющая базовую точку (BasePoint) с текущим положением мыши.
Эта линия помогает пользователю визуально оценить направление и длину вводимого
расстояния, что особенно полезно при выполнении операций, таких как смещение,
копирование или построение объектов.
Для корректной работы UseDashedLine необходимо:
* Установить BasePoint — точку начала линии.
* Включить UseBasePoint = true.
Если UseDashedLine равно false, визуальная линия не отображается,
и пользователь работает без графической привязки.
Returns: Возвращает значение типа bool:
* true — штриховая линия отображается.
* false — штриховая линия скрыта.
Example
C#