HostMgd.EditorInput.Editor.PromptingForAngle
Событие возникает при начале интерактивной операции ввода угла
в редакторе nanoCAD, позволяя модифицировать параметры ввода перед его началом.
Событие не реализовано.
Событие инициируется в момент запуска операции ввода угла — например,
при вызове метода GetAngle(). Оно позволяет разработчикам надстроек nanoCAD
обрабатывать или изменять параметры команды ввода угла, такие как сообщение,
начальное значение, допустимые диапазоны и другие настройки, до того,
как пользователь начнёт взаимодействовать с командой.
Событие реализуется через делегат PromptAngleOptionsEventHandler,
который передаёт объект PromptAngleOptionsEventArgs, содержащий:
* параметры ввода угла (Options),
* точку ввода (Point), если она уже определена,
* контекст операции (Context).
Это событие полезно при настройке поведения команды ввода угла в зависимости от контекста —
например, для установки начального значения,
задания ограничений или изменения сообщения приглашения.
Example
C#