Teigha.BoundaryRepresentation.BrepEntity.CheckEntity
Метод позволяет проверить на наличие ошибок топологию, геометрию и структуру данных объекта.
Метод позволяет проверить на наличие ошибок топологию, геометрию и структуру данных объекта.
Returns: Возвращает true, если проверка не выявила в объекте топологических ошибок.
В противном случае возвращает false.