HostMgd.EditorInput.PromptNestedEntityOptionsEventArgs
Класс предоставляет данные для события PromptingForNestedEntity,
позволяя настроить параметры выбора вложенного геометрического объекта.
Класс используется для передачи параметров, применяемых при начале операции выбора
вложенного объекта — например, при вызове метода GetNestedEntity().
Он предоставляет доступ к объекту PromptNestedEntityOptions, содержащему настройки команды, такие как:
* текст приглашения (Message),
* разрешение на отмену (AllowNone),
* дополнительные флаги поведения .
Этот класс применяется в обработчике события PromptingForNestedEntity, где разработчик может динамически
изменять параметры ввода перед тем, как пользователь начнёт выбирать объект внутри блока или внешней ссылки.

HostMgd.EditorInput.PromptNestedEntityOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при выборе вложенного геометрического объекта.
Свойство возвращает объект типа PromptNestedEntityOptions,
который содержит настройки операции выбора объекта, вложенного
в блок или внешнюю ссылку.
Оно используется в событии PromptingForNestedEntity для динамического
изменения параметров ввода перед началом взаимодействия с пользователем.
Через это свойство можно:
* изменить текст приглашения (Message),
* разрешить или запретить отмену выбора (AllowNone),
* настроить дополнительные режимы поведения команды.
Returns: Возвращает объект типа PromptNestedEntityOptions. Если параметры не были инициализированы, может вернуть null.
* Message — текст, отображаемый в командной строке.
* AllowNone — разрешено ли завершить операцию без выбора.
* Keywords — (при наличии) ключевые слова, доступные в процессе выбора.