Teigha.DatabaseServices.Vertex2d
Класс Vertex2d представляет в базе данных вершины двумерной полилинии.
Класс Vertex2d представляет в базе данных вершины двумерной полилинии.

Teigha.DatabaseServices.Vertex2d.#ctor
Конструктор по умолчанию класса Vertex2d.
Конструктор по умолчанию класса Vertex2d.

Teigha.DatabaseServices.Vertex2d.#ctor(Teigha.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса Vertex2d. Создает экземпляр класса с указанными параметрами.
Конструктор класса Vertex2d. Создает экземпляр класса с указанными параметрами.
position: Координаты вершины в системе координат объекта (OCS). Тип Point3d.
bulge: Величина прогиба сегмента полилинии, берущего начало в данной вершине. Тип double.
startWidth: Начальная ширина сегмента с началом в данной вершине. Тип double.
endWidth: Конечная ширина сегмента с началом в данной вершине. Тип double.
tangent: Направление касательной к кривой в данной вершине. Тип double.

Teigha.DatabaseServices.Vertex2d.Bulge
Свойство Bulge представляет безразмерную величину прогиба сегмента полилинии, берущего начало в данной вершине.
Свойство Bulge представляет безразмерную величину прогиба сегмента полилинии, берущего начало в данной вершине.
Численно значение прогиба определяется отношением высоты сегмента круглой дуги к половине длины хорды, стягивающей эту дугу, и равно тангенсу 1/4 угла этой дуги.  Так, если дуга представляет собой половину окружности, то прогиб равен 1, соответственно, значение 0 соответствует прямолинейному сегменту.
Знак прогиба определяется положением дуги относительно хорды.
Если дуга располагается правее хорды (движение к следующей вершине по дуге против часовой стрелки), значение прогиба положительно, если левее хорды (движение по дуге по часовой стрелке) - отрицательно.
Notes
Для значений прогиба используется групповой код DXF 42.
Returns: Возвращает безразмерный прогиб сегмента полилинии.
Тип double.

Teigha.DatabaseServices.Vertex2d.EndWidth
Свойство EndWidth представляет конечную ширину сегмента полилинии, следующего за этой вершиной.
Свойство EndWidth представляет конечную ширину сегмента полилинии, следующего за этой вершиной.
Returns: Возвращает ширину конца сегмента полилинии. Тип double.

Teigha.DatabaseServices.Vertex2d.Position
Свойство Position представляет положение данной вершины в системе координат объекта (OCS).
Свойство Position представляет положение данной вершины в системе координат объекта (OCS).
Notes
Несмотря на то, что свойство принимает и возвращает Z-координаты, эти значения полилинией игнорируются.
Returns: Возвращает координатную точку данной вершины.
Тип Point3d.

Teigha.DatabaseServices.Vertex2d.StartWidth
Свойство StartWidth представляет начальную ширину сегмента полилинии, следующего за этой вершиной.
Свойство StartWidth представляет начальную ширину сегмента полилинии, следующего за этой вершиной.
Returns: Возвращает начальную ширину сегмента полилинии.
Тип double.

Teigha.DatabaseServices.Vertex2d.Tangent
Свойство Tangent представляет направление касательной к кривой в данной вершине.
Свойство Tangent представляет направление касательной к кривой в данной вершине.
Это угол между осью X объектной системы координат (OCS) Polyline2d и направлением касательной, измеряемый в радианах.
Returns: Возвращает угол в радианах между осью X объектной системы координат (OCS) полилинии и направлением касательной к кривой в данной вершине.
Тип double.

Teigha.DatabaseServices.Vertex2d.TangentUsed
Свойство TangentUsed позволяет определить, используется ли данной вершиной направление определяющей касательной к кривой.
Свойство TangentUsed позволяет определить, используется ли данной вершиной направление определяющей касательной к кривой.
Returns: Возвращает true, если направление касательной используется.
В противном случае возвращает false.

Teigha.DatabaseServices.Vertex2d.VertexType
Свойство VertexType представляет тип вершины полилинии из перечисления Vertex2dType.
Свойство VertexType представляет тип вершины полилинии из перечисления Vertex2dType.
Returns: Возвращает тип вершины. Перечисление Vertex2dType.