Teigha.Geometry.Scale3d.GetMatrix
Метод предоставляет матрицу геометрического преобразования, которое эквивалентно данному вектору масштабирования.
Метод предоставляет матрицу геометрического преобразования, которое эквивалентно данному вектору масштабирования.
Returns: Возвращает матрицу геометрического преобразования.
Тип Matrix3d.