Teigha.DatabaseServices.TableCopyOptions.TableCopyColumnWidth
Значение: 33554432 = 0x2000000.
При копировании ячеек копировать ширину столбца.
Применимо только при копировании ячеек.
Игнорируется, если установлен флаг TableCopySkipGeometry или когда копируется вся таблица целиком.