Teigha.DatabaseServices.MlineStyleElementCollection
Класс представляет коллекцию объектов MlineStyleElement.
Класс представляет коллекцию объектов MlineStyleElement.

Teigha.DatabaseServices.MlineStyleElementCollection.Add(Teigha.DatabaseServices.MlineStyleElement,System.Boolean)
Метод предназначен для добавления в коллекцию объекта MlineStyleElement.
Метод предназначен для добавления в коллекцию объекта MlineStyleElement.
element: Добавляемый в коллекцию элемент. Тип MlineStyleElement.
checkIfReferenced: Флаг, предписывающий проверку на наличие ссылок на element. Тип bool.
Returns: Возвращает индекс нового элемента коллекции.  Тип int.

Teigha.DatabaseServices.MlineStyleElementCollection.CopyTo(array,System.Int32)
Метод копирует элементы данной коллекции в указанный массив, начиная с заданной индексом позиции.
Метод копирует элементы данной коллекции в указанный массив, начиная с заданной индексом позиции.
arr: Целевой массив. Тип MlineStyleElement[].
index: Индекс в массиве, начиная с которого в массив копируются элементы коллекции.  Тип int.

Teigha.DatabaseServices.MlineStyleElementCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент MlineStyleElement с указанным индексом.
Метод удаляет из коллекции элемент MlineStyleElement с указанным индексом.
Нумерация элементов коллекции начинается с 0.
index: Индекс удаляемого элемента коллекции. Тип int.  Индексы отсчитываются от нуля.

Teigha.DatabaseServices.MlineStyleElementCollection.Count
Свойство возвращает текущее количество элементов в данной коллекции.
Свойство возвращает текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.
Тип int.

Teigha.DatabaseServices.MlineStyleElementCollection.default
Свойство возвращает элемент данной коллекции с указанным индексом.
Свойство возвращает элемент данной коллекции с указанным индексом.
Нумерация элементов коллекции начинается с 0.
index: Индекс элемента коллекции.  Тип int.
Returns: Возвращает элемент коллекции с индексом index.
Тип MlineStyleElement.