Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator
Данный класс представляет перечислитель для коллекции объектов MlineStyleElement.
Данный класс представляет перечислитель для коллекции объектов MlineStyleElement.

Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.#ctor(Teigha.DatabaseServices.MlineStyleElementCollection)
Конструктор класса MlineStyleElementCollectionEnumerator.
Создает перечислитель для указанной коллекции объектов MlineStyleElement.
Конструктор класса MlineStyleElementCollectionEnumerator.
Создает перечислитель для указанной коллекции объектов MlineStyleElement.
col: Коллекция объектов MlineStyleElement, для которой создается перечислитель.

Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.Current
Свойство представляет текущий элемент перечислителя.
Свойство представляет текущий элемент перечислителя.
Returns: Возвращает текущий элемент перечислителя. Тип MlineStyleElement.