HostMgd.ApplicationServices.InplaceTextEditorSettings.EditFlags.CursorAtEnd
Значение: 4.
Вызов текстового редактора с этим флагом предписывает изначальное позиционирование курсора в конце редактируемого текста.
Данный флаг и флаг SelectAll являются взаимоисключающими.
Если флаг CursorAtEnd установлен, то состояние флага SelectAll игнорируется.