Teigha.DatabaseServices.ResultBuffer.GetHashCode
Метод предназначен для получения хэш-кода этого объекта.
Метод предназначен для получения хэш-кода этого объекта.
Подробные сведения см. в документации Microsoft .NET API.
Returns: Возвращает хэш-код этого объекта, тип int.