Teigha.GraphicsSystem.PageParamsCollection
Класс PageParamsCollection представляет коллекцию объектов параметров страницы PageParams.
Класс PageParamsCollection представляет коллекцию объектов параметров страницы PageParams.

Teigha.GraphicsSystem.PageParamsCollection.#ctor
Конструктор по умолчанию класса PageParamsCollection.
Конструктор по умолчанию класса PageParamsCollection.
Создает пустую коллекцию.

Teigha.GraphicsSystem.PageParamsCollection.Add(Teigha.GraphicsSystem.PageParams)
Метод добавляет объект параметров страницы в конец этой коллекции.
Метод добавляет указанный объект параметров страницы в конец этой коллекции.
При необходимости увеличивает емкость коллекции.
value: Добавляемый в коллекцию объект PageParams.
Returns: Возвращает индекс в коллекции вновь добавленного элемента.
Тип int.

Teigha.GraphicsSystem.PageParamsCollection.Contains(Teigha.GraphicsSystem.PageParams)
Метод позволяет проверить, содержится ли в коллекции указанный объект.
Метод позволяет проверить, содержится ли в коллекции указанный объект.
value: Проверяемый объект. Тип PageParams.
Returns: Возвращает true, если искомый объект содержится в коллекции.
В противном случае возвращает false.

Teigha.GraphicsSystem.PageParamsCollection.CopyTo(array,System.Int32)
Метод копирует в данную коллекцию объекты из указанного массива, начиная с указанного индекса.
Метод копирует в данную коллекцию объекты из указанного массива, начиная с указанного индекса.
array: Входной массив копируемых объектов. Тип PageParams[].
index: Индекс в массиве, начиная с которого объекты массива будут копироваться в данную коллекцию.  Тип int.  Индексация элементов в массиве начинается с нуля.

Teigha.GraphicsSystem.PageParamsCollection.IndexOf(Teigha.GraphicsSystem.PageParams)
Метод предоставляет индекс элемента коллекции, который соответствует указанному объекту PageParams.
Метод предоставляет индекс элемента коллекции, который соответствует указанному объекту PageParams.
value: Искомый объект. Тип PageParams.
Returns: Возвращает индекс найденного элемента коллекции. Тип int.
Если объект value в коллекции отсутствует, метод возвращает значение -1.

Teigha.GraphicsSystem.PageParamsCollection.Insert(System.Int32,Teigha.GraphicsSystem.PageParams)
Метод вставляет в коллекцию предоставленный объект по указанному индексу.
Метод вставляет в коллекцию предоставленный объект по указанному индексу.
Notes
Метод выбрасывает исключение ArgumentOutOfRangeException, если предоставленный индекс недействителен.
Метод также увеличивает емкость коллекции, если это потребуется.
index: Индекс добавленного элемента коллекции. Тип int.
value: Вставляемый в коллекцию объект. Тип PageParams.

Teigha.GraphicsSystem.PageParamsCollection.Remove(Teigha.GraphicsSystem.PageParams)
Метод удаляет из данной коллекции указанный объект.
Метод удаляет из данной коллекции указанный объект
value: Удаляемый объект. Тип PageParams.

Teigha.GraphicsSystem.PageParamsCollection.Item
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Свойство Item предоставляет доступ к элементу коллекции с указанным индексом.
Notes
Выбрасывает исключение ArgumentOutOfRangeException, если предоставленный индекс недействителен.
index: Индекс искомого элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип PageParams.