HostMgd.EditorInput.SelectionMode
Это перечисление содержит режим настроек процесса выбора
геометрических объектов. ,ти настройки используются методами,
которые обеспечивают проверку ошибки в выборе геометрического
подобъекта.
Члены             Описание
перечисления
----------------  ----------------------------------------------
All = 6           Выбор всех
Box = 3
Crossing = 2      Выбор пересечением с окном
CrossingPolygon   Выбор пересечением с многоугольником
= 8
Entity = 5        По точному имени геометрического объекта
Every = 11        Каждый геометрический объект по единственному
указателю
Extents = 12
FencePolyline =   Выбор путём указания точки на теле
7                 геометрического объекта.
Group = 13        Групповой выбор
Last = 4          Последний
Pick = 10         Единственный указатель
Previous = 14     Предыдущий
Window = 1        Выбор окном
WindowPolygon =   Выбор по включению в многоугольник
9