HostMgd.ApplicationServices.DocumentLockMode.ProtectedAutoWrite
Значение: 20.
Этот тип блокировки используется вместо AutoWrite перед выполнением кода, который может обработать вложенную блокировку документа, с тем чтобы сохранить блокировку AutoWrite.