Teigha.DatabaseServices.MLeaderStyle
Данный класс представляет объекты MLeaderStyle в базе данных.
Данный класс представляет объекты MLeaderStyle в базе данных.

Teigha.DatabaseServices.MLeaderStyle.#ctor
Конструктор по умолчанию класса MLeaderStyle.
Конструктор по умолчанию класса MLeaderStyle.

Teigha.DatabaseServices.MLeaderStyle.#ctor(Teigha.DatabaseServices.MLeaderStyle)
Конструктор класса MLeaderStyle, который создает новый экземпляр класса как копию уже существующего экземпляра.
Конструктор класса MLeaderStyle, который создает новый экземпляр класса как копию уже существующего экземпляра.
mleaderStyle: Объект для копирования.  Тип MLeaderStyle.

Teigha.DatabaseServices.MLeaderStyle.GetTextAttachmentType(Teigha.DatabaseServices.LeaderDirectionType)
Метод возвращает текущий вариант расположения точки прикрепления выносной линии к многострочному тексту мультивыноски с учетом указанного расположения полки.
Метод возвращает текущий вариант расположения точки прикрепления выносной линии к многострочному тексту мультивыноски с учетом указанного расположения полки.
leaderDirection: Вариант ориентации полки из перечисления LeaderDirectionType.
Returns: Возвращает тип прикрепления выносной линии к многострочному тексту. Перечисление TextAttachmentType.
Тип TextAttachmentType.

Teigha.DatabaseServices.MLeaderStyle.PostMLeaderStyleToDb(DatabaseServices.Database,String)
Метод позволяет добавить данный объект MLeaderStyle в указанную базу данных.
Метод позволяет добавить данный объект MLeaderStyle в указанную базу данных.
db: Целевая база данных. Тип DatabaseServices.Database.
styleName: Имя стиля мультивыноски. Тип String.
Returns: Возвращает идентификатор добавленного в базу данных стиля мультивыноски.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeaderStyle.SetTextAttachmentType(Teigha.DatabaseServices.TextAttachmentType,Teigha.DatabaseServices.LeaderDirectionType)
Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
textAttachmentType: Тип прикрепления выносной линии к многострочному тексту из перечисления TextAttachmentType.
leaderDirection: Вариант ориентации полки из перечисления LeaderDirectionType.

Teigha.DatabaseServices.MLeaderStyle.Annotative
Свойство представляет предусмотренное стилем состояние аннотаций.
Свойство представляет предусмотренное стилем состояние аннотаций.
Returns: Возвращает состояние аннотаций. Перечисление DatabaseServices.AnnotativeStates.

Teigha.DatabaseServices.MLeaderStyle.ArrowSize
Свойство представляет размер стрелки, предусмотренный данным стилем.
Свойство представляет размер стрелки, предусмотренный данным стилем.
Returns: Возвращает размер стрелки. Тип double.

Teigha.DatabaseServices.MLeaderStyle.ArrowSymbolId
Свойство представляет идентификатор объекта символа стрелки, предусмотренный данным стилем.
Свойство представляет идентификатор объекта символа стрелки, предусмотренный данным стилем.
Returns: Возвращает идентификатор символа стрелки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeaderStyle.BlockColor
Свойство представляет цвет, предусмотренный данным стилем для отрисовки содержимого блока мультивыноски.
Свойство представляет цвет, предусмотренный данным стилем для отрисовки содержимого блока мультивыноски.
Returns: Возвращает цвет блока. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MLeaderStyle.BlockConnectionType
Свойство представляет предусмотренный данным стилем вариант соединения блока с линиями выноски.
Свойство представляет предусмотренный данным стилем вариант соединения блока с линиями выноски.
Returns: Возвращает вариант соединения блока с линиями выноски. Перечисление DatabaseServices.BlockConnectionType.

Teigha.DatabaseServices.MLeaderStyle.BlockId
Свойство представляет идентификатор ObjectId блока, связанного с данным стилем.
Свойство представляет идентификатор ObjectId блока, связанного с данным стилем.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeaderStyle.BlockRotation
Свойство представляет угол поворота блока, на который ссылается данный стиль.
Свойство представляет угол поворота блока, на который ссылается данный стиль.
Returns: Возвращает угол поворота блока (в радианах). Тип double.

Teigha.DatabaseServices.MLeaderStyle.blockScale
Свойство представляет масштаб отображения блока, на который ссылается данный стиль.
Свойство представляет масштаб отображения блока, на который ссылается данный стиль.
Returns: Возвращает масштаб отображения блока. Тип Scale3d.

Teigha.DatabaseServices.MLeaderStyle.BreakSize
Свойство представляет величину разрыва выносных линий, предусмотренную данным стилем.
Свойство представляет величину разрыва выносных линий, предусмотренную данным стилем.
Returns: Возвращает величину разрыва выносных линий. Тип double.

Teigha.DatabaseServices.MLeaderStyle.ContentType
Свойство представляет тип содержимого мультивыноски, предусмотренный данным стилем.
Свойство представляет тип содержимого мультивыноски, предусмотренный данным стилем.
Returns: Возвращает тип содержимого мультивыноски. Значение из перечисления DatabaseServices.ContentType.

Teigha.DatabaseServices.MLeaderStyle.DefaultMText
Свойство представляет текст по умолчанию для связанного многострочного текста.
Свойство представляет текст по умолчанию для связанного многострочного текста.
Returns: Возвращает текст по умолчанию. Тип MText.

Teigha.DatabaseServices.MLeaderStyle.DoglegLength
Свойство представляет длину полки мультивыноски, предусмотренную данным стилем.
Свойство представляет длину полки мультивыноски, предусмотренную данным стилем.
Returns: Возвращает длину полки. Тип double.

Teigha.DatabaseServices.MLeaderStyle.DrawLeaderOrderType
Свойство представляет последовательность отрисовки сегментов выносных линий объектов MLeader, предусмотренный данным стилем.
Свойство представляет последовательность отрисовки сегментов выносных линий объектов MLeader, предусмотренный данным стилем.
Returns: Возвращает последовательность отрисовки сегментов выносных линий.
Тип DatabaseServices.DrawLeaderOrderType.

Teigha.DatabaseServices.MLeaderStyle.DrawMLeaderOrderType
Свойство представляет порядок отрисовки содержимого объектов MLeader, предумотренный данным стилем.
Свойство представляет порядок отрисовки содержимого объектов MLeader, предумотренный данным стилем.
Returns: Возвращает порядок отрисовки содержимого мультивыноски.
Перечисление DatabaseServices.DrawMLeaderOrderType.

Teigha.DatabaseServices.MLeaderStyle.EnableBlockRotation
Свойство позволяет проверить, предусмотрено ли данным стилем вращение связанного блока.
Свойство позволяет проверить, предусмотрено ли данным стилем вращение связанного блока.
Returns: Возвращает true, если вращение блока включено (допускается).
В противном случае возвращает false.

Teigha.DatabaseServices.MLeaderStyle.EnableBlockScale
Свойство позволяет включить или отключить масштабирование содержимого связанного блока.
Свойство позволяет включить или отключить масштабирование содержимого связанного блока.
Returns: Возвращает true, если масштабирование блока включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeaderStyle.EnableDogleg
Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
Returns: Возвращает true, если полка отображается.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeaderStyle.EnableFrameText
Свойство позволяет контролировать отображение рамки вокруг текста мультивыноски.
Свойство позволяет контролировать отображение рамки вокруг текста мультивыноски.
Returns: Возвращает true, если рамка вокруг текста отображается.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeaderStyle.EnableLanding
Свойство должно управлять отображением зазора между концом линии полки и содержимым мультивыноски.
В текущей реализации платформы всегда считается равным true.
Свойство должно управлять отображением зазора между концом линии полки и содержимым мультивыноски (многострочным текстом или блоком).
По замыслу разработчиков, если данный флаг принимает значение true, величина зазора должна определяться значением свойства LandingGap. В противном случае значение зазора LandingGap должно игнорироваться (просто считается равным нулю).
Но в текущей реализации платформы флаг EnableLanding выставлен всегда (равен true).  Таким образом, для отрисовки зазора между концом линии полки и контентом мультивыноски всегда используется текущее значение свойства LandingGap.
Изменять состояние флага EnableLanding через API технически возможно, но бессмысленно, поскольку в текущей реализации состояние флага не анализируется, а принимается всегда равным true.
Returns: Всегда возвращает true, т.е. отображение зазора между линией полки и контентом мультивыноски всегда включено.

Teigha.DatabaseServices.MLeaderStyle.ExtendLeaderToText
Свойство позволяет управлять режимом продления горизонтальных линий выносок автоматически до текста.
Свойство позволяет управлять режимом продления горизонтальных линий выносок автоматически до текста.
Returns: Возвращает true, если автоматическое продление линий выносок включено.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeaderStyle.FirstSegmentAngleConstraint
Свойство представляет угловое ограничение для первого сегмента линии выноски.
Свойство представляет угловое ограничение для первого сегмента линии выноски (используется при создании объектов MLeader).
Returns: Возвращает угловое ограничение из перечисления AngleConstraint.

Teigha.DatabaseServices.MLeaderStyle.LandingGap
Свойство представляет величину зазора между концом линии полки и многострочным текстом мультивыноски.
Свойство представляет величину зазора между концом линии полки и многострочным текстом мультивыноски.
Returns: Возвращает величину зазора. Тип double.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineColor
Свойство представляет цвет линии выноски, предусмотренный данным стилем.
Свойство представляет цвет линии выноски, предусмотренный данным стилем.
Returns: Возвращает цвет линии выноски. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineType
Свойство представляет предусмотренный данным стилем тип линий выноски (прямая, сплайн, невидимая).
Свойство представляет предусмотренный данным стилем тип линий выноски (прямая, сплайн, невидимая).
Returns: Возвращает тип линий выноски из перечисления LeaderType.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineTypeId
Свойство представляет предусмотренный данным стилем идентификатор ObjectId типа линии, используемого для отрисовки выносных линий мультивыноски.
Свойство представляет предусмотренный данным стилем идентификатор ObjectId типа линии, используемого для отрисовки выносных линий мультивыноски.
Returns: Возвращает идентификатор типа линии. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineWeight
Свойство представляет предусмотренную данным стилем толщину (вес) выносных линий мультивыноски.
Свойство представляет предусмотренную данным стилем толщину (вес) выносных линий мультивыноски.
Returns: Возвращает толщину (вес) линий из перечисления DatabaseServices.LineWeight.

Teigha.DatabaseServices.MLeaderStyle.MaxLeaderSegmentsPoints
Свойство представляет максимальное количество точек сегментов, используемых для построения линий выносок.
Свойство представляет максимальное количество точек сегментов, используемых для построения линий выносок.
Returns: Возвращает количество точек сегментов. Тип int.

Teigha.DatabaseServices.MLeaderStyle.Name
Свойство представляет имя данного стиля мультивыноски.
Свойство представляет имя данного стиля мультивыноски.
Returns: Возвращает имя стиля. Тип String.

Teigha.DatabaseServices.MLeaderStyle.Scale
Свойство представляет масштабный множитель для данного стиля.
Свойство представляет масштабный множитель для данного стиля.
Returns: Возвращает масштабный множитель. Тип double.

Teigha.DatabaseServices.MLeaderStyle.SecondSegmentAngleConstraint
Свойство представляет угловое ограничение для второго сегмента линии выноски.
Свойство представляет угловое ограничение для второго сегмента линии выноски (используется при создании объектов MLeader).
Returns: Возвращает угловое ограничение из перечисления AngleConstraint.

Teigha.DatabaseServices.MLeaderStyle.TextAlignAlwaysLeft
Свойство позволяет указать, что создаваемый многострочный текст должен всегда выравниваться по левому краю.
Свойство позволяет указать, что создаваемый многострочный текст должен всегда выравниваться по левому краю.
Returns: Возвращает true, если стиль предусматривает выравнивание текста по левому краю.
В противном случае возвращает false.

Teigha.DatabaseServices.MLeaderStyle.TextAlignmentType
Свойство представляет тип выравнивания многострочного текста мультивыноски, предусмотренный данным стилем.
Свойство представляет тип выравнивания многострочного текста мультивыноски, предусмотренный данным стилем.
Returns: Возвращает тип выравнивания многострочного текста.
Значение из перечисления DatabaseServices.TextAlignmentType.

Teigha.DatabaseServices.MLeaderStyle.TextAngleType
Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
Returns: Возвращает выбор угла для размещения текста.
Значение из перечисления DatabaseServices.TextAngleType.

Teigha.DatabaseServices.MLeaderStyle.TextAttachmentDirection
Свойство представляет ориентацию полки выносных линий, предусмотренную данным стилем.
Свойство представляет ориентацию полки выносных линий, предусмотренную данным стилем.
Returns: Возвращает ориентацию полки выносной линии. Значение из перечисления DatabaseServices.TextAttachmentDirection.

Teigha.DatabaseServices.MLeaderStyle.TextAttachmentType
Свойство представляет предусмотренный стилем вариант расположения точки прикрепления выносной линии к многострочному тексту.
Свойство представляет предусмотренный стилем вариант расположения точки прикрепления выносной линии к многострочному тексту.
Returns: Возвращает вариант расположения точки прикрепления. Перечисление DatabaseServices.TextAttachmentType.

Teigha.DatabaseServices.MLeaderStyle.TextColor
Свойство представляет цвет многострочного текста, предусмотренный данным стилем.
Свойство представляет цвет многострочного текста, предусмотренный данным стилем.
Returns: Возвращает цвет многострочного текста. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.MLeaderStyle.TextHeight
Свойство представляет высоту многострочного текста, которая предусмотрена данным стилем.
Свойство представляет высоту многострочного текста, которая предусмотрена данным стилем.
Returns: Возвращает высоту текста. Тип double.

Teigha.DatabaseServices.MLeaderStyle.TextStyleId
Свойство представляет идентификатор ObjectId текстового стиля, который должен применяться к многострочному тексту  мультивыноски.
Свойство представляет идентификатор ObjectId текстового стиля, который должен применяться к многострочному тексту  мультивыноски.
Returns: Возвращает идентификатор текстового стиля. Тип DatabaseServices.ObjectId.