HostMgd.PlottingServices.PreviewEndPlotStatus.Cancel
Значение: 2.
Предварительный просмотр был прерван.
Пользователь (или главное приложение) запросил завершение всего вывода на печать и возврат управления главному приложению. (Например, если предварительный просмотр был инициирован пользовательской командой nanoCAD, эта команда должна быть завершена, а управление возвращено nanoCAD).