Teigha.DatabaseServices.Field.GetFieldCode
Метод предназначен для извлечения кода поля в виде текстовой строки.
Метод предназначен для извлечения кода поля в виде текстовой строки.
Returns: Возвращает текстовую строку с кодом поля.  Тип String.