Teigha.DatabaseServices.CellContentsCollection.Clear
Метод очищает данную коллекцию, удаляя из нее все элементы.
Метод очищает данную коллекцию, удаляя из нее все элементы.
После завершения метода свойство Count коллекции возвращает значение 0.