Teigha.DatabaseServices.DBDictionary.Copy
Метод создает копию словаря.
Метод создает копию данного словаря в виде экземпляра класса DBDictionary.
Returns: Возвращает копию данного словаря в виде экземпляра класса DBDictionary.