Teigha.DatabaseServices.DBObject
Этот класс является базовым классом для всех объектов, содержащихся в базе данных dwg-файла (Database).
Этот класс является базовым классом для всех объектов, содержащихся в базе данных dwg-файла (Database).
Notes
Создание и удаление объектов базы данных:
* Объекты базы данных обычно создаются путем вызова Database.AddDBObject().
Когда объект создан, он находится в режиме OpenMode.ForWrite.
* Экземпляры DBObject должны создаваться путем вызова метода AddDBObject().
* Экземпляры DBObject создаются в режиме OpenMode.ForWrite.
* Запрещено зависеть от других экземпляров DBObject при создании или удалении экземпляров.
* Экземпляры DBObject должны удаляться из Database с помощью метода erase().
Доступ к объектам базы данных:
* Объекты базы данных должны быть открыты перед тем, как к ним можно будет получить доступ.
* При наличии допустимого ObjectId объект базы данных открывается путем вызова Transaction.GetObject().
* Объекты базы данных должны открываться в наиболее ограничительном режиме (если нет необходимости изменять объект, то OpenMode.ForRead).
Объект может быть открыт в одном из следующих режимов:
Режим                Описание
-----                ---------
OpenMode.ForRead     Позволяет выполнять операции, которые не изменяют этот объект.
Объект базы данных может быть открыт в этом режиме любое количество раз (одновременно),
если он не открыт в режимах ForWrite или ForNotify.
Исключение будет выброшено, если попытаться выполнить любую операцию записи
для объекта, открытого в этом режиме.
OpenMode.ForWrite    Позволяет выполнять операции чтения и записи для этого объекта.
Объект базы данных может быть открыт в этом режиме только если он еще не открыт
ни в каком другом режиме.
OpenMode.ForNotify   Объект открыт для целей уведомления.
Объект базы данных может быть открыт в этом режиме, если он еще не открыт
в режиме ForNotify.

Teigha.DatabaseServices.DBObject.#ctor(IntPtr,System.Boolean)
Конструктор.
Конструктор.
unmanagedPointer: Указатель на объект; тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.

Teigha.DatabaseServices.DBObject.AddContext(Teigha.DatabaseServices.ObjectContext)
Метод предназначен для добавления копии контекста к объекту базы данных.
Метод добавляет копию контекста к объекту базы данных.
context: Контекст для добавления

Teigha.DatabaseServices.DBObject.AddPersistentReactor(DatabaseServices.ObjectId)
Метод предназначен для добавления указанного постоянного реактора в список реакторов этого объекта.
Метод добавляет указанный постоянный реактор в список реакторов этого объекта.
objId: Идентификатор объекта постоянного реактора

Teigha.DatabaseServices.DBObject.ApplyPartialUndo(Teigha.DatabaseServices.DwgFiler,Teigha.Runtime.RXClass)
Метод уведомления, который вызывается каждый раз, когда этот объект использует механизм частичной отмены.
Этот метод вызывается nanoCAD всегда, когда выполняется
операция Undo с объектом DBObject, и объект последовательно
установил признак autoUndo во всех вызовах
assertWriteEnabled() в false, что указывает на использование
механизма частичного удаления.
undoFiler: Программа работы с файлами, содержащая информацию
classObj: RXClass объект для класса, который должен

Teigha.DatabaseServices.DBObject.Audit(Teigha.DatabaseServices.AuditInfo)
Метод выполняет операцию аудита над этим объектом.
Этот метод вызывается nanoCAD, когда выполняется команда
AUDIT. Объект AuditInfo, на который указывает auditInfo,
содержит функции, которые будут использоваться для
определения того, что должно быть сделано, а также для отчета
о результатах операции аудита над объектом.
auditInfo: Объект AuditInfo

Teigha.DatabaseServices.DBObject.CloseAndPage(System.Boolean)
Метод закрывает объект и выводит его на страницу. Все изменения, внесенные в объект с момента его открытия, фиксируются в базе данных, и отправляется уведомление о том, что объект теперь "закрыт".
В настоящее время не реализован.
Закрывает объект и выгружает его, если объект можеть быть выгружен.
Все изменения, сделанные с объектом с
момента открытия, фиксируются в базе данных, и формируется
событие "закрыт" (так же, как и, в соответствующих случаях, события
"изменен", "очищен" и т.д.).
onlyWhenClean: Признак, указывающий, нужно ли удалять

Teigha.DatabaseServices.DBObject.DecomposeForSave(Teigha.DatabaseServices.DwgVersion)
Метод определяет поведение пользовательских объектов при сохранении в dwg-файл.
Этот метод используется для контроля поведения
пользовательских объектов и геометрических объектов при
сохранении в предыдущих форматах. Пользовательский объект
может в этом случае разместить свои части в других объектах с
помощью добавления дополнительных данных (xdata) к созданным
объектам.
version: Версия, в которой файл был сохранен

Teigha.DatabaseServices.DBObject.DeepClone(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.IdMapping,System.Boolean)
Метод выполняет глубокое клонирование этого объекта.
Этот метод позволяет контролировать операции полного
клонирования объекта. При реализации по умолчанию, объект
клонируется и добавляется к объекту-владельцу (ownerPointer).
Клонирование выполняется с учетом DeepCloneFiler. Также
добавляется запись в idMap. Затем, используя фильтр, все
объекты, имеющие владельца, клонируются, с установкой
isPrimary в false.
ownerPointer: Объект, к которому добавляются клонируемые
idMap: Текущий Id карты объекта
isPrimary: Признак, определяющий, является ли объект

Teigha.DatabaseServices.DBObject.DisableUndoRecording(System.Boolean)
Метод управляет отменой записи этого объекта в буфер Undo.
Метод включает или выключает запись в буфер Undo для объекта. Если
значение disable равно true, запись в буфер Undo выключена.
disable: Признак включения или выключения запись в буфер

Teigha.DatabaseServices.DBObject.DowngradeToNotify(System.Boolean)
Метод понижает уровень доступа к этому объекту с ForNotify и ForWrite до наличия только одного открытого режима - ForNotify.
В настоящее время не реализован.
Восстанавливает объект, открытый и в режиме
OpenMode.ForNotify , и в режиме OpenMode.ForWrite, чтобы он
был открыт только в режиме OpenMode.ForNotify. Значение
параметра wasWritable возвращается из соответствующего вызова
DBObject.upgradeFromNotify() для восстановления надлежащего
статуса открытия.
Эта функция должна предшествовать вызову upgradeFromNotify().
wasWritable: Признак, указывающий, был ли объект открыт на

Teigha.DatabaseServices.DBObject.DwgIn(Teigha.DatabaseServices.DwgFiler)
Метод считывает данные этого объекта из файла формата dwg.
Этот метод выполняет несколько внутренних учетных действий,
и затем читает любые xdata, присоединенные к объекту.
filer: Набор данных, которые необходимо считать из dwg-файла. Тип DwgFiler

Teigha.DatabaseServices.DBObject.DwgOut(Teigha.DatabaseServices.DwgFiler)
Метод записывает данные этого объекта в указанный файл формата .dwg.
Этот метод выполняет несколько внутренних учетных действий,
и затем записывает в dwg-файл любые xdata, присоединенные к объекту.
filer: Набор данных, которые нужно записать в dwg-файл. Тип DwgFiler

Teigha.DatabaseServices.DBObject.DxfIn(Teigha.DatabaseServices.DxfFiler)
Метод считывает данные этого объекта из файла формата dxf.
Этот метод выполняет несколько внутренних учетных действий,
и затем читает любые xdata, присоединенные к объекту.
Note
Создание объектов с xdata перед данными объекта не является
хорошей практикой, но для совместимости такой режим
поддерживается.
filer: Набор данных, которые необходимо считать из dxf-файла. Тип DxfFiler

Teigha.DatabaseServices.DBObject.DxfOut(Teigha.DatabaseServices.DxfFiler)
Метод записывает данные этого объекта в указанный файл формата .dxf.
Этот метод выполняет несколько внутренних учетных действий,
и затем записывает в dxf-файл любые xdata, присоединенные к объекту.
filer: Набор данных, которые нужно записать в dxf-файл. Тип DxfFiler

Teigha.DatabaseServices.DBObject.Erase(System.Boolean)
Метод помечает этот объект, как удалённый или убирает отметку об удалении, но не удаляет из базы данных.
Метод устанавливает признак удаления ли восстановления объекта.
erasing: Флаг, указывающий убрать или добавить пометку об удалении. Тип bool.

Teigha.DatabaseServices.DBObject.FromAcadObject(Object)
Метод предназначен для получения идентификатора объекта в базе данных чертежа по указателю на него.
С помощью метода можно получить идентификатор объекта в базе данных чертежа по указателю на этот объект.
acadObj: Указатель на объект чертежа. Тип Object
Returns: Возвращает идентификатор объекта базы данных. Тип ObjectId.
Exceptions
Этот метод генерирует исключение 'ArgumentNullException', если переданный аргумент равен null.

Teigha.DatabaseServices.DBObject.GetEventExtender(System.Boolean)
Метод предоставляет доступ к расширителю событий данного объекта.
Метод позволяет расширить события данного объекта.
create: Флаг, указывающий, создавать ли расширитель при вызове метода. Тип bool
Returns: Возвращает расширитель событий данного объекта. Тип DBObjectEventExtender

Teigha.DatabaseServices.DBObject.GetField(String)
Метод предназначен для получения идентификатора поля с указанным названием из словаря полей.
Этот метод обеспечивает доступ к полю с указанным названием, возвращая его идентификатор.
propertyName: Имя поля свойств объекта базы данных чертежа, которое необходимо получить. Тип string
Returns: Возвращает идентификатор указанного объекта. Тип ObjectId

Teigha.DatabaseServices.DBObject.GetObjectSaveVersion(Teigha.DatabaseServices.DwgFiler)
Метод позволяет получить номер версии чертежа и технического обновления.
Чтобы определить, какую версию данного объекта сохранить, необходимо переопределить этот метод. Это не требует обращения к
данному методу родительского класса.
filer: Набор данных, используемый для операции с dwg-файлом. Тип DwgFiler
Returns: Возвращает версию чертежа и технического обновления, в которой должен быть сохранен этот объект. Тип FullDwgVersion
Реализация этого метода по умолчанию возвращает DwgFiler->DwgVersion.
Notes
Этот метод может быть переопределен в пользовательских классах.
Предупреждение
Не следует использовать Dwg(Dxf)Filer-\>Dwg(Dxf)Version() в ваших методах
dwg(In/Out) и dxf(In/Out) — это не работает в
экземплярах, производных от вашего класса. Вместо этого
используйте GetObjectSaveVersion().

Teigha.DatabaseServices.DBObject.GetObjectSaveVersion(Teigha.DatabaseServices.DxfFiler)
Метод позволяет получить номер версии чертежа и технического обновления.
Чтобы определить, какую версию данного объекта сохранить, необходимо переопределить этот метод. Это не требует обращения к
данному методу родительского класса.
filer: Набор данных, используемый для операции с dxf-файлом. Тип DxfFiler
Returns: Возвращает версию чертежа и технического обновления, в которой должен быть сохранен этот объект. Тип FullDxfVersion
Реализация этого метода по умолчанию возвращает DxfFiler->DxfVersion.
Предупреждение
Не следует использовать Dwg(Dxf)Filer-\>Dwg(Dxf)Version() в ваших методах
dwg(In/Out) и dxf(In/Out) — это не работает в
экземплярах, производных от вашего класса. Вместо этого
используйте GetObjectSaveVersion().

Teigha.DatabaseServices.DBObject.GetXDataForApplication(String)
Метод предназначен для получения данных xdata приложения с указанным названием.
Метод предоставляет данные xdata приложения с указанным названием.
applicationName: Имя зарегистрированного приложения,
Returns: Возвращает данные, которые являются копией xdata приложения с указанным названием. Тип ResultBuffer

Teigha.DatabaseServices.DBObject.HandOverTo(Teigha.DatabaseServices.DBObject,System.Boolean,System.Boolean)
Метод заменяет данный объект, являющийся резидентом базы данных (DBPRO), указанным объектом, не являющимся резидентом базы данных (NDBRO), сохраняя при этом ObjectId, дескриптор, владельца и список реакторов данного объекта.
"newPointer"> [in] Указатель на объект, которым нужно заменить этот объект в базе данных.
"keepXData"> [in] Флаг, указывающий, следует ли сохранять данные этого объекта.
Флаг "keepExtDict"> [in], указывающий, следует ли сохранять словарь расширений этого объекта.
Этот объект должен быть открыт в режиме ForWrite. Объект замены открывается в режиме ForWrite и должен быть закрыт.
Этот метод обеспечивает возможность замены на нерезидентный
объект базы данных (NDBRO) резидентного объекта базы
данных (DBRO), сохраняя Id объекта, дескриптор и список
реакторов DBRO.
Примером такой ситуации является использование команды BREAK
для разбиения окружности на две дуги. Arc является совершенно
другим классом, чем Circle, и новый объект типа Arc должен
заместить объект Circle на том месте, где этот объект
находится, но при этом Arc должен иметь тот же дескриптор и
Id объекта, что имел объект Circle.
При использовании метода handOverTo(), замещаемый объект (в
примере — Circle) должен быть открыт как OpenMode.ForWrite
(на запись). Метод handOverTo() объекта, вызываемый с
параметром newPointer делает объект, указанный в этом
параметре, нерезидентным объектом базы данных
(в примере — Arc).
Если keepXData установлен в true, то xdata данные должны быть
сохранены (в новом объекте), а, если keepXData установлен в
false, то данные xdata будут утеряны.
Если keepExtensionDictionary установлен в true, то
расширенный словарь и его контекстные данные должны быть
сохранены (в новом объекте), и, если keepExtensionDictionary
установлен в false, то данные расширенного словаря и его
контекста будут утеряны.
Будучи возвращенным данным методом, объект, вставленный на
замену (в примере — Arc) открывается в режиме OpenMode.ForWrite
(на запись) и должен быть закрыть методом close(),
который вызывается для занесения изменений и закрытия буфера
Undo. Приложение, вызвавшее HandOverTo() должно удалить старый объект
(в примере — Circle) из памяти т.к.
он больше не является резидентом базы данных.
newPointer: Объект для замещения текущего
keepXData: Признак, указывающий, должна ли
keepExtensionDictionary: Признак, указывающий, должна ли

Teigha.DatabaseServices.DBObject.HasContext(Teigha.DatabaseServices.ObjectContext)
Метод предназначен для проверки, существует ли указанный контекст в коллекции.
Метод определяет, есть ли указанный контекст в коллекции.
context: Контекст для поиска. Тип ObjectContext
Returns: Возвращает тип данных bool. true если этот объект имеет указанный контекст, false в противном случае.

Teigha.DatabaseServices.DBObject.HasPersistentReactor(DatabaseServices.ObjectId)
Метод предназначен для проверки, является ли переданный идентификатор идентификатором реактора, присоединенного к этому объекту.
Метод проеверяет, является ли переданный идентификатор идентификатором реактора, присоединенного к этому объекту.
objId: Идентификатор постоянного реактора. Тип ObjectId
Returns: Возвращает тип данных bool. true, если ObjId является идентификатором объекта реактора, присоединенного к этому объекту, false в противном случае.

Teigha.DatabaseServices.DBObject.IsCustomObject(DatabaseServices.ObjectId)
Метод предназначен для проверки, относится ли переданный идентификатор к пользовательскому объекту.В настоящее время не реализован.
"id"> [в] Идентификатор объекта для проверки.
Возвращает true, если id соответствует пользовательскому
объекту.
Id: Идентификатор объекта для проверки. Тип ObjectId
Returns: Возвращает тип данных bool. true, если объект с Id является пользовательским объектом, false в противном случае.

Teigha.DatabaseServices.DBObject.RemoveContext(Teigha.DatabaseServices.ObjectContext)
Метод предназначен для удаляения контекста из коллекции.
Метод удаляет контекст из коллекции.
Notes
Активный контекст не может быть удален.
context: Контекст, который необходимо удалить. Тип ObjectContext

Teigha.DatabaseServices.DBObject.RemoveField(DatabaseServices.ObjectId)
Метод предназначен для удаления поля с указанным идентификатором.
Метод удаляет поле с указанным ObjectId.
id: Идентификатор удаляемого из объекта поля. Тип ObjectId
Returns: Возвращает идентификатор удалённого объекта. Тип ObjectId

Teigha.DatabaseServices.DBObject.RemoveField(String)
Метод удаляет указанное поле по его имени и возвращает его идентификатор.
Удаляет определенное поле. Возвращает Id удаляемого поля.
propertyName: Имя свойства, соответствующее которому поле
Returns: Возвращает идентификатор поля. Тип ObjectId

Teigha.DatabaseServices.DBObject.RemovePersistentReactor(DatabaseServices.ObjectId)
Метод удаляет указанный постоянный реактор из списка реакторов этого объекта.
Метод удаляет указанный постоянный реактор из списка реакторов этого объекта.
ObjId: Идентификатор постоянного реактора объекта. Тип ObjectId

Teigha.DatabaseServices.DBObject.SetField(Teigha.DatabaseServices.Field)
Метод устанавливает указанное поле для свойства "ТЕКСТ".
Поле может быть задано в объекте, с использованием имени свойства как
ключа. Если поле еще не заведено в базе данных, оно будет
заведено. Если поле уже есть в базе данных, оно будет открыто
на запись. После вызова метода, поле должно быть закрыто.
field: Задаваемое поле. Тип Field

Teigha.DatabaseServices.DBObject.SetField(String,Teigha.DatabaseServices.Field)
Метод устанавливает указанное поле для указанного свойства.
Метод устанавливает указанное поле для указанного свойства.
Поле может быть задано в объекте, с исползованием имени свойства как
ключа. Чтобы метод был успешным, необходимо, чтобы объект был
в базе данных. Если поле еще не заведено в базе данных, оно
будет заведено. Если поле уже есть в базе данных, оно будет
открыто на запись.
propertyName: Имя свойства, для которого устанавливается
field: Устанавливаемое поле. Тип Field
Returns: Возвращает идентификатор установленного поля. Тип ObjectId

Teigha.DatabaseServices.DBObject.SetPaperOrientation(System.Boolean)
Метод задает свойство ориентации бумаги для указанного объекта.
Устанавливает текущее значение свойства ориентации листа в
аннотационном объекте.
bPaperOrientation: Новое значение свойства ориентации листа. Тип bool

Teigha.DatabaseServices.DBObject.SupportsCollection(String)
Метод проверяет, поддерживается ли данным объектом определенный тип контекста.
Определяет, что определенный тип контекста поддерживается
объектом.
Этот метод показывает, поддерживает ли объект тип коллекции, но не показывает
, участвует ли этот объект в каких-либо контекстах этого типа.
См. также метод HasContext().
collectionName: Имя коллекции (тип контекста) для проверки. Тип String
Returns: Возвращает тип данных bool. true, если объект поддерживает тип контекста с
указанным именем.

Teigha.DatabaseServices.DBObject.SwapIdWith(DatabaseServices.ObjectId,System.Boolean,System.Boolean)
Метод заменяет идентификаторы объектов, Handles, расширенные данные (XData) и словарь расширений местами между
этим объектом и другим объектом.
Этот метод меняет Id и Handle между объектом,
определенным параметром otherId и объектом, вызвавшим этот
метод. Оба объекта должны быть резидентами базы данных и должны
размешаться в одной и той же базе данных. Если
swapExtendedData установлен в true, то будет производиться обмен
расширенными данными геометрических объектов. Если
swapExtensionDictionary установлен в true, то и обмен
расширенными словарями будет произведен.
otherId: Id объекта, с которым производится
swapExtendedData: Признак, показывающий, должен ли
swapExtensionDictionary: Признак, показывающий, должен ли

Teigha.DatabaseServices.DBObject.SwapReferences(Teigha.DatabaseServices.IdMapping)
Этот метод выполняет преобразование ссылок на идентификаторы объектов,
аналогичное тому, как происходит в конце глубокого клонирования.
В настоящее время не реализован.
Действие этого метода подобно преобразованию Id объектов для
ссылок, выполняемому при завершении клонирования. В ссылках
между объектами в рабочем множестве, в которых есть Id
объекта, Id преобразуется в Id заменяющих объектов в
ссылочных объектах. Не так как в клонировании, это
преобразование производится в обоих направлениях. Таким
образом, возможно увидеть два разных Id отображения,
передаваемых для различных вызовов метода.
Например, при замене исходного объекта на некоторый новый,
должно быть указано отображение всех других исходных
объектов, замещаемых на некоторые новые объекты. Поскольку
менеджер транзакций собирается стереть эти исходные объекты,
является важным, чтобы отношения между объектами были
корректными для таких целей, как отправка уведомлений о
стирании объектов.
Новый объект может иметь или не иметь объект, с которым он
меняется. В любом случае, ссылки этого объекта должны быть
обновлены с использованием отображения от всех новых объектов
к их исходным.
Поведение по умолчанию этого метода в DBObject заключается в
преобразовании Id ссылок объекта с использованием параметра
idMap таким же способом, что и преобразование, выполняемое при
исполнении операции DeepClone().
Предупреждение
Пользовательские объекты, которые переопределяют этот метод,
должны обратиться к методу родительского объекта. Отсутствие
или сбой такого обращения приведет к ошибке времени выполнения.
idMap: Id отображение ссылок. Тип IdMapping

Teigha.DatabaseServices.DBObject.WblockClone(Teigha.Runtime.RXObject,Teigha.DatabaseServices.IdMapping,System.Boolean)
Метод выполняет неглубокое клонирование этого объекта.
Этот метод практически идентичен методу DBObject.DeepClone(),
за исключением того, что использование WblockCloneFiler не
должно выходить за границы базы данных. Субклонирование
базируется на жестком задании владельца и жестком указании на
связи.
ownerPointer: Входной объект, который клонируется. Тип RxObject
idMap: Карта преобразований Id текущего объекта. Тип IdMapping
isPrimary: Признак, является ли объект первичным или
Returns: Возвращает созданной клон. Тип DBObject
Если операция клонирования завершается ошибкой, возвращается значение null.

Teigha.DatabaseServices.DBObject.XDataTransformBy(Teigha.Geometry.Matrix3d)
Метод применяет матрицу трехмерного преобразования к данным этого объекта.
Этот метод применяет матрицу преобразования к любым xdata
типов 1011, 1021, 1031, 1012, 1022, 1032, 1013, 1023, 1033,
1041, и 1042 из xdata объекта. Для более подробной информации
о применении матрицы преобразования к xdata разных типов,
смотрите документацию на xdata.
Этот метод следует вызывать вместе с методом TransformBy() для
пользовательских геометрических объектов, так что такие
геометрические объекты будут преобразовывать свои xdata
таким же образом, как это делают встроенные
геометрические объекты.
transform: Матрица преобразования. Тип Matrix3d

Teigha.DatabaseServices.DBObject.AcadObject
Свойство предоставляет доступ к COM-объекту.
Свойство предоставляет доступ к COM-объекту.
Returns: Тип данных object.

Teigha.DatabaseServices.DBObject.Annotative
Свойство позволяет управлять статусом аннотации объекта.
Свойство позволяет управлять статусом аннотации объекта.
Returns: Возвращает установленный статус аннотации объекта. Тип AnnotativeStates

Teigha.DatabaseServices.DBObject.ClassID
Свойство предоставляет идентификатор класса данного объекта.
Свойство предоставляет идентификатор класса данного объекта.
Returns: Возвращает идентификатор класса объекта. Тип System.Guid

Teigha.DatabaseServices.DBObject.Database
Свойство предоставляет доступ к базе данных, в которой хранится данный объект.
Свойство предоставляет доступ к базе данных, в которой хранится данный объект.
Returns: Возвращает базу данных, используемую объектом. Тип Database.

Teigha.DatabaseServices.DBObject.Drawable
Свойство предоставляет доступ к графическому объекту, связанном с этим объектом базы данных.
Свойство предоставляет доступ к графическому объекту, связанном с этим объектом базы данных.
Returns: Возвращает отображаемый объект, тип данных Drawable.
Если данный объект базы данных не имеет отображаемого объекта, свойство вернёт NULL.

Teigha.DatabaseServices.DBObject.ExtensionDictionary
Свойство предоставляет идентификатор словаря расширения этого объекта.
Свойство предоставляет идентификатор словаря расширения этого объекта.
Returns: Тип данных ObjectId.

Teigha.DatabaseServices.DBObject.Handle
Свойство предоставляет идентификатор Handle данного объекта.
Свойство предоставляет идентификатор Handle данного объекта.
Returns: Возвращает тип данных Handle.

Teigha.DatabaseServices.DBObject.HasFields
Свойство предоставляет информацию, есть ли у объекта хотя бы одно поле.
Свойство предоставляет информацию, есть ли у объекта хотя бы одно поле.
Returns: Возвращает тип данных bool. Возвращает true, если у объекта есть одно или более полей.

Teigha.DatabaseServices.DBObject.HasSaveVersionOverride
Свойство предоставляет доступ к флагу, указывающему, что объект переопределяет способ сохранения объекта в dwg-файл.
Свойство предоставляет доступ к флагу, указывающему, что объект переопределяет способ сохранения объекта в dwg-файл.
Returns: Возвращает тип данных bool. Возвращает true, если у объекта установлен бит
переопределения способа сохранения объекта.

Teigha.DatabaseServices.DBObject.Id
Свойство предоставляет идентификатор объекта в базе данных чертежа.
Возвращает значение свойства Id.
Returns: Возвращает идентификатор объекта. Тип ObjectId.

Teigha.DatabaseServices.DBObject.IsAProxy
Свойство предоставляет информацию, является ли данный объект прокси-объектом.
Свойство предоставляет информацию, является ли данный объект прокси-объектом.
Returns: Возвращает тип данных bool. Возвращает true, если объект — прокси объект.

Teigha.DatabaseServices.DBObject.IsCancelling
Свойство предоставляет информацию, происходит ли сейчас отмена всех изменений объекта.
Свойство предоставляет информацию, происходит ли сейчас отмена всех изменений объекта.
Returns: Возвращает тип данных bool. Возвращает true, если объекта в данный момент выполняется
вызов метода Cancel() (т.е. открытие объекта отменяется и для
всех изменений производится откат).

Teigha.DatabaseServices.DBObject.IsErased
Свойство предоставляет информацию, был очищен ли объект.
Свойство предоставляет информацию, был очищен ли объект.
Returns: Возвращает тип данных bool. Возвращает true, если объект, ассоциированный с данным,
очищен.

Teigha.DatabaseServices.DBObject.IsEraseStatusToggled
Свойство предоставляет информацию, был ли переключен бит очистки объекта с момента его открытия.
Свойство предоставляет информацию, был ли переключен бит очистки объекта с момента его открытия.
Returns: Возвращает тип данных bool. Возвращает true, если бит очистки объекта был переключен с
момента его открытия.

Teigha.DatabaseServices.DBObject.IsModified
Свойство предоставляет информацию, был ли объект изменен.
Свойство предоставляет информацию, был ли объект изменен.
Returns: Возвращает тип данных bool. Возвращает true, если объект был изменен.

Teigha.DatabaseServices.DBObject.IsModifiedGraphics
Свойство предоставляет информацию, был ли объект, отнаследованный от класса Entity, изменен.
Свойство предоставляет информацию, был ли объект, отнаследованный от класса Entity, изменен.
Returns: Возвращает тип данных bool. Возвращает true, если объект был изменен.

Teigha.DatabaseServices.DBObject.IsModifiedXData
Свойство предоставляет информаицю, были ли изменены XData объекта.
Свойство предоставляет информацию, были ли изменены XData объекта.
Returns: Возвращает тип данных bool. Возвращает true, если данные были изменены.

Teigha.DatabaseServices.DBObject.IsNewObject
Свойство предоставляет информацию, был ли закрыт объект с момента его создания.
Свойство предоставляет информацию, был ли закрыт объект с момента его создания.
Returns: Возвращает тип данных bool. Возвращает true, если объект еще не был закрыт с того
момента, как он впервые был создан.

Teigha.DatabaseServices.DBObject.IsNotifyEnabled
Свойство предоставляет информацию, открыт ли объект в режиме OpenMode.ForNotify.
Свойство предоставляет информацию, открыт ли объект в режиме OpenMode.ForNotify.
Returns: Возвращает тип данных bool. Возвращает true, если объект в настоящее время открыт в
режиме OpenMode.ForNotify.

Teigha.DatabaseServices.DBObject.IsNotifying
Свойство предоставляет информацию, отправляет ли в данный момент объект уведомление о событии.
Возвращает true, если объект находится в процессе посылки
уведомления о событии.
Returns: Возвращает тип данных bool.

Teigha.DatabaseServices.DBObject.IsObjectIdsInFlux
Свойство предоставляет информацию, находится ли данный объект в процессе преобразования.
Свойство проверяет условие, которое происходит в процессе выполнения
глубокого клонирования. Свойство возвращает true, если Id
клонированных объектов еще не преобразованы, и, следовательно,
не могут использоваться в любых операциях с объектами. Это
условие обычно происходит только при
CEventReactorImpl.beginDeepCloneXlation, DBObject.DeepClone,
или DBObject.WblockClone. Любые операции, которые включают
ссылку на Id объектов, таких как записи таблицы символов,
должны быть отложены до окончания endDeepClone.
DBObject.SubClose, чтобы не вызвать никаких объектов, Id
которых могут находиться в процессе преобразования.
Returns: Возвращает тип данных bool.

Teigha.DatabaseServices.DBObject.IsPersistent
Свойство предоставляет информацию о том, является ли объект резидентом базы данных чертежа.
Свойство предоставляет информацию о том, является ли объект резидентом базы данных чертежа.
Returns: Возвращает тип данных bool. Возвращает true, если отображаемый объект является резидентом
базы данных (относится к модели, которая требует
использования функций открытия и закрытия).

Teigha.DatabaseServices.DBObject.IsReadEnabled
Свойство предоставляет информацию, открыт ли объект на чтение.
Свойство предоставляет информацию, открыт ли объект на чтение.
Returns: Возвращает тип данных bool. Возвращает true, если объект в данный момент открыт в режиме
OpenMode.ForRead.

Teigha.DatabaseServices.DBObject.IsReallyClosing
Свойство предоставляет информацию о статусе закрытия объекта.
Свойство предоставляет информацию о статусе закрытия объекта.
Returns: Возвращает тип данных bool. Возвращает true, если вызванный в данный момент метод Close()
действительно полностью закрыл объект. Например, если объект
не находится в транзакции, и был открыт на чтение только
одним пользователем, будет возвращено true.

Teigha.DatabaseServices.DBObject.IsTransactionResident
Свойство предоставляет информацию об участии объекта в транзакции.
Свойство предоставляет информацию об участии объекта в транзакции.
Returns: Возвращает тип данных bool. Возвращает true, если объект в данный момент является частью
транзакции.

Teigha.DatabaseServices.DBObject.IsUndoing
Свойство предоставляет информацию об участии объекта в операции Undo.
Свойство предоставляет информацию об участии объекта в операции Undo.
Returns: Возвращает тип данных bool. Возвращает true, если объект участвует в операции Undo в
данный момент времени.

Teigha.DatabaseServices.DBObject.IsWriteEnabled
Свойство предоставляет информацию о статусе объекта: открыт ли он на запись и посылает ли уведомления.
Свойство предоставляет информацию о статусе открытия объекта и отправки им уведомлений.
Returns: Тип данных bool. Возвращает true, если объект в данный момент доступен
на запись и в данный момент не посылает
уведомления.

Teigha.DatabaseServices.DBObject.MergeStyle
Свойство позволяет установить нужный стиль слияния словарей.
Свойство обеспечивает доступ к настройке стиля слияния словарей.
Returns: Возвращает установленный стиль слияния. Тип данных DuplicateRecordCloning

Teigha.DatabaseServices.DBObject.ObjectBirthVersion
Свойство предоставляет набор параметров объекта в исходной версии.
Свойство предоставляет данные начальной версии объекта. Начальная
версия объекта — это версия, в которой класс был введен. Эта
информация требуется для определения того, когда класс был
зарегистрирован в nanoCAD.
Returns: Возвращает набор параметров объекта, тип FullDwgVersion.

Teigha.DatabaseServices.DBObject.ObjectId
Свойство предназначено для получения идентификатора этого объекта.
Свойство предоставляет значение идентификатора этого объекта в базе данных чертежа.
Returns: Возвращает идентификатор объекта. Тип ObjectId

Teigha.DatabaseServices.DBObject.OwnerId
Свойство предназначено для получения идентификатора владельца объекта.
Свойство предоставляет значение идентификатора владельца этого объекта в базе данных чертежа.
Returns: Возвращает идентификатор владельца в базе данных чережа. Тип ObjectId

Teigha.DatabaseServices.DBObject.PaperOrientation
Свойство предназначено для получения значения свойства ориентации листа аннотационного объекта.
Свойство предоставляет значение свойства ориентации листа аннотационного объекта.
Returns: Возвращает текущее значение свойств ориентации листа аннотационного объекта. Тип PaperOrientationStates

Teigha.DatabaseServices.DBObject.UndoFiler
Свойство предоставляет доступ к истории операций с объектом.
Свойство предоставляет доступ к истории операций с объектом для выполнения операции Undo.
Returns: Возвращает историю операций с объектом выполнения операции Undo с объектом. Тип DwgFiler

Teigha.DatabaseServices.DBObject.XData
Свойство предоставляет доступ к XData этого объекта.
Свойство предоставляет доступ к XData этого объекта.
Returns: Возвращает тип данных ResultBuffer