Teigha.DatabaseServices.UnderlayDefinition
Класс UnderlayDefinition является абстрактным классом, который обеспечивает связь с внешним содержимым подложки.
Класс UnderlayDefinition — это абстрактный класс, который обеспечивает связь с внешним содержимым подложки.
Подложки аналогичны растровым изображениям, за исключением того, что пользователю доступны привязки к содержимому подложки. На экземпляр класса UnderlayDefinition могут ссылаться объекты UnderlayReferences.
Класс UnderlayReference отвечает за размещение содержимого в чертеже, а класс UnderlayDefinition обеспечивает связь с содержимым подложки.
Экземпляры конкретных классов, производных от UnderlayReference, вставляются в запись таблицы блоков.
Экземпляры конкретных классов, производных от UnderlayDefinition, вставляются в словарь в словаре именованных объектов.

Teigha.DatabaseServices.UnderlayDefinition.GetDictionaryKey(Type)
Метод позволяет получить имя словаря с объектами UnderlayDefinition в словаре именованных объектов.
Метод позволяет получить имя словаря с объектами UnderlayDefinition в словаре именованных объектов.
underlayDefinitionType: Входной дескриптор класса типа подложки, для которого требуется получить имя словаря. Тип Type.
Returns: Возвращает имя словаря. Тип String.

Teigha.DatabaseServices.UnderlayDefinition.Load(String)
Метод позволяет загрузить файл, на который ссылается эта подложка.
Метод позволяет загрузить файл, возвращаемый свойством UnderlayDefinition.ActiveFileName.
Если пароль равен null, но он необходим для открытия файла, этот метод запрашивает пароль у пользователя.
password: Необязательный пароль, который может потребоваться для открытия файла. Тип String.

Teigha.DatabaseServices.UnderlayDefinition.SetUnderlayItem(String,String,Teigha.DatabaseServices.UnderlayItem)
Метод позволяет задать имя элемента подложки, на который должна ссылаться эта подложка, и выгружает предыдущий элемент подложки, на который имелась ссылка.
Метод позволяет задать имя элемента подложки, на который должна ссылаться эта подложка, и выгружает предыдущий элемент подложки, на который имелась ссылка.
sourceFileName: Путь к исходному файлу. Тип String.
activeFileName: Путь к активному файлу. Тип String.
item: Элемент, на который создается ссылка. Тип UnderlayItem.

Teigha.DatabaseServices.UnderlayDefinition.ActiveFileName
Свойство ActiveFileName представляет полный путь к файлу, на который ссылается данная подложка.
Свойство ActiveFileName представляет полный путь к файлу, на который ссылается данная подложка.
Returns: Полный путь к файлу. Тип String.

Teigha.DatabaseServices.UnderlayDefinition.ItemName
Свойство ItemName представляет имя элемента, на который ссылается эта подложка.
Свойство ItemName представляет имя элемента, на который ссылается эта подложка.
Returns: Возвращает имя элемента. Тип String.

Teigha.DatabaseServices.UnderlayDefinition.Loaded
Свойство Loaded позволяет определить, загружена ли в данный момент эта подложка.
Свойство Loaded позволяет определить, загружена ли в данный момент эта подложка.
Returns: Возвращает true, если данная подложка загружена.
В противном случае возвращает false.

Teigha.DatabaseServices.UnderlayDefinition.SourceFileName
Свойство SourceFileName представляет полное или относительное имя исходного файла, на который ссылается эта подложка.
Свойство SourceFileName представляет имя исходного файла, на который ссылается эта подложка.
Путь к файлу может быть как полным, так и относительным.
Returns: Возвращает полное или относительное имя файла. Тип String.

Teigha.DatabaseServices.UnderlayDefinition.UnderlayItem
Свойство UnderlayItem представляет элемент, на который ссылается эта подложка.
Свойство UnderlayItem представляет элемент, на который ссылается эта подложка.
Returns: Возвращает элемент, на который ссылается подложка.
Тип DatabaseServices.UnderlayItem.