Teigha.DatabaseServices.DwgFiler
Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DWG.
Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DWG.

Teigha.DatabaseServices.DwgFiler.ReadBytes(array)
Метод предназначен для получения указанного количества байтов из данного объекта Filer.
Метод предназначен для получения указанного количества байтов из данного объекта Filer.
value: Массив байтов. Его длина определяет количество считываемых байтов. Тип long long[].

Teigha.DatabaseServices.DwgFiler.Seek(long long,System.Int32)
Метод предназначен для перемещения указателя ввода-вывода в указанное место в этом объекте Filer.
Метод предназначен для перемещения указателя ввода-вывода в указанное место в этом объекте Filer.
Характер смещения можно настроить аргументом method:
Тип		Описание
---		--------------------------------
0		Абсолютное значение
1 		Относительно текущего положения
2 		От конца файла
offset: Смещение в количестве байтов.  Тип long long.
method: Тип поиска. Тип int

Teigha.DatabaseServices.DwgFiler.WriteAddress(IntPtr)
Метод предназначен для записи указанного адреса памяти в данный объект Filer.
Метод предназначен для записи указанного адреса памяти в данный объект Filer.
value: Адрес, который следует записать в Filer. Тип IntPtr.

Teigha.DatabaseServices.DwgFiler.WriteBinaryChunk(array)
Метод предназначен для записи заданного двоичного фрагмента в этот объект Filer.
Метод предназначен для записи заданного двоичного фрагмента chunk в этот объект Filer.
chunk: Двоичный фрагмент, который требуется записать в Filer.  Тип unsigned char[].

Teigha.DatabaseServices.DwgFiler.WriteBoolean(System.Boolean)
Метод предназначен для записи заданного логического значения в этот объект Filer.
Метод предназначен для записи в этот объект Filer заданного логического значения value.
value: Записываемое в Filer значение. Тип bool.

Teigha.DatabaseServices.DwgFiler.WriteByte(Byte)
Метод предназначен для записи заданного байта в этот объект Filer.
Метод предназначен для записи в этот объект Filer заданного байта value.
value: Записываемое в Filer значение. Тип byte.

Teigha.DatabaseServices.DwgFiler.WriteBytes(array)
Метод предназначен для записи заданного байтового массива в этот объект Filer.
Метод предназначен для записи заданного байтового массива value в этот объект Filer.
value: Записываемый в Filer массив. Тип unsigned char[].

Teigha.DatabaseServices.DwgFiler.WriteDouble(System.Double)
Метод предназначен для записи заданного значения типа double в этот объект Filer.
Метод предназначен для записи заданного значения типа double в этот объект Filer.
value: Записываемое в Filer значение. Тип double.

Teigha.DatabaseServices.DwgFiler.WriteHandle(Teigha.DatabaseServices.Handle)
Метод предназначен для записи заданного дескриптора объекта в этот объект Filer.
Метод предназначен для записи заданного дескриптора Handle в этот объект Filer.
handle: Записываемый в Filer дескриптор объекта. Тип Handle.

Teigha.DatabaseServices.DwgFiler.WriteHardOwnershipId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи заданного идентификатора жесткой ссылки владения объектом (HardOwnershipId) в этот объект Filer.
Метод предназначен для записи заданного идентификатора жесткой ссылки владения объектом (HardOwnershipId) в этот объект Filer.
value: Записываемый в Filer идентификатор жесткой ссылки владения объектом. Тип ObjectId.

Teigha.DatabaseServices.DwgFiler.WriteHardPointerId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи заданного идентификатора жесткой ссылки на указатель (HardPointerId) в этот объект Filer.
Метод предназначен для записи заданного идентификатора жесткой ссылки на указатель (HardPointerId) в этот объект Filer.
value: Записываемый в Filer идентификатор жесткой ссылки на указатель. Тип ObjectId.

Teigha.DatabaseServices.DwgFiler.WriteInt16(short)
Метод предназначен для записи заданного 16-разрядного целого числа со знаком в этот объект Filer.
Метод предназначен для записи заданного 16-разрядного целого числа со знаком (тип short) в этот объект Filer.
value: Записываемое в Filer значение. Тип short.

Teigha.DatabaseServices.DwgFiler.WriteInt32(System.Int32)
Метод предназначен для записи заданного 32-разрядного целого числа со знаком (тип int) в этот объект Filer.
Метод предназначен для записи заданного 32-разрядного целого числа со знаком (тип int) в этот объект Filer.
value: Записываемое в Filer значение. Тип int.

Teigha.DatabaseServices.DwgFiler.WriteInt64(long long )
Метод предназначен для записи заданного 64-разрядного целого числа со знаком (тип long long) в этот объект Filer.
Метод предназначен для записи заданного 64-разрядного целого числа со знаком (тип long long) в этот объект Filer.
value: Записываемое в Filer значение. Тип long long.

Teigha.DatabaseServices.DwgFiler.WritePoint2d(Teigha.Geometry.Point2d)
Метод предназначен для записи заданной двумерной точки Point2d в этот объект Filer.
Метод предназначен для записи заданной двумерной точки Point2d в этот объект Filer.
value: Записываемое в Filer значение. Тип Point2d.

Teigha.DatabaseServices.DwgFiler.WritePoint3d(Teigha.Geometry.Point3d)
Метод предназначен для записи указанной трехмерной точки Point3d в этот объект Filer.
Метод предназначен для записи указанной трехмерной точки Point3d в этот объект Filer
value: Записываемое в Filer значение. Тип Point3d.

Teigha.DatabaseServices.DwgFiler.WriteScale3d(Teigha.Geometry.Scale3d)
Метод предназначен для записи указанного объекта Scale3d в этот объект Filer.
Метод предназначен для записи указанного объекта Scale3d в этот объект Filer.
value: Записываемое в Filer значение. Тип Scale3d.

Teigha.DatabaseServices.DwgFiler.WriteSoftOwnershipId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки владения объектом SoftOwnershipId.
Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки владения объектом SoftOwnershipId.
value: Записываемое в Filer значение. Тип ObjectId.

Teigha.DatabaseServices.DwgFiler.WriteSoftPointerId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки на указатель SoftPointerId.
Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки на указатель SoftPointerId.
value: Записываемое в Filer значение. Тип ObjectId.

Teigha.DatabaseServices.DwgFiler.WriteString(String)
Метод предназначен для записи в этот Filer указанной строки.
Метод предназначен для записи в этот Filer указанной строки.
value: Записываемое в Filer значение. Тип String.

Teigha.DatabaseServices.DwgFiler.WriteUInt16(unsigned short)
Метод записывает в этот Filer указанное 16-разрядное целое число без знака (тип unsigned short).
Метод записывает в этот Filer указанное 16-разрядное целое число без знака (тип unsigned short).
value: Записываемое в Filer значение. Тип unsigned short.

Teigha.DatabaseServices.DwgFiler.WriteUInt32(unsigned int)
Метод записывает в этот Filer указанное 32-разрядное целое число без знака (тип unsigned int).
Метод записывает в этот Filer указанное 32-разрядное целое число без знака (тип unsigned int).
value: Записываемое в Filer значение. Тип unsigned int.

Teigha.DatabaseServices.DwgFiler.WriteUInt64(unsigned long long)
Метод записывает в этот Filer указанное 64-разрядное целое число без знака (тип unsigned long long).
Метод записывает в этот Filer указанное 64-разрядное целое число без знака (тип unsigned long long).
value: Записываемое в Filer значение. Тип unsigned long long.

Teigha.DatabaseServices.DwgFiler.WriteVector2d(Teigha.Geometry.Vector2d)
Метод записывает в этот Filer указанный объект Vector2d.
Метод записывает в этот Filer указанный объект Vector2d.
value: Записываемое в Filer значение. Тип Vector2d.

Teigha.DatabaseServices.DwgFiler.WriteVector3d(Teigha.Geometry.Vector3d)
Метод записывает в этот Filer указанный объект Vector3d.
Метод записывает в этот Filer указанный объект Vector3d.
value: Записываемое в Filer значение. Тип Vector3d.

Teigha.DatabaseServices.DwgFiler.FilerStatus
Свойство представляет текущее состояние данного объекта Filer.
Свойство представляет текущее состояние данного объекта Filer.
Returns: Возвращает статус объекта как значение из перечисления Teigha.Runtime.ErrorStatus.

Teigha.DatabaseServices.DwgFiler.Database
Свойство возвращает объект Database, представляющий базу данных, с которой связан данный объект Filer.
Свойство возвращает объект Database, представляющий базу данных, с которой связан данный объект Filer.
Returns: Возвращает базу данных. Тип DatabaseServices.Database.

Teigha.DatabaseServices.DwgFiler.FilerType
Свойство возвращает тип этого файлера.
Свойство возвращает тип этого файлера.
Returns: Возвращает тип этого файлера как значение из перечисления Teigha.DatabaseServices.FilerType.

Teigha.DatabaseServices.DwgFiler.DwgVersion
Свойство возвращает версию DWG файла, с которым связан данный файлер, в виде объекта FullDwgVersion.
Свойство возвращает версию DWG файла, с которым связан данный файлер, в виде объекта FullDwgVersion.
Returns: Возвращает версию DWG файла как объект FullDwgVersion.

Teigha.DatabaseServices.DwgFiler.Position
Свойство предоставляет доступ к текущей позиции указателя ввода-вывода этого объекта Filer.
Свойство предоставляет доступ к текущей позиции указателя ввода-вывода этого объекта Filer.
Returns: Возвращает текущую позицию указателя ввода-вывода данного файлера. Тип long.