HostMgd.EditorInput.DisposableSelectionSet
Класс DisposableSelectionSet представляет набор выделенных в редакторе nanoCAD объектов, в котором реализован интерфейс IDisposable для корректного освобождения связанных ресурсов.
В текущей версии этот класс не реализован.
Класс DisposableSelectionSet представляет набор выделенных в редакторе nanoCAD объектов, в котором реализован интерфейс IDisposable для корректного освобождения связанных ресурсов.
В текущей версии не реализован.

HostMgd.EditorInput.DisposableSelectionSet.#ctor(HostMgd.EditorInput.SelectionSetDelayMarshalled)
Конструктор класса DisposableSelectionSet.
Конструктор класса DisposableSelectionSet.
Создает новый экземпляр класса на основе предоставленной выборки объектов чертежа.
selectionSet: Набор выбранных объектов чертежа. Тип HostMgd.EditorInput.SelectionSetDelayMarshalled.