Teigha.Geometry.Point2dCollection.TrimToSize
Метод приводит ёмкость данной коллекции в соответствие фактическому количеству ее элементов.
Метод приводит ёмкость данной коллекции в соответствие фактическому количеству ее элементов.