HostMgd.EditorInput.SelectionMethod
Перечисление, обозначающее различные методы выбора объектов в
nanoCAD.
Члены          Описание
перечисления
-------------  -------------------------------------------------------------
Crossing =     Выбор пересечением или пересечением многоугольником.При
3              выборе перечесением с многоугольником, Id окна указывается
в подсписке данных геометрического объекта, чтобы
идентифицировать, какое пересечение было использовано для
выбора геометрического объекта. Id окна также указывается в
списке данных для выбора включением/пересечением с окном
или включением в многоугольник. По совпадению этих Id
приложение может определить всю информацию о том, как
геометрический объект был выбран.Id окон начинаются с
\-1 и последовательно уменьшаются (т.е., становятся -2, -3 и
т.д.). Каждое отдельное пересечение, используемое в
процессе выбора, получает свой собственный Id.
Fence = 4      Выбор объекта путём указания точки на его теле.Для
такого выбора выбранная точка должна пересекаться с
выбираемым геометрическим объектом. Список данных точки
пересечения такой же, как и для обычной базовой точки, но
содержит подсписок для каждого пересечения между точкой и
видимым ребром геометрического объекта
NonGraphical   Не графический выбор.Если выбор производится этим не
= 0            графическим методом, то только метод выбора, имя
геометрического объекта и GS марке будут содержаться в
подсписке.
PickPoint =    Указание точкой.Для геометрических объектов, выбранных
1              этим методом, содержится примерно такая же информация, как
и информация для GS маркера
SubEntity =    Выбор геометрического подобъекта.Этот метод выбора
5              когда геометрический объект попадает в выбранный набор
из-за того, что выбора его подобъект. В этом случае формат
результатов такой-же, как и для не графического метода
выбора
Unavailable    Нет доступных методов выбора
= -1
Window = 2     Выбор окном или многоугольником.Для выбора
многоугольником, Id окна заносится в подсписок данных
геометрического объекта, чтобы идентифицировать, какое окно
использовалось для выбора геометрического объекта.Id
окна также указывается в списке данных для выбора
включением/пересечением с окном или включением в
многоугольник. По совпадению этих Id приложение может
определить всю информацию о том, как геометрический объект
был выбран.Id окон начинаются с -1 и последовательно
уменьшаются (т.е., становятся -2, -3 и т.д.). Каждое
отдельное пересечение, используемое в процессе выбора,
получает свой собственный Id.