HostMgd.EditorInput.SelectionSet
Класс представляет собой колекцию объектов, обычно выбираемых
пользователем

HostMgd.EditorInput.SelectionSet.CopyTo(Array,System.Int32)
Копирует выбранный набор или его часть в одномерный массив.
a: Одномерный массив, в который записываются копируемые
index: Индекс массива, начиная с которого должны размещаться

HostMgd.EditorInput.SelectionSet.CopyTo(array,System.Int32)
Копирует выбранный набор или его часть в одномерный массив.
a: Одномерный массив, в который записываются копируемые
index: Индекс массива, начиная с которого должны размещаться

HostMgd.EditorInput.SelectionSet.Count
Возвращает количество элементов, реально содержащихся в
выбранном наборе.

HostMgd.EditorInput.SelectionSet.FromObjectIds(array)
Создает новый выбранный набор, используя массив Id объектов
ids: Массив Id объектов

HostMgd.EditorInput.SelectionSet.IsSynchronized
Возвращает признак того, является ли набор синхронизированным.

HostMgd.EditorInput.SelectionSet.#ctor
Конструктор класса, создающий пустую коллекцию.

HostMgd.EditorInput.SelectionSet.SyncRoot
Возвращает корневой синхронизированный объект.

HostMgd.EditorInput.SelectionSet.ToString(IFormatProvider)
Возвращает строковое представление данного объекта в
соответствии с заданным форматом, зависящим от локализации.
provider: Формат, зависящей от локализации