Teigha.GraphicsInterface.FaceData.GetTransparency
Метод предоставляет массив объектов прозрачности для граней сети или оболочки, используемых этим объектом FaceData.
Метод позволяет получить массив объектов прозрачности для граней сети или оболочки, используемых этим объектом FaceData.
Returns: Возвращает массив объектов прозрачности для граней.
Тип Transparency[].