Teigha.GraphicsSystem.GsModule.CreateBitmapDevice
Метод создает новое устройство растрового изображения.
Метод создает новый объект Device растрового изображения.
Returns: Возвращает созданное устройство растрового изображения.
Тип GraphicsSystem.Device.