Teigha.DatabaseServices.OpenMode
Этот перечислимый тип предоставляет режимы доступа к открываемым резидентным объектам базы данных.
Этот перечислимый тип предоставляет режимы доступа к открываемым резидентным объектам базы данных.