Teigha.DatabaseServices.Leader.EvaluateLeader
Вычисляет отношения выноски с ассоциированной аннотацией и
обновляет геометрию выноски, если это необходимо.
Это может вызвать изменения положения конечной точки выноски,
и метод может полностью удалить ассоциативные связи в одном
из следующих случаев:
* Id аннотации выноски не является корректным Id объекта;
* Id выноски не представлен постоянным реактором в
аннотационном объекте.