HostMgd.EditorInput.JigPromptOptions.CommonInit
Вспомогательный метод, который задает значения свойствам Cursor и UserInputControls при создании экземпляра
класса.
Вспомогательный метод, вызывается в конструкторах класса для установки значений свойств Cursor и UserInputControls.
Свойству Cursor присваивается значение Crosshair, свойству UserInputControls присваивается значение 0, т.е. все настройки
пользовательского ввода равны значениям по умолчанию.