HostMgd.EditorInput.PromptOptions.IsReadOnly
Признак доступности свойств класса для записи.
Возвращает признак доступности свойств класса UseDefaultValue, DefaultValueWorker для записи.
Если значение свойства равно true, то эти свойства класса доступны только для чтения.
Returns: Возвращает признак доступности свойств класса. true - свойства доступны только для чтения, false - свойства доступны для чтения и записи.