HostMgd.PlottingServices.DsdData.Copy
Метод создает копию данного объекта DsdData.
Не реализован.
Метод создает копию данного объекта DsdData.
В текущей версии не реализован.
Returns: Возвращает DSD-данные в виде объекта типа HostMgd.PlottingServices.DsdData.