Teigha.DatabaseServices.Cell.GetMergeRange
Метод позволяет получить диапазон слияния данной ячейки.
Метод позволяет получить диапазон слияния данной ячейки.
Метод возвращает недопустимый диапазон слияния, если ячейка не является частью диапазона слияния.
Returns: Возвращает диапазон слияния данной ячейки. Тип CellRange.