Teigha.DatabaseServices.CellRange.GetDataLink
Метод позволяет получить коллекцию внешних ссылок в этом диапазоне ячеек.
Метод позволяет получить коллекцию внешних ссылок в этом диапазоне ячеек.
Returns: Возвращает коллекцию идентификаторов внешних ссылок. Тип ObjectIdCollection.