HostMgd.ApplicationServices
Пространство имен, в котором расположены классы, предназначенные для работы с приложением nanoCAD через API.
В пространстве имен расположены классы, с помощью которых можно работать с приложением nanoCAD через API:
закрывать приложение, переключаться между открытыми чертежами, отслеживать события, происходящие в приложении,
вызывать справку и пр.