Teigha.DatabaseServices.HatchLoopTypes
Данное перечисление представляет типы границ областей, используемых в штриховке.
Перечисление HatchLoopTypes представляет типы границ областей, используемых в штриховке.