Teigha.DatabaseServices.PlaneSurface
Данный класс реализует объект трехмерной плоской поверхности.
Данный класс реализует объект трехмерной плоской поверхности.

Teigha.DatabaseServices.PlaneSurface.#ctor
Конструктор по умолчанию класса PlaneSurface.
Конструктор по умолчанию класса PlaneSurface.

Teigha.DatabaseServices.PlaneSurface.CreateFromRegion(Teigha.DatabaseServices.Region)
Метод предназначен для создания плоской поверхности на основе указанной области.
Метод предназначен для создания плоской поверхности на основе указанной области.
region: Область, на основе которой должна быть создана плоская поверхность.