Teigha.DatabaseServices.MergeCellStyleOption.ConvertDuplicatesToOverrrides
Значение: 4.
В случае конфликтов в именах стилей ячеек формат стиля целевых ячеек устанавливается как переопределенный.
Аналогичное действие применяется к строкам и столбцам, которые ссылаются на эти стили ячеек.