HostMgd.ApplicationServices.InplaceTextEditor
Класс InplaceTextEditor представляет встроенный текстовый редактор nanoCAD.
В текущей версии не реализован.
Класс InplaceTextEditor представляет встроенный текстовый редактор nanoCAD.
В текущей версии не реализован.

HostMgd.ApplicationServices.InplaceTextEditor.AddUndoMarker(InplaceTextEditor.TextUndoType)
Метод добавляет маркер отмены в очередь отмены действий данного объекта.
В текущей версии не реализован.
Метод AddUndoMarker() добавляет маркер отмены в очередь отмены действий данного объекта.
В текущей версии не реализован.
undoType: Тип маркера отмены из перечисления InplaceTextEditor.TextUndoType.

HostMgd.ApplicationServices.InplaceTextEditor.AttachmentMenus(System.Drawing.Point,HostMgd.Windows.Window)
Метод вызывает меню прикрепления данного встроенного текстового редактора.
В текущей версии не реализован.
Метод вызывает меню прикрепления данного встроенного текстового редактора в привязке к указанной точке экрана.
В текущей версии не реализован.
pos: Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
parent: Родительское окно для вызываемого меню. Тип HostMgd.Windows.Window.

HostMgd.ApplicationServices.InplaceTextEditor.ColumnMenus(System.Drawing.Point,HostMgd.Windows.Window)
Метод вызывает меню столбцов данного текстового редактора.
В текущей версии не реализован.
Метод вызывает меню столбцов данного текстового редактора в привязке к указанной точке экрана.
В текущей версии не реализован.
pos: Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
parent: Родительское окно для вызываемого меню. Тип HostMgd.Windows.Window.

HostMgd.ApplicationServices.InplaceTextEditor.ColumnsDialog(System.Int32)
Метод вызывает диалог редактирования столбцов данного текстового редактора.
В текущей версии не реализован.
Метод вызывает диалог редактирования столбцов данного текстового редактора.
В текущей версии не реализован.
staticColumnCount: Текущее количество столбцов. Тип int.

HostMgd.ApplicationServices.InplaceTextEditor.ContextMenus(System.Drawing.Point,HostMgd.Windows.Window)
Метод вызывает контекстное меню данного текстового редактора.
В текущей версии не реализован.
Метод вызывает контекстное меню данного текстового редактора в привязке к указанной точке экрана.
В текущей версии не реализован.
pos: Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
parent: Родительское окно для контекстного меню. Тип HostMgd.Windows.Window.

HostMgd.ApplicationServices.InplaceTextEditor.FieldDialog(Teigha.DatabaseServices.Field)
Метод вызывает диалог редактирования поля.
В текущей версии не реализован.
Метод вызывает диалог редактирования поля field.
В текущей версии не реализован.
field: Поле, для редактирования которого вызывается диалог. Тип Teigha.DatabaseServices.Field.

HostMgd.ApplicationServices.InplaceTextEditor.FindMatchItem(System.Int32,System.String)
Метод предназначен для поиска указанной строки с учетом заданных флагов поиска.
В текущей версии не реализован.
Метод реализует поиск в данном редакторе вхождения указанной строки с учетом заданной комбинации флагов поиска.
В случае успеха найденная строка будет подсвечена.
Если строку найти не удастся, будет выведено сообщение.
В текущей версии метод не реализован.
flags: Флаги поиска. Например, строка целиком, совпадение по регистру и т.п. Тип int.
findStr: Искомая строка. Тип System.String.

HostMgd.ApplicationServices.InplaceTextEditor.InsertFile(System.String)
Метод вставляет в данный редактор контент из указанного файла.
В текущей версии не реализован.
Метод вставляет в данный редактор контент из файла с именем filename.
В текущей версии не реализован.
filename: Входное имя вставляемого файла. Тип System.String.

HostMgd.ApplicationServices.InplaceTextEditor.Invoke(Teigha.DatabaseServices.DBText,array)
Метод вызывает встроенный текстовый редактор для указанного текстового объекта.
В текущей версии метод не реализован.
Метод вызывает встроенный текстовый редактор для указанного текстового объекта.
Если уже имеется активный встроенный редактор, он будет предварительно закрыт.
В текущей версии метод не реализован.
text: Текст, редактирование которого начнется во встроенном текстовом редакторе. Тип Teigha.DatabaseServices.DBText.
appendedEntities: Если объект text является новым и пока отсутствует в базе данных, пользователь, используя левую кнопку мыши, может начать другой сеанс редактирования этого текста. При закрытии редактора новые текстовые объекты будут сохранены в текущей базе данных. Этот параметр возвращает массив добавленных в базу данных объектов.  Тип Teigha.DatabaseServices.ObjectId[].

HostMgd.ApplicationServices.InplaceTextEditor.Invoke(Teigha.DatabaseServices.MText,HostMgd.ApplicationServices.InplaceTextEditorSettings)
Метод вызывает встроенный текстовый редактор для указанного многострочного текста MTEXT.
В текущей версии не реализован.
Метод вызывает встроенный текстовый редактор для указанного многострочного текста MTEXT.
Если уже имеется активный встроенный редактор, он будет предварительно закрыт.
В текущей версии метод не реализован.
mtext: Многострочный текст, редактирование которого начнётся во встроенном текстовом редакторе. Тип Teigha.DatabaseServices.MText.
settings: Настройки, с которыми вызывается встроенный текстовый редактор. Тип InplaceTextEditorSettings.  Если передается значение NULL, при вызове редактора будут использоваться настройки по умолчанию.

HostMgd.ApplicationServices.InplaceTextEditor.LineSpaceMenus(System.Drawing.Point,HostMgd.Windows.Window)
Метод вызывает меню для изменения в данном текстовом редакторе текущего межстрочного интервала.
В текущей версии не реализован.
Метод предназначен для вызова меню редактирования текущего межстрочного интервала в данном текстовом редакторе.
В текущей версии не реализован.
pos: Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
parent: Родительское окно для вызываемого меню. Тип HostMgd.Windows.Window.

HostMgd.ApplicationServices.InplaceTextEditor.NumberingMenus(System.Drawing.Point,HostMgd.Windows.Window)
Метод вызывает меню нумерации текстовых абзацев.
В текущей версии не реализован.
Метод вызывает в данном текстовом редакторе меню нумерации текстовых абзацев.
В текущей версии не реализован.
pos: Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
parent: Родительское окно для вызываемого меню. Тип HostMgd.Windows.Window.

HostMgd.ApplicationServices.InplaceTextEditor.ReplaceAllMatches(System.Int32,System.String,System.String)
Метод предназначен для замены всех вхождений указанной строки на заданную строку с учетом предписанных флагов поиска.
В текущей версии не реализован.
Метод предназначен для замены всех вхождений строки findStr на строку replaceStr с учетом предписанных флагов поиска flags.
По окончании работы метода отображается окно сообщения о завершении операции.
В текущей версии метод не реализован.
flags: Флаги поиска. Например, строка целиком, совпадение по регистру и т.п. Тип int.
findStr: Заменяемая подстрока. Тип System.String.
replaceStr: Заменяющая подстрока. Тип System.String.

HostMgd.ApplicationServices.InplaceTextEditor.ReplaceCurrentMatch(System.Int32,System.String,System.String)
Метод предназначен для замены текущего вхождения указанной строки на другую заданную строку с учетом предписанных флагов поиска.
В текущей версии не реализован.
Метод предназначен для замены текущего вхождения строки findStr на строку replaceStr с учетом предписанных флагов поиска flags. После замены строк курсор будет установлен в конце заменяющего текста.
Если строка findStr не найдена, отображается сообщение о завершении задачи.
В текущей версии метод не реализован.
flags: Флаги поиска. Например, строка целиком, совпадение по регистру и т.п. Тип int.
findStr: Заменяемая подстрока. Тип System.String.
replaceStr: Заменяющая подстрока. Тип System.String.

HostMgd.ApplicationServices.InplaceTextEditor.SymbolMenus(System.Drawing.Point,HostMgd.Windows.Window)
Метод вызывает меню символов данного встроенного текстового редактора.
В текущей версии не реализован.
Метод вызывает меню символов данного встроенного текстового редактора.
В текущей версии данный метод не реализован.
pos: Точка привязки вызываемого меню. Тип System.Drawing.Point. Задается в экранных координатах.
parent: Родительское окно для вызываемого меню. Тип HostMgd.Windows.Window.

HostMgd.ApplicationServices.InplaceTextEditor.Annotative
Свойство Annotative позволяет определить аннотативное состояние данного текстового редактора.
В текущей версии не реализовано.
Свойство Annotative позволяет определить аннотативное состояние данного текстового редактора.
В текущей версии не реализовано.
Returns: Возвращает true, если текстовый редактор находится в аннотативном состоянии.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.CanCopy
Свойство CanCopy позволяет проверить, возможно ли копирование текста в данном текстовом редакторе.
В текущей версии не реализовано.
Свойство CanCopy позволяет проверить, возможно ли копирование текста в данном текстовом редакторе.
В текущей версии не реализовано.
Returns: Возвращает true, если копирование текста разрешено.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.CanCut
Свойство CanCut позволяет проверить, возможно ли вырезать текст с сохранением его в буфере обмена.
В текущей версии не реализовано.
Свойство CanCut позволяет проверить, возможно ли вырезать текст с сохранением его в буфере обмена.
В текущей версии не реализовано.
Returns: Возвращает true, если вырезание текста разрешено.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.CanExitEditor
Свойство CanExitEditor позволяет определить, можно ли закрыть данный текстовый редактор.
В текущей версии не реализовано.
Свойство CanExitEditor позволяет определить, можно ли закрыть данный текстовый редактор.
В текущей версии не реализовано.
Returns: Возвращает true, если данный текстовый редактор можно закрыть.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.CanPaste
Свойство CanPaste позволяет проверить, возможно ли вставить текст из буфера обмена.
В текущей версии не реализовано.
Свойство CanPaste позволяет проверить, возможно ли вставить текст из буфера обмена.
В текущей версии не реализовано.
Returns: Возвращает true, если вставка текста возможна.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.CanRedo
Свойство CanRedo позволяет проверить, возможно ли повторить последнюю выполненную операцию.
В текущей версии не реализовано.
Свойство CanRedo позволяет проверить, возможно ли повторить последнюю выполненную операцию.
В текущей версии не реализовано.
Returns: Возвращает true, если повторить последнюю выполненную операцию возможно.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.CanUndo
Свойство CanUndo позволяет проверить, возможно ли отменить последнюю выполненную операцию.
В текущей версии не реализовано.
Свойство CanUndo позволяет проверить, возможна ли отмена последней выполненной операции.
В текущей версии не реализовано.
Returns: Возвращает true, если отмена последней выполненной операции возможна.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.Current
Свойство Current возвращает текущий активный объект встроенного текстового редактора.
В текущей версии не реализовано.
Свойство Current возвращает текущий активный объект встроенного текстового редактора.
В текущей версии не реализовано.
Returns: Возвращает объект встроенного текстового редактора. Тип InplaceTextEditor.

HostMgd.ApplicationServices.InplaceTextEditor.ForcedOpaqueBackground
Свойство ForcedOpaqueBackground  позволяет проверить, сделан ли принудительно фон непрозрачным.
В текущей версии не реализовано.
Свойство ForcedOpaqueBackground  позволяет проверить, сделан ли принудительно фон в данном редакторе непрозрачным.
В текущей версии не реализовано.
Returns: Возвращает true, если текущая фоновая заливка в данном объекте принудительно сделана непрозрачной.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.LayerColor
Свойство LayerColor позволяет проверить цвет слоя для данного объекта текстового редактора.
В текущей версии не реализовано.
Свойство LayerColor позволяет проверить цвет слоя для данного объекта текстового редактора.
В текущей версии не реализовано.
Returns: Возвращает цвет слоя данного объекта.
Тип Color.

HostMgd.ApplicationServices.InplaceTextEditor.MultiAttribute
Свойство MultiAttribute позволяет проверить, является ли многострочный атрибут текущим объектом в данном текстовом редакторе.
В текущей версии не реализовано.
Свойство MultiAttribute позволяет проверить, является ли многострочный атрибут текущим объектом в данном встроенном текстовом редакторе.
В текущей версии не реализовано.
Returns: Возвращает true, если многострочный атрибут является текущим объектом в данном текстовом редакторе.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.OpaqueBackground
Свойство OpaqueBackground позволяет определить, является ли непрозрачной фоновая заливка в данном редакторе.
В текущей версии не реализовано.
Свойство OpaqueBackground позволяет определить, является ли непрозрачной фоновая заливка в данном редакторе.
Непрозрачный фон скрывает нижележащую геометрию.
В текущей версии данное свойство не реализовано.
Returns: Возвращает true, если фоновая заливка является непрозрачной.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.ParagraphSupported
Свойство ParagraphSupported позволяет проверить, поддерживаются ли текстовые абзацы в данном редакторе.
В текущей версии не реализовано.
Свойство ParagraphSupported позволяет проверить, поддерживаются ли текстовые абзацы в данном редакторе.
В текущей версии не реализовано.
Returns: Возвращает true, если абзацы поддерживаются.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.RulerHidden
Свойство RulerHidden позволяет определить, скрыта ли линейка.
В текущей версии не реализовано.
Свойство RulerHidden позволяет определить, скрыта ли линейка.
В текущей версии не реализовано.
Returns: Возвращает true, если линейка не отображается.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.RulerSupported
Свойство RulerSupported позволяет проверить, поддерживает ли данный текстовый редактор линейку.
В текущей версии не реализовано.
Свойство RulerSupported позволяет проверить, поддерживает ли данный текстовый редактор линейку.
В текущей версии не реализовано.
Returns: Возвращает true, если линейка поддерживается.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.SimpleMText
Свойство SimpleMText  позволяет проверить, является ли текущий объект в редакторе объектом MTEXT.
В текущей версии не реализовано.
Свойство SimpleMText  позволяет проверить, является ли текущий объект в редакторе объектом MTEXT.
В текущей версии не реализовано.
Returns: Возвращает true, если в редакторе текущим является объект MTEXT.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.SpellerEnabled
Свойство SpellerEnabled позволяет определить, включена ли в данном редакторе проверка орфографии.
В текущей версии не реализовано.
Свойство SpellerEnabled позволяет определить, включена ли в данном редакторе проверка орфографии.
В текущей версии не реализовано.
Returns: Возвращает true, если проверка орфографии включена.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.TableCell
Свойство TableCell позволяет проверить, является ли ячейка таблицы текущим объектом в данном редакторе.
В текущей версии не реализовано.
Свойство TableCell позволяет проверить, является ли ячейка таблицы текущим объектом в данном редакторе.
В текущей версии не реализовано.
Returns: Возвращает true, если текущим объектом в редакторе является ячейка таблицы.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.Text
Свойство Text позволяет проверить, является ли текст текущим объектом в данном редакторе.
В текущей версии не реализовано.
Свойство Text позволяет проверить, является ли текст текущим объектом в данном редакторе.
В текущей версии не реализовано.
Returns: Возвращает true, если текущим объектом в редакторе является текст.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.ToolbarHidden
Свойство ToolbarHidden позволяет определить, является ли скрытой панель инструментов.
В текущей версии не реализовано.
Свойство ToolbarHidden позволяет определить, является ли скрытой панель инструментов.
В текущей версии не реализовано.
Returns: Возвращает true, если панель инструментов в редакторе не отображается (скрыта).
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.ToolbarOptionHidden
Свойство ToolbarOptionHidden позволяет управлять отображением опции панели инструментов.
В текущей версии не реализовано.
Свойство ToolbarOptionHidden позволяет управлять отображением опции панели инструментов.
В текущей версии не реализовано.
Returns: Возвращает true, если опция панели инструментов не отображается.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.UndoRecordingDisabled
Свойство UndoRecordingDisabled позволяет включать и выключать режим записи отмены действий.
В текущей версии не реализовано.
Свойство UndoRecordingDisabled позволяет включать и выключать в редакторе режим записи отмены действий.
В текущей версии не реализовано.
Returns: Возвращает true, если запись отмены действий отключена.
В противном случае возвращает false.

HostMgd.ApplicationServices.InplaceTextEditor.Wysiwyg
Свойство Wysiwyg позволяет включать и выключать режим WYSIWYG.
В текущей версии не реализовано.
Свойство Wysiwyg позволяет включать и выключать режим WYSIWYG в данном редакторе.
В текущей версии не реализовано.
Returns: Возвращает true, если режим отображения WYSIWYG включен.
В противном случае возвращает false.