HostMgd.EditorInput.PromptIntegerResult
Класс содержит результат интерактивного ввода целого числа
пользователем в nanoCAD, включая значение, статус и строковое представление ввода.
Класс наследуется от PromptResult и используется для хранения данных
о завершении операции ввода целого числа через метод GetInteger()
или событие PromptedForInteger.
Он предоставляет информацию о:
* введённом числе (Value типа int),
* статусе операции (Status, например OK, Cancel, Error),
* строковом представлении ввода (InputString — если число было введено с клавиатуры или использовалось ключевое слово),
* параметрах приглашения (Options), переданных в команду.
Этот класс применяется при разработке плагинов и надстроек,
где требуется обработка пользовательского ввода с проверкой
допустимых значений, диапазона и контекста.
Класс является sealed (ненаследуемым) и предназначен
только для чтения после выполнения команды.
Example
C#

HostMgd.EditorInput.PromptIntegerResult.ToString(IFormatProvider)
Метод возвращает строковое представление целого числа,
введённого пользователем, с учётом локализации и форматирования,
заданного провайдером.
Метод переопределяет стандартный метод и возвращает строку,
отражающую результат ввода целого числа через интерактивное приглашение в nanoCAD.
В отличие от базового ToString(), этот метод принимает IFormatProvider,
что позволяет форматировать число в соответствии с региональными настройками —
например, учитывать локализацию при отладке, логировании
или отображении информации в командной строке.
Метод возвращает:
Значение Value в виде строки, если статус операции OK.
Сообщение об отмене или ошибке, если ввод не был успешно завершён.
provider: Объект, предоставляющий информацию о форматировании чисел,
Может быть:
Returns: Возвращает значение типа string, представляющее результат операции ввода:
* Для успешного ввода (Status == OK) — строка с числом, отформатированным с учётом провайдера.
* Для отмены или ошибки — строка, отражающая статус операции (например, "Operation cancelled").
Example
C#

HostMgd.EditorInput.PromptIntegerResult.Value
Свойство возвращает целое число, введённое пользователем через
интерактивную команду ввода, например, с помощью метода GetInteger().
Свойство предоставляет доступ к числовому значению, введённому пользователем
в ходе интерактивного приглашения. Оно используется, например, после вызова метода
GetInteger(), чтобы получить результат ввода — целое число в диапазоне
от -32768 до 32767 (ограничение 16-битного целого).
Свойство доступно только для чтения и содержит значение только
в случае успешного завершения операции (Status == PromptStatus.OK).
Если операция была отменена или завершена с ошибкой,
значение может быть не определено или равно 0.
Returns: Возвращает значение типа int, представляющее собой число,
введённое пользователем в результате интерактивной команды ввода.
Если операция успешна (Status == OK) — корректное целое число.
Если операция отменена или произошла ошибка — значение по умолчанию (0)
или недопустимое значение, в зависимости от контекста.
Для проверки успешности ввода рекомендуется использовать свойство Status.
Example
C#