Teigha.DatabaseServices.GradientColor.get_Color
Метод предназначен для получения цвета градиента, представленного данным объектом GradientColor.
Метод предназначен для получения цвета градиента, представленного данным объектом GradientColor.
Returns: Возвращает цвет градиента.  Тип Teigha.Colors.Color.