Teigha.DatabaseServices.Intersect.ExtendArgument
Значение: 2.
При вычислении пересечения, если это необходимо, продлеваются ребра граничной рамки второго объекта (передается как аргумент).
Граничная рамка данного объекта остаётся без изменений.