Teigha.DatabaseServices.SelectType.Window
Значение: 1. Режим выбора рамкой (окном).
Область выбора определяется двумя точками, которые задают прямоугольную рамку.
Выбираются только те объекты, которые полностью находятся внутри рамки.