Teigha.Runtime.RXObject.Clone
Метод создает клон данного объекта.  Если создать клон не удалось, возвращает NULL.
Метод создает клон данного объекта.  Если создать клон не удалось, возвращает NULL.
Returns: Возвращает созданный клон. Тип Object. Если создать клон не удалось, возвращает NULL.