Teigha.BoundaryRepresentation.EdgeLoopCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции циклов ребра BREP.
Тип EdgeLoopEnumerator.