Teigha.DatabaseServices.UnitsValue.LightYears
Значение: 19. Единица измерения - световой год, внесистемная единица измерения расстояний в астрономии. Равна расстоянию, которое электромагнитные волны (свет) проходят в вакууме, не испытывая влияния гравитационных полей, за один юлианский год. Составляет примерно 9.46×10^15 м.