Teigha.Geometry.NurbCurve2d.PurgeFitData
Метод предназначен для удаления всех определяющих данных, использованных для построения данной кривой.
Метод удаляет все определяющие данные, использованные для построения сплайна.
Определяющие данные состоят из определяющих точек, точности интерполяции, касательных векторов в начальной и конечной точках.
Само определение сплайна не изменяется  (т.е. метод не затрагивает управляющие вершины, узлы или веса).
Returns: Возвращает true, если этот сплайн был построен методом определяющих точек.
В противном случае возвращает false.