HostMgd.EditorInput.InputPointContext.GetAlignmentPaths
Метод предназначен для получения массива кривых, определяющих направления
автоматического выравнивания при интерактивном вводе точки в nanoCAD.
Метод используется для извлечения геометрических путей выравнивания,
активных в текущем контексте ввода — например, при включённом ортогональном режиме,
полярном отслеживании или использовании объектной привязки.
Эти пути формируют визуальные направляющие, которые помогают пользователю
точно указывать точки при рисовании и редактировании.
Метод особенно полезен при разработке пользовательских инструментов ввода —
таких как PointFilter или PointMonitor, где требуется анализировать
или дополнять стандартное поведение привязки.
Returns: Возвращает массив объектов типа Curve3d[],
каждый из которых представляет собой направление или траекторию,
используемую для выравнивания курсора.
Если направления отсутствуют, возвращается пустой массив.
Если контекст не поддерживает выравнивание, может вернуть null.
Поддерживаемые типы:
* Line3d — направления ортогонального/полярного отслеживания.
* LineSeg3d — расширенные рёбра объектов.
* EllipArc3d — дуговые направляющие.
Example
C#