HostMgd.EditorInput.InputPointContext.GetPickedEntities
Метод предназначен для получения массива путей к геометрическим объектам,
на которых была выполнена привязка или выбор при вводе точки.
Метод используется в контексте интерактивного ввода точки и возвращает набор объектов,
на которые указывал курсор в момент определения положения точки — например,
при использовании режимов объектной привязки (OSNAP) или при выборе элемента для построения.
Эти объекты называются "picked entities" и представляют собой базовые геометрические сущности,
участвующие в операции ввода.
Метод полезен при реализации пользовательских фильтров (PointFilter) или мониторов (PointMonitor), где необходимо:
определить, какие именно объекты были "подхвачены" курсором,
выполнить дополнительную обработку на основе выбранных сущностей,
визуализировать или проанализировать геометрию привязки.
Returns: Возвращает массив объектов типа FullSubentityPath[], каждый из которых указывает на:
* ObjectId основного объекта,
* путь к подобъекту (при наличии).
Если ни один объект не был захвачен — возвращается пустой массив.
В типичном случае содержит один элемент.
Может содержать несколько элементов при сложных привязках (например, пересечение нескольких объектов).
Значение никогда не является null, но может быть пустым.
Example
C#