HostMgd.EditorInput.PromptSelectionOptionsEventArgs
Класс предоставляет данные для события PromptingForSelection,
позволяя настроить параметры операции выбора объектов перед её началом.
Класс используется для передачи параметров, применяемых при начале
интерактивной операции выбора объектов — например, при вызове метода
GetSelection(). Он предоставляет доступ к объекту PromptSelectionOptions,
содержащему настройки команды выборки, такие как:
* текст приглашения (Message),
* режим выбора (SelectionMode),
* разрешение на пустой ввод (AllowNone),
* ключевые слова (Keywords),
* ограничения и фильтры выборки .
Этот класс применяется в обработчике события PromptingForSelection,
где разработчик может динамически изменять параметры выбора в зависимости
от контекста — например, задать подсказку, включить режим выбора "Все"
или добавить пользовательские команды.
Example
C#

HostMgd.EditorInput.PromptSelectionOptionsEventArgs.Filter
Свойство возвращает фильтр, использованный при операции выбора объектов,
позволяя получить критерии отбора, применённые к выборке.
Свойство предоставляет доступ к объекту типа SelectionFilter,
который определял критерии выбора объектов в ходе операции — например,
при вызове GetSelection() с заданным фильтром.
Фильтр может включать:
* типы объектов (например, Line, Circle),
* значения свойств (например, слой, цвет, стиль),
* пользовательские условия отбора.
Это свойство особенно полезно при реализации команд, которые должны обрабатывать
объекты в соответствии с теми же критериями, что и исходная выборка.
Returns: Возвращает объект типа SelectionFilter, содержащий набор условий, применённых к выбору объектов.
* Если фильтр был задан при вызове команды выбора, возвращается соответствующий объект.
* Если фильтр не использовался, может вернуть null.
Example
C#

HostMgd.EditorInput.PromptSelectionOptionsEventArgs.Options
Свойство предоставляет доступ к параметрам приглашения,
используемым при операции выбора объектов.
Свойство предоставляет доступ к объекту типа PromptSelectionOptions,
который содержит настройки, применяемые к интерактивной команде выбора объектов
— например, при вызове метода GetSelection().
Оно используется в обработчике события PromptingForSelection,
чтобы дать разработчику возможность изменить параметры выборки
до начала взаимодействия с пользователем.
Через это свойство можно настроить:
* текст приглашения,
* режим выбора,
* разрешение на пустой ввод,
* ключевые слова,
* другие параметры выбора.
Returns: Возвращает объект типа PromptSelectionOptions. Если параметры не были инициализированы, может вернуть null.
Example
C#