Teigha.BoundaryRepresentation.BrepEdgeEnumerator
Класс BrepEdgeEnumerator представляет перечислитель рёбер, соответствующих граничному представлению.
Класс BrepEdgeEnumerator представляет перечислитель рёбер, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepEdgeEnumerator.Current
Свойство Current представляет текущий элемент данного перечислителя.
Свойство Current представляет текущий элемент данного перечислителя.
Returns: Возвращает ребро, которое является текущим элементом данного перечислителя.
Тип Edge.