HostMgd.ApplicationServices.CommandEventArgs
Класс предназначен для хранения данных о событиях, произошедших в документе.
Класс обеспечивает данными различные события класса Document.

HostMgd.ApplicationServices.CommandEventArgs.#ctor
Конструктор по умолчанию.
Конструктор по умолчанию.

HostMgd.ApplicationServices.CommandEventArgs.GlobalCommandName
В свойстве хранится имя команды, которая вызвала событие в документе.
В свойстве хранится имя команды, которая вызвала событие в документе.
Returns: Название команды. Тип String.