Teigha.BoundaryRepresentation.BrepEdgeCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции рёбер.
Метод позволяет получить перечислитель данной коллекции рёбер.
Returns: Возвращает перечислитель коллекции рёбер.
Тип BrepEdgeEnumerator.