Teigha.DatabaseServices.MlineStyleElementCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель. Тип MlineStyleElementCollectionEnumerator.