Teigha.DatabaseServices.TableEnumerator.Reset
Метод реинициализирует перечислитель, сбрасывая его текущий индекс в значение -1.
Метод реинициализирует перечислитель, сбрасывая его текущий индекс в значение -1.