Teigha.DatabaseServices.SecurityParameters
Класс SecurityParameters представляет параметры безопасности, используемые базой данных.
Класс SecurityParameters представляет параметры безопасности, используемые базой данных.

Teigha.DatabaseServices.SecurityParameters.#ctor
Конструктор по умолчанию класса SecurityParameters.
Конструктор по умолчанию класса SecurityParameters.
Задает алгоритм шифрования SecurityAlgorithm.RC4 с длиной ключа 40.
Устарел. Рекомендуется использовать другие перегрузки.

Teigha.DatabaseServices.SecurityParameters.#ctor(String,String,String,String,String,String,String,Teigha.DatabaseServices.SecurityActions,Teigha.DatabaseServices.SecurityAlgorithm,unsigned int,unsigned int)
Конструктор класса SecurityParameters. Создает экземпляр класса с указанными параметрами.
Конструктор класса SecurityParameters. Создает экземпляр класса с указанными параметрами.

Teigha.DatabaseServices.SecurityParameters.Equals(Object)
Метод предназначен для проверки объектов на равенство.
Метод предназначен для проверки объектов на равенство.
obj: Объект, проверяемый на равенство данному объекту. Тип Object.
Returns: Возвращает true, если объекты совпадают, и оба не равны null.
В противном случае возвращает false.
Notes
Переопределение методов Equals и GetHashCode  должно выполняться совместно, чтобы не нарушать логику -
если Equals возвращает true, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство сравниваемых объектов.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать данный GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.SecurityParameters.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее заданные языковые и региональные настройки.
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее заданные языковые и региональные настройки.
provider: Входной провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Тип String.

Teigha.DatabaseServices.SecurityParameters.!=(Teigha.DatabaseServices.SecurityParameters,Teigha.DatabaseServices.SecurityParameters)
Оператор неравенства для класса SecurityParameters.
Оператор неравенства для класса SecurityParameters.
a: Левый операнд. Тип SecurityParameters.
b: Правый операнд. Тип SecurityParameters.
Returns: Возвращает true, если левый операнд не равен правому, или оба представлены нулевыми указателями.
В противном случае возвращает false.
Достаточным условием неравенства операндов является невыполнение хотя бы одного из следующих условий:
* Совпадают пароли.
* Совпадают имена провайдеров криптографии.
* Совпадают имена субъектов сертификата (цифрового ID).
* Совпадают имена эмитентов сертификата (цифрового ID).
* Совпадают серийные номера сертификата.
* Совпадают дополнительные комментарии, предоставляемые с подписью.
* Совпадают имена серверов времени, используемых для установления временных меток.
* Совпадают заявленные действия.
* Совпадают используемые алгоритмы шифрования.
* Совпадают используемые длины ключей.
* Совпадают типы провайдеров шифрования.

Teigha.DatabaseServices.SecurityParameters.==(Teigha.DatabaseServices.SecurityParameters,Teigha.DatabaseServices.SecurityParameters)
Оператор равенства для класса SecurityParameters.
Оператор равенства для класса SecurityParameters.
a: Левый операнд. Тип SecurityParameters.
b: Правый операнд. Тип SecurityParameters.
Returns: Возвращает true, если левый операнд равен правому (при этом оба не могут быть одновременно представлены нулевыми указателями. В противном случае возвращает false.
Критерием равенства ненулевых операндов является одновременное выполнение следующих условий:
* Совпадают пароли.
* Совпадают имена провайдеров криптографии.
* Совпадают имена субъектов сертификата (цифрового ID).
* Совпадают имена эмитентов сертификата (цифрового ID).
* Совпадают серийные номера сертификата.
* Совпадают дополнительные комментарии, предоставляемые с подписью.
* Совпадают имена серверов времени, используемых для установления временных меток.
* Совпадают заявленные действия.
* Совпадают используемые алгоритмы шифрования.
* Совпадают используемые длины ключей.
* Совпадают типы провайдеров шифрования.

Teigha.DatabaseServices.SecurityParameters.Action
Свойство Action представляет действия безопасности, которые необходимо выполнить.
Свойство Action представляет действия безопасности, которые необходимо выполнить.
Returns: Возвращает предписанные действия безопасности. Перечисление SecurityActions.

Teigha.DatabaseServices.SecurityParameters.Algorithm
Свойство Algorithm представляет используемый алгоритм шифрования.
Свойство Algorithm представляет используемый алгоритм шифрования.
Returns: Возвращает алгоритм шифрования. Перечисление SecurityAlgorithm.

Teigha.DatabaseServices.SecurityParameters.Comment
Свойство Comment представляет дополнительный комментарий, сопровождающий подпись.
Свойство Comment представляет дополнительный комментарий, сопровождающий подпись.
Returns: Возвращает строку комментария. Тип String.

Teigha.DatabaseServices.SecurityParameters.Issuer
Свойство Issuer представляет имя эмитента сертификата (цифрового ID).
Свойство Issuer представляет имя эмитента сертификата (цифрового ID).
Returns: Возвращает имя эмитента сертификата. Тип String.

Teigha.DatabaseServices.SecurityParameters.KeyLength
Свойство KeyLength представляет длину ключа шифра.
Свойство KeyLength представляет длину ключа шифра.
Returns: Возвращает длину ключа шифра. Тип int.

Teigha.DatabaseServices.SecurityParameters.Password
Свойство Password представляет строку пароля.
Свойство Password представляет строку пароля.
Returns: Возвращает пароль. Тип String.

Teigha.DatabaseServices.SecurityParameters.ProviderName
Свойство ProviderName представляет имя провайдера криптографии.
Свойство ProviderName представляет имя провайдера криптографии.
Returns: Возвращает имя провайдера криптографии. Тип String.

Teigha.DatabaseServices.SecurityParameters.ProviderType
Свойство ProviderType представляет тип провайдера шифрования.
Свойство ProviderType представляет тип провайдера шифрования.
Returns: Возвращает тип провайдера шифрования. Тип int.

Teigha.DatabaseServices.SecurityParameters.SerialNumber
Свойство SerialNumber представляет серийный номер сертификата (цифрового ID).
Свойство SerialNumber представляет серийный номер сертификата (цифрового ID).
Returns: Возвращает серийный номер сертификата. Тип String.

Teigha.DatabaseServices.SecurityParameters.Subject
Свойство Subject представляет имя субъекта сертификата (цифрового ID).
Свойство Subject представляет имя субъекта сертификата (цифрового ID).
Returns: Возвращает имя субъекта сертификата. Тип String.

Teigha.DatabaseServices.SecurityParameters.TimeServer
Свойство TimeServer представляет имя сервера времени, используемого для установления временных меток.
Свойство TimeServer представляет имя сервера времени, используемого для установления временных меток.
Returns: Возвращает имя сервера времени. Тип String.