Teigha.Geometry.BoundedPlane
Класс BoundedPlane представляет ограниченную плоскую параметрическую поверхность.
Класс BoundedPlane представляет ограниченную плоскую параметрическую поверхность.

Teigha.Geometry.BoundedPlane.#ctor
Конструктор по умолчанию класса BoundedPlane.
Создает действительную бесконечную плоскую поверхность в плоскости XY.
Конструктор по умолчанию класса BoundedPlane.
Создает действительную бесконечную плоскую поверхность в плоскости XY.

Teigha.Geometry.BoundedPlane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса BoundedPlane.
Создает ограниченную плоскую поверхность, определяемую ее началом и двумя точками в этой плоскости.
Конструктор класса BoundedPlane.
Создает ограниченную плоскую поверхность, определяемую ее началом и двумя точками в этой плоскости.
p1: Первая точка. Тип Point3d.
origin: Точка начала. Тип Point3d.
p2: Вторая точка. Тип Point3d.

Teigha.Geometry.BoundedPlane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса BoundedPlane.
Создает ограниченную плоскую поверхность, определяемую точкой начала и двумя векторами в этой плоскости.
Конструктор класса BoundedPlane.
Создает ограниченную плоскую поверхность, определяемую точкой начала и двумя векторами u и v в этой плоскости.
origin: Точка начала.    Тип Point3d.
u: Вектор U. Тип Vector3d.
v: Вектор V. Тип Vector3d.

Teigha.Geometry.BoundedPlane.Create(IntPtr,System.Boolean)
Метод создает объект BoundedPlane на основе переданного указателя.
Метод создает объект BoundedPlane на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на основе которого создается данный объект.  Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора.  Тип bool.
Returns: Возвращает вновь созданный экземпляр класса BoundedPlane.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.BoundedPlane)
Метод позволяет создать линию пересечения данного объекта с переданной ограниченной плоскостью.
Метод позволяет создать линию пересечения данного объекта с переданной ограниченной плоскостью.
plane: Ограниченная плоскость, с которой строится линия пересечения.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом plane.
Тип LineSegment3d.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.BoundedPlane,Teigha.Geometry.Tolerance)
Метод позволяет создать линию пересечения данного объекта с переданной ограниченной плоскостью с указанной точностью.
Метод позволяет создать линию пересечения данного объекта с переданной ограниченной плоскостью с указанной точностью.
plane: Ограниченная плоскость, с которой строится линия пересечения.  Тип BoundedPlane.
tolerance: Точность геометрических вычислений.  Тип Tolerance.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом plane.
Тип LineSegment3d.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.Plane)
Метод позволяет создать линию пересечения данного объекта с указанной плоскостью.
Метод позволяет создать линию пересечения данного объекта с указанной плоскостью.
plane: Плоскость, с которой строится линия пересечения.  Тип Plane.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом plane.
Тип LineSegment3d.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод позволяет с указанной точностью создать линию пересечения данного объекта с переданной плоскостью.
Метод позволяет с указанной точностью создать линию пересечения данного объекта с переданной плоскостью.
plane: Плоскость, с которой строится линия пересечения. Тип Plane.
tolerance: Точность геометрических вычислений.  Тип Tolerance.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом plane.
Тип LineSegment3d.

Teigha.Geometry.BoundedPlane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить данный объект, используя новые координаты начала и две точки в этой плоскости.
Метод позволяет переопределить данный объект, используя новые координаты начала и две точки в этой плоскости.
p1: Новое положение первой точки. Тип Point3d.
origin: Новое положение точки начала. Тип Point3d.
p2: Новое положение второй точки. Тип Point3d.

Teigha.Geometry.BoundedPlane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить данный объект, используя указанные координаты начала и два вектора в этой плоскости.
Метод позволяет переопределить данный объект, используя указанные координаты начала и два вектора u и v в этой плоскости.
origin: Новое положение точки начала.  Тип Point3d.
u: Входной вектор u.       Тип Vector3d.
v: Входной вектор v.       Тип Vector3d.