Teigha.DatabaseServices.DBObject.Cancelled
Событие возникает, когда операция открытия объекта была отменена.
Событие возникает, когда операция открытия объекта была отменена.
Returns: Тип данных EventHandler, представляющий обработчик события.