Teigha.DatabaseServices.Filters.SpatialFilter
Этот класс реализует объекты пространственного фильтра в экземпляре базы данных.
Этот класс реализует пространственные фильтры для фильтрации объектов чертежа в экземпляре базы данных.
Пространственный фильтр определяет геометрическую 3D-область, полученную экструзией некоторого 2D-контура в заданном направлении, ограниченную передней и задней плоскостями отсечения.
Такие фильтры реализуют также границы отсечения для объектов внешних ссылок.

Teigha.DatabaseServices.Filters.SpatialFilter.#ctor
Конструктор класса SpatialFilter по умолчанию..
Конструктор класса SpatialFilter по умолчанию.

Teigha.DatabaseServices.Filters.SpatialFilter.ClipVolumeIntersectsExtents(Teigha.DatabaseServices.Extents3d)
Метод позволяет определить, пересекается ли область данного пространственного фильтра SpatialFilter с указанным ограничивающим 3D-боксом.
Метод позволяет определить, пересекается ли область данного пространственного фильтра SpatialFilter с указанным ограничивающим 3D-боксом Extents3d.
ext: Входной ограничивающий бокс (прямоугольный параллелепипед, ориентированный по осям системы координат).
Returns: Возвращает true, если факт пересечения областей установлен.
В противном случае возвращает false.

Teigha.DatabaseServices.Filters.SpatialFilter.GetQueryBounds(Teigha.DatabaseServices.BlockReference)
Метод не реализован.
Метод не реализован.
blockReference: Вхождение блока. Тип BlockReference.
Returns: Возвращает ограничивающий бокс. Тип Extents3d.

Teigha.DatabaseServices.Filters.SpatialFilter.SetPerspectiveCamera(Teigha.Geometry.Point3d)
Метод позволяет задать положение перспективной камеры в указанной 3D-точке.
Метод позволяет задать положение перспективной камеры в 3D-точке, переданной аргументом fromPoint.
fromPoint: Точка установки перспективной камеры.  Тип Point3d.

Teigha.DatabaseServices.Filters.SpatialFilter.ClipSpaceToWorldCoordinateSystemTransform
Свойство ClipSpaceToWorldCoordinateSystemTransform возвращает геометрическое преобразование точек граничной области данного фильтра из их системы координат (какой бы она ни была) в мировую систему координат WCS.
Свойство ClipSpaceToWorldCoordinateSystemTransform возвращает геометрическое преобразование точек граничной области данного фильтра из их системы координат (какой бы она ни была) в мировую систему координат WCS.
Returns: Возвращает геометрическое преобразование координат точек граничной области в мировую систему координат WCS.
Тип Matrix3d.

Teigha.DatabaseServices.Filters.SpatialFilter.Definition
Свойство Definition предоставляет доступ к определению данного пространственного фильтра SpatialFilter.
Свойство Definition предоставляет доступ к определению данного пространственного фильтра SpatialFilter.
Returns: Возвращает определение данного пространственного фильтра. Тип SpatialFilterDefinition.

Teigha.DatabaseServices.Filters.SpatialFilter.HasPerspectiveCamera
Свойство HasPerspectiveCamera позволяет определить, задана ли перспективная камера для данного фильтра SpatialFilter.
Свойство HasPerspectiveCamera позволяет определить, задана ли перспективная камера для данного фильтра SpatialFilter.
Returns: Возвращает true, если перспективная камера задана.
В противном случае возвращает false.

Teigha.DatabaseServices.Filters.SpatialFilter.OriginalInverseBlockTransform
Свойство OriginalInverseBlockTransform возвращает обратное геометрическое преобразование блока для связанного вхождения блока BlockReference, когда данный пространственный фильтр был задан в последний раз.
Свойство OriginalInverseBlockTransform возвращает обратное геометрическое преобразование блока для связанного вхождения блока BlockReference, когда данный пространственный фильтр был задан в последний раз.
Returns: Возвращает обратное геометрическое преобразование блока. Тип Matrix3d.