HostMgd.ApplicationServices.DocumentLockMode.AutoWrite
Значение: 1. Блокировка автоматической записи.
Цель этого режима блокировки — объединить в единую команду непрерывающиеся последовательности запросов от элементов ActiveX,
которые могут быть обработаны все вместе без разблокирования и повторной блокировки между запросами. Это гарантирует, что в отношении отмены и подтверждения они будут работать как одна команда, а не как набор отдельных команд или операций  с соответствующими действиями по подтверждению и отмене для каждой из них (т.е. подтверждение выполняется лишь один раз перед первым действием). Этот режим блокировки дает тот же эффект, что и режим Write, за исключением того, что AutoWrite устанавливается только в отсутствие других блокировок. Автоматическая блокировка снимается при установке любой другой блокировки, а при новой блокировке AutoWrite подтверждение и отмена выводятся пользователю только в случае, если после последней блокировки AutoWrite была выполнена какая-либо другая блокировка (т.е. блокировка AutoWrite уже была снята).