Teigha.DatabaseServices.SweepOptionsAlignOption
Данное перечисление определяет варианты выравнивания вытягиваемого по траектории объекта относительно касательной к траектории вытягивания.
Данное перечисление определяет варианты выравнивания вытягиваемого по траектории объекта относительно касательной к траектории вытягивания.