Teigha.Runtime.IMenuItem.Click
Событие Click создается, когда данный элемент меню выбирается щелчком мыши или с помощью клавиш клавиатуры.
Событие Click создается, когда данный элемент меню выбирается щелчком мыши или с помощью клавиш клавиатуры.