HostMgd.PlottingServices.DsdEntryCollection
Класс DsdEntryCollection представляет коллекцию объектов HostMgd.PlottingServices.DsdEntry.
Класс DsdEntryCollection представляет коллекцию объектов HostMgd.PlottingServices.DsdEntry.

HostMgd.PlottingServices.DsdEntryCollection.#ctor
Конструктор по умолчанию класса DsdEntryCollection.
Конструктор по умолчанию класса DsdEntryCollection.

HostMgd.PlottingServices.DsdEntryCollection.Add(HostMgd.PlottingServices.DsdEntry)
Метод добавляет указанный объект в конец этой коллекции.
Метод добавляет указанный объект в конец этой коллекции и возвращает индекс вновь созданного элемента коллекции.
Индексация в коллекции начинается с нуля.
value: Входной объект, который требуется ввести в коллекцию. Тип HostMgd.PlottingServices.DsdEntry.
Returns: Возвращает индекс вновь созданного элемента коллекции.
Тип int.

HostMgd.PlottingServices.DsdEntryCollection.CopyTo(array,System.Int32)
Метод копирует все элементы данной коллекции в указанный одномерный массив типа HostMgd.PlottingServices.DsdEntry[].
Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
a: Целевой массив, в который копируются элементы коллекции. Тип HostMgd.PlottingServices.DsdEntry[].
index: Входной индекс в целевом массиве a, начиная с которого в массив копируются элементы коллекции. Тип int.

HostMgd.PlottingServices.DsdEntryCollection.CopyTo(Array,System.Int32)
Метод копирует все элементы данной коллекции в указанный одномерный массив типа Array.
Метод копирует все элементы данной коллекции в указанный одномерный массив, начиная с указанного индекса в этом массиве.
a: Целевой массив, в который копируются элементы коллекции. Тип Array.
index: Входной индекс в целевом массиве a, начиная с которого в массив копируются элементы коллекции. Тип int.

HostMgd.PlottingServices.DsdEntryCollection.Insert(System.Int32,HostMgd.PlottingServices.DsdEntry)
Метод вставляет в коллекцию заданный объект DsdEntry по указанному индексу.
Метод вставляет в коллекцию объект типа DsdEntry по указанному индексу index.
Индекс должен иметь допустимое значение.
index: Входной индекс вставленного в коллекцию элемента. Тип int.
value: Входной объект, вставляемый в коллекцию. Тип HostMgd.PlottingServices.DsdEntry.

HostMgd.PlottingServices.DsdEntryCollection.RemoveAt(System.Int32)
Метод удаляет из данной коллекции элемент с заданным индексом.
Метод удаляет из данной коллекции элемент с индексом index.
index: Индекс удаляемого из коллекции элемента. Тип int.

HostMgd.PlottingServices.DsdEntryCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Свойство Count представляет количество элементов, фактически содержащихся в данной коллекции.
Returns: Возвращает количество элементов в данной коллекции.
Тип int.

HostMgd.PlottingServices.DsdEntryCollection.IsSynchronized
Свойство IsSynchronized позволяет проверить, является ли доступ к коллекции синхронизированным (потокобезопасным).
Свойство IsSynchronized позволяет проверить, является ли доступ к данной коллекции синхронизированным (потокобезопасным).
Returns: Возвращает true, если доступ к данной коллекции является синхронизированным.
В противном случае возвращает false.

HostMgd.PlottingServices.DsdEntryCollection.Item
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
Свойство Item предоставляет или задаёт элемент коллекции с указанным индексом.
index: Входной индекс требуемого элемента. Тип int. Значения индекса отсчитываются от нуля.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип HostMgd.PlottingServices.DsdEntry.