Teigha.BoundaryRepresentation.Edge.GetCurveAsNurb
Метод позволяет получить базовую кривую данного объекта Edge как объект NurbCurve3d.
Метод позволяет получить базовую кривую данного объекта Edge как объект NurbCurve3d.
Точность вычислений определяется глобальными настройками.
Returns: Возвращает NURBS кривую.
Тип NurbCurve3d.