Teigha.DatabaseServices.DbHomeView.Clone
Метод предназначен для клонирования данного объекта DbHomeView.
Метод предназначен для клонирования данного объекта DbHomeView.
Returns: Возвращает результат клонирования. Тип Object.