Teigha.DatabaseServices.SectionSettings
Класс SectionSettings представляет настройки геометрии секущей плоскости.
Класс SectionSettings представляет настройки геометрии секущей плоскости.

Teigha.DatabaseServices.SectionSettings.#ctor
Конструктор по умолчанию класса SectionSettings.
Конструктор по умолчанию класса SectionSettings.

Teigha.DatabaseServices.SectionSettings.Color(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить цвет указанной геометрии сечения.
Метод позволяет получить цвет указанной геометрии сечения.
nSecType: Входной тип создаваемого сечения. Перечисление SectionType.
nGeometry: Входной тип геометрии сечения.    Перечисление SectionGeometry.
Returns: Возвращает экземпляр класса Teigha.Colors.Color, который представляет настройки цвета указанной геометрии.

Teigha.DatabaseServices.SectionSettings.DestinationBlock(Teigha.DatabaseServices.SectionType)
Метод предоставляет идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
Метод предоставляет идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
nSecType: Входной тип создаваемого сечения, для которого возвращается целевой блок. Перечисление SectionType.
Returns: Возвращает идентификатор объекта целевого блока. Тип DatabaseServices.ObjectId.
Если целевой блок не задан, возвращает null.

Teigha.DatabaseServices.SectionSettings.DestinationFile(Teigha.DatabaseServices.SectionType)
Метод предоставляет имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
Метод предоставляет имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
nSecType: Входной тип создаваемого сечения из перечисления SectionType.
Returns: Возвращает имя файла, в котором сохраняется сечение. Тип String.

Teigha.DatabaseServices.SectionSettings.DivisionLines(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет определить, отображаются ли линии разделения для указанной геометрии.
Метод позволяет определить, отображаются ли линии разделения для указанной геометрии.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает true, если линии разделения отображаются для указанного типа и геометрии сечения.
В противном случае возвращает false.

Teigha.DatabaseServices.SectionSettings.EdgeTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод предоставляет значение прозрачности рёбер геометрии указанного типа.
Метод предоставляет значение прозрачности рёбер геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает прозрачность рёбер геометрии указанного типа.
Тип int.

Teigha.DatabaseServices.SectionSettings.FaceTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод предоставляет значение прозрачности граней геометрии указанного типа.
Метод предоставляет значение прозрачности граней геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает прозрачность граней геометрии указанного типа.
Тип int.

Teigha.DatabaseServices.SectionSettings.GenerationOptions(Teigha.DatabaseServices.SectionType)
Метод позволяет получить текущие опции генерации для указанного типа сечения.
Метод позволяет получить текущие опции генерации для указанного типа сечения как комбинацию флагов из перечисления SectionGeneration.
nSecType: Тип сечения. Перечисление SectionType.
Returns: Возвращает флаги настройки процесса генерации сечения. Перечисление SectionGeneration.

Teigha.DatabaseServices.SectionSettings.GetHatchPatternName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя образца штриховки геометрии сечения указанного типа.
Метод позволяет получить имя образца штриховки геометрии сечения указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает имя образца штриховки. Тип String.

Teigha.DatabaseServices.SectionSettings.GetHatchPatternType(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить тип образца штриховки геометрии сечения указанного типа.
Метод позволяет получить тип образца штриховки геометрии сечения указанного типа как значение из перечисления HatchPatternType.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает тип образца штриховки. Перечисление HatchPatternType.

Teigha.DatabaseServices.SectionSettings.GetSourceObjects(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет получить коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
Метод позволяет получить коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
nSecType: Тип сечения. Перечисление SectionType.
ids: Полученная коллекция идентификаторов исходных объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.SectionSettings.HatchAngle(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить значение угла наклона штриховки геометрии указанного типа.
Метод позволяет получить значение угла наклона штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает угол наклона штриховки в радианах. Тип double.

Teigha.DatabaseServices.SectionSettings.HatchScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить масштаб штриховки геометрии указанного типа.
Метод позволяет получить значение масштаба штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает значение масштаба штриховки. Тип double.

Teigha.DatabaseServices.SectionSettings.HatchSpacing(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить интервал штриховки для геометрии указанного типа.
Метод позволяет получить значение интервала штриховки для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает значение интервала штриховки. Тип double.

Teigha.DatabaseServices.SectionSettings.HatchVisibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет определить, отображается ли штриховка для геометрии указанного типа.
Метод позволяет определить, отображается ли штриховка для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает true, если штриховка отображается.
В противном случае возвращает false.

Teigha.DatabaseServices.SectionSettings.HiddenLine(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет определить, отображаются ли скрытые линии для геометрии указанного типа.
Метод позволяет определить, отображаются ли скрытые линии для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает true, если скрытые линии отображаются.
В противном случае возвращает false.

Teigha.DatabaseServices.SectionSettings.Layer(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя слоя для геометрии указанного типа.
Метод позволяет получить имя слоя, на котором располагается геометрия указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает имя слоя. Тип String.

Teigha.DatabaseServices.SectionSettings.Linetype(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя типа линий для геометрии указанного типа.
Метод позволяет получить имя типа линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает имя типа линий. Тип String.

Teigha.DatabaseServices.SectionSettings.LinetypeScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить масштаб типа линий, который используется для геометрии указанного типа.
Метод позволяет получить значение масштаба типа линий, который используется для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает значение масштаба типа линий. Тип double.

Teigha.DatabaseServices.SectionSettings.LineWeight(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить вес линий, используемых для построения геометрии указанного типа.
Метод позволяет получить вес линий, используемых для построения геометрии указанного типа.
Вес линий может определяться настройками слоя или блока, весом линий по умолчанию или же задаваться конкретным числовым значением из перечисления DatabaseServices.LineWeight.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает вес (толщину) линий как значение из перечисления DatabaseServices.LineWeight.

Teigha.DatabaseServices.SectionSettings.PlotStyleName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя стиля печати для геометрии указанного типа.
Метод позволяет получить имя стиля печати, используемого при выводе на печать геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает имя стиля печати.
Тип String.

Teigha.DatabaseServices.SectionSettings.Reset(Teigha.DatabaseServices.SectionType)
Метод сбрасывает к значениям по умолчанию все настройки для указанного типа сечения.
Метод сбрасывает к значениям по умолчанию все настройки для указанного типа сечения.
nSecType: Тип сечения. Перечисление SectionType.

Teigha.DatabaseServices.SectionSettings.SetColor(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,Colors.Color)
Метод позволяет задать цвет для отображения геометрии указанного типа.
Метод позволяет задать цвет для отображения геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
color: Новое значение цвета. Тип Teigha.Colors.Color.

Teigha.DatabaseServices.SectionSettings.SetDestinationBlock(Teigha.DatabaseServices.SectionType,DatabaseServices.ObjectId)
Метод позволяет задать идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
Метод позволяет задать идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг SectionGeneration.DestinationReplaceBlock.
nSecType: Тип сечения. Перечисление SectionType.
id: Идентификатор объекта блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.SectionSettings.SetDestinationFile(Teigha.DatabaseServices.SectionType,String)
Метод позволяет задать имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
Метод позволяет задать имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг SectionGeneration.DestinationFile.
nSecType: Тип сечения. Перечисление SectionType.
pszFileName: Имя файла, в котором сохраняется сечение. Тип String.

Teigha.DatabaseServices.SectionSettings.SetDivisionLines(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет задать видимость линий разделения для указанной геометрии.
Метод позволяет задать видимость линий разделения для указанной геометрии.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
bShow: Флаг, определяющий, должны ли отображаться линии разделения. Тип bool. Линии видимы в случае значения true.

Teigha.DatabaseServices.SectionSettings.SetEdgeTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Int32)
Метод позволяет задать значение прозрачности рёбер геометрии указанного типа.
Метод позволяет задать значение прозрачности рёбер геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
nTransparency: Значение прозрачности рёбер геометрии указанного типа. Тип int.

Teigha.DatabaseServices.SectionSettings.SetFaceTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Int32)
Метод позволяет задать значение прозрачности граней геометрии указанного типа.
Метод позволяет задать значение прозрачности граней геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
nTransparency: Значение прозрачности граней геометрии указанного типа. Тип int.

Teigha.DatabaseServices.SectionSettings.SetGenerationOptions(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeneration)
Метод позволяет задать опции генерации для указанного типа сечения как комбинацию флагов из перечисления SectionGeneration.
Метод позволяет задать опции генерации для указанного типа сечения как комбинацию флагов из перечисления SectionGeneration.
nSecType: Тип сечения. Перечисление SectionType.
nOptions: Флаги настройки процесса генерации сечения. Перечисление SectionGeneration.

Teigha.DatabaseServices.SectionSettings.SetHatchAngle(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать значение угла наклона штриховки геометрии указанного типа.
Метод позволяет задать значение угла наклона штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
fAngle: Угол наклона штриховки в радианах. Тип double.

Teigha.DatabaseServices.SectionSettings.SetHatchPatternName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя образцу штриховки геометрии сечения указанного типа.
Метод позволяет задать имя образцу штриховки геометрии сечения указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
sNewName: Имя образца штриховки. Тип String.

Teigha.DatabaseServices.SectionSettings.SetHatchPatternType(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,Teigha.DatabaseServices.HatchPatternType)
Метод позволяет задать тип образца штриховки геометрии сечения указанного типа.
Метод позволяет задать тип образца штриховки геометрии сечения указанного типа как значение из перечисления HatchPatternType.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
nPatternType: Тип образца штриховки. Перечисление HatchPatternType.

Teigha.DatabaseServices.SectionSettings.SetHatchScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать масштаб штриховки геометрии указанного типа.
Метод позволяет задать величину масштаба штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
fScale: Значение масштаба штриховки. Тип double.

Teigha.DatabaseServices.SectionSettings.SetHatchSpacing(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать интервал штриховки для геометрии указанного типа.
Метод позволяет задать значение интервала штриховки для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
fSpacing: Значение интервала штриховки.  Тип double.

Teigha.DatabaseServices.SectionSettings.SetHatchVisibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет управлять видимостью штриховки для геометрии указанного типа.
Метод позволяет управлять видимостью штриховки для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
bVisible: Входной флаг видимости штриховки. Тип bool. Передать значение true, если штриховка должна быть видимой. В противном случае передать false.

Teigha.DatabaseServices.SectionSettings.SetHiddenLine(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет управлять видимостью скрытых линий для геометрии указанного типа.
Метод позволяет управлять видимостью скрытых линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
bHiddenLine: Входной флаг видимости скрытых линий. Тип bool. Передать значение true, если скрытые линии должны быть видимыми. В противном случае передать false.

Teigha.DatabaseServices.SectionSettings.SetLayer(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя слоя для геометрии указанного типа.
Метод позволяет задать имя слоя, на котором располагается геометрия указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
pszLayer: Строка с именем слоя. Тип String.

Teigha.DatabaseServices.SectionSettings.SetLinetype(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя типа линий для геометрии указанного типа.
Метод позволяет задать имя типа линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
pszLinetype: Имя типа линий. Тип String.

Teigha.DatabaseServices.SectionSettings.SetLinetypeScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать масштаб типа линий для геометрии указанного типа.
Метод позволяет задать масштаб типа линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
fScale: Масштаб типа линий. Тип double.

Teigha.DatabaseServices.SectionSettings.SetLineWeight(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,DatabaseServices.LineWeight)
Метод позволяет задать вес линий для геометрии указанного типа.
Метод позволяет задать вес (толщину) линий, используемых для построения геометрии указанного типа.
Вес линий может определяться настройками родительских слоя или блока, значением по умолчанию или же задаваться конкретным числовым значением из перечисления DatabaseServices.LineWeight.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
nLineWeight: Вес линий. Перечисление DatabaseServices.LineWeight.

Teigha.DatabaseServices.SectionSettings.SetPlotStyleName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя стиля печати для вывода на печать геометрии указанного типа.
Метод позволяет задать имя стиля печати, используемого при выводе на печать геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
pszPlotStyleName: Имя стиля печати. Тип String.

Teigha.DatabaseServices.SectionSettings.SetSourceObjects(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет задать коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
Метод позволяет задать коллекцию исходных объектов для случаев, когда выставлен флаг SectionGeneration.SourceSelectedObjects.
nSecType: Тип сечения. Перечисление SectionType.
ids: Коллекция идентификаторов исходных объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.SectionSettings.SetVisibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет управлять видимостью создаваемой геометрии указанного типа.
Метод позволяет управлять видимостью создаваемой геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
bVisible: Флаг видимости геометрии. Тип bool. Передать в метод значение true, если геометрия должна отображаться, в противном случае передать значение false.

Teigha.DatabaseServices.SectionSettings.Visibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет проверить, включено ли отображение геометрии указанного типа.
Метод позволяет проверить, включено ли отображение геометрии указанного типа.
nSecType: Тип сечения. Перечисление SectionType.
nGeometry: Типы элементов геометрии сечения. Перечисление SectionGeometry.
Returns: Возвращает true, если отображение геометрии включено.
В противном случае возвращает false.

Teigha.DatabaseServices.SectionSettings.CurrentSectionType
Свойство CurrentSectionType представляет текущий тип сечения или разреза.
Свойство CurrentSectionType представляет текущий тип сечения или разреза.
Returns: Возвращает тип сечения. Перечисление SectionType.