Teigha.DatabaseServices.Surface
Класс Surface представляет в базе данных объект 3D-поверхности.
Класс Surface представляет в базе данных объект 3D-поверхности.

Teigha.DatabaseServices.Surface.#ctor
Конструктор по умолчанию класса Surface.
Конструктор по умолчанию класса Surface.

Teigha.DatabaseServices.Surface.BooleanIntersect(Teigha.DatabaseServices.Solid3d)
Метод предназначен для выполнения операции логического пересечения данной поверхности с указанным трехмерным твердым телом.
Метод реализует операцию логического пересечения данной поверхности с указанным трехмерным твердым телом.
Если результат пересечения не является поверхностью, все кривые и точки пересечения сохраняются в выходном массиве, а данная поверхность не изменяется.
Если результатом пересечения является поверхность, кривые пересечения или точки не извлекаются.
Если эта поверхность не является производной от класса Surface, результирующая поверхность сохраняется в данной поверхности. В противном случае данный объект остается без изменений, а результат сохраняется в выходном массиве тел пересечений.
Если данная поверхность и входное твердое тело не пересекаются, метод выдает исключение eNoIntersections, а данная поверхность остается без изменений.  Если операцию пересечения успешно завершить не удается, данная поверхность не изменяется.
Notes
Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
solid: Входное твердое тело, пересекающееся с данной поверхностью. Тип Solid3d.
Returns: Возвращает массив объектов, являющихся пересечением этой поверхности с указанным телом. Тип Entity[].

Teigha.DatabaseServices.Surface.BooleanIntersect(Teigha.DatabaseServices.Surface)
Метод предназначен для выполнения операции логического пересечения данной поверхности с указанной трехмерной поверхностью.
Метод реализует операцию логического пересечения данной поверхности с указанной трехмерной поверхностью.
Если результат пересечения не является поверхностью, все кривые и точки пересечения сохраняются в выходном массиве, а данная поверхность не изменяется.
Если результатом пересечения является поверхность, кривые пересечения или точки не извлекаются.
Если эта поверхность не является производной от класса Surface, результирующая поверхность сохраняется в данной поверхности. В противном случае данный объект остается без изменений, а результат сохраняется в выходном массиве тел пересечений.
Если поверхности не пересекаются, метод выдает исключение eNoIntersections, а данная поверхность остается без изменений.
Если операцию пересечения успешно завершить не удается, данная поверхность не изменяется.
Notes
Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
surface2: Входная поверхность, пересекающаяся с данной поверхностью. Тип Surface.
Returns: Возвращает массив объектов, представляющих пересечение двух поверхностей.  Тип Entity[].

Teigha.DatabaseServices.Surface.BooleanSubtract(Teigha.DatabaseServices.Solid3d)
Метод предназначен для выполнения операции логического вычитания указанного твердого тела из данной поверхности.
Метод реализует операцию логического вычитания указанного твердого тела из данной поверхности.
Если получившаяся поверхность не является производной от класса Surface, результат сохраняется в данном объекте.
В противном случае данный объект не изменяется, и метод возвращает результирующую поверхность.
В случае отсутствия пересечения поверхности с телом метод выбрасывает исключение eNoIntersections, возвращает NULL и данный объект не изменяется.
Если операцию логического вычитания успешно завершить не удается, метод возвращает NULL, и данный объект не изменяется.
Notes
Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
solid: Трехмерное твердое тело, которое вычитается из данного объекта.
Returns: Возвращает поверхность, являющуюся результатом логического вычитания. Тип Surface.

Teigha.DatabaseServices.Surface.BooleanSubtract(Teigha.DatabaseServices.Surface)
Метод предназначен для выполнения операции логического вычитания из данной поверхности указанной трехмерной поверхности.
Метод реализует операцию логического вычитания указанной трехмерной поверхности из данной поверхности.
Если данная поверхность не является производной от класса Surface, результат сохраняется в данной поверхности.
В противном случае данная поверхность остается без изменений, а метод возвращает результирующую поверхность.
В случае отсутствия пересечения поверхностей метод выбрасывает исключение eNoIntersections, возвращает NULL и данный объект не изменяется.
Если операцию логического вычитания успешно завершить не удается, метод возвращает NULL, и данный объект не изменяется.
Notes
Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
surface2: Поверхность, которая вычитается из данной поверхности. Тип Surface.
Returns: Возвращает поверхность, являющуюся результатом логического вычитания. Тип Surface.

Teigha.DatabaseServices.Surface.BooleanUnion(Teigha.DatabaseServices.Surface)
Метод предназначен для выполнения операции логического объединения данной поверхности с другой поверхностью.
Метод реализует операцию логического объединения данной поверхности с другой поверхностью.
Если данная поверхность не является производной от класса Surface или обе поверхности являются компланарными объектами PlaneSurface, результат сохраняется в данной поверхности.
В противном случае данная поверхность не изменяется, а метод возвращает результирующую поверхность.
Если результирующая поверхность пуста (т.е. пусты обе поверхности), метод выбрасывает исключение eNoIntersections, возвращает NULL и данная поверхность оставляется без изменений.
Если операция объединения не удалась, метод возвращает NULL и данная поверхность оставляется без изменений.
Notes
Данный метод реализован только в ModelerGeometry и в среде пространственного моделирования Spatial Modeler.
surface2: Поверхность, которая объединяется с данной поверхностью. Тип Surface.
Returns: Возвращает поверхность, являющуюся результатом логического объединения двух поверхностей. Тип Surface.

Teigha.DatabaseServices.Surface.ChamferEdges(array,Teigha.DatabaseServices.SubentityId,System.Double,System.Double)
Метод предназначен для создания ассоциативных фасок на указанных ребрах данной поверхности.
Метод предназначен для создания ассоциативных фасок на указанных ребрах данной поверхности.
Notes
Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
subentityIds: Массив идентификаторов подобъектов ребер, к которым применяется данная операция. Тип SubentityId[].
baseSubentityId: Идентификатор подобъекта базовой грани, на ребрах которой создаются фаски. Тип SubentityId.
baseDist: Расстояние от ребра для построения фаски на базовой грани. Тип double.
otherDist: Расстояние от ребра для построения фасок на других гранях. Тип double.

Teigha.DatabaseServices.Surface.CreateFrom(Teigha.DatabaseServices.Entity)
Метод позволяет создать выдавленную поверхность из 2D-объекта с некоторой толщиной или плоскую поверхность из замкнутой кривой или области.
Метод позволяет создать выдавленную поверхность из 2D-объекта с некоторой толщиной или плоскую поверхность из замкнутой кривой или области.
Notes
Этот метод реализован только в среде пространственного моделирования.
fromEntity: Объект чертежа, на основе которого создается поверхность. Тип Entity.
Returns: Возвращает созданную поверхность. Тип Surface.

Teigha.DatabaseServices.Surface.CreateInterferenceObjects(Teigha.DatabaseServices.Entity,System.Int32)
Метод позволяет создать новые объекты, которые представляют собой результат пересечения между данной поверхностью и указанным объектом чертежа.
Метод позволяет создать новые объекты, которые представляют собой результат пересечения (коллизий) между данной поверхностью и указанным объектом чертежа.
Если объекты пересечений поверхности и объекта ent не созданы, метод выбрасывает исключение eNoIntersection.
Метод выбрасывает исключение eInvalidInput, если в качестве значения ent указан неподдерживаемый объект или NULL.
Notes
Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
ent: Объект чертежа, который анализируется на предмет пересечений с данной поверхностью. Тип Entity.
flags: Флаги пересечений. Тип int. Используется значение 0x00 - коллизии по умолчанию.

Teigha.DatabaseServices.Surface.CreateOffsetSurface(Teigha.DatabaseServices.Entity,System.Double)
Метод позволяет создать поверхность смещением указанного объекта на заданное расстояние.
Метод позволяет создать поверхность смещением указанного объекта на заданное расстояние.
Notes
Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
entity: Входная поверхность для смещения. Тип Entity.
offsetDistance: Величина смещения (в единицах чертежа). Тип double.
Returns: Возвращает поверхность, полученную смещением.  Тип Entity.

Teigha.DatabaseServices.Surface.CreateOffsetSurface(Teigha.DatabaseServices.Entity,System.Double,System.Boolean)
Метод позволяет создать поверхность смещения и загрузить ее в текущую базу данных.
Метод позволяет создать поверхность смещения и загрузить ее в текущую базу данных.
Notes
Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
entity: Входная поверхность для смещения. Тип Entity.
offsetDistance: Величина смещения. Тип double.
associativeEnabled: Флаг, определяющий, требуется ли создавать ассоциативную поверхность смещения. Тип bool.
Returns: Возвращает идентификатор объекта полученной смещением поверхности. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Surface.CreateSectionObjects(Teigha.Geometry.Plane)
Метод позволяет получить массив объектов, которые образуются в результате рассечения данной поверхности указанной плоскостью.
Метод позволяет получить массив объектов, которые образуются в результате рассечения данной поверхности указанной плоскостью.
Notes
Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
sectionPlane: Плоскость сечения. Тип Plane.
Returns: Возвращает массив объектов, созданных в результате построения сечения. Тип Entity[].

Teigha.DatabaseServices.Surface.FilletEdges(array,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection)
Метод позволяет создать скругления на указанных ребрах данной поверхности.
Метод позволяет создать скругления на указанных ребрах данной поверхности.
Notes
Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
subentityIds: Идентификаторы подобъектов ребер данной поверхности, на которых требуется создать скругления. Тип SubentityId[].
radius: Массив радиусов скруглений на соответствующих ребрах. Тип DoubleCollection.
startSetback: Массив начальных отступов на соответствующих ребрах. Тип DoubleCollection.
endSetback: Массив конечных отступов на соответствующих ребрах. Тип DoubleCollection.

Teigha.DatabaseServices.Surface.GetSubentityColor(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить цвет указанного подобъекта данной поверхности.
Метод позволяет получить цвет указанного подобъекта данной поверхности.
subEntityId: Идентификатор подобъекта, цвет которого требуется выяснить. Тип SubentityId.
Returns: Возвращает цвет указанного подобъекта. Тип Colors.Color.

Teigha.DatabaseServices.Surface.GetSubentityMaterial(Teigha.DatabaseServices.SubentityId)
Метод позволяет извлечь материал для указанного подобъекта данной поверхности.
Метод позволяет извлечь материал для указанного подобъекта данной поверхности.
subEntityId: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает идентификатор объекта материала. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Surface.GetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить для указанного подобъекта объект Mapper, который обеспечивает сопоставление материалов.
Метод позволяет получить для указанного подобъекта объект Mapper, который обеспечивает сопоставление материалов.
subEntityId: Идентификатор подобъекта. Тип SubentityId.
Returns: Возвращает объект Mapper для сопоставления материалов подобъекта.

Teigha.DatabaseServices.Surface.ImprintEntity(Teigha.DatabaseServices.Entity)
Метод позволяет построить пересечение указанного объекта с данной поверхностью и добавить в неё новую фасетную грань путем клеймения.
Метод позволяет построить пересечение указанного объекта entity с данной поверхностью и добавить в неё новую фасетную грань путем клеймения.
В случае образования замкнутого контура ребер создается новая грань.
В случае создания незамкнутого контура ребер его можно добавить в виде выступа к существующему контуру ребер на грани или как разрез на грани.
Типы объектов, клеймение которых на поверхности поддерживается данным методом:
* Curve,
* Solid3d,
* Surface,
* Body,
* Region,
* Trace,
* Solid.
* Face.
Notes
Данный метод реализован только в среде пространственного моделирования Spatial Modeler.
entityToImprint: Объект для клеймения на данном твердом теле. Тип Entity.

Teigha.DatabaseServices.Surface.ProjectOnToSurface(Teigha.DatabaseServices.Entity,Teigha.Geometry.Vector3d)
Метод позволяет создать новые объекты проецированием указанного объекта на данную поверхность в заданном направлении.
Метод позволяет создать новые объекты проецированием указанного объекта на данную поверхность в заданном направлении.
Если на поверхность проецируется точка Point, результатом проецирования будет объект Point, представляющий ближайшую точку на этой поверхности в направлении проецирования.
Notes
Этот метод реализован только в среде пространственного моделирования.
entityToProject: Проецируемый геометрический объект. Тип Entity.
projectionDirection: Направление проецирования. Тип Vector3d.
Returns: Возвращает массив геометрических объектов, образованных в результате проецирования. Тип Entity[].

Teigha.DatabaseServices.Surface.RayTest(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,[Out]array%,[Out]DoubleCollection%)
Метод предназначен для для создания луча, который начинается в указанной точке и имеет заданное направление.
Метод предназначен для для создания луча, который начинается в указанной точке и имеет заданное направление.
Notes
Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
rayBasePoint: Базовая точка, в которой начинается луч. Тип Point3d.
rayDir: Направление распространения луча. Тип Vector3d.
rayRadius: Радиус луча. Тип double. Он определяет допуск для проверок пересечений.
subEntIds: Возвращаемый массив идентификаторов подобъектов. Тип SubentityId[]. Может содержать идентификаторы граней, ребер и вершин.
parameters: Возвращаемый массив значений параметра. Тип DoubleCollection. Значения параметра отражают пересечение луча и подобъектов из массива subEntIds. Параметр возрастает по мере удаления от базовой точки луча.

Teigha.DatabaseServices.Surface.SetSubentityColor(Teigha.DatabaseServices.SubentityId,Colors.Color)
Метод позволяет задать цвет указанному подобъекту данной поверхности.
Метод позволяет задать цвет указанному подобъекту данной поверхности.
subEntityId: Идентификатор подобъекта. Тип SubentityId.
color: Новый цвет подобъекта.    Тип Teigha.Colors.Color.

Teigha.DatabaseServices.Surface.SetSubentityMaterial(Teigha.DatabaseServices.SubentityId,DatabaseServices.ObjectId)
Метод позволяет назначить новый материал указанному подобъекту данной поверхности.
Метод позволяет назначить новый материал указанному подобъекту данной поверхности.
subEntityId: Идентификатор подобъекта.  Тип SubentityId.
materialId: Идентификатор материала, который назначается подобъекту. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Surface.SetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId,Teigha.GraphicsInterface.Mapper)
Метод позволяет задать указанному подобъекту новый объект Mapper для сопоставления материалов.
Метод позволяет задать указанному подобъекту новый объект Mapper для сопоставления материалов.
subEntityId: Идентификатор подобъекта. Тип SubentityId.
mapper: Объект Mapper для сопоставления материалов.

Teigha.DatabaseServices.Surface.SliceByPlane(Teigha.Geometry.Plane)
Метод позволяет разрезать плоскостью данную поверхность и преобразовать ее в ту часть, которая осталась со стороны от режущей плоскости с положительным направлением нормали.
Метод позволяет разрезать плоскостью данную поверхность и преобразовать ее в ту часть, которая осталась со стороны от режущей плоскости с положительным направлением нормали.
Notes
Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
slicePlane: Секущая плоскость. Тип Plane.
Returns: Возвращает объект SurfaceSliceResults, который включает как "отрицательную", так и "положительную" части разрезанной поверхности.

Teigha.DatabaseServices.Surface.SliceBySurface(Teigha.DatabaseServices.Surface)
Метод позволяет рассечь данный объект другой поверхностью и преобразовать его в ту часть, которая остается со стороны от режущей поверхности с положительным направлением нормали.
Метод позволяет рассечь данный объект другой поверхностью и преобразовать его в ту часть, которая остается со стороны от режущей поверхности с положительным направлением нормали.
Notes
Этот метод реализован только в среде пространственного моделирования Spatial Modeler.
slicingSurface: Режущая поверхность. Тип Surface.
Returns: Возвращает объект SurfaceSliceResults, который включает как "отрицательную", так и "положительную" части разрезанной поверхности.

Teigha.DatabaseServices.Surface.Thicken(System.Double,System.Boolean)
Метод предназначен для создания трехмерного твердого тела утолщением данной поверхности на указанную величину.
Метод предназначен для создания трехмерного твердого тела утолщением данной поверхности на указанную величину.
Знак параметра thickness определяет направление утолщения. Положительные значения приводят к утолщению в положительном направлении нормали к поверхности. Если толщина меньше нуля, поверхность будет утолщена в противоположном направлении.
Логический аргумент bothSides позволяет включить режим симметричного утолщения.
Notes
Этот метод реализован только в среде пространственного моделирования.
thickness: Величина утолщения. Тип double.
bothSides: Флаг, определяющий, должно ли утолщение выполняться в обе стороны от исходной поверхности. Тип bool.
Returns: Возвращает твердое тело, созданное в результате утолщения. Тип Solid3d. В случае ошибки метода возвращает NULL.

Teigha.DatabaseServices.Surface.TrimSurface(DatabaseServices.ObjectId,Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.ObjectIdCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean)
Метод позволяет обрезать поверхность с указанными режущими поверхностями (или кривыми).
Метод позволяет обрезать поверхность с указанными режущими поверхностями (или кривыми).
Поверхность можно обрезать по другим поверхностям или кривым.
В случае использования кривых фактическая граница обрезки образуется проецированием кривых на поверхность, поэтому
необходимо предоставить дополнительную информацию о направлениях проекции.
blankSurfaceId: Обрезаемая поверхность. Тип DatabaseServices.ObjectId.
toolSurfaceIds: Массив идентификаторов режущих объектов, тела которых будут использоваться для обрезки поверхности непосредственно, без каких-либо дополнительных операций типа проецирования. Тип ObjectIdCollection.
toolCurveIds: Массив идентификаторов режущих кривых, которые будут использоваться для обрезки поверхности после предварительного проецирования их на поверхность. Тип ObjectIdCollection.
projVectors: Массив направлений проецирования для каждой режущей кривой из массива ToolCurveIds. Соответственно, размеры коллекций projVectors и ToolCurveIds должны совпадать. Тип Vector3dCollection.
pickPoint: Точка выбора, которая определяет, какую именно область указанной поверхности необходимо обрезать. Тип Point3d.
viewVector: Вектор, представляющий направление обзора для создания луча из точки выбора. Используется для устранения возможной неоднозначности определения обрезаемой области поверхности при использовании точки выбора.  Искомой областью будет та, которую луч, построенный в этом направлении, встретит первой.  Тип Vector3d.
bAutoExtend: Если флаг принимает значение true, то, когда тело инструмента состоит из одной грани с аналитической геометрией, эта базовая геометрия достраивается до поверхности, чтобы обеспечить обрезку. Геометрия самого режущего объекта не изменяется. Тип bool.
associativeEnabled: Флаг ассоциативной обрезки. Определяет, должна ли данная операция обрезки быть ассоциативной. Тип bool.

Teigha.DatabaseServices.Surface.Perimeter
Свойство Perimeter представляет текущее значение периметра данной поверхности.
Свойство Perimeter представляет текущее значение периметра данной поверхности.
Returns: Возвращает значение периметра. Тип double.

Teigha.DatabaseServices.Surface.UIsoLineDensity
Свойство UIsoLineDensity представляет плотность изолиний в направлении U, отображаемых при визуализации поверхности в каркасном режиме.
Свойство UIsoLineDensity представляет плотность изолиний в направлении U, отображаемых при визуализации поверхности в каркасном режиме.
Returns: Возвращает плотность изолиний в направлении U. Тип short.

Teigha.DatabaseServices.Surface.VIsoLineDensity
Свойство VIsoLineDensity представляет плотность изолиний в направлении V, отображаемых при визуализации поверхности в каркасном режиме.
Свойство VIsoLineDensity представляет плотность изолиний в направлении V, отображаемых при визуализации поверхности в каркасном режиме.
Returns: Возвращает плотность изолиний в направлении V. Тип short.