Teigha.GraphicsSystem.Device.GetSizeExt
Метод позволяет получить двумерную габаритную рамку, представляющую размеры данного устройства.
Метод позволяет получить двумерную габаритную рамку, представляющую размеры данного устройства.
Returns: Возвращает двумерную габаритную рамку устройства.
Тип DatabaseServices.Extents2d.