HostMgd.ApplicationServices.InplaceTextEditorSettings.EditFlags
Перечисление EditFlags определяет флаги редактирования, используемые при вызове встроенного текстового редактора.
Перечисление EditFlags определяет флаги редактирования, используемые при вызове встроенного текстового редактора.
Допускается использование одного флага или их комбинации.