Teigha.Geometry.LinearEntity3d
Класс LinearEntity3d является абстрактным базовым классом для всех классов трехмерных линейных объектов.
Класс LinearEntity3d является абстрактным базовым классом для всех классов трехмерных линейных объектов.

Teigha.Geometry.LinearEntity3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип bool.
Returns: Возвращает созданный объект. Тип LinearEntity3d.

Teigha.Geometry.LinearEntity3d.GetPerpendicularPlane(Teigha.Geometry.Point3d)
Метод предоставляет плоскость, перпендикулярную данному линейному объекту и проходящую через указанную точку.
Метод предоставляет плоскость, перпендикулярную данному линейному объекту и проходящую через указанную точку.
intersectionPoint: Входная произвольная точка. Тип Point3d.
Returns: Возвращает плоскость, перпендикулярную данному линейному объекту и проходящую через точку intersectionPoint.
Тип Plane.

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод определяет точку пересечения данного объекта с другим линейным объектом.
Метод определяет, пересекается ли данный объект с указанным линейным объектом, и если да, возвращает точку их пересечения.
Используется вызов метода LinearEntity3d.IntersectWith(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Проверяемый линейный объект. Тип LinearEntity3d.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип Point3d[].

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод определяет точку пересечения данного объекта с другим линейным объектом с некоторой заданной точностью.
Метод определяет, пересекается ли данный объект с указанным линейным объектом, и если да, возвращает точку их пересечения с заданной точностью.
line: Проверяемый линейный объект. Тип LinearEntity3d.
tolerance: Входное значение геометрической точности. Тип Tolerance.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип Point3d[].

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.PlanarEntity)
Метод вычисляет точку пересечения данного линейного объекта с указанной плоскостью.
Метод определяет, пересекает ли данный объект указанную плоскость, и если да, возвращает точку их пересечения.
Используется вызов метода LinearEntity3d.IntersectWith(PlanarEntity plane, Tolerance tolerance) с точностью, равной Tolerance.Global.
plane: Входная плоскость. Тип PlanarEntity.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип Point3d[].

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет с некоторой заданной точностью точку пересечения данного линейного объекта с указанной плоскостью.
Метод определяет, пересекает ли данный объект указанную плоскость, и если да, возвращает точку их пересечения.
Вычисления выполняются с указанной геометрической точностью.
plane: Входная плоскость. Тип PlanarEntity.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип Point3d[].

Teigha.Geometry.LinearEntity3d.IsColinearTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту.
Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту.
Используется вызов метода LinearEntity3d.IsColinearTo(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Проверяемый линейный объект. Тип LinearEntity3d.
Returns: Возвращает true, если данный объект коллинеарен указанному линейному объекту.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsColinearTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту в пределах некоторой заданной точности.
Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту в пределах заданной точности.
line: Проверяемый линейный объект.      Тип LinearEntity3d.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах указанной точности объекты можно считать коллинеарными.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsOn(Teigha.Geometry.Plane)
Метод проверяет, принадлежит ли данный объект указанной плоскости.
Метод проверяет, принадлежит ли данный объект указанной плоскости.
Используется вызов метода LinearEntity3d.IsOn(Plane plane, Tolerance tolerance) с точностью, равной Tolerance.Global.
plane: Входная плоскость. Тип Plane.
Returns: Возвращает true, если данный объект лежит в указанной плоскости.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsOn(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли данный объект в указанной плоскости в пределах заданной точности.
Метод позволяет проверить, лежит ли данный объект в указанной плоскости в пределах заданной точности.
plane: Входная плоскость. Тип Plane.
tolerance: Заданная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный объект лежит в плоскости plane.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить параллельность данного объекта и указанного линейного объекта.
Метод позволяет проверить параллельность данного объекта и указанного линейного объекта.
Используется вызов метода LinearEntity3d.IsParallelTo(LinearEntity3d line, Tolerance tolerance) с точностью, равной
Tolerance.Global.
line: Входной линейный объект. Тип LinearEntity3d.
Returns: Возвращает true, если данный объект можно считать параллельным объекту line.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет с некоторой заданной точностью проверить параллельность данного объекта и указанного линейного объекта.
Метод позволяет проверить с указанной точностью параллельность данного объекта и указанного линейного объекта.
line: Входной линейный объект. Тип LinearEntity3d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный объект и объект line можно считать параллельными.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить параллельность данного объекта и указанной плоскости.
Метод позволяет проверить параллельность данного объекта и указанной плоскости.
Используется вызов метода LinearEntity3d.IsParallelTo(PlanarEntity plane, Tolerance tolerance) с точностью, равной
Tolerance.Global.
plane: Входная плоскость. Тип PlanarEntity.
Returns: Возвращает true, если данный объект и плоскость plane параллельны друг другу.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить параллельность данного объекта и указанной плоскости в пределах заданной точности.
Метод позволяет проверить параллельность данного объекта и указанной плоскости в пределах заданной точности.
plane: Входная плоскость. Тип PlanarEntity.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный объект можно считать параллельным плоскости plane.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта.
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта.
Используется вызов метода LinearEntity3d.IsPerpendicularTo(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Входной линейный объект. Тип LinearEntity3d.
Returns: Возвращает true, если линейные объекты перпендикулярны друг другу.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта в пределах заданной геометрической точности.
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта в пределах заданной геометрической точности.
line: Входной линейный объект. Тип LinearEntity3d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance линейные объекты можно считать взаимно перпендикулярными.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости.
Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости.
Используется вызов метода LinearEntity3d.IsPerpendicularTo(PlanarEntity plane, Tolerance tolerance) с точностью, равной Tolerance.Global.
plane: Входная плоскость. Тип PlanarEntity.
Returns: Возвращает true, если данный объект перпендикулярен указанной плоскости.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости в пределах заданной точности.
Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости в пределах заданной точности.
plane: Входная плоскость. Тип PlanarEntity.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный объект можно считать перпендикулярным плоскости plane.
В противном случае возвращает false.

Teigha.Geometry.LinearEntity3d.Overlap(Teigha.Geometry.LinearEntity3d)
Метод позволяет определить область перекрытия данного объекта с указанным линейным объектом.
Метод позволяет определить, перекрывается ли данный объект с указанным линейным объектом, и если да, возвращает линейный объект, который представляет область их перекрытия.
В зависимости от типов проверяемых линейных объектов возвращаемая область перекрытия может быть объектом любого класса, производного от класса LinearEnt3d.
Используется вызов метода LinearEntity3d.Overlap(LinearEntity3d line, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Входной линейный объект. Тип LinearEntity3d.
Returns: Возвращает объект, который представляет область перекрытия.
Тип LinearEntity3d.

Teigha.Geometry.LinearEntity3d.Overlap(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта, вычисленную с некоторой заданной точностью.
Метод позволяет определить с некоторой заданной точностью, перекрывается ли данный объект с указанным линейным объектом, и если да, возвращает линейный объект, который представляет область их перекрытия.
В зависимости от типов проверяемых линейных объектов возвращаемая область перекрытия может быть объектом любого класса, производного от класса LinearEnt3d.
line: Входной линейный объект. Тип LinearEntity3d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает объект, который представляет область перекрытия.
Тип LinearEntity3d.

Teigha.Geometry.LinearEntity3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d)
Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта.
Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта.
Метод находит на этих двух объектах такие точки, которые совпадают в проекции на плоскость, нормаль которой определяется вектором projectionDirection.
Метод используется в основном в графических задачах, где projectionDirection представляет направление взгляда.
В этом случае метод возвращает точки на двух линиях, в которых линии кажутся наблюдателю пересекающимися.
Если в действительности линии не пересекаются, то вектор между двумя точками параллелен вектору projectionDirection.
Используется вызов метода LinearEntity3d.ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance) с точностью, равной Tolerance.Global.
line: Входной линейный объект. Тип LinearEntity3d.
projectionDirection: Направление проецирования. Тип Vector3d.
Returns: Возвращает массив точек пересечения из двух элементов. Тип Point3d[].
Элемент с индексом 0 представляет точку пересечения на данном объекте, а элемент с индексом 1 - точку на объекте line.

Teigha.Geometry.LinearEntity3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта в пределах некоторой заданной точности.
Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта в пределах заданной точности.
Метод находит на этих двух объектах такие точки, которые совпадают в проекции на плоскость, нормаль которой определяется вектором projectionDirection.
Метод используется в основном в графических задачах, где projectionDirection представляет направление взгляда.
В этом случае метод возвращает точки на двух линиях, в которых линии кажутся наблюдателю пересекающимися.
Если в действительности линии не пересекаются, то вектор между двумя точками параллелен вектору projectionDirection.
line: Входной линейный объект. Тип LinearEntity3d.
projectionDirection: Направление проецирования. Тип Vector3d.
tolerance: Входная геометрическая точность. Тип Tolerance.
Returns: Возвращает массив точек пересечения из двух элементов. Тип Point3d[].
Элемент с индексом 0 представляет точку пересечения на данном объекте, а элемент с индексом 1 - точку на объекте line.

Teigha.Geometry.LinearEntity3d.Direction
Свойство Direction представляет единичный направляющий вектор данного линейного объекта.
Свойство Direction представляет направляющий вектор данного линейного объекта.
Этот вектор является единичным и ориентирован в направлении увеличения значения параметра.
Returns: Возвращает единичный направляющий вектор данного объекта.
Тип Vector3d.

Teigha.Geometry.LinearEntity3d.PointOnLine
Свойство PointOnLine представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
Свойство PointOnLine представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
Returns: Возвращает точку на данном линейном объекте. Тип Point3d.